Repository: exsilium/ogy
Catalog: l10n/*/speed_duel_guide.po
Languages: et

source: CHOOSE YOUR SKILL WISELY, IT WILL<BR>HAVE A HUGE IMPACT ON THE DUEL!
et: VALI OMA OSKUS TARGALT, SELLEL<BR>ON DUELLIL SUUR MÕJU!

source: GAMEMAT
et: MÄNGUMATT

source: Flip your Skill<BR>over to<BR>activate it
et: Pööra oma <BR>Oskuse kaart <BR>ümber, et see<BR>aktiveerida

source: STANDARD RULES FOR SPEED DUELING!
et: SPEED DUEL STANDARDREEGLID!

source: CARDS LEGAL FOR SPEED DUELING
et: SPEED DUEL LEGAALSED KAARDID

source: These are just the basics. You can find out some more cool moves, and learn about advanced things like Quick-Play Spells <BR>by reading the full rulebook online at http://www.yugioh-card.com/en/rulebook
et: Need on vaid põhitõed. Saad avastada rohkem lahedaid käike ja õppida edasijõudnute teemasid nagu Kiir-Mängu <BR>Loitsud lugedes täielikku reeglistikku veebis aadressil http://www.yugioh-card.com/en/rulebook

source: Each of your Attack Position monsters can attack once per turn. Pick a monster for it to attack, or if your opponent has <BR>no monsters, you can attack their LP directly. Subtract your monster’s ATK points from your opponent’s LP. If you battle <BR>an opponent’s monster, refer to the chart on the right to see what happens! If you attack a face-down monster, flip it <BR>face-up, and if it survives the battle, it stays face-up.
et: Iga sinu Ründepositsioonis olev koletis võib rünnata korra käigu kohta. Vali koletis, mida rünnata, või kui su <BR>vastasel ei ole koletisi, võid rünnata otse nende LP-d. Lahuta oma koletise ATK punktid vastase LP-st. Kui lahingusse <BR>astud vastase koletisega, vaata paremal olevat tabelit, et näha, mis juhtub! Kui ründad näoga allapoole olevat <BR>koletist, keera see näoga ülespoole ja kui see jääb lahingust ellu, jääb see näoga ülespoole.

source: Traps are not played face-up during your turn. Instead, you Set Traps face-down in your turn. Then on any turn after <BR>that (yours OR your opponent’s turn), you can flip them face-up and use their effect, then send them to the Graveyard. <BR>This lets you do a surprise move!
et: Lõkse ei mängita oma käigu ajal näoga ülespoole. Selle asemel paigutad sa Lõksud oma käigu ajal näoga allapoole. Seejärel <BR>ükskõik millisel järgneval käigul (sinu oma VÕI vastase käigu ajal) võid sa need ümber pöörata näoga ülespoole ja <BR>kasutada nende efekti, seejärel saata need surnuaeda. See võimaldab sul teha üllatuskäigu!

source: Zone. All other Spells and Traps go to the Graveyard after you do what the card says.
et: Tsooni. Kõik ülejäänud Loitsud ja Lõksud lähevad surnuaeda pärast seda, kui teed, mida kaart ütleb.

source: symbol, it stays in play in the Spell & Trap
et: sümbol, jääb see mängu Loitsu & Lõksu

source: or Continuous
et: või Püsiv

source: place it in the Field Zone. If a Spell or Trap has an Equip
et: aseta see Väljatsooni. Kui Loitsul või Lõksul on Varustus-

source: You can play Spells right from your hand to the Spell & Trap Zone. Just follow the card directions. If it’s a Field Spell
et: Saad mängida Loitsud otse oma käest Loitsu & Lõksu Tsooni. Järgi lihtsalt kaardi juhiseid. Kui tegu on Väljaloitsuga

source: Monsters with yellow borders have no special abilities, but are good at battling. Monsters with orange borders have <BR>Monsters with blue borders, like Relinquished, cannot be Summoned special abilities – just follow what the card says.<BR>except by using the Spell explained on the monster.
et: Koletistel kollaste piiridega ei ole erilisi võimeid, kuid nad on head võitlejad. Koletistel oranžide piiridega on<BR>erilised võimed – järgi lihtsalt, mida kaart ütleb. Koletised siniste piiridega, nagu Relinquished, ei saa välja kutsuda<BR>muul viisil kui kasutades loitsu, mis on koletisel selgitatud.

source: During your turn, you can Normal Summon 1 monster from your hand, in Attack Position (upright), or Set 1 monster face-<BR>down in Defense Position (sideways). Count the monster’s Level Stars when you Summon it. If it has 4 or less Level Stars, <BR>then you can just Summon or Set it. If it has more than 4 Stars, you need to Tribute a monster you already have in play <BR>first, by sending it to the Graveyard. You need to Tribute 1 monster to Summon or Set a Level 5 or 6 monster, or Tribute 2 <BR>monsters to Summon or Set a Level 7 or higher monster. If a card effect says to Special Summon a monster, you don’t need <BR>to Tribute unless the card effect says to. Also, Special Summons are “free” so they don’t take up your 1 regular Normal <BR>Summon/Set during your turn, and can even sometimes be done during your opponent’s turn!
et: Oma käigu ajal võid sa Tavakutsuda välja 1 koletise oma käest Ründepositsioonis (püsti) või seada 1 koletise näoga <BR>allapoole Kaitsepositsioonis (külili). Arvesta koletise Tase Tähtede arvu, kui sa ta välja kutsud. Kui tal on 4 või vähem <BR> Taseme Tähte, siis võid sa lihtsalt kutsuda või seada ta. Kui tal on rohkem kui 4 Tähte, pead sa esmalt ohverdama <BR>koletise, kes on juba mängus saates ta Surnuaeda. Sa pead ohverdama 1 koletise, et kutsuda või seada Tase 5 või 6 <BR>koletis, või ohverdama 2 koletist, et kutsuda või seada Tase 7 või kõrgem koletis. Kui kaardi efekt ütleb, et kutsu <BR>koletis eriliselt välja, siis ei ole vaja ohverdada, välja arvatud juhul, kui kaardi efekt seda nõuab. Lisaks, erilised <BR>väljakutsed on "tasuta", nii et need ei kasuta ära sinu 1 Tavakutsumist/Seadmist oma käigu ajal ja neid saab isegi <BR>mõnikord teha vastase käigu ajal!

source: The Duel is played in turns. At the start of your turn, draw a card. Then you can Set Traps, play Spells, and Summon a <BR>monster, in any order. After all that, you can attack. When you are done attacking, your turn ends, and now it’s your <BR>opponent’s turn.
et: Duell mängitakse käikude kaupa. Oma käigu alguses tõmba kaart. Seejärel võid sa seada Lõkse, mängida Loitse ja kutsuda välja koletise, mis tahes järjekorras. Pärast seda kõike, võid sa rünnata. Kui oled ründamise lõpetanud, lõpeb sinu käik ja nüüd on sinu vastase käik.

source: Each player draws the top 4 cards from their Deck for their starting hand.
et: Iga mängija tõmbab oma alustavaks käeks oma kaardipakist ülemised 4 kaarti.

source: Flip a coin at the start. The winner gets to choose to go first or second. If you go first, don’t draw a card<BR>on your first turn.
et: Alustuseks visatakse münti. Võitja saab valida, kas alustada esimesena või teisena. Kui alustad esimesena, siis <BR>oma esimesel käigul kaarti ära tõmba.

source: Each player chooses 1 Skill Card before the Duel and places it face-down in front of them.
et: Iga mängija valib enne duelli 1 Oskuse kaardi ja asetab selle näoga allapoole enda ette.

source: You can’t have more than 3 copies of the same card in your Deck.
et: Sa ei tohi oma pakis omada rohkem kui 3 sama kaardi koopiat.

source: Shuffle the cards in your Deck together before the Duel (but not your Extra Deck).
et: Sega enne duelli oma kaardipakk (välja arvatud sinu kaartide Lisapakk).

source: Your Deck needs to contain between 20 and 30 cards. Your Extra Deck, if you have any Fusion Monsters, <BR>can be between 0 and 5 cards.
et: Sinu pakk peab sisaldama 20 kuni 30 kaarti. Sinu Lisapakk, kui sul on Fusioonkoletisi, <BR>võib olla 0 kuni 5 kaarti.

source: If you have Fusion Monsters (purple cards), like Thousand Dragon, place them in the Extra Deck zone.
et: Kui sul on Fusioonkoletisi (lillad kaardid), nagu Thousand Dragon, aseta need Lisapaki tsooni.

source: Each player begins with 4000 LP (Life Points). If your LP hit zero, you lose!
et: Iga mängija alustab 4000 LP-ga (Elupunktidega). Kui su LP jõuab nullini, oled kaotanud!

source: You can use all your Speed Duel cards when you play the full<BR>Yu-Gi-Oh! TRADING CARD GAME, and put them in your Decks, except <BR>for Skill Cards. They can only be used in Speed Duels!
et: Sa võid kasutada kõiki oma Speed Duel kaarte, kui mängid täis<BR>Yu-Gi-Oh! KOGUMISKAARDIMÄNGU ja panna need oma pakkidesse, välja <BR>arvatud Oskuse kaardid. Neid võib kasutada ainult Speed Duel'is!

source: Speed Duels are played with a carefully selected set of cards. <BR>For Speed Duels, you should only use cards with the Speed Duel <BR>watermark on them.
et: Speed Duel'i mängitakse hoolikalt valitud kaartide komplektiga. <BR>Speed Duel'i jaoks peaksid kasutama ainult kaarte, millel on peal <BR>Speed Duel vesimärk.

source: Skill Cards should be a secret from your opponent until you use them, <BR>so don’t let them see what the card is when you set up at the start of <BR>the Duel!
et: Oskuskaardid peaksid olema sinu vastase eest saladus kuni sa neid <BR>kasutad, seega ära lase neil näha, mis kaart see on, kui sa duelli <BR>alguses sättima hakkad!

source: Skill Cards are chosen before the start of the Duel. You choose 1 Skill <BR>Card and place it face-down before the Duel starts (so the character’s <BR>name is showing). It might say that you can flip it face-up at the start of <BR>the Duel. If it does not, then the instructions on the hidden side of the <BR>card will tell you when you can activate it by flipping it face-up. When <BR>you do, just follow the instructions on the card.
et: Oskuskaardid valitakse enne duelli algust. Vali üks oskuskaart ja <BR>aseta see enne duelli algust tagurpidi (nii, et tegelase nimi on <BR>nähtav). Võib olla, et see ütleb, et võid selle duelli alguses ümber <BR>pöörata. Kui ei, siis juhised kaardi peidetud küljel ütlevad sulle, <BR>millal saad selle aktiveerida, pöörates selle nähtavaks. Kui sa seda <BR>teed, järgi kaardi peal olevaid juhiseid.

source: Your Speed Duel Starter Deck contains<BR>3 Speed Duel Decks. You can play these <BR>Decks as they are, or combine cards from <BR>each to build your own Deck the way you <BR>want. If this is your ﬁrst time playing the<BR>Yu-Gi-Oh! TRADING CARD GAME, this Dueling <BR>Guide will teach you the basics. You can <BR>also ﬁnd the complete rulebook online at<BR>http://www.yugioh-card.com/en/rulebook
et: Sinu Speed Duel Algajakomplekt sisaldab 3 Speed Duel kaardipakki. Sa võid neid pakke mängida nii, nagu need on, või ühendada kaarte igast pakist, et ehitada oma pakk nii, nagu sa soovid. Kui see on sinu esimene kord mängida Yu-Gi-Oh! KAARDIMÄNGU, siis see mängujuhend õpetab sulle põhitõdesid. Täieliku reeglistiku leiad veebis aadressil http://www.yugioh-card.com/en/rulebook

source: DEFENSE POSITION
et: KAITSEASEND

source: ATTACK POSITION
et: RÜNDEASEND

source: No LP Lost
et: LP'd Pole Kaotatud

source: 500 LP Lost
et: 500 LP-d Kaotatud

source: No LP Lost
et: LP'd Pole Kaotatud

source: TARGET
et: SIHTMÄRK

source: ATTACKER
et: RÜNDAJA

source: • No one takes damage
et: • Keegi ei saa kahju

source: • Both monsters survive
et: • Mõlemad koletised jäävad ellu

source: If the ATK equals the DEF
et: Kui ATK jääb võrdseks DEF'iga

source: • You take damage equal to the <BR>difference between your ATK and <BR>their DEF
et: • Sa saad kahju, mis võrdub <BR>sinu ATK ja <BR>nende DEF vahega

source: If your ATK is smaller
et: Kui sinu ATK on väiksem

source: • Destroy the other monster
et: • Hävita teine koletis

source: If your ATK is bigger
et: Kui sinu ATK on suurem

source: Compare the attacker’s ATK to the other monster’s DEF. Your opponent <BR>does not take any damage when you attack their Defense Position <BR>monster.
et: Võrdle ründaja ATK-d teise koletise DEF'iga. Sinu vastane ei <BR>saa mingit kahju, kui sa ründad nende Kaitseasendis <BR>koletist.

source: 1000 LP Lost
et: 1000 LP-d Kaotatud

source: 800 LP Lost
et: 800 LP-d Kaotatud

source: • Destroy both monsters
et: • Hävita mõlemad koletised

source: If both monsters<BR>have the same ATK
et: Kui mõlemal koletisel<BR>on sama ATK

source: • You take damage
et: • Sa saad kahju

source: • Destroy the attacker
et: • Hävita ründaja

source: • Opponent takes damage
et: • Vastane saab kahju

source: A destroyed monster is placed face-up in <BR>its owner’s Graveyard.
et: Hävitatud koletis asetatakse näoga ülespoole <BR>oma omaniku Surnuaeda.

source: Compare the attacker’s ATK to the other monster’s ATK. The weaker <BR>monster is destroyed. The player with the destroyed monster takes <BR>damage equal to the difference in Attack Points.
et: Võrdle ründaja ATK-d teise koletise ATK-ga. Nõrgem <BR>koletis hävitatakse. Koletise hävinud mängija saab <BR>kahju, mis võrdub Ründe Punktide vahega.
