Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: Multi Token
et: Mitu Token

source: Special Summon with the effect of "<M8470>Lord British Space Fighter<M>".
et: Erikutsuge "<M8470>Lord British Space Fighter<M>" efektiga.

source: Special Summon with the effect of "<M8485>Reptilianne Spawn<M>".
et: Erikutsuge "<M8485>Reptilianne Spawn<M>" efektiga.

source: Spider Token
et: Ämblikmärk

source: Special Summon with the effect of “<M8503>Spider Egg<M>”.
et: Erikutsuge “<M8503>Ämblikumuna<M>” efektiga.

source: Soul Token
et: Hinge Token

source: Special Summon with the effect of “<M8507>Limit Impulse<M>”. This Token cannot be Tributed except for a Tribute Summon.
et: Eriliselt kutsutud välja kaardi „<M8507>Limit Impulse<M>” efektiga. Seda žetooni ei saa ohverdada, välja arvatud ohverdussummoni jaoks.

source: Ceremonial Token
et: Tseremoniaalne Mängunupp

source: Special Summon with the effect of "<M8679>Offering to the Immortals<M>". This Token cannot be Tributed, except for a Tribute Summon of an "Earthbound Immortal" monster, and cannot be used as a Synchro Material Monster.
et: Erikutsuge "<M8679>Ohverdus Surematutele<M>" efektiga. Seda Tokenit ei saa ohverdada, välja arvatud "Earthbound Immortal" koletise ohverdussummoniks, ja seda ei saa kasutada Sünkro Materjal Koletisena.

source: Grain Corn Token
et: Teravilja Maisi Mängunupp

source: Special Summon with the effect of "<M8857>Sweet Corn<M>".
et: Erikutsuge "<M8857>Sweet Corn<M>" efektiga.

source: Laval Token
et: Lavali Maatriks

source: Special Summon with the effect of “<M8919>Searing Fire Wall<M>”.
et: Erikutsuge “<M8919>Põlev Tulemüür<M>” efektiga.

source: Koa'ki Meiru Token
et: Koa'ki Meiru Maatriks

source: Special Summon with the effect of “<M9033>Koa'ki Meiru Prototype<M>”.
et: Erikutsuge “<M9033>Koa'ki Meiru Prototype<M>” efektiga.

source: Siphon Token
et: Sifooni Maatriks

source: Special Summon with the effect of "<M9146>Star Siphon<M>".
et: Erikutsugeeri "<M9146>Star Siphon<M>" efektiga.

source: Waltz Token
et: Waltzi Mängunupp

source: Summoned with "<M9238>Battle Waltz<M>". The ATK, DEF, Type, Attribute, and Level of this Token are equal to those of the monster selected by "<M9238>Battle Waltz<M>".
et: Kutsutud "<M9238>Battle Waltz<M>" abil. Selle Tokeni ATK, DEF, tüüp, atribuut ja tase on võrdsed "<M9238>Battle Waltz<M>" poolt valitud koletise omadega.

source: Compass Token
et: Kompassi Mängunupp

source: Special Summon with the effect of "<M9292>Cosmic Compass<M>".
et: Erikutsuge "<M9292>Cosmic Compass<M>" efekti abil.

source: Special Summon with the effect of "<M9293>Doppelwarrior<M>".
et: Eriliselt kutsu välja "<M9293>Doppelwarrior<M>" efektiga.

source: Nordic Beast Token
et: Põhjamaade metsalise žetoon

source: Special Summon with the effect of "<M9301>Tanngrisnir of the Nordic Beasts<M>".
et: Erikutsuge "<M9301>Põhjala metsaliste Tanngrisnir<M>" efektiga.

source: Einherjar Token
et: Einherjari Maatriks

source: Special Summon with the effect of "<M9308>Valkyrie of the Nordic Ascendan<M>".
et: Erikutsuge "<M9308>Põhjala tõusva valküüri<M>" efektiga.

source: Malus Token
et: Maluse žeton

source: Special Summon with the effect of "<M9362>The Golden Apples<M>". The ATK and DEF of this Token is equal to the amount of the Life Points gained by effect of "<M9362>The Golden Apples<M>".
et: Erikutsuge "<M9362>Kuldõunad<M>" efektiga. Selle Tokeni ATK ja DEF on võrdne elu punktide kogusega, mis saadi "<M9362>Kuldõunad<M>" efekti abil.

source: Special Summon with the effect of “<M9834>Chew-Bone<M>”.
et: Erikutsummon “<M9834>Chew-Bone<M>” efekti abil.

source: Blue-Eyes White Dragon
et: Sinisilmsed Valged Draakon

source: This legendary dragon is a powerful engine of destruction. Virtually invincible, very few have faced this awesome creature and lived to tell the tale.
et: See legendaarne draakon on võimas hävitusmasin. Praktiliselt võitmatu, väga vähesed on selle võimsa olendiga silmitsi seisnud ja ellu jäänud, et sellest rääkida.

source: Mystical Elf
et: Müstiline Elf

source: A delicate elf that lacks offense, but has a terrific defense backed by mysticalpower.
et: Õrn haldjas, kellel puudub rünnak, kuid kellel on suurepärane kaitse, mida toetab müstiline jõud.

source: Hitotsu-Me Giant
et: Hitotsu-Me Hiiglane

source: A one-eyed behemoth with thick, powerful arms made for delivering punishing blows.
et: Ühesilmne hiiglane, kellel on paksud ja võimsad käed, mis on loodud karmide löökide andmiseks.

source: Baby Dragon
et: Beebi Draakon

source: Much more than just a child, this dragon is gifted with untapped power.
et: Palju enamat kui lihtsalt laps, see draakon on varustatud avastamata jõuga.

source: A very elusive creature that looks like a harmless statue until it attacks.
et: Väga tabamatu olend, mis näeb välja nagu kahjutu kuju, kuni see ründab.

source: Feral Imp
et: Metsik Imp

source: A playful little fiend that lurks in the dark, waiting to attack an unwary enemy.
et: Mänguline väike deemon, kes varitseb pimeduses, oodates, et rünnata ettevaatamatut vaenlast.

source: Winged Dragon, Guardian of the Fortress #1
et: Tiivuline Draakon, Kindluse Valvur #1

source: A dragon commonly found guarding mountain fortresses. Its signature attack is a sweeping dive from out of the blue.
et: Draakon, keda leidub sageli mägilinnuste valvurina. Selle iseloomulik rünnak on ootamatu sukeldumine kõrgustest.

source: Mushroom Man
et: Seene Mees

source: Found in humid regions, this creatureattacks enemies with a lethal rain of poison spores.
et: Leitud niisketes piirkondades, ründab see olend vaenlasi surmava mürgiste eoste vihmaga.

source: Shadow Specter
et: Varjuvaim

source: Powerful in groups, this animal spirit can be found in the wastelands.
et: Võimas gruppides, seda looma vaimu võib leida tühermaadel.

source: Blackland Fire Dragon
et: Musta tulelohe

source: A dragon that dwells in the depths of darkness, its vulnerability lies in its poor eyesight.
et: Draakon, kes elab pimeduse sügavustes, tema nõrkus peitub halvas nägemises.

source: Sword Arm of Dragon
et: Draakoni mõõgakäsi

source: With a body covered in sword-like thorns, nothing dares stand in the way of this charging monster.
et: Keha on kaetud mõõgataoliste okastega, miski ei julge seista selle tormava koletise teel.

source: Swamp Battleguard
et: Soojavõitleja

source: Increase the ATK of this monster by 500 points for every face-up "<M4560>Lava Battleguard<M>" on your side of the field.
et: Suurenda selle koletise ATK-d 500 punkti võrra iga sinu väljaku poolel oleva avatud "<M4560>Lava Battleguard<M>" eest.

source: Capable of firing cannonballs from its mouth for long-range attacks, this creature is particularly effective in mountain battles.
et: Võimeline tulistama suust kahurikuule kaugmaa rünnakuteks, see olend on eriti tõhus mäelahingutes.

source: Battle Steer
et: Lahingrool

source: A bull monster often found in the woods, it charges enemy monsters with a pair of deadly horns.
et: Pullikoll, keda sageli leidub metsades, ründab vaenlase koletisi oma surmavate sarvedega.

source: Flame Swordsman
et: Leegionär Mõõgamees

source: "<M4148>Flame Manipulator<M>" + "<M4299>Masaki The Legendary Swordsman<M>"
et: "<M4148>Leegitse Manipulaator<M>" + "<M4299>Masaki, Legendaarne Mõõgamees<M>"

source: Time Wizard
et: Ajan Võlur

source: Once per turn, during your Main Phase, toss a coin and call it. If you call it right, destroy all monsters your opponent controls. If you call it wrong, destroy all monsters you control, and you lose Life Points equal to half the total ATK of the destroyed monsters.
et: Kord ühe korra oma peafaasil viska münti ja ütle, kummale poole see kukub. Kui arvad õigesti, hävita kõik vastase kontrollitavad koletised. Kui arvad valesti, hävita kõik sinu kontrollitavad koletised ja kaota Elupunkte, mis on võrdne hävitatud koletiste kogurünnakujõu poolega.

source: Right Leg of the Forbidden One
et: Keelatud Ühe Parem Jalg

source: A forbidden right leg sealed by magic. Whosoever breaks this seal will know infinite power.
et: Maagia poolt pitseeritud keelatud parem jalg. Kes iganes selle pitseri murrab, saab tundma lõputut jõudu.

source: Left Leg of the Forbidden One
et: Keelatud Üksuse Vasak Jalg

source: A forbidden left leg sealed by magic. Whosoever breaks this seal will know infinite power.
et: Maagia poolt pitseeritud keelatud vasak jalg. Kes iganes selle pitseri murrab, saab tundma lõputut jõudu.

source: Right Arm of the Forbidden One
et: Keelatud Ühe Parem Käsi

source: A forbidden right arm sealed by magic. Whosoever breaks this seal will know infinite power.
et: Maagia poolt pitseeritud keelatud parem käsi. Kes iganes selle pitseri murrab, saab tundma lõputut jõudu.

source: Left Arm of the Forbidden One
et: Keelatud Üksuse Vasak Käsi

source: A forbidden left arm sealed by magic. Whosoever breaks this seal will know infinite power.
et: Maagia poolt pitseeritud keelatud vasak käsi. Kes iganes selle pitseri murrab, saab tundma lõputut jõudu.

source: Exodia the Forbidden One
et: Keelatud Exodia

source: When you have "<M4023>Right Leg of the Forbidden One<M>", "<M4024>Left Leg of the Forbidden One<M>", "<M4025>Right Arm of the Forbidden One<M>", "<M4026>Left Arm of the Forbidden One<M>" in addition to this card in your hand, you win the Duel.
et: Kui sul on käes "<M4023>Keelatud Ühe Parem Jalg<M>", "<M4024>Keelatud Ühe Vasak Jalg<M>", "<M4025>Keelatud Ühe Parem Käsi<M>", "<M4026>Keelatud Ühe Vasak Käsi<M>" lisaks sellele kaardile, võidad Duelli.

source: Summoned Skull
et: Kutsutud Kolju

source: A fiend with dark powers for confusing the enemy. Among the Fiend-Type monsters, this monster boasts considerable force.<BR>(This card is always treated as an "Archfiend" card.)
et: Deemon, kellel on tumedad jõud vaenlase segadusse ajamiseks. Deemon-Tüüpi koletiste seas on sellel koletisel märkimisväärne jõud.<BR>(Seda kaarti käsitletakse alati kui "Archfiend" kaarti.)

source: The Wicked Worm Beast
et: Kuri Kurja Elajas

source: This face-up card on the field is returned to the owner's hand during the End Phase of your turn.
et: See avatud kaart väljakul tagastatakse omaniku kätte sinu käigu lõppfaasis.

source: Skull Servent
et: Kolgiteener

source: A skeletal ghost that isn't strong, but can mean trouble in large numbers.
et: Luurangekummitus, kes pole tugev, kuid võib suures koguses probleeme tekitada.

source: Horn Imp
et: Sarvimp

source: A small fiend that dwells in the dark, its single horn makes it a formidable opponent.
et: Väike deemon, kes elab pimeduses, tema üksik sarv teeb temast hirmuäratava vastase.

source: Battle Ox
et: Lahinghärg

source: A monster with tremendous power, it destroys enemies with a swing of its axe.
et: Koletis tohutu jõuga, hävitab vaenlasi oma kirvehoobiga.

source: Beaver Warrior
et: Kopra Sõdalane

source: What this creature lacks in size it makes up for in defense when battling in the prairie.
et: See olend, mis tal puudub suuruses, korvab ta kaitses, kui ta võitleb preerias.

source: Rock Ogre Grotto #1
et: Kalju Ogre Grotto #1

source: Protected by a solid body of rock, this monster throws a bone-shattering punch.
et: Kivist keha kaitse all viskab see koletis luumurdva löögi.

source: Mountain Warrior
et: Mäesõdalane

source: A tough warrior that can move smoothly on even the roughest terrain.
et: Vapper sõdalane, kes suudab sujuvalt liikuda isegi kõige raskemal maastikul.

source: Zombie Warrior
et: Zombisõdalane

source: "<M4030>Skull Servent<M>" + "<M4106>Battle Warrior<M>"
et: "<M4030>Kolju Sõdur<M>" + "<M4106>Lahingusõdalane<M>"

source: Koumori Dragon
et: Koumori Draakon

source: A vicious, fire-breathing dragon whose wicked flame corrupts the souls of its victims.
et: Õel, tuld purskav draakon, kelle kuri leek rikub tema ohvrite hinged.

source: Two-Headed King Rex
et: Kaherealine Rex

source: A powerful monster whose two heads attack as one.
et: Võimas koletis, kelle kaks pead ründavad üheskoos.

source: Judge Man
et: Kohtunik

source: This club-wielding warrior battles to the end and will never surrender.
et: See nuiaga vehklev sõdalane võitleb lõpuni ja ei anna kunagi alla.

source: Saggi the Dark Clown
et: Saggi, Tume Kloun

source: This clown appears from nowhere and executes very strange moves to avoid enemy attacks.
et: See kloun ilmub eikuskilt ja sooritab väga kummalisi liigutusi, et vältida vaenlase rünnakuid.

source: Dark Magician
et: Pimevõlur

source: The ultimate wizard in terms of attack and defense.
et: Rünnakute ja kaitse osas ülim võlur.

source: The Snake Hair
et: Madude juuksed

source: A monster with the head of poisonous snakes. One look from this monster can turn an opponent into stone.
et: Mürgiste madude peaga koletis. Üks pilk sellelt koletiselt võib vastase kiviks muuta.

source: Gaia the Dragon Champion
et: Draakonimeister Gaia

source: "<M4044>Gaia the Fierce Knight<M>" + "<M4045>Curse of Dragon<M>"
et: "<M4044>Raevukas Rüütel Gaia<M>" + "<M4045>Draakoni Needus<M>"

source: Gaia the Fierce Knight
et: Raevukas Rüütel Gaia

source: A knight whose horse travels faster than the wind. His battle-charge is a force to be reckoned with.
et: Rüütel, kelle hobune liigub kiiremini kui tuul. Tema lahingurünnak on jõud, millega tuleb arvestada.

source: Curse of Dragon
et: Draakoni needus

source: A wicked dragon that taps into dark forces to execute a powerful attack.
et: Kuri lohe, kes kasutab tumedaid jõude võimsa rünnaku sooritamiseks.

source: Dragon Piper
et: Draakonipuhuja

source: FLIP: Destroy all face-up "<M4335>Dragon Capture Jar<M>"(s) on the field. If you destroy any, change all face-up Dragon-Type monsters on the field to Attack Position.
et: FLIP: Hävita kõik lahtised "<M4335>Dragon Capture Jar<M>"(id) väljal. Kui hävitad mõne, muuda kõik lahtised Draakoni-tüüpi koletised väljal Rünnakuasendisse.

source: Celtic Guardian
et: Keldi valvur

source: An elf who learned to wield a sword, he baffles enemies with lightning-swift attacks.
et: Haldjas, kes õppis mõõka käsitsema, hämmastab vaenlasi välkkiirete rünnakutega.

source: Illusionist Faceless Mage
et: Illusionistist Näoteta Maag

source: Manipulates enemy attacks with the power of illusion.
et: Manipuleerib vaenlase rünnakuid illusiooni jõuga.

source: Karbonala Warrior
et: Karbonala Sõdalane

source: "<M4166>M-Warrior #1<M>" + "<M4167>M-Warrior #2<M>"
et: "<M4166>M-Sõdalane #1<M>" + "<M4167>M-Sõdalane #2<M>"

source: Rogue Doll
et: Pahatahtlik Nukk

source: A deadly doll gifted with mystical power, it is particularly powerful when attacking against dark forces.
et: Surmav nukk, millele on antud müstiline jõud, on eriti võimas pimedate jõudude vastu rünnates.

source: A creature that electrocutes opponents with bolts of lightning.
et: Olend, kes elektrilöökidega vastaseid tabab.

source: This monster's tough hide deflects almost any attack.
et: Selle koletise tugev nahk peegeldab peaaegu iga rünnaku.

source: Although a poor defender, this monster's sharp horn gives it an edge when attacking.
et: Kuigi see on kehv kaitsja, annab selle koletise terav sarv talle rünnates eelise.

source: When this card is sent from the field to the Graveyard: Add 1 monster with 1500 or less ATK from your Deck to your hand.
et: Kui see kaart saadetakse väljakult hauakambrisse: Lisa 1 koletis, mille ATK on 1500 või vähem, oma pakist oma kätte.

source: Big Insect
et: Suur Putukas

source: A giant ant that dwells in the jungle, it is powerful whether attacking or defending.
et: Hiiglaslik sipelgas, kes elab džunglis, on võimas nii rünnates kui ka kaitstes.

source: Basic Insect
et: Lihtne Putukas

source: Usually found traveling in swarms, this creature's ideal environment is the forest.
et: Tavaliselt parvedes liikuv olend, kelle ideaalne elupaik on mets.

source: Armored Lizard
et: Soomustatud Sisalik

source: A lizard with a very tough hide and a vicious bite.
et: Sisaliku väga kõva nahk ja õel hammustus.

source: Hercules Beetle
et: Herkulesmardikas

source: A massive beetle with a tough carapace and a dangerous horn.
et: Massiivne mardikas, millel on tugev kitiinkest ja ohtlik sarv.

source: Killer Needle
et: Surmanõel

source: A huge bee with exceptional strength that's particularly dangerous in a swarm.
et: Hiiglaslik mesilane erakordse jõuga, mis on eriti ohtlik parves.

source: A large, spherical roach that attacks its enemies by rolling over them.
et: Suur, sfääriline prussakas, kes ründab oma vaenlasi neist üle veeredes.

source: Giant Flea
et: Hiidkirp

source: A massive flea that feeds on the blood of its enemies.
et: Massiivne kirp, kes toitub oma vaenlaste verest.

source: Larvae Moth
et: Tõugmutt

source: This monster cannot be Normal Summoned or Set. This card can only be Special Summoned by Tributing "<M4284>Petit Moth<M>" on the 2nd of your turns after "<M4284>Petit Moth<M>" has been equipped with "<M4078>Cocoon of Evolution<M>".
et: Seda koletist ei saa normaalselt kutsuda ega asetada. Seda kaarti saab eriliselt kutsuda ainult siis, kui ohverdatakse "<M4284>Petit Moth<M>" teisel käigul pärast seda, kui "<M4284>Petit Moth<M>" on varustatud "<M4078>Cocoon of Evolution<M>".

source: Great Moth
et: Suur Koi

source: This monster cannot be Normal Summoned or Set. This card can only be Special Summoned by Tributing "<M4284>Petit Moth<M>" on the 4th of your turns after "<M4284>Petit Moth<M>" has been equipped with "<M4078>Cocoon of Evolution<M>".
et: Seda koletist ei saa normaalselt kutsuda ega asetada. Seda kaarti saab eriliselt kutsuda ainult siis, kui ohverdatakse "<M4284>Petit Moth<M>" neljandal käigul pärast seda, kui "<M4284>Petit Moth<M>" on varustatud "<M4078>Cocoon of Evolution<M>".

source: During your opponent's Battle Phase, you can discard this card to reduce the Battle Damage inflicted to your Life Points from 1 of your opponent's monsters attacks to 0.
et: Oma vastase Lahingufaasis võid selle kaardi ära visata, et vähendada oma Elupunktidele tekitatud Lahingukahju ühe vastase koletise rünnakust nullini.

source: Mammoth Graveyard
et: Mammutikalmistu

source: A mammoth that protects the graves of its pack and is absolutely merciless when facing grave-robbers.
et: Mammut, kes kaitseb oma karja haudu ja on hauaröövlite vastu täiesti halastamatu.

source: Great White
et: Suur Valge

source: A giant white shark with razor-sharp teeth.
et: Hiiglaslik valge hai teravate hammastega.

source: Wolf
et: Hunt

source: A rare wolf that can follow the slightest scent of an enemy.
et: Haruldane hunt, kes suudab jälitada vaenlase kõige nõrgematki lõhna.

source: Harpie Lady
et: Harpyia Leedi

source: This human-shaped animal with wings is beautiful to watch but deadly in battle.
et: See tiibadega inimkuju loom on ilus vaadata, kuid lahingus surmav.

source: Harpie Lady sisters
et: Harpy Õed

source: This card cannot be Normal Summoned or Set. This card can only be Special Summoned by "<M4324>Elegant Egotist<M>".
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti saab eriliselt kutsuda ainult "<M4324>Elegant Egotist<M>".

source: Tiger Axe
et: Tiigrikirves

source: A fast and powerful axe-wielding beast-warrior.
et: Kiire ja võimas kirvest kasutav metsaline-sõdalane.

source: Silver Fang
et: Hõbekihv

source: A snow wolf that's beautiful to the eye, but absolutely vicious in battle.
et: Ilus lumehunt, kes on lahingus täiesti halastamatu.

source: A man-hunter with powerful arms that can crush boulders.
et: Kivimürakaid purustavate võimsate kätega mehekütt.

source: Perfectly Ultimate Great Moth
et: Täiuslikult Ülim Suur Koi

source: This card cannot be Normal Summoned or Set. This monster can only be Special Summoned by Tributing "<M4284>Petit Moth<M>" on the 6th of your turns after "<M4284>Petit Moth<M>" has been equipped with "<M4078>Cocoon of Evolution<M>".
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda koletist saab eriliselt kutsuda ainult siis, kui ohverdatakse "<M4284>Petit Moth<M>" oma kuuendal käigul pärast seda, kui "<M4284>Petit Moth<M>" on varustatud "<M4078>Cocoon of Evolution<M>".

source: An axe-swinging beast-warrior with the head of a dragon.
et: Kirvest viibutav metssõdalane draakoni peaga.

source: Thousand Dragon
et: Tuhande Draakon

source: "<M4022>Time Wizard<M>" + "<M4010>Baby Dragon<M>"
et: "<M4022>Aja Võlur<M>" + "<M4010>Beebi Draakon<M>"

source: Fiend Kraken
et: Deemonkraken

source: A giant squid that drags its enemies to a waterygrave.
et: Hiiglaslik kalmaar, kes veab oma vaenlased vesisesse hauda.

source: Jellyfish
et: Meduus

source: An almost invisible, semi-transparent jellyfish that drifts in the sea.
et: Peaaegu nähtamatu, poolläbipaistev meduus, mis triivib meres.

source: Cocoon of Evolution
et: Evolutsiooni kookon

source: You can equip this card from your hand as an Equip Spell Card to a face-up "<M4284>Petit Moth<M>" on the field. If equipped, the ATK and DEF of "<M4078>Cocoon of Evolution<M>" is applied to "<M4284>Petit Moth<M>".
et: Saad selle kaardi oma käest varustuse loitsukaardina kinnitada näoga üles "<M4284>Petit Moth<M>"-ile väljal. Kui see on varustatud, rakendatakse "<M4078>Cocoon of Evolution<M>" ATK ja DEF "<M4284>Petit Moth<M>"-ile.

source: A sea dragon known as the King of the Ocean, it attacks with huge tidal waves.
et: Merekuningas, tuntud kui Ookeani Kuningas, ründab tohutute tõusulainetega.

source: Giant Soldier of Stone
et: Kivihiid

source: A giant warrior made of stone. A punch from this creature has earth-shaking results.
et: Kivist valmistatud hiiglaslik sõdalane. Selle olendi löök põhjustab maavärinaid.

source: Man-Eating Plant
et: Inimesesööja taim

source: A meat-eating plant that is attractive to the eye but dangerous when approached.
et: Liha söövat taim, mis on silmale meeldiv, kuid lähenedes ohtlik.

source: A vicious crocodile with great intelligence.
et: Väga intelligentne ja metsik krokodill.

source: Grappler
et: Maadleja

source: A devious snake with a thick body that wraps around an enemy monster and squeezes the life out of it.
et: Salakaval madu, kellel on jäme keha, mis mähib end vaenlase koletise ümber ja pigistab sellest elu välja.

source: Axe Raider
et: Kirveraidur

source: An axe-wielding monster of tremendous strength and agility.
et: <translated Kirvest kandev koletis, kellel on tohutu jõud ja osavus.

source: Nothing stands in the way of this spike-covered dinosaur.
et: Mitte miski ei seisa selle ogadega kaetud dinosauruse teel.

source: Fast on its feet, this dinosaur rips enemies to shreds with its sharp claws.
et: Kiire jalgadel, rebib see dinosaurus oma teravate küünistega vaenlased tükkideks.

source: Crawling Dragon #2
et: Roomav Draakon #2

source: This weakened dragon can no longer fly, but is still a deadly force to be reckoned with.
et: See nõrgenenud draakon ei suuda enam lennata, kuid on endiselt surmav jõud, millega tuleb arvestada.

source: Red Eyes B. Dragon
et: Punasilmne B. Draakon

source: A ferocious dragon with a deadly attack.
et: Surmava rünnakuga raevukas draakon.

source: Castle of Dark Illusions
et: Pimedate Illusioonide Loss

source: FLIP: Increases the ATK and DEF of all Zombie-Type monsters by 200 points. As long as this card remains face-up on the field, the ATK and DEF of Zombie-Type monsters continues to increase by 200 points during each of your Standby Phases. This effect continues until the 4th turn after the card is activated.
et: FLIP: Suurendab kõigi Zombi-tüüpi koletiste ATK ja DEF 200 punkti võrra. Kuni see kaart jääb väljale avatud olekus, suurenevad Zombi-tüüpi koletiste ATK ja DEF iga sinu Ootefaaside ajal 200 punkti võrra. See efekt kestab kuni 4. käiguni pärast kaardi aktiveerimist.

source: Reaper of the Cards
et: Kaartide Niiduk
