Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: This card cannot be Normal Summoned or Set. This card can only be Special Summoned by Tributing 1 "<M3681>Skiel Carrier 5<M>" you control. If there is no face-up "Machine Emperor" monster on the field, destroy this card. Once per turn, when a monster you control is selected as an attack target, you can negate the attack. When a monster you control destroys an opponent's monster by battle and sends it to the Graveyard, inflict 300 damage to your opponent.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti saab eriliselt kutsuda ainult ohverdades 1 "<M3681>Skiel Carrier 5<M>", mida sa kontrollid. Kui väljakul ei ole ühtegi avatud "Masina Keisri" koletist, hävita see kaart. Kord ühe käigu jooksul, kui sinu kontrollitav koletis valitakse rünnaku sihtmärgiks, saad rünnaku tühistada. Kui sinu kontrollitav koletis hävitab lahingus vastase koletise ja saadab selle Hauakambrisse, tekitab see vastasele 300 kahju.

source: You can send 1 face-down Spell or Trap Card you control to the Graveyard to inflict 800 damage to your opponent.
et: Saadad ühe enda kontrolli all oleva tagurpidi Maagia- või Lõksukaardi Hauakambrisse, et tekitada vastasele 800 kahju.

source: Infernity Zero
et: Infernity Null

source: This card cannot be Normal Summoned or Set. This card cannot be Special Summoned except by this card's effect. When your opponent activates a card or effect that would inflict damage, while your Life Points are 2000 or less, you can discard all other cards in your hand to Special Summon this card from your hand. You do not lose the Duel even if your Life Points become 0. If you have no cards in your hand, this card cannot be destroyed by battle. For each time you take damage, place 1 Des Counter on this card. When there are 3 Des Counters on this card, destroy it.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti ei saa eriliselt kutsuda, välja arvatud selle kaardi efekti abil. Kui sinu vastane aktiveerib kaardi või efekti, mis tekitaks kahju, kui sinu Elupunktid on 2000 või vähem, võid sa kõik teised kaardid oma käest ära visata, et eriliselt kutsuda see kaart oma käest. Sa ei kaota Duelli isegi siis, kui sinu Elupunktid muutuvad 0-ks. Kui sul pole kaarte käes, ei saa seda kaarti lahingus hävitada. Iga kord, kui sa saad kahju, aseta sellele kaardile 1 Des Counter. Kui sellel kaardil on 3 Des Counterit, hävita see.

source: If you have no cards in your hand, when your opponent activates a card or effect that would inflict damage, you can remove from play this card in the Graveyard to negate the effect damage you take. Your opponent then chooses whether or not to apply the following effect:<BR>●Reveal the top card of your Deck. If it is a Monster Card, you take 2000 damage. If it is a Spell or Trap Card, inflict 2000 damage to your opponent. Then shuffle your Deck.
et: Kui sul pole kaarte käes, siis kui sinu vastane aktiveerib kaardi või efekti, mis tekitaks kahju, saad selle kaardi Hauakambrist mängust eemaldada, et negatiivne efektikahju ära hoida. Seejärel otsustab sinu vastane, kas rakendada järgmist efekti:<BR>●Paljasta oma paki ülemine kaart. Kui see on Koletisekaart, saad 2000 kahju. Kui see on Loitsu- või Lõksukaart, tekitad oma vastasele 2000 kahju. Seejärel sega oma pakk.

source: Hook the Hidden Knight
et: Peidetud Rüütel Hook

source: When this Attack Position card is selected as an attack target, change this card and the attacking monster to Defense Position. When this card is changed from Attack Position to Defense Position, inflict 800 damage to your opponent.
et: Kui see ründepositsioonis kaart valitakse rünnaku sihtmärgiks, muuda see kaart ja ründav koletis kaitsepositsiooni. Kui see kaart muudetakse ründepositsioonist kaitsepositsiooni, põhjusta oma vastasele 800 kahju.

source: Double Type Rescue
et: Topelt tüübi päästmine

source: Activate only while you control 2 or more different Types of monsters and your opponent controls more monsters than you do. Select and Special Summon 1 monster from your Graveyard.
et: Aktiveeri ainult siis, kui sul on kontrolli all 2 või rohkem erinevat tüüpi koletisi ja sinu vastasel on rohkem koletisi kui sinul. Vali ja erikutsu 1 koletis oma Hauakambrist.

source: Twin Vortex
et: Kaksikvorteks

source: Select and destroy 1 face-up Machine-Type monster you control and 1 monster your opponent controls.
et: Vali ja hävita 1 avatud Masinatüüpi koletis, mida sa kontrollid, ja 1 koletis, mida sinu vastane kontrollib.

source: Spark Breaker
et: Sädemete Purustaja

source: Once per turn, you can select and destroy 1 monster you control.
et: Korra ühe käigu jooksul saad valida ja hävitada ühe koletise, mida sa kontrollid.

source: Labyrinth of Kline
et: Kline'i labürint

source: Activate only when an opponent's monster declares an attack. Negate the attack and switch the original ATK and DEF of that monster until the End Phase of the next turn.
et: Aktiveeri ainult siis, kui vastase koletis kuulutab välja rünnaku. Tühista rünnak ja vaheta selle koletise algne ATK ja DEF kuni järgmise käigu lõppfaasini.

source: Battle Return
et: Lahingu Tagasitulek

source: During your Battle Phase, you can select 1 "Machine Emperor" monster you control. The ATK of that monster is halved until the End Phase, and it can attack twice during the Battle Phase of this turn.
et: Oma Lahingufaasis saad valida 1 "Masina Keisri" koletise, mida sa kontrollid. Selle koletise ATK väheneb poole võrra kuni Lõppfaasini ja see võib rünnata kaks korda selle käigu Lahingufaasis.

source: Divergence
et: Lahknemine

source: When an opponent's monster declares an attack against a face-up Machine-Type monster you control, you can change the attack target to another face-up Machine-Type monster you control.
et: Kui vastase koletis kuulutab välja rünnaku sinu kontrollitava avatud Masina-tüüpi koletise vastu, saad sa muuta rünnaku sihtmärgi teiseks sinu kontrollitavaks avatud Masina-tüüpi koletiseks.

source: Absurd Stealer
et: Absurdne Varas

source: When this card is Normal Summoned, select 1 face-up Attack Position Level 4 or lower monster your opponent controls. The ATK of that monster is halved and this card's ATK becomes equal to the DEF of the selected monster until the End Phase.
et: Kui see kaart on Normaal-Kutsutud, vali 1 vastase kontrollitav avatud Rünnakupositsioonis Tase 4 või madalam koletis. Selle koletise RÜN väheneb poole võrra ja selle kaardi RÜN muutub valitud koletise KAIT-iga võrdseks kuni Lõppfaasini.

source: Convert Ghost
et: Muundatud Kummitus

source: When you control a face-up "Machine Emperor" monster: Banish 1 Machine-Type monster in your Graveyard. Negate the activation of an opponent's Spell Card, Trap Card, or Effect Monster's effect and destroy that card. Set this card face-down again instead of sending it to the Graveyard.
et: Kui sa kontrollid avatud "Masina Keisri" koletist: Saada 1 Masina-tüüpi koletis oma Hauakambrist eksiili. Tühista vastase Loitsukaardi, Lõksukaardi või Efektkoletise efekti aktiveerimine ja hävita see kaart. Pane see kaart uuesti näoga allapoole, selle asemel et saata see Hauakambrisse.

source: Infinity Force
et: Lõpmatuse Jõud

source: Activate only while you control a face-up "Machine Emperor" monster when you take damage. Destroy all monsters your opponent controls.
et: Aktiveeri ainult siis, kui sa kontrollid avatud "Masina Keisri" koletist, kui sa saad kahju. Hävita kõik koletised, mida sinu vastane kontrollib.

source: Jester Queen
et: Narrikuninganna

source: When you control Spell/Trap Cards, this card can attack your opponent directly a number of times per turn equal to the number of Spell/Trap Cards you control.
et: Kui sa kontrollid Loitsu/Lõksu Kaardid, võib see kaart rünnata sinu vastast otse mitu korda ühe käigu jooksul, mis on võrdne sinu kontrollitavate Loitsu/Lõksu Kaartide arvuga.

source: Card of Distrain
et: Arestitud kaart

source: Activate only while your opponent controls 2 or more Set cards in their Spell & Trap Card Zone. Select 1 of them. It cannot be activated this turn. This turn, inflict 800 damage to your opponent each time they activate a Set Spell/Trap Card.
et: Aktiveeri ainult siis, kui sinu vastasel on 2 või rohkem seatud kaarti nende Võlu- ja Lõksukaartide alas. Vali neist 1. Seda ei saa sellel käigul aktiveerida. Sellel käigul tee oma vastasele 800 kahju iga kord, kui nad aktiveerivad seatud Võlu-/Lõksukaardi.

source: Jester's Panic
et: Jesteri paanika

source: Select and look at 1 face-down card in your opponent's Spell & Trap Card Zone. Reveal 1 card from your hand of the same Type to destroy the selected card. If a card is destroyed by this effect, all Level 2 or lower Spellcaster-Type monsters you control can attack your opponent directly this turn.
et: Vali ja vaata ühte vastase Maagia- ja Lõksukaartide alal olevat tagurpidi kaarti. Paljasta oma käest üks sama tüüpi kaart, et valitud kaart hävitada. Kui selle efektiga hävitatakse kaart, võivad kõik sinu kontrolli all olevad 2. taseme või madalama tasemega Loitsija-tüüpi koletised sel käigul otse vastast rünnata.

source: Hidden Passage
et: Varjatud Läbipääs

source: All Level 2 or lower Spellcaster-Type monsters you control with ATK lower than the face-up monster your opponent controls with the lowest ATK can attack your opponent directly.
et: Kõik 2. taseme või madalama taseme Loitsija-tüüpi koletised, mida sa kontrollid ja mille ATK on madalam kui sinu vastase madalaima ATK-ga avatud koletisel, võivad rünnata sinu vastast otse.

source: Late Penalty
et: Hilinemise karistus

source: At the beginning of your opponent's Standby Phase, if you control a face-up Level 2 or lower Spellcaster-Type monster and your opponent controls no monsters, skip your opponent's Battle Phase this turn.
et: Kui sinu vastase Ootefaas algab ja sul on kontrolli all avatud 2. taseme või madalama tasemega Loitsija-tüüpi koletis ning sinu vastasel pole koletisi, jäta sellel käigul vahele vastase Lahingufaas.

source: Tuning Barrier
et: Häälestusbarjäär

source: If a player has a Tuner monster on the field or in the Graveyard, they cannot declare an attack. This face-up card on the field cannot be returned to the hand. Send this card to the Graveyard during your third End Phase after activation.
et: Kui mängijal on Tuner koletis väljakul või Hauakambris, ei saa ta rünnakut kuulutada. Seda avatud kaarti väljakul ei saa käele tagasi saata. Saada see kaart Hauakambrisse oma kolmanda lõppfaasi ajal pärast aktiveerimist.

source: Sacred Knight's Spearholder
et: Püha Rüütli Odakandja

source: You can Tribute this face-up card on the field to add 1 Equip Spell Card from your Deck to your hand.
et: Saad selle avatud kaardi väljal ohverdada, et lisada 1 Varustuse Võlusõna Kaart oma pakist kätte.

source: Horse of the Floral Knights
et: Lillede rüütlite hobune

source: When this card is Normal Summoned, you can add 1 "<M3709>Sacred Knight's Spearholder<M>" or 1 "<M4837>Polymerization<M>" from your Deck to your hand.
et: Kui see kaart on Normaal-Kutsutud, saad lisada 1 "<M3709>Püha Rüütli Odakandja<M>" või 1 "<M4837>Polümerisatsioon<M>" oma pakist oma kätte.

source: Sacred Knight's Shield Bearer
et: Püha Rüütli Kilbikandja

source: When this card is Normal Summoned, you can remove from play 1 LIGHT Warrior-Type monster in your Graveyard to draw 1 card.
et: Kui see kaart on normaalvälja kutsutud, saad eemaldada oma kalmistult mängust 1 VALGUS Sõdalase-tüüpi koletise, et tõmmata 1 kaart.

source: École de Zone
et: Piirkonna Kool

source: Non-Token monsters cannot attack directly. When a non-Token monster is Normal or Special Summoned: Destroy that monster and Special Summon 1 "<M3633>Mask Token<M>" (Spellcaster-Type/DARK/Level 1/ATK ?/DEF ?) to the destroyed monster's controller's side of the field, in the same battle position as the monster destroyed by this effect. The ATK and DEF of the "<M3633>Mask Token<M>" are equal to the respective ATK and DEF of the destroyed monster.
et: Mittetaolised koletised ei saa rünnata otse. Kui mittetaoline koletis kutsutakse tavaliselt või eriliselt välja: hävita see koletis ja kutsu eriliselt välja 1 "<M3633>Mask Token<M>" (Loitsija-tüüp/PIMEDUS/Tase 1/ATK ?/DEF ?) hävitatud koletise kontrollija väljaku poolele, samas lahingupositsioonis kui selle efekti poolt hävitatud koletis. "<M3633>Mask Token<M>" ATK ja DEF on võrdsed hävitatud koletise vastava ATK ja DEF-iga.

source: Soul-Binding Gate
et: Hingehoidja Värav

source: Once per turn, when a monster that has lower ATK than your Life Points is Summoned face-up on the field, destroy that monster, and inflict 800 damage to each player.
et: Korra ühe korra käigu jooksul, kui väljakule kutsutakse avatud positsioonis koletis, mille ATK on madalam kui sinu Elupunktid, hävita see koletis ja tekita igale mängijale 800 kahju.

source: Centaur Mina
et: Kentaur Mina

source: "<M3709>Sacred Knight's Spearholder<M>" + "<M3710>Horse of the Floral Knights<M>"<BR>Once during each of your turns, you can negate the activation of an opponent's Trap Card, and return it to its original position.
et: "<M3709>Püha Rüütli Odakandja<M>" + "<M3710>Lillede Rüütlite Hobune<M>"<BR>Korra iga oma käigu jooksul saad tühistada vastase Lõksukaardi aktiveerimise ja viia see tagasi algsesse asendisse.

source: Imitation
et: Imitatsioon

source: Select 1 Token on the field. Destroy that Token, then Special Summon 1 "<M3633>Mask Token<M>" with the same original Level, Type, Attribute, ATK, and DEF as the selected Token to your opponent's side of the field. Then, inflict damage to your opponent equal to half the ATK of the selected Token.
et: Vali 1 Mängunupp väljal. Hävita see Mängunupp, seejärel Kutsu Eriliselt välja 1 "<M3633>Mask Token<M>" sama algse Tase, Tüüp, Atribuut, RÜN, ja KAIT nagu valitud Mängunupp oma vastase väljale. Seejärel põhjusta oma vastasele kahju, mis on võrdne poolega valitud Mängunupu RÜN-st.

source: For our Dreams
et: Meie unistuste nimel

source: Tribute 1 Warrior-Type monster you control to select 1 face-up Warrior-Type monster you control. It cannot be destroyed by battle while face-up on the field.
et: Lohverda 1 Sõdalase-tüüpi koletis, mida sa kontrollid, et valida 1 ülespööratud Sõdalase-tüüpi koletis, mida sa kontrollid. Seda ei saa lahingus hävitada, kui see on väljal ülespööratud.

source: Fleur de vertige
et: Pearinglill

source: If there is no face-up Field Spell Card on the field, you cannot activate this Card. Activate only when a monster is Special Summoned to your opponent's side of the field. Remove it from play.
et: Kui väljakul ei ole avatud Väljaloitsu Kaarti, ei saa sa seda Kaarti aktiveerida. Aktiveeri ainult siis, kui koletis kutsutakse eriliselt välja sinu vastase väljaku poolele. Eemalda see mängust.

source: Floral Shield
et: Lilleline Kilp

source: Activate only when your opponent's monster declares an attack. Negate the attack, and draw 1 card.
et: Aktiveeri ainult siis, kui sinu vastase koletis kuulutab välja rünnaku. Tühista rünnak ja tõmba 1 kaart.

source: Chain Close
et: Ahela sulgemine

source: Activate only when a card is destroyed by battle or by a card effect, and sent from the field to the Graveyard. Your opponent cannot activate any Spell/Trap Cards, until the End Phase. Spell/Trap Cards and Effect Monster's effects cannot be activated in response to this card's activation.
et: Aktiveeri ainult siis, kui kaart hävitatakse lahingus või kaardi efekti tõttu ja saadetakse väljakult hauakambrisse. Sinu vastane ei saa aktiveerida ühtegi Loitsu/Lõksu kaarti kuni Lõppfaasini. Loitsu/Lõksu kaarte ja Efektkoletise efekte ei saa aktiveerida vastuseks selle kaardi aktiveerimisele.

source: Fallen Paradise
et: Langenud paradiis

source: If there is at least 1 face-up "<M6563>Uria, Lord of Searing Flames<M>", "<M6564>Hamon, Lord of Striking Thunder<M>", or "<M6565>Raviel, Lord of Phantasms<M>" on the field, once per turn the controller of that card may draw 2 cards from their Deck.
et: Kui väljakul on vähemalt 1 avatud "<M6563>Uria, Lord of Searing Flames<M>", "<M6564>Hamon, Lord of Striking Thunder<M>" või "<M6565>Raviel, Lord of Phantasms<M>", võib selle kaardi kontrollija kord käigu jooksul tõmmata oma pakist 2 kaarti.

source: Slash Draw
et: Lõikejoonistus

source: Discard 1 card from your hand. Send cards from the top of your Deck to the Graveyard equal to the number of cards on the field, then, draw 1 card from your Deck and show it your opponent. If that card is "<M3721>Slash Draw<M>", send it to the Graveyard to destroy every card on the field. Inflict 1000 damage to your opponent for each card sent to the Graveyard this way. This card's activation and effect cannot be negated by any other card.
et: Viska 1 kaart oma käest. Saada kaardid oma pakist hauakambrisse, mis on võrdne väljal olevate kaartide arvuga, seejärel tõmba 1 kaart oma pakist ja näita seda oma vastasele. Kui see kaart on "<M3721>Slash Draw<M>", saada see hauakambrisse, et hävitada kõik kaardid väljal. Tekita oma vastasele 1000 kahju iga selle viisil hauakambrisse saadetud kaardi eest. Selle kaardi aktiveerimist ja efekti ei saa ühegi teise kaardiga tühistada.

source: Load of Darkness
et: Pimeduse koorem

source: This card cannot be destroyed by battle. This card cannot attack your opponent directly. When this card destroys an opponent's monster by battle, inflict 700 damage to your opponent.
et: Seda kaarti ei saa lahingus hävitada. See kaart ei saa rünnata sinu vastast otse. Kui see kaart hävitab lahingus vastase koletise, tekitab see sinu vastasele 700 kahju.

source: Infinite Fiend Summoning Mirrors
et: Lõpmatud deemoni kutsumise peeglid

source: While a player controls a face-up "<M3722>Load of Darkness<M>", they must Special Summon as many "<M3751>Load of Darkness Token<M>"(s) as possible that have the same original Level, Type, Attribute, ATK, DEF and effects as that monster. If there is no face-up "<M3722>Load of Darkness<M>" on the field, destroy all "<M3751>Load of Darkness Token<M>"(s) on the field.
et: Kui mängija kontrollib avatud "<M3722>Load of Darkness<M>", peab ta eriliselt kutsuma nii palju "<M3751>Load of Darkness Token<M>"(eid) kui võimalik, millel on sama algne tase, tüüp, atribuut, ATK, DEF ja efektid nagu sellel koletisel. Kui väljakul ei ole avatud "<M3722>Load of Darkness<M>", hävita kõik väljakul olevad "<M3751>Load of Darkness Token<M>"(id).

source: Arcana Force XII - The Hanged Man
et: Arcana Force XII - Poodu Riputatu

source: When this card is Summoned, toss a coin once. This card gains one of the following effects.<BR>●Heads: During your End Phase, Destroy 1 face-up monster you control and take damage equal to its ATK.<BR>●Tails: During your End Phase, Destroy 1 face-up monster your opponent controls and your opponent takes damage to equal to its ATK.
et: Kui see kaart kutsutakse välja, viska kord münti. See kaart saab ühe järgmistest efektidest.<BR>●Kull: Sinu lõppfaasis hävita 1 avatud koletis, mida sa kontrollid, ja saa kahju, mis võrdub selle rünnakuga.<BR>●Kiri: Sinu lõppfaasis hävita 1 avatud koletis, mida sinu vastane kontrollib, ja sinu vastane saab kahju, mis võrdub selle rünnakuga.

source: Bond Between Teacher and Student
et: Õpetaja ja Õpilase Vaheline Side

source: Activate if you control "<M4041>Dark Magician<M>". Special Summon 1 "<M4766>Dark Magician Girl<M>" from your hand, Deck or Graveyard in face-up Defense Position.
et: Aktiveeri, kui sa kontrollid "<M4041>Must Maag<M>". Kutsu eriliselt välja 1 "<M4766>Must Maag Tüdruk<M>" oma käest, pakist või hauast avatud kaitsepositsioonis.

source: Dark Magic Twin Burst
et: Pimeduse Maagia Kaksikpurse

source: Activate only while you control a face-up "<M4041>Dark Magician<M>" and a face-up "<M4766>Dark Magician Girl<M>". 1 "<M4041>Dark Magician<M>" you control gains ATK equal to the ATK of 1 "<M4766>Dark Magician Girl<M>" you control until the End Phase.
et: Aktiveeri ainult siis, kui sa kontrollid avatud "<M4041>Dark Magician<M>" ja avatud "<M4766>Dark Magician Girl<M>". 1 "<M4041>Dark Magician<M>", mida sa kontrollid, saab ATK, mis on võrdne 1 "<M4766>Dark Magician Girl<M>", mida sa kontrollid, ATK-ga kuni End Phase'ini.

source: Arcana Force VIII - The Strength
et: Arkaani Jõud VIII - Jõud

source: When this card is Normal Summoned, toss a coin once. This card gains one of the following effects.<BR>●Heads: Take control of 1 monster your opponent controls.<BR>●Tails: Your opponent selects and takes control of 1 monster you control, except this card.
et: Kui see kaart on Normaal-Kutsutud, viska münti üks kord. See kaart saab ühe järgmistest efektidest.<BR>●Kull: Võta kontroll 1 vastase koletise üle.<BR>●Kiri: Sinu vastane valib ja võtab kontrolli 1 sinu koletise üle, välja arvatud see kaart.

source: Dark Spiral Force
et: Pime Spiraaljõud

source: If you control a face-up "<M4041>Dark Magician<M>": Target 1 face-up monster you control, except "<M4041>Dark Magician<M>"; double that target's ATK until the End Phase. "<M4041>Dark Magician<M>" cannot attack this turn.
et: Kui sa kontrollid avatud "<M4041>Dark Magician<M>": sihi 1 avatud koletis, mida sa kontrollid, välja arvatud "<M4041>Dark Magician<M>"; kahekordista selle sihtmärgi ATK kuni lõppfaasini. "<M4041>Dark Magician<M>" ei saa sellel käigul rünnata.

source: Neos Spiral Force
et: Neose Spiraaljõud

source: If you control a face-up "<M6653>Elemental Hero Neos<M>": Target 1 face-up monster you control, except "<M6653>Elemental Hero Neos<M>"; double that target's ATK until the End Phase. "<M6653>Elemental Hero Neos<M>" cannot attack this turn.
et: Kui sa kontrollid avatud "<M6653>Elemental Hero Neos<M>": sihi 1 avatud koletis, mida sa kontrollid, välja arvatud "<M6653>Elemental Hero Neos<M>"; kahekordista selle sihtmärgi ATK kuni lõppfaasini. "<M6653>Elemental Hero Neos<M>" ei saa sellel käigul rünnata.

source: The Sky Lord
et: Taevaisand

source: Activate only while there is a Level 7 or higher "Arcana Force" monster in your Graveyard. You can send this face-up card, along with one face-up "<M3731>The Material Lord<M>" and "<M3732>The Spiritual Lord<M>" you control, to the Graveyard to Special Summon 1 "<M7344>Arcana Force Ex - the Light Ruler<M>" from your hand, Deck, or Graveyard, ignoring the Summoning conditions.
et: Aktiveeri ainult siis, kui sinu kalmistul on 7. või kõrgema tasemega "Arcana Force" koletis. Sa saad saata selle avatud kaardi koos ühe avatud "<M3731>The Material Lord<M>" ja "<M3732>The Spiritual Lord<M>"-ga, mida sa kontrollid, kalmistule, et erilissummonida 1 "<M7344>Arcana Force Ex - the Light Ruler<M>" oma käest, pakist või kalmistult, eirates summoni tingimusi.

source: The Material Lord
et: Materjalide Isand

source: Activate only when a Level 4 or higher "Arcana Force" monster is in your Graveyard. By sending a Level 5 or 6 "Arcana Force" monster from your hand to your Graveyard, add 1 "<M3732>The Spiritual Lord<M>" from your Deck to your hand.
et: Aktiveeri ainult siis, kui sinu kalmistul on 4. või kõrgema taseme "Arcana Force" koletis. Saates 5. või 6. taseme "Arcana Force" koletise oma käest kalmistule, lisa 1 "<M3732>The Spiritual Lord<M>" oma pakist kätte.

source: The Spiritual Lord
et: Vaimne Isand

source: Activate only when a Level 5 or 6 or higher "Arcana Force" monster is in your Graveyard. By sending a Level 7 "Arcana Force" monster from your hand to the Graveyard, add 1 "<M3730>The Sky Lord<M>" from your Deck to your hand.
et: Aktiveeri ainult siis, kui sinu kalmistul on 5. või 6. või kõrgema taseme "Arcana Force" koletis. Saates 7. taseme "Arcana Force" koletise oma käest kalmistule, lisa 1 "<M3730>The Sky Lord<M>" oma pakist kätte.

source: Malefic Divide
et: Pahatahtlik Jagamine

source: Target 1 "Malefic" monster in your Graveyard; Special Summon it, ignoring the Summoning conditions. Banish it during the End Phase.
et: Vali 1 "Malefic" koletis oma kalmistul; Kutsu see eriliselt välja, eirates kutsumise tingimusi. Eemalda see mängust lõppfaasis.
