Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: FLIP: Take control of 1 WIND monster on your opponent's side of the field for as long as this card remains face-up on the field.
et: FLIP: Võta kontroll 1 WIND koletise üle oma vastase väljaku poolel nii kauaks, kuni see kaart jääb väljale avatud olekusse.

source: Batteryman AA
et: Patarei AA

source: If all "Batteryman AA"(s) you control are in Attack Position, this card gains 1000 ATK for each. If all "Batteryman AA"(s) you control are in Defense Position, this card gains 1000 DEF for each.
et: Kui kõik sinu kontrolli all olevad "Batteryman AA"(d) on Rünnakupositsioonis, saab see kaart igaühe eest 1000 ATK juurde. Kui kõik sinu kontrolli all olevad "Batteryman AA"(d) on Kaitsepositsioonis, saab see kaart igaühe eest 1000 DEF juurde.

source: Any damage to you from a card effect becomes 0.
et: Kõik kaardiefektidest tulenevad kahjustused sulle muutuvad nulliks.

source: King of the Skull Servants
et: Kolgade teenrite kuningas

source: The original ATK of this card becomes the number of "King of the Skull Servants" and "<M4030>Skull Servent<M>" cards in your Graveyard x 1000. When this card is destroyed by battle and sent to the Graveyard, by removing from play 1 other "King of the Skull Servants" or "<M4030>Skull Servent<M>" card in your Graveyard, Special Summon this card.
et: Selle kaardi algne ATK muutub võrdseks sinu kalmistul olevate "King of the Skull Servants" ja "<M4030>Skull Servent<M>" kaartide arvuga x 1000. Kui see kaart hävitatakse lahingus ja saadetakse kalmistule, siis eemaldades mängust 1 teise "King of the Skull Servants" või "<M4030>Skull Servent<M>" kaardi oma kalmistul, kutsu see kaart eriliselt välja.

source: Reshef the Dark Being
et: Reshef, Tume Olend

source: This card can only be Ritual Summoned with the Ritual Spell Card, "Final Ritual of the Ancients". Once per turn, by discarding 1 Spell Card from your hand, take control of 1 monster on your opponent's side of the field until the end of this turn.
et: Seda kaarti saab Rituaali Kutsuda ainult Rituaali Loitsukaardiga "Iidsete Viimane Rituaal". Kord käigu jooksul, kui sa viskad oma käest ära 1 Loitsukaardi, saad võtta kontrolli 1 vastase poolel oleva koletise üle kuni käigu lõpuni.

source: Elemental Mistress Doriado
et: Elementaalne Armuke Doriado

source: This card can only be Ritual Summoned with the Ritual Spell Card, "Doriado's Blessing". The Attribute of this card is also treated as WIND, WATER, FIRE, and EARTH while it is face-up on the field.
et: Seda kaarti saab rituaalsummonida ainult rituaal-loitsukaardiga "Doriado õnnistus". Selle kaardi atribuuti käsitletakse ka kui TUUL, VESI, TULI ja MAA, kui see on väljaku peal avatud.

source: Elemental HERO Flame Wingman
et: Elementaalne KANGELANE Leegitiivamees

source: "<M6310>Elemental HERO Avian<M>" + "<M6311>Elemental HERO Burstinatrix<M>"<BR>Must be Fusion Summoned and cannot be Special Summoned by other ways. When this card destroys a monster by battle and sends it to the Graveyard: Inflict damage to your opponent equal to the ATK of the destroyed monster.
et: "<M6310>Elemental HERO Avian<M>" + "<M6311>Elemental HERO Burstinatrix<M>"<BR>Peab olema Fusion Summoned ja ei saa olla Special Summoned muul viisil. Kui see kaart hävitab lahingus koletise ja saadab selle Hauakambrisse: Tekita oma vastasele kahju, mis on võrdne hävitatud koletise ATK-ga.

source: Elemental HERO Thunder Giant
et: Elementaalne KANGELANE Äikesehiiglane

source: "<M6313>Elemental HERO Sparkman<M>" + "<M6312>Elemental HERO Clayman<M>"<BR>Must be Fusion Summoned and cannot be Special Summoned by other ways. Once per turn: You can discard 1 card to target 1 face-up monster on the field with original ATK less than the ATK of this card; destroy that target.
et: "<M6313>Elemental HERO Sparkman<M>" + "<M6312>Elemental HERO Clayman<M>"<BR>Peab olema Fusion Summoned ja ei saa olla Special Summoned muul viisil. Kord ühe käigu jooksul: Sa võid ühe kaardi ära visata, et sihtida ühte näoga ülespoole olevat koletist väljakul, mille algne ATK on väiksem kui selle kaardi ATK; hävita see sihtmärk.

source: Gift of the Martyr
et: Märtri kingitus

source: Send 1 monster on your side of the field to the Graveyard. Select 1 monster on your side of the field. The selected monster gains ATK equal to the ATK of the sent monster until the end of this turn.
et: Saada 1 koletis oma väljaku poolelt Hauakambrisse. Vali 1 koletis oma väljaku poolelt. Valitud koletis saab ATK-d, mis on võrdne saadetud koletise ATK-ga kuni selle käigu lõpuni.

source: Double Attack
et: Kahekordne Rünnak

source: Discard 1 Monster Card from your hand to the Graveyard. Select 1 monster on your side of the field with a lower Level than the discarded monster. The selected monster can attack twice this turn.
et: Viska 1 koletiskaart oma käest hauakambrisse. Vali 1 koletis oma väljaku poolelt, mille tase on madalam kui visatud koletisel. Valitud koletis võib sellel käigul rünnata kaks korda.

source: Battery Charger
et: Akulaadija

source: Pay 500 Life Points. Special Summon 1 "Batteryman" monster from your Graveyard.
et: Makske 500 Elupunkti. Kutsu eriliselt välja 1 "Batteryman" koletis oma Hauakambrist.

source: Kaminote Blow
et: Kaminote Löök

source: Activate only if there is at least 1 face-up "Chu-Ske the Mouse Fighter", "Monk Fighter", or "Master Monk" on your side of the field. Destroy the monster(s) that battle with these monsters on your side of the field this turn, at the end of each Damage Step.
et: Aktiveeri ainult siis, kui sinu väljaku poolel on vähemalt 1 avatud "Chu-Ske the Mouse Fighter", "Monk Fighter" või "Master Monk". Hävita sellel käigul nende sinu väljaku poolel olevate koletistega võitlevad koletised iga Damage Stepi lõpus.

source: Doriado's Blessing
et: Doriado õnnistus

source: This card is used to Ritual Summon "Elemental Mistress Doriado". You must also Tribute monsters whose total Levels equal 3 or more from the field or your hand.
et: Seda kaarti kasutatakse "Elemental Mistress Doriado" rituaalsummonimiseks. Sa pead ka ohverdama koletisi, kelle kogutasemed on 3 või rohkem, kas väljakult või oma käest.

source: Final Ritual of the Ancients
et: Muistsete lõplik rituaal

source: This card is used to Ritual Summon "Reshef the Dark Being". You must also Tribute monsters whose total Levels equal 8 or more from the field or your hand.
et: Seda kaarti kasutatakse "Reshef the Dark Being" rituaalsummonimiseks. Sa pead ka ohverdama koletisi, kelle kogutasemed on 8 või rohkem, kas väljakult või oma käest.

source: Legendary Black Belt
et: Legendaarne Must Vöö

source: Equip only to "Chu-Ske the Mouse Fighter", "Monk Fighter", or "Master Monk". When the equipped monster destroys your opponent's monster by battle and sends it to the Graveyard, inflict damage to your opponent equal to the DEF of the destroyed monster.
et: Varusta ainult kaardile "Chu-Ske the Mouse Fighter", "Monk Fighter" või "Master Monk". Kui varustatud koletis hävitab lahingus sinu vastase koletise ja saadab selle Hauakambrisse, põhjusta oma vastasele kahju, mis on võrdne hävitatud koletise DEF-iga.

source: Nitro Unit
et: Nitro Üksus

source: Equip only to a monster on your opponent's side of the field. When the equipped monster is destroyed by battle and sent to the Graveyard, inflict damage to your opponent equal to the ATK of the equipped monster.
et: Varusta ainult vastase väljaku poolel olevale koletisele. Kui varustatud koletis hävitatakse lahingus ja saadetakse Hauakambrisse, põhjusta oma vastasele kahju, mis on võrdne varustatud koletise rünnakupunktidega.

source: Shifting Shadows
et: Varjuvahetus

source: Once per turn, by paying 300 Life Points, rearrange the face-down Defense Position monsters on your side of the field, then return them in face-down Defense Position.
et: Korra ühe korra käigu jooksul, makstes 300 Elupunkti, korralda ümber oma väljaku poolel olevad tagurpidi kaitseasendis olevad koletised, seejärel aseta need tagasi tagurpidi kaitseasendisse.

source: Impenetrable Formation
et: Läbimatu Formatsioon

source: Select 1 monster on your side of the field to activate this card. While you have 2 or more monsters on your side of the field, and all monsters on your side of the field are in Defense Position, the selected monster gains 700 DEF. When the selected monster is removed from the field, destroy this card.
et: Vali 1 koletis oma väljaku poolelt, et aktiveerida see kaart. Kui sul on oma väljaku poolel 2 või rohkem koletist ja kõik koletised on Kaitsepositsioonis, saab valitud koletis 700 DEF juurde. Kui valitud koletis eemaldatakse väljalt, hävita see kaart.

source: Hero Signal
et: Kangelase Signaal

source: When a monster you control is destroyed by battle and sent to the Graveyard: Special Summon 1 Level 4 or lower1 "Elemental HERO" monster from your hand or Deck.
et: Kui sinu kontrollitav koletis hävitatakse lahingus ja saadetakse Hauakambrisse: Kutsu eriliselt välja 1 tase 4 või madalam "Elemental HERO" koletis oma käest või pakist.

source: Pikeru's Second Sight
et: Pikeru teine nägemine

source: Until your opponent's second End Phase, your opponent shows you all the cards that they draw before adding them to their hand.
et: Kuni sinu vastase teise lõppfaasini näitab vastane sulle kõiki kaarte, mida ta tõmbab, enne kui lisab need oma kätte.

source: Minefield Eruption
et: Miinivälja Purset

source: Inflict 1000 damage to your opponent for each face-up "Mine Golem" on your side of the field. After that, destroy all face-up "Mine Golem"(s) on your side of the field.
et: Tehke oma vastasele 1000 kahju iga sinu väljaku avatud "Mine Golem" eest. Pärast seda hävita kõik sinu väljaku avatud "Mine Golem"(id).

source: Kozaky's Self-Destruct Button
et: Kozaky enesehävitusnupp

source: Inflict 1000 damage to the player who destroyed this Set card.
et: Tekita 1000 kahju mängijale, kes hävitas selle seatud kaardi.

source: Mispolymerization
et: Vale polümerisatsioon

source: Activate only when a Fusion Monster is Special Summoned. Return all face-up Fusion Monsters to their respective Fusion Decks.
et: Aktiveeri ainult siis, kui Fusion Monster kutsutakse eriliselt välja. Tagasta kõik ülespööratud Fusion Monsterid nende vastavatesse Fusion Deckidesse.

source: Level Conversion Lab
et: Taseme Muundamise Labor

source: Select 1 monster in your hand and show it to your opponent, then roll a six-sided die. If the result is 1, send the selected monster to the Graveyard. If the result is 2-6, the Level of the selected monster becomes equal to the result until the end of this turn.
et: Vali oma käest 1 koletis ja näita seda oma vastasele, seejärel veereta kuuepoolset täringut. Kui tulemus on 1, saada valitud koletis Hauakambrisse. Kui tulemus on 2-6, muutub valitud koletise tase võrdseks tulemusega kuni selle käigu lõpuni.

source: Rock Bombardment
et: Kivipommitus

source: Select 1 Rock-Type monster in your Deck and send it to the Graveyard. Inflict 500 damage to your opponent. Then shuffle the Deck.
et: Vali oma pakist 1 Kaljukivi-tüüpi koletis ja saada see Hauakambrisse. Põhjusta oma vastasele 500 kahju. Seejärel sega pakk.

source: Grave Lure
et: Hauakutse

source: Turn the top card of your opponent's Deck face-up, then your opponent shuffles their Deck. When your opponent draws the face-up card, immediately send it to the Graveyard.
et: Pööra oma vastase paki ülemine kaart ülespoole, seejärel segab vastane oma paki. Kui vastane tõmbab ülespoole pööratud kaardi, saada see kohe Hauakambrisse.

source: Token Feastevil
et: Tokenpidu

source: Activate only when a Token(s) is Special Summoned. Destroy all Tokens on the field, and inflict 300 damage to your opponent for each destroyed Token.
et: Aktiveeri ainult siis, kui Token(id) kutsutakse eriliselt välja. Hävita kõik Tokenid väljakul ja tekita oma vastasele 300 kahju iga hävitatud Tokeni eest.

source: Spell-Stopping Statute
et: Loitsupeatuse Seadus

source: Activate only when your opponent activates a Continuous Spell Card. Negate the activation and the effect of the card and destroy it.
et: Aktiveeri ainult siis, kui sinu vastane aktiveerib pideva loitsukaardi. Tühista kaardi aktiveerimine ja efekt ning hävita see.

source: Royal Surrender
et: Kuninglik alistumine

source: Activate only when your opponent activates a Continuous Trap Card. Negate the activation and the effect of the card and destroy it.
et: Aktiveeri ainult siis, kui sinu vastane aktiveerib pideva lõksukaardi. Tühista kaardi aktiveerimine ja efekt ning hävita see.

source: Lone Wolf
et: Üksik Hunt

source: Activate only if the 1 and only monster on your side of the field is "Chu-Ske the Mouse Fighter", "Monk Fighter", or "Master Monk". That monster cannot be destroyed as a result of battle, and is unaffected by any of your opponent's monster effects.
et: Aktiveeri ainult siis, kui ainus koletis sinu väljaku poolel on "Chu-Ske the Mouse Fighter", "Monk Fighter" või "Master Monk". See koletis ei saa lahingu tulemusena hävitatud ning ei ole mõjutatud ühegi sinu vastase koletise efekti poolt.

source: Infernal Flame Emperor
et: Põrgulik Leegikeiser

source: This card cannot be Special Summoned. When this card is Tribute Summoned, you can remove from play up to 5 FIRE monsters in your Graveyard. Destroy a number of Spell/Trap Cards on the field equal to the number of monsters remove from play for this effect.
et: Seda kaarti ei saa eriliselt kutsuda. Kui see kaart on ohverdatud kutsumiseks, võid eemaldada mängust kuni 5 TULE monsterit oma kalmistul. Hävita väljakul olevate Loitsu/Lõksu kaartide arv, mis on võrdne selle efekti jaoks mängust eemaldatud monsterite arvuga.

source: Mutant Mindmaster
et: Mutantne Mõistusemeister

source: When this card declares an attack, you can take control of 1 face-up Attack Position monster your opponent controls, and attack with it instead of this monster. It cannot attack your opponent directly. Return it to your opponent at the end of the Battle Phase.
et: Kui see kaart kuulutab välja rünnaku, saad võtta kontrolli oma vastase ühe avatud rünnakupositsioonis oleva koletise üle ja rünnata sellega selle koletise asemel. See ei saa rünnata sinu vastast otse. Tagasta see oma vastasele lahingufaasi lõpus.

source: Divine Knight Ishzark
et: Jumalik rüütel Ishzark

source: Any monster this card destroys by battle is removed from play.
et: Mis tahes koletis, mille see kaart lahingus hävitab, eemaldatakse mängust.

source: Ocean Dragon Lord - Neo-Daedalus
et: Ookeani Draakoni Isand - Neo-Daedalus

source: This card cannot be Normal Summoned or Set. This card cannot be Special Summoned except by Tributing 1 "Levia-Dragon - Daedalus". You can send "<M4340>Umi<M>" you control to the Graveyard to send all cards in both players' hands and on the field to the Graveyard, except this card.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti ei saa eriliselt kutsuda, välja arvatud 1 "Levia-Dragon - Daedalus" ohverdamise teel. Sa võid saata oma kontrolli all oleva "<M4340>Umi<M>" kalmistule, et saata kõik kaardid mõlema mängija käest ja väljakult kalmistule, välja arvatud see kaart.

source: Green Baboon, Defender of the Forest
et: Rohelise Baboon, Metsa Kaitsja

source: When a Beast-Type monster you control is destroyed and sent to the Graveyard, you can pay 1000 Life Points to Special Summon this card from your hand or the Graveyard.
et: Kui sinu kontrolli all olev Beast-tüüpi koletis hävitatakse ja saadetakse Hauakambrisse, võid maksta 1000 Elupunkti, et Kutsuda see kaart eriliselt oma käest või Hauakambrist.

source: Cycroid
et: Tsükloid

source: The most lovable and friendly of all the Vehicroids. It can arm itself with training wheels!
et: Kõige armastusväärsem ja sõbralikum kõigist Vehicroididest. See võib end varustada abiratastega!

source: Once per turn, during your Main Phase, you can look at 1 face-down card your opponent controls, then return it to its original position.
et: Kord ühe korra oma peafaasis võid vaadata ühte vastase kontrollitavat allapoole kaarti, seejärel tagastada see algsesse asendisse.

source: Gyroid
et: Güroiid

source: Once per turn, if this card would be destroyed by battle, it is not destroyed. (Damage calculation is applied normally).
et: Korra ühe korra käigu jooksul, kui see kaart peaks lahingus hävima, siis seda ei hävitata. (Kahju arvutamine toimub tavapäraselt).

source: Steamroid
et: Aururobot

source: If this card attacks an opponent's monster, this card gains 500 ATK during the Damage Step only. If this card is attacked by an opponent's monster, this card loses 500 ATK during the Damage Step only.
et: Kui see kaart ründab vastase koletist, saab see kaart ainult Kahjuastme ajal 500 ATK juurde. Kui vastase koletis ründab seda kaarti, kaotab see kaart ainult Kahjuastme ajal 500 ATK.

source: Drillroid
et: Puurroid

source: If this card attacks a Defense Position monster, destroy the monster immediately with this card's effect without applying damage calculation.
et: Kui see kaart ründab kaitsepositsioonis olevat koletist, hävita koletis kohe selle kaardi efektiga ilma kahju arvutust rakendamata.

source: When this card is destroyed by battle and sent to the Graveyard, you can Special Summon 1 Machine-Type monster with 1500 or less ATK from your Deck in face-up Attack Position.
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse, saad Sa eriliselt kutsuda 1 Masinatüüpi koletise, millel on 1500 või vähem rünnakupunkti, oma pakist avatud rünnakupositsioonis.

source: At the time this card is selected as an attack target by an opponent's monster, you can activate Trap Card(s) from your hand.
et: Kui vastase koletis valib selle kaardi rünnaku sihtmärgiks, saad aktiveerida lõksukaardi(d) oma käest.

source: Cyber Dragon
et: Küberdraakon

source: If your opponent controls a monster and you control no monsters, you can Special Summon this card (from your hand).
et: Kui sinu vastasel on koletis ja sul ei ole ühtegi koletist, saad selle kaardi (oma käest) eriliselt kutsuda.

source: When this card is destroyed by battle and sent to the Graveyard: Target 1 "Elemental HERO" card and 1 "<M4837>Polymerization<M>" in your Graveyard; add both those targets to your hand.
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse: Sihtige 1 "Elemental HERO" kaarti ja 1 "<M4837>Polümerisatsioon<M>" oma Hauakambris; lisage mõlemad need sihtmärgid oma kätte.

source: Dark Catapulter
et: Tume Katapulteer

source: During your Standby Phase, if this card is in Defense Position, put 1 counter on this card. You can remove from play a number of card(s) in your Graveyard equal to the number of counters on this card to destroy that many Spell or Trap Card(s) on the field. Then remove all counter(s) from this card.
et: Oma Ootefaasia ajal, kui see kaart on kaitsepositsioonis, pane sellele kaardile 1 loendur. Sa võid eemaldada oma Hauakambrist mängust kaarte, mis on võrdne selle kaardi loendurite arvuga, et hävitada sama palju Väljal olevaid Loitsu- või Lõksukaarte. Seejärel eemalda kõik loendurid sellelt kaardilt.

source: Elemental HERO Bubbleman
et: Elementaalne KANGELANE Mullimees

source: If this is the only card in your hand, you can Special Summon it (from your hand). When this card is Summoned: You can draw 2 cards. You must control no other cards and have no cards in your hand to activate and to resolve this effect.
et: Kui see on ainus kaart sinu käes, saad selle eriliselt välja kutsuda (oma käest). Kui see kaart kutsutakse välja: Saad tõmmata 2 kaarti. Selle efekti aktiveerimiseks ja lahendamiseks ei tohi sul olla teisi kaarte kontrolli all ega kaarte käes.

source: Steam Gyroid
et: Aurugüroid

source: "<M6385>Gyroid<M>" + "<M6386>Steamroid<M>"
et: "<M6385>Gyroid<M>" + "<M6386>Aururobot<M>"

source: UFOroid Fighter
et: UFOroidi Võitleja

source: "<M6388>UFOroid<M>" + 1 Warrior-Type monster<BR>A Fusion Summon of this card can only be conducted with the above Fusion Material Monsters. The original ATK and DEF of this card become equal to the combined original ATK of the 2 Fusion Material Monsters you used for the Fusion Summon of this card.
et: "<M6388>UFOroid<M>" + 1 Sõdalase-tüüpi koletis<BR>Selle kaardi Fusion Summon'i saab läbi viia ainult ülaltoodud Fusion Material Monsters'itega. Selle kaardi algne ATK ja DEF muutuvad võrdseks nende kahe Fusion Material Monsters'i algse ATK summaga, mida kasutasite selle kaardi Fusion Summon'i jaoks.

source: Cyber Twin Dragon
et: Küberkaksikdraakon

source: "<M6390>Cyber Dragon<M>" + "<M6390>Cyber Dragon<M>"<BR>A Fusion Summon of this card can only be conducted with the above Fusion Material Monsters. This card can attack twice during each Battle Phase.
et: "<M6390>Küberdraakon<M>" + "<M6390>Küberdraakon<M>"<BR>Selle kaardi sulandumise kutse saab toimuda ainult ülaltoodud sulandumismaterjalide koletistega. See kaart võib rünnata kaks korda iga lahingufaasi jooksul.

source: Cyber End Dragon
et: Küberlõpu Draakon

source: "<M6390>Cyber Dragon<M>" + "<M6390>Cyber Dragon<M>" + "<M6390>Cyber Dragon<M>"<BR>A Fusion Summon of this card can only be conducted with the above Fusion Material Monsters. If this card attacks a Defense Position monster, inflict piercing Battle Damage to your opponent.
et: "<M6390>Küberdraakon<M>" + "<M6390>Küberdraakon<M>" + "<M6390>Küberdraakon<M>"<BR>Selle kaardi sulandumise kutse saab toimuda ainult ülaltoodud sulandumismaterjalide koletistega. Kui see kaart ründab kaitseasendis koletist, tekitab see vastasele läbistavat lahingukahju.

source: Power Bond
et: Võimuside

source: Send, from your hand or your side of the field to the Graveyard, Fusion Material Monsters that are listed on a Machine-Type Fusion Monster Card, then Special Summon that Fusion Monster from your Extra Deck, and it gains ATK equal to its original ATK. (This Special Summon is treated as a Fusion Summon.) During the End Phase of this turn, the player who activated this card takes damage equal to the original ATK of the monster (at the time it was Summoned).
et: Saada oma käest või oma väljaku poolelt Hauakambrisse Fusion Material Monsters, mis on loetletud Machine-Type Fusion Monster Card'il, seejärel Special Summon see Fusion Monster oma Extra Deck'ist ja see saab ATK, mis on võrdne selle algse ATK-ga. (See Special Summon käsitletakse kui Fusion Summon.) Selle käigu lõppfaasis saab mängija, kes aktiveeris selle kaardi, kahju, mis on võrdne koletise algse ATK-ga (ajal, mil see kutsuti).

source: Skyscraper
et: Pilvelõhkuja

source: When an1 "Elemental HERO" monster attacks, if its ATK is lower than the ATK of the attack target, the attacking monster gains 1000 ATK during damage calculation only.
et: Kui mõni "Elemental HERO" koletis ründab ja selle ATK on madalam kui rünnatava sihtmärgi ATK, saab ründav koletis ainult kahjuarvutuse ajal 1000 ATK juurde.

source: Summoner Monk
et: Kutsuja Munk

source: This card cannot be Tributed. When this card is Normal or Flip Summoned, it is changed to Defense Position. Once per turn, you can discard 1 Spell Card to Special Summon 1 Level 4 monster from your Deck. It cannot attack this turn.
et: Seda kaarti ei saa ohverdada. Kui see kaart on normaal- või pöördkutsutud, muudetakse see kaitsepositsiooni. Kord käigu jooksul võid sa ühe loitsukaardi ära visata, et eriliselt kutsuda üks 4. taseme koletis oma pakist. See ei saa sel käigul rünnata.

source: The Wicked Dreadroot
et: Kuri Dreadroot

source: This card cannot be Special Summoned. This card cannot be Normal Summoned or Set except by Tributing 3 monsters. Halve the ATK and DEF of all monsters on the field, except this card.
et: Seda kaarti ei saa eriliselt kutsuda. Seda kaarti ei saa normaalselt kutsuda ega asetada, välja arvatud 3 koletise ohverdamise teel. Kõigi väljal olevate koletiste ATK ja DEF vähendatakse poole võrra, välja arvatud selle kaardi oma.

source: Winged Kuriboh LV10
et: Tiivuline Kuriboh LV10
