Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: Spirit of the Six Samurai
et: Kuue Samuraivaim

source: Once per turn, you can equip this card to a face-up "Six Samurai" monster you control, OR unequip it and Special Summon it in face-up Attack Position. When equipped to a monster by this card's effect, that equipped monster gains 500 ATK and DEF. When the equipped monster destroys an opponent's monster by battle, draw 1 card. (A monster can only be equipped with 11 Union Monster at a time. If the equipped monster would be destroyed, destroy this card instead.)
et: Korra ühe korra käigu jooksul saad selle kaardi kinnitada oma kontrollitava avatud "Kuue Samuraid" koletise külge VÕI eemaldada selle ja Kutsuda see Eriliselt avatud Rünnakupositsioonis. Kui see kaart on kinnitatud koletise külge selle kaardi efekti abil, saab see kinnitatud koletis 500 ATK ja DEF juurde. Kui kinnitatud koletis hävitab lahingus vastase koletise, tõmba 1 kaart. (Koletis saab korraga olla kinnitatud ainult 1 Liidu Koletisega. Kui kinnitatud koletis hävitatakse, hävita selle asemel see kaart.)

source: Alien Telepath
et: Välismaalane Telepaat

source: Once per turn, you can remove 1 A-Counter from a monster your opponent controls, and destroy 1 Spell or Trap Card. (If a monster with an A-Counter battles an "Alien" monster, it loses 300 ATK and DEF for each A-Counter during damage calculation only.)
et: Korra ühe korra käigu jooksul saad eemaldada 1 A-loenduri vastase kontrollitavalt koletiselt ja hävitada 1 Loitsu või Lõksukaardi. (Kui koletis, millel on A-loendur, võitleb "Tulnuka" koletisega, kaotab see iga A-loenduri kohta 300 ATK ja DEF ainult kahju arvutamise ajal.)

source: Alien Hypno
et: Tulnukas Hüpnos

source: This card is treated as a Normal Monster while face-up on the field or in the Graveyard. While this card is face-up on the field, you can Normal Summon it to have it be treated as an Effect Monster with this effect:<BR>● During your Main Phase, you can select 1 monster your opponent controls with an A-Counter(s), and take control of it while this card is on the field. During each of your End Phases, remove 1 A-Counter from each controlled monster. If all A-Counters are removed from one of these monsters, destroy it.
et: See kaart loetakse tavaliseks koletiseks, kui see on näoga ülespoole väljakul või hauas. Kui see kaart on näoga ülespoole väljakul, võid selle normaalselt kutsuda, et seda käsitletaks efektikoletisena järgmise efektiga:<BR>● Oma peafaasis võid valida 1 koletise, mida su vastane kontrollib ja millel on A-loendur(id), ning võtta selle üle, kuni see kaart on väljakul. Iga oma lõppfaasi ajal eemalda 1 A-loendur igalt kontrollitud koletiselt. Kui kõik A-loendurid on ühelt neist koletistest eemaldatud, hävita see.

source: Superalloy Beast Raptinus
et: Superlegeeriumi Koletis Raptinus

source: 2 Gemini Monsters<BR>All face-up Gemini Monsters on the field are treated as Effect Monsters, and gain their effects.
et: 2 Kaksikmonsterit<BR>Kõiki lahinguväljal olevaid avatud Kaksikmonstereid käsitletakse Efektimonsteritena ja nad saavad oma efektid.

source: Gladiator Beast Gaiodiaz
et: Gladiaatoribeast Gaiodiaz

source: "<M7283>Gladiator Beast Spartacus<M>" + 1 "Gladiator Beast" monster<BR>This card can only be Special Summoned from the Extra Deck by returning the above Fusion Material Monsters from the field to the Deck. (You do not use "<M4837>Polymerization<M>".) When this card destroys a monster by battle and sends it to the Graveyard, inflict damage to your opponent equal to the DEF of the destroyed monster. At the end of the Battle Phase, if this card attacked or was attacked, you can return it to the Extra Deck to Special Summon 2 "Gladiator Beast" monsters from your Deck, except1 "<M7283>Gladiator Beast Spartacus<M>".
et: "<M7283>Gladiaatoribeast Spartacus<M>" + 1 "Gladiaatoribeast" koletis<BR>Seda kaarti saab erikutsuda lisapakist ainult siis, kui tagastad ülaltoodud sulandumismaterjalide koletised väljakult pakki. (Sa ei kasuta "<M4837>Polümerisatsioon<M>".) Kui see kaart hävitab lahingus koletise ja saadab selle hauakambrisse, põhjusta oma vastasele kahju, mis on võrdne hävitatud koletise DEF-iga. Lahingufaasi lõpus, kui see kaart ründas või seda rünnati, saad selle tagastada lisapakki, et erikutsuda oma pakist 2 "Gladiaatoribeast" koletist, välja arvatud "<M7283>Gladiaatoribeast Spartacus<M>".

source: Gladiator Beast Heraklinos
et: Gladiaatorikutsar Heraklinos

source: "<M7286>Gladiator Beast Laquari<M>" + 2 "Gladiator Beast" monsters<BR>This card can only be Special Summoned from your Extra Deck, by returning the above cards you control to the Deck. (You do not use "<M4837>Polymerization<M>".) You can discard 1 card from your hand to negate the activation of a Spell or Trap Card and destroy it. You can use this effect during either player's turn.
et: "<M7286>Gladiaatoribeast Laquari<M>" + 2 "Gladiaatoribeast" koletist<BR>Seda kaarti saab eriliselt välja kutsuda ainult oma Lisapakist, tagastades ülaltoodud kaardid, mida sa kontrollid, pakki. (Sa ei kasuta "<M4837>Polümerisatsioon<M>".) Sa võid oma käest ühe kaardi ära visata, et tühistada Loitsu või Lõksukaardi aktiveerimine ja see hävitada. Sa võid seda efekti kasutada mõlema mängija käigu ajal.

source: Fog Control
et: Udu Kontroll

source: Tribute 1 face-up "Cloudian" monster you control. Place 3 Fog Counters on 1 face-up monster.
et: Ohverda 1 avatud "Cloudian" koletis, mida sa kontrollid. Aseta 3 Udu Loendurit ühele avatud koletisele.

source: Cloudian Squall
et: Pilveolendite Torm

source: During each of your Standby Phases, place 1 Fog Counter on every face-up monster.
et: Iga oma ootejärgu ajal aseta 1 udu loendur igale avatud koletisele.

source: Super Double Summon
et: Super Kahekordne Kutsumine

source: Select 1 Gemini monster you control and Normal Summon it. During the End Phase of this turn, return it to your hand.
et: Vali 1 Gemini koletis, mida sa kontrollid, ja kutsu see normaalselt välja. Selle käigu lõppfaasis tagasta see oma kätte.

source: Colosseum - Cage of the Gladiator Beasts
et: Kolossium - Gladiaalide metsaliste puur

source: Place 1 Counter on this card each time a monster is Special Summoned from either player's Deck. All "Gladiator Beast" monsters gain 100 ATK and DEF for each of these counters on this card. If this card would be destroyed by a card effect, you can discard 1 "Colosseum - Cage of the Gladiator Beasts" to prevent this card from being destroyed.
et: Aseta sellele kaardile 1 loendur iga kord, kui mõni koletis kutsutakse eriliselt välja kas mängija pakist. Kõik "Gladiaatoribeast" koletised saavad 100 ATK ja DEF iga sellel kaardil oleva loenduri kohta. Kui see kaart hävitatakse kaardi efekti tõttu, võid selle kaardi hävitamise vältimiseks ära visata 1 "Colosseum - Gladiaatoribeastide puur".

source: Gladiator Beast's Battle Halberd
et: Gladiaalvõitleja lahinghalberd

source: Equip only to a "Gladiator Beast" monster. When it attacks, destroy 1 Spell or Trap Card at the end of the Damage Step. When the equipped monster is returned from your side of the field to the Deck and this card is sent to the Graveyard, return this card to your hand.
et: Varusta ainult "Gladiator Beast" koletisega. Kui see ründab, hävita 1 Võlu- või Lõksukaart Kahjustusetapi lõpus. Kui varustatud koletis naaseb sinu väljaku poolelt tagasi pakki ja see kaart saadetakse Hauakambrisse, tagasta see kaart oma kätte.

source: Gladiator Beast's Battle Gladius
et: Gladiaatoribeasti Lahingu Gladius

source: Equip only to a "Gladiator Beast" monster. It gains 300 ATK. When the equipped monster is returned from your side of the field to the Deck and this card is sent to the Graveyard, return this card to your hand.
et: Varusta ainult "Gladiator Beast" koletisega. See saab 300 ATK juurde. Kui varustatud koletis tagastatakse sinu väljalt pakki ja see kaart saadetakse hauakambrisse, tagasta see kaart oma kätte.

source: Gladiator Beast's Battle Manica
et: Gladiaatoribeasti Lahingmanika

source: Equip only to a "Gladiator Beast" monster. It cannot be destroyed by battle (Damage calculation is applied normally). When the equipped monster is returned from your side of the field to the Deck and this card is sent to the Graveyard, return this card to your hand.
et: Varusta ainult "Gladiator Beast" koletisega. Seda ei saa lahingus hävitada (kahju arvutamine toimub tavapäraselt). Kui varustatud koletis naaseb sinu väljalt pakki ja see kaart saadetakse hauakambrisse, tagasta see kaart oma kätte.

source: Gladiator Beast's Respite
et: Gladiaalvõitleja Puhkus

source: Shuffle 2 "Gladiator Beast" cards from your hand into the Deck, then draw 3 cards.
et: Sega 2 "Gladiator Beast" kaarti oma käest tagasi pakki, seejärel tõmba 3 kaarti.

source: Gladiator's Return
et: Gladiaatori tagasitulek

source: Target 3 "Gladiator Beast" cards in your Graveyard; shuffle all 3 targets into the Deck, then draw 1 card.
et: Vali 3 "Gladiator Beast" kaarti oma hauakambris; sega kõik 3 sihtmärki tagasi pakki, seejärel tõmba 1 kaart.

source: Soul Devouring Bamboo Sword
et: Hingeõgade neelav bambusmõõk

source: Select 1 monster equipped with a "Bamboo Sword" Equip Spell Card. If it inflicts Battle Damage to your opponent while equipped with a "Bamboo Sword" card, they skip their next Draw Phase. Destroy this card during your second Standby Phase after activation.
et: Vali 1 koletis, millele on varustatud "Bamboo Sword" Varustus Maagia Kaart. Kui see tekitab lahingukahju sinu vastasele, olles varustatud "Bamboo Sword" kaardiga, jätab vastane oma järgmise Tõmbamisfaasi vahele. Hävita see kaart oma teise Ootefaasil pärast aktiveerimist.

source: Cunning of the Six Samurai
et: Kuue samurai kavalus

source: Send 1 face-up "Six Samurai" monster you control to the Graveyard, then target 1 "Six Samurai" monster in either player's Graveyard; Special Summon that target.
et: Saada 1 avatud "Kuus Samuraid" koletis, mida sa kontrollid, Hauakambrisse, seejärel sihi 1 "Kuus Samuraid" koletis kas mängija Hauakambris; Kutsu see sihtmärk eriliselt välja.

source: A Cell Incubator
et: Raku inkubaator

source: Each time an A-Counter(s) is removed from play by a card effect, place 1 A-Counter on this card. When this card is destroyed, distribute the A-Counters on this card among face-up monsters.
et: Iga kord, kui A-loendur(id) eemaldatakse mängust kaardi efekti tõttu, aseta sellele kaardile 1 A-loendur. Kui see kaart hävitatakse, jaota sellel kaardil olevad A-loendurid lahtistele koletistele.

source: Updraft
et: Õhuvool

source: Remove all Fog Counters from the field. Inflict 300 damage to your opponent for each Fog Counter you removed.
et: Eemalda kõik Udu loendurid väljakult. Põhjusta oma vastasele 300 kahju iga eemaldatud Udu loenduri eest.

source: Release from Stone
et: Vabanemine kivist

source: Select 1 of your removed from play Rock-Type monsters and Special Summon it. When this card is removed from the field, destroy that monster. When that monster is destroyed, destroy this card.
et: Vali 1 oma mängust eemaldatud Kiviliigi koletis ja Kutsu see eriliselt välja. Kui see kaart eemaldatakse väljakult, hävita see koletis. Kui see koletis hävitatakse, hävita see kaart.

source: Light-Imprisoning Mirror
et: Valguse-vangistuse Peegel

source: When the effect of a LIGHT monster activates on the field or in the Graveyard, negate it.
et: Kui VÄRKI koletise efekt aktiveerub väljakul või Hauakambris, tühista see.

source: Shadow-Imprisoning Mirror
et: Varjuvangistuse Peegel

source: When the effect of a DARK monster activates on the field or in the Graveyard, negate it.
et: Kui PIMEDA koletise efekt aktiveerub väljakul või Hauakambris, tühista see.

source: Disarm
et: Desarmeeri

source: Return 1 "Gladiator Beast" monster from your hand to the Deck and negate the activation and effect of a Spell Card and destroy it.
et: Tagasta 1 "Gladiaatoribeast" koletis oma käest tagasi pakki, tühista Võlusõnakaardi aktiveerimine ja efekt ning hävita see.

source: Parry
et: Parreerimine

source: Return 1 "Gladiator Beast" monster from your hand to the Deck and negate the activation and effect of a Trap Card and destroy it.
et: Tagasta 1 "Gladiator Beast" koletis oma käest tagasi pakki, tühista lõksukaardi aktiveerimine ja efekt ning hävita see.

source: Swiftstrike Armor
et: Kiirelöögirüü

source: During your Draw Phase, each time you draw a "Six Samurai" Monster Card(s): You can reveal it; Special Summon it.
et: Oma Tõmbamisfaasis, iga kord, kui tõmbad "Kuue Samuraid" Koletiskaardi(d): Sa võid selle paljastada; Kutsu see Eriliselt välja.

source: Double-Edged Sword Technique
et: Kahe teraga mõõga tehnika

source: Target 2 "Six Samurai" monsters in your Graveyard; Special Summon those targets in face-up Attack Position, then destroy them during the End Phase and take damage equal to monster's ATK.
et: Vali 2 "Kuue Samuraid" koletist oma Hauakambris; Kutsu need sihtmärgid eriliselt välja rünnakupositsioonis, seejärel hävita need lõppfaasis ja saa kahju, mis võrdub koletise rünnakuga.

source: Energy-Absorbing Monolith
et: Energiat neelav monoliit

source: Chain this card to an opponent's card effect that would inflict damage to you. That damage is negated and you gain Life Points equal to the amount you would have taken.
et: Ahelge see kaart vastase kaardi efektile, mis tekitaks sulle kahju. See kahju tühistatakse ja sa saad Elupunkte juurde võrdse koguse võrra, mida oleksid saanud.

source: Cell Explosion Virus
et: Rakuplahvatuse viirus

source: Activate only when an opponent's monster with an A-Counter(s) declares an attack. Destroy all Attack Position monsters your opponent controls.
et: Aktiveeri ainult siis, kui vastase koletis, millel on A-loendur(id), kuulutab välja rünnaku. Hävita kõik rünnakupositsioonis olevad koletised, mida sinu vastane kontrollib.

source: Detonator Circle "A"
et: Detonaatoriring "A"

source: Destroy 1 face-up monster with an A-Counter(s), and then inflict 1000 damage to each player.
et: Hävita 1 avatud koletis, millel on A-loendur(id), ja seejärel tekita igale mängijale 1000 kahju.

source: Interdimensional Warp
et: Interdimensionaalne Warp

source: Select a monster you control and a monster with an A-Counter(s) your opponent controls. Switch control of those monsters.
et: Vali välja koletis, mida sa kontrollid, ja koletis, millel on A-loendur(id) ja mida sinu vastane kontrollib. Vaheta nende koletiste kontrolli.

source: Foolish Revival
et: Rumal taassünd

source: Select 1 monster from your opponent's Graveyard, and Special Summon it in face-up Defense Position on your opponent's side of the field.
et: Vali oma vastase kalmistult 1 koletis ja kutsu see eriliselt esile vastase väljaku poolele avatud kaitseasendis.

source: An Unfortunate Report
et: <translatedÕnnetu Teade

source: Your opponent conducts their next Battle Phase twice.
et: Sinu vastane viib oma järgmise lahingufaasi läbi kaks korda.

source: Fiendish Engine Ω
et: Deemonlik masin Ω

source: During your End Phase, Special Summon 1 "<M3934>Engine Token<M>" (Machine-Type/EARTH/Level 1/ATK 200/DEF 200) in Attack Position. Once per turn, you can have this card gain 1000 ATK. If you do, it is destroyed during the End Phase.
et: End Phase'i ajal kutsu eriliselt välja 1 "<M3934>Engine Token<M>" (Masina tüüp/MAA/Tase 1/ATK 200/DEF 200) rünnakupositsioonis. Kord ühe käigu jooksul saad sellele kaardile lisada 1000 ATK. Kui teed seda, hävitatakse see End Phase'i ajal.

source: Gemini Summoner
et: Kaksikute Kutsuja

source: Once per turn, during your opponent's End Phase, you can pay 500 Life Points to Normal Summon or Set 1 Gemini monster from your hand, or Normal Summon 1 face-up Gemini monster you control. Once per turn, if this card would be destroyed by battle, it is not destroyed.
et: Korra ühe korra oma vastase lõppfaasis, võid maksta 500 Elupunkti, et Normaal-Kutsuda või Asetada 1 Gemini koletis oma käest, või Normaal-Kutsuda 1 ülespööratud Gemini koletis, mida sa kontrollid. Korra ühe korra, kui see kaart peaks lahingus hävima, siis seda ei hävitata.

source: Ocean's Keeper
et: Ookeani Hoidja

source: During battle between this attacking card and a Defense Position monster whose DEF is lower than the ATK of this card, inflict the difference as Battle Damage to your opponent. When this card is destroyed by battle, add 1 "<M7334>Thousand-Eyes Jellyfish<M>" or 1 "<M7335>Cranium Fish<M>" from your Deck to your hand.
et: Kui selle ründava kaardi ja kaitsepositsioonis oleva koletise, mille DEF on madalam kui selle kaardi ATK, vahel toimub lahing, põhjusta vahe Battle Damage'ina oma vastasele. Kui see kaart hävitatakse lahingus, lisa 1 "<M7334>Thousand-Eyes Jellyfish<M>" või 1 "<M7335>Cranium Fish<M>" oma pakist oma kätte.

source: Thousand-Eyes Jellyfish
et: Tuhande Silmaga Meduus

source: This card cannot be Normal Summoned or Set. This card cannot be Special Summoned except by Tributing 1 "<M7333>Ocean's Keeper<M>". Your opponent must play with their hand revealed.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti ei saa eriliselt kutsuda, välja arvatud, kui ohverdate 1 "<M7333>Ookeani Hoidja<M>". Teie vastane peab mängima oma käega avatud.

source: Cranium Fish
et: Kraniumkala

source: You can Special Summon this card by Tributing 1 "<M7333>Ocean's Keeper<M>". You can discard 1 WATER monster to the Graveyard to destroy 1 face-down card.
et: Saad selle kaardi eriliselt välja kutsuda, ohverdades 1 "<M7333>Ookeani Hoidja<M>". Saad saata 1 VEE koletise Hauakambrisse, et hävitada 1 allapoole pööratud kaardi.

source: Abyssal Kingshark
et: Kuristikuningashai

source: Once per turn, if this card would be destroyed by an effect that does not target it, it is not destroyed.
et: Korra ühe käigu jooksul, kui see kaart hävitatakse efekti tõttu, mis ei sihi seda, siis seda ei hävitata.

source: Mormolith
et: Mormoliit

source: You can Tribute 1 face-up EARTH monster to destroy all face-up monsters with DEF equal to or less than the ATK of the Tributed monster.
et: Saad ohverdada 1 avatud EARTH koletise, et hävitada kõik avatud koletised, kelle DEF on võrdne või väiksem ohverdatud koletise ATK-st.

source: Fossil Tusker
et: Fossiilne Mürsk

source: When this card destroys an opponent's monster by battle and sends it to the Graveyard, inflict 400 damage to your opponent.
et: Kui see kaart hävitab lahingus vastase koletise ja saadab selle Hauakambrisse, tekitab vastasele 400 kahju.

source: Phantom Dragonray Bronto
et: Fantoomdraakon Bronto

source: This card is treated as a Normal Monster while face-up on the field or in the Graveyard. While this card is face-up on the field, you can Normal Summon it to have it be treated as an Effect Monster with this effect:<BR>● The original ATK of this card becomes 2300. If this card attacks, it is changed to Defense Position at the end of the Battle Phase. This card's battle position cannot be changed until the end of your next turn, except with a card effect.
et: See kaart loetakse tavaliseks koletiseks, kui see on lahinguväljal või hauas. Kui see kaart on lahinguväljal, võid selle normaalselt kutsuda, et seda käsitletaks efektikoletisena järgmise efektiga:<BR>● Selle kaardi algne rünnakujõud (ATK) muutub 2300-ks. Kui see kaart ründab, muutub see lahingufaasi lõpus kaitsepositsiooniks. Selle kaardi lahingupositsiooni ei saa muuta enne sinu järgmise käigu lõppu, välja arvatud kaardi efekti abil.

source: This card is treated as a Normal Monster while face-up on the field or in the Graveyard. While this card is face-up on the field, you can Normal Summon it to have it be treated as an Effect Monster with this effect:<BR>● Once per turn, you can Special Summon 1 Zombie-Type monster from your hand or from either player's Graveyard. When this card is removed from the field, destroy all Zombie-Type monsters Special Summoned by this effect.
et: See kaart loetakse tavaliseks koletiseks, kui see on väljaku peal või hauas. Kui see kaart on väljaku peal, võid selle tavaliselt kutsuda, et seda käsitletaks efektkoletisena järgmise efektiga:<BR>● Kord kord käigu jooksul võid eriliselt kutsuda ühe zombitüüpi koletise oma käest või mõlema mängija hauast. Kui see kaart eemaldatakse väljaku pealt, hävita kõik selle efektiga eriliselt kutsutud zombitüüpi koletised.

source: Blazewing Butterfly
et: Leegitiib Liblikas

source: This card is treated as a Normal Monster while face-up on the field or in the Graveyard. While this card is face-up on the field, you can Normal Summon it to have it be treated as an Effect Monster with this effect:<BR>● You can Tribute this card to Special Summon 1 Gemini monster from your Graveyard, except1 "<M7341>Blazewing Butterfly<M>". A Gemini monster Special Summoned by this effect is treated as an Effect Monster, and gains its effect.
et: See kaart loetakse tavaliseks koletiseks, kui see on lahinguväljal või hauas ülespoole suunatud. Kui see kaart on lahinguväljal ülespoole suunatud, võid selle tavaliselt kutsuda, et seda käsitletaks efektikoletisena järgmise efektiga:<BR>● Sa võid selle kaardi ohverdada, et eriliselt kutsuda 1 Gemini koletis oma hauast, välja arvatud "<M7341>Blazewing Butterfly<M>". Selle efektiga eriliselt kutsutud Gemini koletist käsitletakse efektikoletisena ja see saab oma efekti.

source: Armityle the Chaos Phantom
et: Kaose Fantoom Armityle

source: "<M6563>Uria, Lord of Searing Flames<M>" + "<M6564>Hamon, Lord of Striking Thunder<M>" + "<M6565>Raviel, Lord of Phantasms<M>"<BR>Must first be Special Summoned (from your Extra Deck) by banishing the above cards you control. (You do not use "<M4837>Polymerization<M>"). This card cannot be destroyed by battle. This card gains 10,000 ATK during your turn only.
et: "<M6563>Uria, Põletavate Leekide Isand<M>" + "<M6564>Hamon, Lööva Äikese Isand<M>" + "<M6565>Raviel, Fantasmide Isand<M>"<BR>Peab esmalt olema erikutsutud (sinu lisapakist), eemaldades mängust ülaltoodud kaardid, mida sa kontrollid. (Sa ei kasuta "<M4837>Polümerisatsioon<M>"). Seda kaarti ei saa lahingus hävitada. Sellel kaardil on sinu käigu ajal ainult 10 000 ATK.

source: White Night Dragon
et: Valge Öö Draakon

source: During either player's turn, when a Spell/Trap Card that targets this card is activated: Negate the activation and destroy it. When a face-up monster you control is targeted for an attack: You can send 1 Spell/Trap card you control to the Graveyard; change the target to this card.
et: Kui mõlemal mängijal on käik ja aktiveeritakse Võlu-/Lõksukaart, mis sihib seda kaarti: Tühista aktiveerimine ja hävita see. Kui sinu kontrolli all olevat avatud koletist sihitakse rünnakuks: Sa võid saata ühe oma kontrolli all oleva Võlu-/Lõksukaardi Hauakambrisse; muuda sihtmärgiks see kaart.

source: Arcana Force Ex - the Light Ruler
et: Arcana Force Ex - Valguse Valitseja

source: This card cannot be Normal Summoned or Set. This card cannot be Special Summoned except by sending 3 monsters you control to the Graveyard. When this card is Special Summoned, toss a coin:<BR>● Heads: When this card destroys an opponent's monster by battle and sends it to the Graveyard, you can add 1 card from your Graveyard to your hand.<BR>● Tails: When an effect of a Spell, Trap or Effect Monster's effect that targets this card is activated, negate its activation and destroy it, and this card loses 1000 ATK.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti ei saa eriliselt kutsuda, välja arvatud juhul, kui saadad 3 oma kontrolli all olevat koletist hauakambrisse. Kui see kaart kutsutakse eriliselt, viska münti:<BR>● Kull: Kui see kaart hävitab lahingus vastase koletise ja saadab selle hauakambrisse, võid lisada ühe kaardi oma hauakambrist oma kätte.<BR>● Kiri: Kui aktiveeritakse selle kaardi sihtiva loitsu, lõksu või efektkoletise efekti mõju, tühista selle aktiveerimine ja hävita see, ning see kaart kaotab 1000 ATK.

source: Card Blocker
et: Kaardiblokeerija
