Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: When your opponent's monster declares a direct attack, you can discard this card to negate that attack and end the Battle Phase.
et: Kui sinu vastase koletis kuulutab välja otsese rünnaku, saad selle kaardi ära visata, et see rünnak tühistada ja lahingufaasi lõpetada.

source: Mirror Ladybug
et: Peegel Leedukas

source: If you control at least 1 face-up monster and have no monsters in your Graveyard, you can Special Summon this card from your hand. When this card is Special Summoned this way, this card's Level becomes equal to the total Levels of all other monsters you control. If the Level of this card is higher than 12, destroy this card.
et: Kui sa kontrollid vähemalt 1 avatud koletist ja sul pole koletisi oma Hauas, saad selle kaardi oma käest eriliselt kutsuda. Kui see kaart kutsutakse sel viisil eriliselt, muutub selle kaardi tase võrdseks kõigi teiste sinu kontrollitavate koletiste tasemete summaga. Kui selle kaardi tase on kõrgem kui 12, hävita see kaart.

source: Reed Butterfly
et: Reed Liblikas

source: If your opponent controls a face-up Synchro Monster(s) and you control no face-up Synchro Monsters, you can Special Summon this card from your hand.
et: Kui sinu vastasel on lahinguväljal avatud Sünkroonkoletis(ed) ja sul ei ole avatud Sünkroonkoletisi, saad selle kaardi oma käest eriliselt kutsuda.

source: Needle Soldier
et: Nõelasõdur

source: If this card is used as a Synchro Material Monster for a Synchro Monster, during battle between that Synchro Monster and a Defense Position monster whose DEF is lower than the ATK of that Synchro Monster, inflict the difference as Battle Damage to your opponent.
et: Kui seda kaarti kasutatakse Sünkroonkoletise Sünkroonmaterjalina, siis lahingus selle Sünkroonkoletise ja Kaitseasendis koletise vahel, mille DEF on madalam kui selle Sünkroonkoletise ATK, põhjusta vahe oma vastasele Lahingukahjuna.

source: You can Tribute this card to select 1 "Synchron" Tuner monster in your Graveyard. Special Summon that monster. It cannot be used as a Synchro Material Monster during the turn it is Special Summoned by this effect.
et: Saad selle kaardi ohverdada, et valida 1 "Synchron" Tuner koletis oma kalmistul. Kutsu see koletis eriliselt välja. Seda ei saa kasutada Sünkro Materjal Koletisena sellel käigul, mil see on selle efekti abil eriliselt välja kutsutud.

source: Rescue Warrior
et: Päästmissõdalane

source: You take no Battle Damage from battles involving this card. If this card is destroyed by battle, select 1 face-up monster your opponent controls that you own, and take control of it.
et: Sa ei saa lahingukahju lahingutest, milles see kaart osaleb. Kui see kaart hävitatakse lahingus, vali 1 avatud koletis, mida sinu vastane kontrollib ja mis kuulub sulle, ning võta selle üle kontroll.

source: Power Giant
et: Võimahiiglane

source: You can send 1 Level 4 or lower monster from your hand to the Graveyard to Special Summon this card from your hand, and decrease this card's Level by the Level of that monster. If this card attacks or is attacked, until the end of the Damage Step any effect damage you take becomes 0.
et: Saadad 1. taseme 4 või madalama koletise oma käest Hauakambrisse, et kutsuda see kaart oma käest eriliselt välja ja vähendada selle kaardi taset selle koletise taseme võrra. Kui see kaart ründab või teda rünnatakse, muutub kuni Kahjustuse Sammuni lõpuni kogu efektikahju, mida sa saad, nulliks.

source: Vice Berserker
et: Pahe Berserker

source: If this card is sent to the Graveyard as a Synchro Material Monster, inflict 2000 damage to the player that Synchro Summoned, and the Synchro Monster that used this card as a Synchro Material Monster gains 2000 ATK until the End Phase.
et: Kui see kaart saadetakse Hauakambrisse Sünkromaterjalina, tekitab see 2000 kahju mängijale, kes Sünkrosummoneeris, ja Sünkromonster, kes kasutas seda kaarti Sünkromaterjalina, saab 2000 ATK juurde kuni Lõppfaasini.

source: Lancer Archfiend
et: Lanssõdalane Deemon

source: Once per turn, when a monster you control declares an attack targeting a Defense Position monster your opponent controls, you can activate this effect. If you do, during this battle, if the ATK of the attacking monster is greater than the DEF of the Defense Position monster it battles, inflict the difference as Battle Damage to your opponent.
et: Kord korra käigu jooksul, kui sinu kontrollitav koletis kuulutab välja rünnaku, mis sihib sinu vastase kontrollitavat kaitseasendis koletist, saad aktiveerida selle efekti. Kui sa seda teed, siis selle lahingu ajal, kui ründava koletise ATK on suurem kui kaitseasendis koletise DEF, kellega ta võitleb, põhjusta vahe oma vastasele lahingukahjuna.

source: Power Breaker
et: Võimupurustaja

source: When this card is destroyed by your opponent's attack or card effect and sent to the Graveyard, select 1 face-up Spell/Trap Card your opponent controls, and destroy it. If this card attacks, it is changed to Defense Position at the end of the Damage Step.
et: Kui see kaart hävitatakse sinu vastase rünnaku või kaardi efekti tõttu ja saadetakse Hauakambrisse, vali 1 avatud Võlu-/Lõksukaart, mida sinu vastane kontrollib, ja hävita see. Kui see kaart ründab, muudetakse see Kahjustuse Etapi lõpus Kaitsepositsiooniks.

source: Extra Veiler
et: Ekstra Veiler

source: When your opponent Special Summons a monster(s), you can Special Summon this card from your hand. During the turn this card is Special Summoned by this effect, your opponent takes any effect damage you would have taken from their card effects, instead.
et: Kui sinu vastane kutsub eriliselt välja koletise(d), saad selle kaardi oma käest eriliselt välja kutsuda. Sellel käigul, kui see kaart on selle efekti abil eriliselt välja kutsutud, saab sinu vastane kõik efektikahjud, mida sa oleksid saanud nende kaardieffektidest.

source: Synchro Soldier
et: Sünkrosõdur

source: Once per turn, during your Main Phase 1, you can select 1 face-up Synchro Monster you control. Remove that face-up Synchro Monster you control from play and inflict 600 damage to your opponent. If you use this effect, during your next Standby Phase the removed from play monster returns to the field.
et: Kord ühe korra oma peafaas 1 jooksul saad valida ühe avatud Sünkro Koletise, mida sa kontrollid. Eemalda see avatud Sünkro Koletis, mida sa kontrollid, mängust ja tekita oma vastasele 600 kahju. Kui kasutad seda efekti, naaseb mängust eemaldatud koletis sinu järgmise ooteetapi ajal väljakule.

source: Creation Resonator
et: Loomise Resonator

source: If you control a face-up Level 8 or higher Synchro Monster, you can Special Summon this card from your hand.
et: Kui sa kontrollid avatud 8. või kõrgema taseme Sünkrokoletist, saad selle kaardi oma käest eriliselt kutsuda.

source: Attack Gainer
et: Rünnaku Saaja

source: If this card is sent to the Graveyard as a Synchro Material Monster, select 1 face-up monster your opponent controls. The selected opponent's monster loses 1000 ATK until the End Phase.
et: Kui see kaart saadetakse Sünkromaterjalina Hauakambrisse, vali 1 vastase kontrollitav avatud koletis. Valitud vastase koletis kaotab 1000 ATK kuni Lõppfaasini.

source: Blackwing - Etesian of Two Swords
et: Mustatiib - Kaksikute Mõõkade Etesian

source: If a "Blackwing" monster you control battles an opponent's monster, and that opponent's monster is still on the field at the end of the Damage Step, you can send this card from your hand to the Graveyard to inflict 1000 damage to your opponent.
et: Kui sinu kontrollitav "Blackwing" koletis võitleb vastase koletisega ja see vastase koletis on endiselt väljakul Kahjustuse Etapi lõpus, saad sa saata selle kaardi oma käest Hauakambrisse, et tekitada vastasele 1000 kahju.

source: Blackwing - Aurora the Northern Lights
et: Musta Tiib - Aurora Põhjatuled

source: This card cannot be Normal Summoned or Set. This card cannot be Special Summoned except by removing from play 2 face-up monsters you control (1 "Blackwing" Tuner and 1 non-Tuner). Once per turn, you can remove from play 1 "Blackwing" Synchro Monster from your Extra Deck. This card's name, ATK, and effects become the same as that monster's, until the End Phase.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti ei saa eriliselt kutsuda, välja arvatud juhul, kui eemaldate mängust 2 avatud koletist, mida te kontrollite (1 "Blackwing" Tuner ja 1 mitte-Tuner). Kord ühe käigu jooksul võite eemaldada mängust 1 "Blackwing" Sünkrooni koletise oma lisapakist. Selle kaardi nimi, ATK ja efektid muutuvad samaks kui sellel koletisel kuni lõppfaasini.

source: Blackwing - Abrolhos the Megaquake
et: Musttiib - Abrolhos Megavärin

source: This card cannot be Special Summoned. Any monsters that battles with this card is not destroyed by that battle, and returns to the hand after damage calculation. Once per turn, during your Main Phase 1, you can have this card lose 1000 ATK, and return all cards in your opponent's Spell and Trap Card Zone to the hand.
et: Seda kaarti ei saa eriliselt kutsuda. Kõik koletised, kes selle kaardiga võitlevad, ei hävine selle lahingu käigus ja naasevad pärast kahju arvutamist kätte. Kord käigu jooksul, oma peafaasi 1 ajal, võid lasta sellel kaardil kaotada 1000 ATK ja tagastada kõik kaardid oma vastase Loitsu ja Lõksu kaarditsoonist kätte.

source: Glow-Up Bulb
et: Helendav Idand

source: You can send the top card of your Deck to the Graveyard and Special Summon this card from the Graveyard. Each player can only use the effect of "<M9095>Glow-Up Bulb<M>" once per Duel.
et: Saad oma pakist pealmise kaardi Hauakambrisse ja Kutsu see kaart Hauakambrist Eriliselt välja. Iga mängija saab "<M9095>Glow-Up Bulb<M>" efekti kasutada ainult üks kord Duelli jooksul.

source: Karakuri Soldier mdl 236 "Nisamu"
et: Karakuri Sõdur mdl 236 "Nisamu"

source: This card must attack if able. When this face-up Attack Position card on the field is selected as an attack target, change it to Defense Position. When this card is destroyed by battle and sent to the Graveyard, you can Special Summon 1 Level 4 or lower "Karakuri" monster from your Deck in face-up Attack Position.
et: See kaart peab ründama, kui võimalik. Kui see avatud ründeasendis kaart väljakul valitakse rünnaku sihtmärgiks, muuda see kaitseasendisse. Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse, saad eriliselt kutsuda 1. taseme 4 või madalama "Karakuri" koletise oma pakist avatud ründeasendis.

source: Karakuri Merchant mdl 177 "Inashichi"
et: Karakuri kaupmees mdl 177 "Inashichi"

source: This card must attack if able. When this face-up Attack Position card on the field is selected as an attack target, change it to Defense Position. When this card is Normal Summoned, add 1 "Karakuri" card from your Deck to your hand.
et: See kaart peab ründama, kui võimalik. Kui see näoga ülespoole olev Rünnakupositsioonis kaart väljal valitakse rünnaku sihtmärgiks, muuda see Kaitsepositsiooniks. Kui see kaart on Normaalseti Kutsutud, lisa 1 "Karakuri" kaart oma pakist oma kätte.

source: Karakuri Strategist mdl 248 "Nishipachi"
et: Karakuri Strateeg mdl 248 "Nishipachi"

source: This card must attack if able. When this face-up Attack Position card is selected as an attack target, change it to Defense Position. When this card is Normal or Special Summoned, select 1 monster on the field and change its battle position.
et: See kaart peab ründama, kui võimalik. Kui see avatud Rünnakupositsioonis kaart valitakse rünnaku sihtmärgiks, muuda see Kaitsepositsiooniks. Kui see kaart kutsutakse välja normaalselt või eriliselt, vali 1 koletis väljal ja muuda selle lahingupositsiooni.

source: This card must attack if able. When this face-up Attack Position card is selected as an attack target, change it to Defense Position. When this card is flipped face-up, select 1 face-up monster on the field, and send it to the Graveyard. During the turn this card is flipped face-up, it can attack your opponent directly.
et: See kaart peab ründama, kui see on võimalik. Kui see avatud Rünnakupositsioonis kaart valitakse rünnaku sihtmärgiks, muuda see Kaitsepositsiooniks. Kui see kaart pööratakse avatud poolega üles, vali 1 avatud poolega koletis väljakul ja saada see Hauakambrisse. Sellel käigul, mil see kaart pööratakse avatud poolega üles, võib see rünnata otse sinu vastast.

source: This card must attack if able. When this face-up Attack Position card on the field is selected as an attack target, change it to Defense Position. If another "Karakuri" monster on the field is destroyed, this card gains 400 ATK.
et: See kaart peab ründama, kui võimalik. Kui see avatud rünnakupositsioonis kaart väljal valitakse rünnaku sihtmärgiks, muuda see kaitsepositsiooniks. Kui mõni teine "Karakuri" koletis väljal hävitatakse, saab see kaart 400 ATK juurde.

source: Scrap Soldier
et: <translated Rahe Sõdur

source: This card cannot be used as a Synchro Material Monster, except for the Synchro Summon of a "Scrap" monster. If this face-up Defense Position card is selected as an attack target, destroy this card at the end of the Battle Phase. If this card is destroyed by the effect of a "Scrap" card and sent to the Graveyard, you can select 1 "Scrap" monster in your Graveyard, except "<M9101>Scrap Soldier<M>", and add it to your hand.
et: Seda kaarti ei saa kasutada Sünkro Materjal Koletisena, välja arvatud "Scrap" koletise Sünkro Kutsumiseks. Kui see ülespoole suunatud Kaitseasendis kaart valitakse rünnaku sihtmärgiks, hävita see kaart Lahingufaasi lõpus. Kui see kaart hävitatakse "Scrap" kaardi efekti tõttu ja saadetakse Hauakambrisse, saad valida 1 "Scrap" koletise oma Hauakambris, välja arvatud "<M9101>Scrap Soldier<M>", ja lisada see oma kätte.

source: Scrap Searcher
et: Rämpsu Otsija

source: When a "Scrap" monster you control, except "<M9102>Scrap Searcher<M>", is destroyed and sent to the Graveyard while this card is in the Graveyard, you can Special Summon this card from your Graveyard. When this card is Special Summoned, destroy all face-up monsters you control, except "Scrap" monsters.
et: Kui sinu kontrollitav "Scrap" koletis, välja arvatud "<M9102>Scrap Searcher<M>", hävitatakse ja saadetakse Hauakambrisse, kui see kaart on Hauakambris, saad selle kaardi Hauakambrist eriliselt kutsuda. Kui see kaart eriliselt kutsutakse, hävita kõik avatud koletised, mida sa kontrollid, välja arvatud "Scrap" koletised.

source: Wattkiwi
et: Wattkiivi

source: “Watt" monsters you control cannot be destroyed by battle while they are attacking.
et: “Watt" koletised, mida sa kontrollid, ei saa hävitada lahingus, kui nad ründavad.

source: Your opponent cannot select another face-up "Watt" monster on the field as an attack target, or target them with card effects.
et: Sinu vastane ei saa valida teist avatud "Watt" koletist väljal rünnaku sihtmärgiks ega sihtida neid kaardiefektidega.

source: Wattdragonfly
et: Watt-sudulane

source: If this card is destroyed by your opponent's card (either by battle or by card effect), you can Special Summon 1 "Watt" monster from your Deck.
et: Kui see kaart hävitatakse sinu vastase kaardi poolt (kas lahingus või kaardi efekti tõttu), saad eriliselt kutsuda 1 "Watt" koletise oma pakist.

source: This card can attack twice during each Battle Phase. If this card battles, negate the effects of the monster it battled after damage calculation (including in the Graveyard).
et: See kaart võib rünnata kaks korda iga Lahingu Faasi jooksul. Kui see kaart võitleb, tühista pärast kahju arvutamist selle koletise efektid, millega see võitles (kaasa arvatud Hauakambris).

source: Naturia Cherries
et: Naturia Kirsid

source: If this card is sent from the field to the Graveyard by your opponent's card (including by battle, card effect, or by being destroyed), you can Special Summon up to 2 "<M9107>Naturia Cherries<M>" from your Deck in face-down Defense Position.
et: Kui see kaart saadetakse vastase kaardi poolt väljakult hauakambrisse (sh lahingus, kaardi efekti tõttu või hävitamise tõttu), saad eriliselt kutsuda kuni 2 "<M9107>Naturia Cherries<M>" oma pakist näoga allapoole kaitsepositsioonis.

source: Naturia Pumpkin
et: Naturia Kõrvits

source: When this card is Normal Summoned, if your opponent controls a monster, you can Special Summon 1 "Naturia" monster from your Hand.
et: Kui see kaart on Normaal-Kutsutud ja kui sinu vastane kontrollib koletist, saad sa oma käest Eriliselt Kutsuda 1 "Naturia" koletise.

source: Naturia Stag Beetle
et: Naturia Põrnikas

source: Once per turn, during the Battle Step or Damage Step of this card's attack, when your opponent activates a card or effect, you can select 1 "Naturia" monster in your Graveyard. Special Summon that monster from the Graveyard.
et: Kord ühe korra käigu jooksul, selle kaardi rünnaku Lahinguetapis või Kahjuetapis, kui sinu vastane aktiveerib kaardi või efekti, saad valida 1 "Naturia" koletise oma Hauakambris. Erikutsu see koletis Hauakambrist.

source: Dance Princess of the Ice Barrier
et: Jääbarjääri Tantsuprintsess

source: Once per turn, if you control another face-up "Ice Barrier” monster, you can reveal any number of “Ice Barrier” monsters in your hand to select an equal number of Set Spell/Trap cards your opponent controls. Return the selected Set Spell/Trap cards your opponent controls to the hand.
et: Korra ühe korra käigu jooksul, kui sa kontrollid teist avatud "Ice Barrier" koletist, võid sa paljastada suvalise arvu "Ice Barrier" koletisi oma käes, et valida sama arv vastase seatud Loitsu/Lõksu kaarte. Tagasta valitud vastase seatud Loitsu/Lõksu kaardid kätte.

source: Chain Dog
et: Ahelkoer

source: This card cannot be used as a Synchro Material Monster, except for the Synchro Summon of a Beast-Type monster. If you control 2 face-up Beast-Type monsters, you can Special Summon this card from the Graveyard. If this card is Special Summoned this way, remove it from play when it is removed from the field.
et: Seda kaarti ei saa kasutada Sünkro Materjal Koletisena, välja arvatud Looma-tüüpi koletise Sünkro Kutsumiseks. Kui sa kontrollid 2 avatud Looma-tüüpi koletist, saad selle kaardi Hauakambrist Eriliselt Kutsuda. Kui see kaart on sel viisil Eriliselt Kutsutud, eemalda see mängust, kui see väljakult eemaldatakse.

source: Wightmare
et: Luupainaja

source: While it is in the Graveyard, this card's name is treated as "<M4030>Skull Servent<M>". You can discard this card to activate 1 of the following effects:<BR>● Select 1 of your removed from play "<M4030>Skull Servent<M>" or "<M9112>Wightmare<M>", and return it to your Graveyard.<BR>● Select 1 of your removed from play1 "<M7611>The Lady in Wight<M>" or "<M6341>King of the Skull Servants<M>", and Special Summon it.
et: Kui see kaart on surnuaias, käsitletakse selle nime kui "<M4030>Skull Servent<M>". Sa võid selle kaardi ära visata, et aktiveerida üks järgmistest efektidest:<BR>● Vali 1 oma mängust eemaldatud "<M4030>Skull Servent<M>" või "<M9112>Wightmare<M>" ja tagasta see oma surnuaeda.<BR>● Vali 1 oma mängust eemaldatud "<M7611>The Lady in Wight<M>" või "<M6341>King of the Skull Servants<M>" ja kutsu see eriliselt välja.

source: Anarchist Monk Ranshin
et: Anarhistist Munk Ranshin

source: When this card is sent from the field to the Graveyard by your opponent's card (including by battle, card effect, or by being destroyed), select 1 monster in your opponent's Graveyard and remove it from play.
et: Kui see kaart saadetakse vastase kaardi poolt (sh lahingus, kaardi efekti tõttu või hävitamise teel) väljakult kalmistule, vali 1 koletis vastase kalmistul ja eemalda see mängust.

source: Delg the Dark Monarch
et: Delg, Tume Monarh

source: When this card is Normal or Special Summoned, you can select up to 2 cards in your opponent's Graveyard, remove them from play. Then send the same number of cards from the top of their Deck to the Graveyard. During the turn it is Normal or Special Summoned, this card cannot attack.
et: Kui see kaart kutsutakse normalkutsumise või erikutsumise teel, saad valida kuni 2 kaarti oma vastase hauakambris ja eemaldada need mängust. Seejärel saada sama arv kaarte nende paki pealt hauakambrisse. Sellel käigul, kui see kaart kutsutakse normalkutsumise või erikutsumise teel, ei saa see rünnata.

source: Supreme Arcanite Magician
et: Ülim Arkaanimaag

source: 1 Spellcaster-Type Synchro Monster + 1 Spellcaster-Type monster<BR>This monster can only be Special Summoned by Fusion Summon (from the Extra Deck). When this card is Fusion Summoned, place 2 Spell Counters on it. This card gains 1000 ATK for each Spell Counter on it. Once per turn, you can remove 1 Spell Counter from your side of the field to activate one of the following effects:<BR>● Select 1 card on the field, and destroy it.<BR>● Draw 1 card.
et: 1 Sünkro Spellcaster-tüüpi koletis + 1 Spellcaster-tüüpi koletis<BR>Seda koletist saab eriliselt kutsuda ainult Fusion Summon'iga (lisapakist). Kui see kaart on Fusion Summon'iga kutsutud, aseta sellele 2 loitsuloendurit. See kaart saab iga loitsuloenduri eest 1000 ATK juurde. Kord käigu jooksul võid eemaldada 1 loitsuloenduri oma väljaku poolelt, et aktiveerida üks järgmistest efektidest:<BR>● Vali 1 kaart väljakul ja hävita see.<BR>● Tõmba 1 kaart.

source: Gaia Drake, the Universal Force
et: Gaia Drake, Universaalne Jõud

source: 11 "<M7697>Gaia Knight, the Force of Earth<M>" + 1 non-Effect Synchro Monster<BR>This card cannot be targeted by, or destroyed by, the effects of Effect Monsters.
et: 11 "<M7697>Gaia Rüütel, Maa Jõud<M>" + 1 mitte-efekti Sünkro Monster<BR>Seda kaarti ei saa sihtida ega hävitada Efekt Monsterite efektide poolt.

source: Shooting Star Dragon
et: Laskmistäht Draakon

source: 1 Tuner Synchro Monster +1 "<M7734>Stardust Dragon<M>"<BR>Each of these effects can be activated once per turn:<BR>● Reveal the top 5 cards of your Deck. Shuffle them back in, and this card's maximum number of attacks this turn is equal to the number of Tuner monsters revealed.<BR>● Negate the activation of an effect that would destroy a card(s) on the field, and destroy that card.<BR>● When your opponent's monster declares an attack you can select it, then remove this card from play and negate the attack. During the End Phase, Special Summon this card that was removed from play by this effect.
et: 1 Tuner Sünkro Monster +1 "<M7734>Stardust Dragon<M>"<BR>Iga efekti saab aktiveerida kord käigu jooksul:<BR>● Paljasta oma paki 5 ülemist kaarti. Sega need tagasi ja selle kaardi maksimaalne rünnakute arv sellel käigul on võrdne paljastatud Tuner monsterite arvuga.<BR>● Tühista efekti aktiveerimine, mis hävitaks kaardi(d) väljakul, ja hävita see kaart.<BR>● Kui sinu vastase monster kuulutab välja rünnaku, saad selle valida, seejärel eemalda see kaart mängust ja tühista rünnak. Lõppfaasis kutsu see kaart, mis selle efekti tõttu mängust eemaldati, eriliselt välja.

source: Formula Synchron
et: Formula Sünkron

source: 1 Tuner + 1 non-Tuner Monster<BR>When this card is Synchro Summoned, you can draw 1 card. During your opponent's Main Phase, you can Synchro Summon using this face-up card you control as a Synchro Material Monster.
et: 1 Tuner + 1 mitte-Tuner Koletis<BR>Kui see kaart on Sünkrosummonitud, võid tõmmata 1 kaardi. Oma vastase peafaasi ajal võid Sünkrosummonida, kasutades seda avatud kaarti, mida sa kontrollid, Sünkromaterjalina.

source: Red Nova Dragon
et: Punane Nova Draakon
