Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: 2 Tuners +1 "<M7735>Red Demon's Dragon<M>"<BR>This card gains 500 ATK for each Tuner monster in your Graveyard. This card cannot be destroyed by the effects of your opponent's Spells, Traps, or monsters. When your opponent's monster declares an attack, you can select it, then remove this card from play and negate the attack. During the End Phase, Special Summon this card that was removed by this effect.
et: 2 Häälestajat +1 "<M7735>Red Demon's Dragon<M>"<BR>See kaart saab 500 ATK iga sinu Hauakambris oleva Häälestaja koletise eest. Seda kaarti ei saa hävitada sinu vastase Loitsude, Lõksude ega koletiste efektide tõttu. Kui sinu vastase koletis kuulutab välja rünnaku, saad selle valida, seejärel eemaldada see kaart mängust ja tühistada rünnak. Lõppfaasi ajal kutsu see kaart, mis eemaldati selle efekti tõttu, eriliselt välja.

source: 1 Tuner + 1 or more non-Tuner Machine-Type monsters<BR>When this card is Synchro Summoned, you can Special Summon 1 "Karakuri" monster from your Deck. Once per turn, you can select 1 monster on the field, and change its battle position.
et: 1 Tuner + 1 või rohkem mitte-Tuner Masinatüüpi koletisi<BR>Kui see kaart on Sünkrosummonitud, saad Sa oma pakist erilisummonida 1 "Karakuri" koletise. Kord ühe käigu jooksul saad valida 1 koletise väljal ja muuta selle lahinguasendit.

source: Scrap Twin Dragon
et: Rämekaksiklo

source: 1 "Scrap" Tuner + 1 or more non-Tuner monsters<BR>Once per turn, you can select 1 card you control and 2 cards your opponent controls. Destroy the one you control and return the two your opponent controls to the hand. When this card is destroyed by your opponent's card (either by battle or by card effect) and sent to the Graveyard, select 1 non-Synchro "Scrap" monster in your Graveyard, and Special Summon it.
et: 1 "Scrap" Tuner + 1 või rohkem mitte-Tuner koletist<BR>Korra käigu jooksul saad valida 1 kaardi, mida sa kontrollid, ja 2 kaarti, mida su vastane kontrollib. Hävita see, mida sa kontrollid, ja tagasta kaks, mida su vastane kontrollib, kätte. Kui see kaart hävitatakse su vastase kaardi poolt (kas lahingus või kaardi efekti tõttu) ja saadetakse Hauakambrisse, vali 1 mitte-Sünkro "Scrap" koletis oma Hauakambris ja Kutsu see Eriliselt välja.

source: Tuning
et: Häälestamine

source: Add 1 "Synchron" Tuner monster from your Deck to your hand. Then send the top card of your Deck to the Graveyard.
et: Lisa oma pakist 1 "Synchron" Tuner koletis oma kätte. Seejärel saada oma paki pealmine kaart Hauakambrisse.

source: Karakuri Showdown Castle
et: Karakuri Lahinguloss

source: When a face-up "Karakuri" monster you control selects an opponent's face-up monster as an attack target, you can change the target's battle position. When this face-up card on the field is destroyed and sent to the Graveyard, you can select 1 Level 4 or higher "Karakuri" monster in your Graveyard, and Special Summon it.
et: Kui sinu juhitav avatud "Karakuri" koletis valib vastase avatud koletise rünnaku sihtmärgiks, saad muuta sihtmärgi lahinguasendit. Kui see avatud kaart väljakul hävitatakse ja saadetakse Hauakambrisse, saad valida ühe 4. või kõrgema taseme "Karakuri" koletise oma Hauakambris ja Kutsuda see Eriliselt välja.

source: Golden Gearbox
et: Kuldne käigukast

source: Select 1 face-up "Karakuri" monster on the field. It gains 500 ATK and 1500 DEF, until the End Phase.
et: Vali 1 avatud "Karakuri" koletis väljal. See saab 500 ATK ja 1500 DEF juurde kuni End Phase'ini.

source: Karakuri Anatomy
et: Karakuri Anatoomia

source: Each time a "Karakuri" monster's battle position is changed, place 1 Karakuri Counter on this card (max. 2). You can send this card from the field to the Graveyard to draw 1 card for each Karakuri Counter on this card.
et: Iga kord, kui "Karakuri" koletise lahinguasendit muudetakse, pane sellele kaardile 1 Karakuri loendur (max. 2). Sa saad saata selle kaardi väljakult Hauakambrisse, et tõmmata 1 kaart iga Karakuri loenduri kohta sellel kaardil.

source: Scrap Lube
et: Rauaõli

source: Select 1 "Scrap" monster in your Graveyard. Special Summon that monster from the Graveyard. Its effects are negated. When this card is removed from the field, destroy that monster. When that monster is removed from the field, destroy this card. You cannot conduct your Battle Phase the turn you activate this card.
et: Vali oma kalmistult 1 "Scrap" koletis. Kutsu see koletis kalmistult eriliselt välja. Selle efektid on tühistatud. Kui see kaart eemaldatakse väljakult, hävita see koletis. Kui see koletis eemaldatakse väljakult, hävita see kaart. Sa ei saa oma lahingufaasi läbi viia sellel käigul, mil sa selle kaardi aktiveerid.

source: Wattcastle
et: Wattloss

source: Any monster that attacks a "Watt" monster loses 1000 ATK after damage calculation.
et: Iga koletis, kes ründab "Watt" koletist, kaotab pärast kahjukalkulatsiooni 1000 ATK.

source: Equip only to a Level 3 or lower Thunder-Type monster. It gains 800 ATK and its effects are negated. Each time it inflicts Battle Damage to your opponent, draw 1 card.
et: Varusta ainult 3. taseme või madalama Äikese-tüüpi koletisega. See saab 800 ATK juurde ja selle efektid tühistatakse. Iga kord, kui see tekitab lahingukahju sinu vastasele, tõmba 1 kaart.

source: Barkion's Bark
et: Barkioni Haukumine

source: Activate only if you control a face-up "Naturia" monster. Your opponent cannot activate Trap Cards this turn.
et: Aktiveeri ainult siis, kui sa kontrollid avatud "Naturia" koletist. Sinu vastane ei saa sellel käigul lõksukaarte aktiveerida.

source: Leodrake's Mane
et: Leodrake'i lakk

source: Select 1 face-up "Naturia" monster you control. Its ATK becomes 3000, and its effects are negated, until the End Phase.
et: Vali 1 avatud "Naturia" koletis, mida sa kontrollid. Selle ATK muutub 3000-ks ja selle efektid tühistatakse kuni lõppfaasini.

source: Medallion of the Ice Barrier
et: Jääbarjääri medaljon

source: Add 1 "Ice Barrier" monster from your Deck to your hand.
et: Lisa oma pakist 1 "Ice Barrier" koletis oma kätte.

source: Mirror of the Ice Barrier
et: Jääbarjääri Peegel

source: During this turn, each time a card(s) is removed from play from your hand, your side of the field, and/or your Graveyard by the effect of an opponent's Effect Monster:<BR>●If a card in your hand is removed from play, remove from play up to 2 random cards in your opponent's hand.<BR>●If a card you control is removed from play, remove from play up to 2 cards your opponent controls.<BR>●If a card in your Graveyard is removed from play, remove from play up to 2 cards in your opponent's Graveyard.
et: Selle käigu jooksul, iga kord kui kaart või kaardid eemaldatakse mängust sinu käest, sinu väljakupoolelt ja/või sinu Hauakambrist vastase Efektikoletise efekti tõttu:<BR>●Kui kaart sinu käest eemaldatakse mängust, eemalda mängust kuni 2 juhuslikku kaarti vastase käest.<BR>●Kui kaart, mida sa kontrollid, eemaldatakse mängust, eemalda mängust kuni 2 kaarti, mida vastane kontrollib.<BR>●Kui kaart sinu Hauakambrist eemaldatakse mängust, eemalda mängust kuni 2 kaarti vastase Hauakambrist.

source: Koa'ki Ring
et: Koa'ki Sõrmus

source: Reveal 1 "<M8207>Iron Core of Koa'ki Meiru<M>" in your hand to select 1 face-up monster on the field. Destroy that monster, and both players take 1000 damage.
et: Paljasta oma käes olev "<M8207>Iron Core of Koa'ki Meiru<M>", et valida üks avatud koletis väljal. Hävita see koletis ja mõlemad mängijad saavad 1000 kahju.

source: Darkworld Shackles
et: Pimeduse Maailma Ahelad

source: The equipped monster cannot attack, and its ATK and DEF become 100. During each of your Standby Phases, inflict 500 damage to the controller of the equipped monster.
et: Varustatud koletis ei saa rünnata ja selle ATK ja DEF muutuvad 100-ks. Iga sinu Standby Phase'i ajal tekita 500 kahju varustatud koletise kontrollijale.

source: Axe Of Fools
et: Lollide Kirves

source: The equipped monster gains 1000 ATK and its effect(s) is negated. During each of your Standby Phases, the controller of the equipped monster takes 500 damage.
et: Varustatud koletis saab 1000 ATK juurde ja selle efekt(id) on tühistatud. Iga sinu Ootefaaside ajal saab varustatud koletise kontrollija 500 kahju.

source: Cursed Bill
et: Neetud Arve

source: When the equipped monster is destroyed and this card is sent to the Graveyard, inflict damage to the player who controlled the equipped monster, equal to the monster's original DEF.
et: Kui varustatud koletis hävitatakse ja see kaart saadetakse Hauakambrisse, põhjusta kahju mängijale, kes kontrollis varustatud koletist, võrdne koletise algse DEF-iga.

source: Tokkosho of Ghost Destroying
et: Kummituste hävitamise Tokkosho

source: When the equipped monster inflicts Battle Damage to your opponent, you can select and remove from play up to 2 monsters from your opponent's Graveyard.
et: Kui varustatud koletis tekitab lahingukahju sinu vastasele, saad valida ja mängust eemaldada kuni 2 koletist oma vastase hauakambrist.

source: White Elephant's Gift
et: Valge Elevandi Kingitus

source: Send 1 face-up non-Effect Monster you control to the Graveyard to draw 2 cards.
et: Saada 1 avatud mitte-efektiga koletis, mida sa kontrollid, hauakambrisse, et tõmmata 2 kaarti.

source: Heat Wave
et: Kuumalaine

source: This card can only be activated at the start of Main Phase 1. Neither player can Normal or Special Summon an Effect Monster, until your next Draw Phase.
et: Seda kaarti saab aktiveerida ainult Main Phase 1 alguses. Kumbki mängija ei saa Normal ega Special Summonida Effect Monsterit kuni sinu järgmise Draw Phase'ini.

source: D2 Shield
et: D2 Kilp

source: Select 1 face-up Defense Position monster you control. Its DEF becomes double its original DEF.
et: Vali 1 avatud kaitseasendis olev koletis, mida sa kontrollid. Selle DEF muutub kahekordseks selle algsest DEF-ist.

source: Red Screen
et: Punane Ekraan

source: Your opponent's monsters cannot declare attacks. This card's controller must pay 1000 Life Points during each of their End Phases (this is not optional), or this card is destroyed. If1 "<M7735>Red Demon's Dragon<M>" is face-up on the field, you can select 1 Level 1 Tuner Monster in your Graveyard, then destroy this card and Special Summon that monster.
et: Sinu vastase koletised ei saa rünnakuid kuulutada. Selle kaardi kontrollija peab iga oma lõppfaasi ajal maksma 1000 elupunkti (see ei ole valikuline), vastasel juhul see kaart hävitatakse. Kui1 "<M7735>Red Demon's Dragon<M>" on väljakul avatud, saad valida 1. taseme Tuner-koletise oma hauast, seejärel hävita see kaart ja kutsu see koletis eriliselt välja.

source: Blackback
et: Mustselg

source: Activate only during your turn. Select 1 "Blackwing" monster with 2000 or less ATK in your Graveyard, and Special Summon it. You cannot Normal Summon or Set the turn you activate this card.
et: Aktiveeri ainult oma käigu ajal. Vali 1 "Blackwing" koletis, mille ATK on 2000 või vähem sinu Hauakambris, ja Kutsu see Eriliselt välja. Sa ei saa Normaalset Kutsumist ega Asetamist teha käigul, mil aktiveerid selle kaardi.

source: Defenders Intersect
et: Kaitsjate ristumine

source: Activate only during the Battle Phase. Defense Position monsters your opponent controls are changed to face-up Attack Position, and their effects are negated.
et: Aktiveeri ainult Lahingufaasis. Kaitseasendis olevad koletised, mida sinu vastane kontrollib, muudetakse ründeseisundisse ja nende efektid tühistatakse.

source: Gravity Collapse
et: Gravitatsiooni Kokkuvarisemine

source: Activate by sending 1 face-up Synchro Monster you control to the Graveyard when your opponent Summons a monster. Negate the Summon and destroy that card. Your opponent cannot Summon a monster until the End Phase of this turn.
et: Aktiveeri, saates 1 avatud Sünkro Monster, mida sa kontrollid, Hauakambrisse, kui su vastane kutsub välja koletise. Tühista väljakutse ja hävita see kaart. Sinu vastane ei saa selle käigu lõpufaasi jooksul koletist välja kutsuda.

source: Blackwing - Boobytrap
et: Mustatiib - Lõks

source: When this Set card is destroyed by your opponent's card effect while you control a face-up "Blackwing" monster, inflict 1000 damage to your opponent and draw 1 card.
et: Kui see seatud kaart hävitatakse sinu vastase kaardi efekti tõttu, kui sa kontrollid avatud "Blackwing" koletist, põhjusta oma vastasele 1000 kahju ja tõmba 1 kaart.

source: Star Siphon
et: Tähe Sifoon

source: Activate only when a Synchro Monster is Special Summoned, by selecting it. Special Summon 1 "<M3969>Siphon Token<M>" (Spellcaster-Type/DARK/Level 1/ATK 0/DEF 0). Its Level is that of the selected monster, and the selected monster is now Level 1.
et: Aktiveeri ainult siis, kui Sünkro Monster kutsutakse eriliselt välja, valides selle. Kutsu eriliselt välja 1 "<M3969>Siphon Token<M>" (Loitsija-Tüüp/PIMEDUS/Tase 1/ATK 0/DEF 0). Selle tase on valitud koletise tase ja valitud koletis on nüüd Tase 1.

source: Half Counter
et: Poolik Vasturünnak

source: Activate only during damage calculation if a monster you control is being attacked. The attack target monster you control gains ATK equal to half the original ATK of the attacking monster, until the End Phase.
et: Aktiveeri ainult kahju arvutamise ajal, kui sinu kontrollitavat koletist rünnatakse. Rünnaku sihtmärgiks olev koletis, mida sa kontrollid, saab ATK-d juurde, mis on võrdne ründava koletise algse ATK poolega, kuni lõppfaasini.

source: Karakuri Trick House
et: Karakuri Trikimaja

source: Activate only when the battle position of a face-up "Karakuri" monster you control is changed . Select 1 card on the field, and destroy it.
et: Aktiveeri ainult siis, kui sinu kontrollitava avatud "Karakuri" koletise lahingupositsioon muutub. Vali 1 kaart väljal ja hävita see.

source: Karakuri Klock
et: Karakuri Kella

source: Activate only when a face-up Defense Position "Karakuri" monster is selected as an attack target. Destroy all face-up monsters your opponent controls.
et: Aktiveeri ainult siis, kui rünnaku sihtmärgiks valitakse ülespööratud kaitseasendis "Karakuri" koletis. Hävita kõik ülespööratud koletised, mida sinu vastane kontrollib.

source: Scrap Crash
et: Rämpsu Krahh

source: Activate only when a "Scrap" monster you control is destroyed and sent to the Graveyard. Destroy all face-up Spell/Trap Cards on the field.
et: Aktiveeri ainult siis, kui sinu kontrollitav "Scrap" koletis hävitatakse ja saadetakse Hauakambrisse. Hävita kõik avatud Võlu-/Lõksukaardid väljal.

source: Wattkeeper
et: Wattkaitsja

source: Select 1 Level 4 or lower "Watt" monster in your Graveyard. Special Summon that monster from the Graveyard. Destroy it during the End Phase.
et: Vali oma kalmistult 1. taseme 4 või madalama "Watt" koletis. Kutsu see koletis kalmistult eriliselt välja. Hävita see lõppfaasis.

source: Exterio's Fang
et: Exterio kihv

source: Activate only if you control a face-up "Naturia" monster and have at least 1 card in your hand. Negate the activation of an opponent's Spell/Trap Card and destroy it. Then, send 1 card from your hand to the Graveyard.
et: Aktiveeri ainult siis, kui sul on kontrolli all avatud "Naturia" koletis ja vähemalt 1 kaart käes. Tühista vastase Loitsu/Lõksukaardi aktiveerimine ja hävita see. Seejärel saada 1 kaart oma käest Hauakambrisse.

source: Vanity's Emptiness
et: Edvistuse Tühjus

source: Neither player can Special Summon monsters. Destroy this card when a card is sent from the Deck or the field to your Graveyard.
et: Kumbki ei saa erilisi kutsumisi teha. Hävita see kaart, kui kaart saadetakse pakist või väljakult sinu hauakambrisse.

source: Different Dimension Ground
et: Teise dimensiooni maa

source: This turn, any monster sent to the Graveyard is removed from play instead.
et: Sellel käigul eemaldatakse kõik koletised, mis saadetakse Hauakambrisse, mängust.

source: Powersink Stone
et: Võimukivi

source: Each time a monster effect is activated, place 1 Spellstone Counter on this card (max. 2). While this card has 2 Spellstone Counters, face-up monsters on the field cannot activate their effects, and their effects are negated. During each End Phase, remove all Spellstone Counters on this card.
et: Iga kord, kui aktiveeritakse koletise efekt, aseta sellele kaardile 1 Loitsukivi loendur (maks. 2). Kui sellel kaardil on 2 Loitsukivi loendurit, ei saa avatud koletised väljal oma efekte aktiveerida ja nende efektid on tühistatud. Iga lõppfaasi ajal eemalda kõik Loitsukivi loendurid sellelt kaardilt.

source: Tyrant's Temper
et: Türanni raev

source: Tribute 1 monster to activate this card. All face-up monsters on the field that you own are unaffected by other Trap Cards.
et: Ohverda 1 koletis, et aktiveerida see kaart. Kõik sinu omanduses olevad avatud koletised väljakul ei ole mõjutatud teistest lõksukaartidest.

source: Dark Trap Hole
et: Pime lõksuauk

source: Activate only when your opponent Special Summons 2 or more monsters face-up. Send all of those monsters to the Graveyard. Then, send all monsters in the opponent's hand and Deck to the Graveyard that have the same name as either of those monsters.
et: Aktiveeri ainult siis, kui sinu vastane kutsub eriliselt välja 2 või rohkem koletist avatud olekus. Saada kõik need koletised Hauakambrisse. Seejärel saada kõik koletised vastase käest ja pakist Hauakambrisse, millel on sama nimi kui mõnel neist koletistest.

source: Gishki Abyss
et: Gishki Kuristik

source: When this card is Summoned: You can add 1 "Gishki" monster with 1000 or less DEF from your Deck to your hand, except "<M9158>Gishki Abyss<M>".
et: Kui see kaart kutsutakse välja: Sa võid lisada oma pakist oma kätte 1 "Gishki" koletise, mille DEF on 1000 või vähem, välja arvatud "<M9158>Gishki Abyss<M>".

source: Gishki Vanity
et: Gishki Edevus

source: During your Main Phase: You can discard this card to activate the following effect: During this turn, your opponent cannot activate the effects of Spells, Trap, or Effect Monsters in response to the activation of a "Gishki" Ritual Spell Card or the Ritual Summon of a "Gishki" Ritual Monster.
et: Oma peafaasi ajal: Sa võid selle kaardi ära visata, et aktiveerida järgmine efekt: Selle käigu ajal ei saa sinu vastane aktiveerida Loitsude, Lõksude ega Efektikoletiste efekte vastuseks "Gishki" Rituaalloitsukaardi aktiveerimisele või "Gishki" Rituaalkoletise rituaalsummonile.

source: When this card is Summoned: You can add 1 "Gishki" Ritual Monster or Ritual Spell Card from your Graveyard to your hand.
et: Kui see kaart kutsutakse välja: Sa saad lisada 1 "Gishki" Rituaalikoletise või Rituaaliloitsukaardi oma kalmistult oma kätte.

source: Gishki Chain
et: Gishki Kett

source: When this card is Normal Summoned: Look at the top 3 cards of your Deck and if there is a Ritual Monster or Ritual Spell Card among those cards; you can reveal it to add it to your hand and return the remaining cards to the top of the Deck in any order.
et: Kui see kaart on Normaal-Kutsutud: Vaata oma Paki kolme ülemist kaarti ja kui nende kaartide hulgas on Rituaal-Koletis või Rituaal-Loitsukaart; võid selle avaldada, et lisada see oma kätte ja tagastada ülejäänud kaardid Paki tippu suvalises järjekorras.

source: FLIP: You can add 1 "Gishki" monster from your Deck to your hand.
et: FLIP: Sa võid lisada 1 "Gishki" koletise oma pakist oma kätte.

source: Gishki Shadow
et: Gishki Vari

source: If you Ritual Summon a WATER Ritual Monster, this 1 card can be used as the entire Tribute. You can discard this card; add 1 "Gishki" Ritual Spell Card from your Deck to your hand.
et: Kui sa kutsud rituaaliga välja VEE rituaalikoletise, võib seda 1 kaarti kasutada kogu ohvriannina. Sa võid selle kaardi ära visata; lisa 1 "Gishki" rituaaliloitsukaart oma pakist oma kätte.

source: When this card is sent from the field to the Graveyard, you can Special Summon 1 Level 2 or lower "Gusto" monster from your Deck.
et: Kui see kaart saadetakse väljakult hauakambrisse, saad eriliselt kutsuda 1 taseme 2 või madalama "Gusto" koletise oma pakist.

source: When this card is destroyed by battle and sent to the Graveyard, you can Special Summon 1 non-Tuner Level 4 or lower "Gusto" monster from your Deck.
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse, saad Sa eriliselt kutsuda 1 mitte-Tuuner Tase 4 või madalama "Gusto" koletise oma Paki seest.

source: If this card is destroyed by battle and sent to the Graveyard: You can banish 1 "Gusto" monster from your Graveyard at the end of the Battle Phase to target 1 WIND Psychic-Type monster with 1500 or less DEF from your Deck; Special Summon it.
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse: Sa võid Lahingufaasi lõpus eemaldada oma Hauakambrist mängust 1 "Gusto" koletise, et valida oma Pakist 1 TUULE Psüühika-tüüpi koletis, mille DEF on 1500 või vähem; Kutsu see eriliselt välja.

source: Winda, Priestess of Gusto
et: Winda, Gusto preestrinna

source: When this card is destroyed by battle with an opponent's attacking monster and sent to the Graveyard, you can Special Summon 1 "Gusto" Tuner monster from your Deck.
et: Kui see kaart hävitatakse vastase ründava koletisega lahingus ja saadetakse Hauakambrisse, saad oma pakist eriliselt kutsuda 1 "Gusto" häälestaja koletise.

source: Caam, Serenity of Gusto
et: Caam, Gusto Rahu

source: Once per turn, you can return 2 "Gusto" monsters from your Graveyard to the Deck to draw 1 card.
et: Korra ühe käigu jooksul saad saata 2 "Gusto" koletist oma Hauakambrist tagasi Pakki, et tõmmata 1 kaart.

source: Windaar, Sage of Gusto
et: Windaar, Gusto Tark

source: When this card destroys an opponent's monster by battle and sends it to the Graveyard: You can target 1 Level 3 or lower "Gusto" monster from your Graveyard; Special Summon it in face-up Defense Position.
et: Kui see kaart hävitab lahingus vastase koletise ja saadab selle Hauakambrisse: Sa saad sihtida 1. taseme või madalama "Gusto" koletise oma Hauakambrist; Kutsu see eriliselt välja näoga ülespoole Kaitseasendis.

source: Steelswarm Cell
et: Terassülemirakk

source: If you control no monsters: You can Special Summon this card from your hand. This card cannot be Tributed, except for the Tribute Summon of a "Steelswarm" monster, and cannot be used as a Synchro Material Monster.
et: Kui sul pole kontrolli all ühtegi koletist: Sa saad selle kaardi oma käest eriliselt kutsuda. Seda kaarti ei saa ohverdada, välja arvatud "Steelswarm" koletise ohverduskutsumiseks, ja seda ei saa kasutada Sünkro Materjal Koletisena.

source: Steelswarm Scout
et: Terasparve Skaud

source: If this card is in your Graveyard at the start of your Main Phase 1 and you control no Spell or Trap Cards: You can Special Summon it. During the turn you activated this effect, you cannot Special Summon any monsters. This card cannot be Tributed, except for a Tribute Summon of an "Steelswarm" monster, and cannot be used as a Synchro Material Monster.
et: Kui see kaart on sinu Hauakambris oma Peafaasi 1 alguses ja sul pole kontrolli all ühtegi Loitsu ega Lõksukaarti: Sa võid selle Eriliselt Kutsuda. Sellel käigul, mil sa aktiveerisid selle efekti, ei saa sa Eriliselt Kutsuda ühtegi koletist. Seda kaarti ei saa ohverdada, välja arvatud "Steelswarm" koletise Ohverduskutsumiseks, ja seda ei saa kasutada Sünkromaterjalina.

source: Steelswarm Gatekeeper
et: Terassülemiväravavaht

source: While this card is face-up on the field, during a turn when a "Steelswarm" monster is Tribute Summoned, you can Normal Summon 1 additional time this turn.
et: Kui see kaart on lahinguväljal avatud, siis pöördel, mil "Steelswarm" koletis on ohverdatud, saad sellel pöördel veel ühe korra tavaliselt kutsuda.

source: Steelswarm Caller
et: Terassülemikutsuja
