Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: The Lady in Wight
et: Valge Daam

source: Face-up Level 3 or lower Zombie-Type monsters you control, except1 "<M7611>The Lady in Wight<M>", cannot be destroyed by battle and are unaffected by the effects of Spell and Trap Cards. This card's name is treated as "<M4030>Skull Servent<M>" while it is in the Graveyard.
et: Avatud positsioonis 3. taseme või madalama taseme Zombi-tüüpi koletised, mida sa kontrollid, välja arvatud1 "<M7611>The Lady in Wight<M>", ei saa lahingus hävitatud ja neid ei mõjuta Loitsu- ja Lõksukaartide efektid. Selle kaardi nimeks loetakse "<M4030>Skull Servent<M>" kui see on Hauas.

source: Simorgh, Bird of Ancestry
et: Simorgh, Esivanemate Lind

source: Both players Tribute Summon WIND monsters with 1 less Tribute than required. If you Tribute Summon this card by Tributing only WIND monsters, return up to 2 cards your opponent controls to their owner's hand. This card is treated as a Normal Monster while in your hand.
et: Mõlemad mängijad kutsuvad välja WIND koletisi ühe ohvri võrra vähem kui nõutud. Kui sa kutsud selle kaardi välja ohverdades ainult WIND koletisi, siis tagasta kuni 2 kaarti, mida sinu vastane kontrollib, nende omaniku kätte. Seda kaarti käsitletakse tavalise koletisena, kui see on sinu käes.

source: Cloudian - Storm Dragon
et: Pilveke - Tormadraakon

source: This card cannot be Normal Summoned or Set. This card can only be Special Summoned by removing from play 1 "Cloudian" monster from your Graveyard. This card cannot be destroyed by battle. If this card is in face-up Defense Position, destroy it. Once per turn, you can place 1 Fog Counter on 1 monster on the field.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti saab eriliselt kutsuda ainult eemaldades mängust 1 "Cloudian" koletise oma hauakambrist. Seda kaarti ei saa lahingus hävitada. Kui see kaart on avatud kaitsepositsioonis, hävita see. Kord ühe käigu jooksul saad asetada 1 udu loenduri ühele koletisele väljakul.

source: Phantom Dragon
et: Fantoomdraakon

source: When your opponent Special Summons a monster, you can Special Summon this card from your hand. 2 of your Monster Card Zones cannot be used.
et: Kui sinu vastane kutsub erikutsumisega välja koletise, saad selle kaardi oma käest erikutsumisega välja kutsuda. 2 sinu koletise kaardi tsooni ei saa kasutada.

source: Destiny End Dragoon
et: Saatuselõpu Dragoon

source: "<M7096>Destiny HERO - Plasma<M>" + "<M6757>Destiny Hero - Dogma<M>"<BR>A Fusion Summon of this card can only be done with the above Fusion Material Monsters. Once per turn: You can target 1 monster your opponent controls; destroy that target and inflict damage to your opponent equal to its ATK on the field. You cannot conduct your Battle Phase the turn you activate this effect. During your Standby Phase, if this card is in your Graveyard: You can banish 1 "Destiny HERO" card from your Graveyard; Special Summon this card.
et: "<M7096>Saatuskangel - Plasma<M>" + "<M6757>Saatuskangel - Dogma<M>"<BR>Selle kaardi sulandumise kutse saab teha ainult ülaltoodud sulandumismaterjalidega. Kord ühe käigu jooksul: Sa võid sihtida 1 koletist, mida su vastane kontrollib; hävita see sihtmärk ja tekita oma vastasele kahju, mis on võrdne selle ATK-ga väljakul. Sa ei saa läbi viia oma lahingufaasi sellel käigul, mil aktiveerid selle efekti. Oma ooteetapi ajal, kui see kaart on sinu hauas: Sa võid pagendada 1 "Saatuskangel" kaardi oma hauast; Kutsu see kaart eriliselt välja.

source: Ultimate Ancient Gear Golem
et: Ülim Vana Käigu Koloss

source: "<M6315>Ancient Gear Golem<M>" + 2 "Ancient Gear" monsters<BR>This card cannot be Special Summoned except by Fusion Summon. During battle between this attacking card and a Defense Position monster whose DEF is lower than the ATK of this card, inflict the difference as Battle Damage to your opponent. If this card attacks, your opponent cannot activate Spell or Trap Cards until the end of the Damage Step. If this card is destroyed, you can Special Summon 1 "<M6315>Ancient Gear Golem<M>" from your Graveyard, ignoring the Summoning conditions.
et: "<M6315>Muinasvarustuse Koljat<M>" + 2 "Muinasvarustuse" koletist<BR>Seda kaarti ei saa Erikutsega välja kutsuda, välja arvatud Sulandumiskutsega. Lahingu ajal selle ründava kaardi ja Kaitseasendis koletise vahel, mille DEF on madalam kui selle kaardi ATK, tekitage vahe vastasele Lahingukahjuna. Kui see kaart ründab, ei saa teie vastane aktiveerida Loitsu ega Lõksukaarti kuni Kahjustusetapi lõpuni. Kui see kaart hävitatakse, saate Erikutsega välja kutsuda 1 "<M6315>Muinasvarustuse Koljat<M>" oma Hauakambrist, eirates kutsumise tingimusi.

source: Gladiator Beast Gyzarus
et: Gladiaatorikutsar Gyzarus

source: "<M7285>Gladiator Beast Bestiari<M>" + 1 "Gladiator Beast" monster<BR>This card can only be Special Summoned from your Extra Deck by returning the above cards you control to the Deck. (You do not use "<M4837>Polymerization<M>".) When this card is Special Summoned, you can destroy up to 2 cards on the field. At the end of the Battle Phase, if this card attacked or was attacked, you can return this card to the Extra Deck to Special Summon 2 "Gladiator Beast" monsters from your Deck, except1 "<M7285>Gladiator Beast Bestiari<M>".
et: "<M7285>Gladiaatoribeast Bestiari<M>" + 1 "Gladiaatoribeast" koletis<BR>Seda kaarti saab erikutsuda oma lisapakist, tagastades ülaltoodud kaardid, mida kontrollid, pakki. (Sa ei kasuta "<M4837>Polümerisatsioon<M>".) Kui see kaart on erikutsutud, saad hävitada kuni 2 kaarti väljal. Lahingufaasi lõpus, kui see kaart ründas või teda rünnati, saad selle kaardi tagastada lisapakki, et erikutsuda 2 "Gladiaatoribeast" koletist oma pakist, välja arvatud1 "<M7285>Gladiaatoribeast Bestiari<M>".

source: Hero Mask
et: Kangelase Mask

source: Target 1 face-up monster you control; send 11 "Elemental HERO" monster from your Deck to the Graveyard, then that target's name becomes the sent monster's name, until the End Phase.
et: Vali 1 avatud näoga koletis, mida sa kontrollid; saada 11 "Elemental HERO" koletist oma pakist hauakambrisse, siis selle sihtmärgi nimi muutub saadetud koletise nimeks kuni lõppfaasini.

source: Space Gift
et: Kosmose Kingitus

source: Draw 1 card for each different "Neo-Spacian" name on the monsters you control.
et: Tõmba 1 kaart iga erineva "Neo-Spacian" nimega koletise kohta, mida sa kontrollid.

source: Demise of the Land
et: Maa hukatus

source: Activate this card when your opponent Special Summons a monster. Select 1 Field Spell Card from your Deck and activate it.
et: Aktiveeri see kaart, kui su vastane kutsub eriliselt välja koletise. Vali oma pakist 1 väljaloitsu kaart ja aktiveeri see.

source: D - Formation
et: D - Formatsioon

source: Each time a face-up "Destiny HERO" monster(s) you control is destroyed, place 1 D Counter on this card for each of those monsters. When you Normal or Special Summon a monster during your Main Phase: You can send this card with 2 or more D Counters to the Graveyard; add up to 2 cards from your Deck and/or Graveyard to your hand, with the same name as that monster.
et: Iga kord, kui sinu kontrolli all olev "Destiny HERO" näokaardiga koletis(ed) hävitatakse, aseta sellele kaardile 1 D-loendur iga sellise koletise kohta. Kui sa kutsud oma põhifaasis koletise normaalselt või eriliselt välja: Sa võid saata selle kaardi, millel on 2 või rohkem D-loendurit, hauakambrisse; lisa oma pakist ja/või hauakambrist kuni 2 kaarti oma kätte, millel on sama nimi kui sellel koletisel.

source: Spell Gear
et: Loitsuratas

source: Send 3 face-up "Ancient Gear" cards you control to the Graveyard. You can Special Summon up to 1 "<M6315>Ancient Gear Golem<M>" from your hand and 1 from your Deck, ignoring the Summoning Conditions. Then, destroy all monsters you control except "<M6315>Ancient Gear Golem<M>". You cannot Normal Summon or Set until the end of your next turn.
et: Saada 3 avatud "Ancient Gear" kaarti, mida sa kontrollid, Hauakambrisse. Sa saad Kutsuda Eriliselt kuni 1 "<M6315>Ancient Gear Golem<M>" oma käest ja 1 oma Pakist, eirates Kutsumise Tingimusi. Seejärel hävita kõik koletised, mida sa kontrollid, välja arvatud "<M6315>Ancient Gear Golem<M>". Sa ei saa Tavaliselt Kutsuda ega Paigutada kuni oma järgmise käigu lõpuni.

source: Cup of Ace
et: Ässa karikas

source: Toss a coin.<BR>● Heads: Draw 2 cards.<BR>● Tails: Your opponent draws 2 cards.
et: Viska münti.<BR>● Kull: Tõmba 2 kaarti.<BR>● Kiri: Sinu vastane tõmbab 2 kaarti.

source: Light Barrier
et: Valguse Barjäär

source: During your Standby Phase, toss a coin. If the result is Tails, the following effects are negated until your next Standby Phase:<BR>● When you Summon an "Arcana Force" monster, choose which effect to apply without tossing a coin. If an "Arcana Force" monster destroys an opponent's monster by battle, you gain Life Points equal to the destroyed monster's original ATK.
et: Oma Standby Phase'i ajal viska münti. Kui tulemus on kull, siis järgmised efektid tühistatakse kuni sinu järgmise Standby Phase'ini:<BR>● Kui sa kutsud välja "Arcana Force" koletise, vali, millist efekti rakendada, ilma münti viskamata. Kui "Arcana Force" koletis hävitab lahingus vastase koletise, saad Sa elu punkte, mis on võrdne hävitatud koletise algse rünnakuga.

source: Solar Recharge
et: Päikese Laadimine

source: Discard 1 "Lightsworn" monster. Draw 2 cards, then send the top 2 cards of your Deck to the Graveyard.
et: Viska 1 "Lightsworn" koletis. Tõmba 2 kaarti, seejärel saada oma paki 2 ülemist kaarti hauakambrisse.

source: Realm of Light
et: Valguse Kuningriik

source: Each time a card(s) is sent from your Deck to the Graveyard, place 1 Shine Counter on this card. All "Lightsworn" monsters gain 100 ATK for each Shine Counter. If this card would be destroyed by a card effect, remove 2 Shine Counters instead.
et: Iga kord, kui kaart või kaardid saadetakse sinu pakist hauakambrisse, pane sellele kaardile 1 Sära Loendur. Kõik "Valgusevande" koletised saavad iga Sära Loenduri eest 100 ATK juurde. Kui see kaart hävitatakse kaardi efekti tõttu, eemalda selle asemel 2 Sära Loendurit.

source: Wetlands
et: Märgalad

source: All Aqua-Type/WATER/Level 2 or lower monsters gain 1200 ATK.
et: Kõik Aqua-tüüpi/VESI/Tase 2 või madalamad koletised saavad 1200 ATK juurde.

source: Quick Charger
et: Kiirlaadija

source: Add 2 Level 4 or lower "Batteryman" monsters from your Graveyard to your hand.
et: Lisa oma käest 2. taseme või madalama tasemega "Batteryman" koletised oma kalmistult oma kätte.

source: Short Circuit
et: Lühis

source: Activate only if you control 3 or more face-up "Batteryman" monsters. Destroy all cards your opponent controls.
et: Aktiveeri ainult siis, kui sul on kontrolli all 3 või enam avatud "Batteryman" koletist. Hävita kõik kaardid, mida su vastane kontrollib.

source: Light of Redemption
et: Lunastuse Valgus

source: Pay 800 Life Points to target 1 of your banished LIGHT monsters; add that target to your hand.
et: Makske 800 Elupunkti, et valida 1 oma eemaldatud VALGUSE koletist; lisa see sihtmärk oma kätte.

source: Mystical Cards of Light
et: Müstilised Valguse Kaardid

source: You cannot use 1 of your Spell & Trap Card Zones. During your Draw Phase, if you control another1 "<M7631>Mystical Cards of Light<M>" face-up on the field, you can draw 2 cards instead of 1 for your normal draw.
et: Sa ei saa kasutada ühte oma Võlu- ja Lõksukaartide tsooni. Oma Tõmbefaasis, kui sul on väljakul teine "<M7631>Mystical Cards of Light<M>" avatud, võid oma tavapärase tõmbamise asemel tõmmata 2 kaarti.

source: Level Tuning
et: Taseme Häälestamine

source: Reduce the Level of all face-up monsters you control by 1 until the End Phase.
et: Vähenda kõigi sinu kontrolli all olevate avatud koletiste taset 1 võrra kuni lõppfaasini.

source: Deck Lockdown
et: Paki lukustus

source: Neither player can add cards to their hand except by drawing, and cannot Special Summon Monster Cards from the Deck. Destroy this card during your 2nd Standby Phase after activation.
et: Kumbki ei saa lisada kaarte oma kätte, välja arvatud tõmbamise teel, ja ei saa eriliselt kutsuda koletiskaarte pakist. Hävita see kaart oma teise ootejärgu faasi ajal pärast aktiveerimist.

source: Ribbon of Rebirth
et: Ümberkehastumise Pael

source: If the equipped monster is destroyed by battle and sent to the Graveyard, Special Summon it to your side of the field during the End Phase.
et: Kui varustatud koletis hävitatakse lahingus ja saadetakse Hauakambrisse, kutsu see End Phase'i ajal oma väljaku poolele eriliselt välja.

source: Golden Bamboo Sword
et: Kuldne Bambusmõõk

source: Activate only if you control a "Bamboo Sword" Equip Spell Card. Draw 2 cards.
et: Aktiveeri ainult siis, kui kontrollid "Bamboo Sword" Varustuse Võlusõna Kaarti. Tõmba 2 kaarti.

source: Limit Reverse
et: Piirangutagastus

source: Target 1 monster with 1000 or less ATK in your Graveyard; Special Summon it in Attack Position. If the target is changed to Defense Position, destroy it and this card. When this card leaves the field, destroy the target. When the target is destroyed, destroy this card.
et: Vali 1 koletis, millel on sinu Hauas 1000 või vähem ATK; Kutsu see erilises rünnakupositsioonis välja. Kui sihtmärk muudetakse kaitsepositsiooniks, hävita see ja see kaart. Kui see kaart lahkub väljakult, hävita sihtmärk. Kui sihtmärk hävitatakse, hävita see kaart.

source: Hero Blast
et: Kangelase Plahvatus

source: Target 1 "Elemental HERO" Normal Monster in your Graveyard; add it to your hand, then destroy 1 face-up monster your opponent controls with ATK less than or equal to the target's ATK.
et: Vali 1 "Elemental HERO" tavaline koletis oma kalmistul; lisa see oma kätte, seejärel hävita 1 vastase avatud koletis, mille ATK on väiksem või võrdne sihtmärgi ATK-ga.

source: Rainbow Gravity
et: Vikerkaare Gravitatsioon

source: If you have 7 "Crystal Beast" cards with different names on the field or in your Graveyard: Special Summon 1 "<M7171>Rainbow Dragon<M>" or "<M7406>Rainbow Dark Dragon<M>" from your Deck or Graveyard, ignoring the Summoning conditions.
et: Kui sul on väljakul või oma Hauakambris 7 erineva nimega "Kristallkoletise" kaarti: Kutsu eriliselt välja 1 "<M7171>Vikerkaaredraakon<M>" või "<M7406>Vikerkaarepime draakon<M>" oma Pakist või Hauakambrist, eirates kutsumise tingimusi.

source: D - Fortune
et: D - Õnn

source: When your opponent declares a direct attack: Banish 1 "Destiny HERO" monster from your Graveyard; end the Battle Phase.
et: Kui sinu vastane kuulutab välja otsese rünnaku: Kõrvalda oma kalmistult mängust 1 "Destiny HERO" koletis; lõpeta Lahingufaas.

source: Reversal of Fate
et: Saatuse pöördumine

source: Select 1 "Arcana Force" monster you control. That monster's effect is now treated as the opposite coin toss result.
et: Vali 1 "Arcana Force" koletis, mida sa kontrollid. Selle koletise efekt loetakse nüüd vastupidiseks mündiviske tulemuseks.

source: Tour of Doom
et: Hukatusretk

source: During your opponent's Standby Phase, toss a coin.<BR>● Heads: Your opponent cannot Normal Summon or Flip Summon until the End Phase.<BR>● Tails: You cannot Normal Summon or Flip Summon during your next turn.
et: Oma vastase Ootefaasil viska münti.<BR>● Kull: Sinu vastane ei saa Normaalkutsuda ega Pöördkutsuda kuni Lõppfaasini.<BR>● Kiri: Sina ei saa oma järgmisel käigul Normaalkutsuda ega Pöördkutsuda.

source: Arcana Call
et: Arkaana Kutse

source: Select 1 "Arcana Force" monster you control. Remove from play 1 "Arcana Force" monster from either player's Graveyard. Until the End Phase, the selected monster's effect becomes the removed monster's effect for the same coin toss result.
et: Vali 1 "Arcana Force" koletis, mida sa kontrollid. Eemalda mängust 1 "Arcana Force" koletis kas enda või vastase kalmistult. Kuni lõppfaasini muutub valitud koletise efekt eemaldatud koletise efektiks sama mündiviske tulemuse korral.

source: Light Spiral
et: Valguse Spiraal

source: Each time a card(s) is sent from your Deck to the Graveyard by the effect of a "Lightsworn" monster, remove from play the top card of your opponent's Deck.
et: Iga kord, kui "Lightsworn" koletise efekti tõttu saadetakse kaart või kaardid sinu pakist hauakambrisse, eemalda mängust oma vastase paki ülemine kaart.

source: Glorious Illusion
et: Hiilgav Illusioon

source: Select 1 "Lightsworn" monster from your Graveyard and Special Summon it in Attack Position. During each of your End Phase, send the top 2 cards of your Deck to the Graveyard. When this card is removed from the field, destroy that monster. When that monster is removed from the field, destroy this card.
et: Vali 1 "Lightsworn" koletis oma Hauakambrist ja Kutsu see Eriliselt Välja Rünnakupositsioonis. Iga oma Lõppfaasi ajal saada oma Paki ülemised 2 kaarti Hauakambrisse. Kui see kaart eemaldatakse väljakult, hävita see koletis. Kui see koletis eemaldatakse väljakult, hävita see kaart.

source: Destruction Jammer
et: Hävituse Summutaja

source: Discard 1 card. Negate the activation of a Spell Card, Trap Card, or Effect Monster's effect that destroys a monster(s) on the field, and destroy that card.
et: Viska 1 kaart. Tühista Väljaloitsu, Lõksukaardi või Efektkoletise efekti aktiveerimine, mis hävitab väljal oleva(te) koletise(te), ja hävita see kaart.

source: Froggy Forcefield
et: Konnapõld

source: Activate only when a face-up "Frog" monster you control, except "<M4555>Frog the Jam<M>", is selected as an attack target. Destroy all Attack Position monsters your opponent controls.
et: Aktiveeri ainult siis, kui sinu kontrollitav avatud "Konna" koletis, välja arvatud "<M4555>Frog the Jam<M>", valitakse rünnaku sihtmärgiks. Hävita kõik vastase kontrollitavad Rünnakupositsioonis koletised.

source: Portable Battery Pack
et: Kaasaskantav akupank

source: Select 2 "Batteryman" monsters from your Graveyard and Special Summon them in Attack Position. When this card is removed from the field, destroy those monsters. When both of those monsters have been removed from the field, destroy this card.
et: Vali oma kalmistult 2 "Batteryman" koletist ja kutsu nad eriliselt välja rünnakupositsioonis. Kui see kaart eemaldatakse väljakult, hävita need koletised. Kui mõlemad need koletised on väljakult eemaldatud, hävita see kaart.

source: Gladiator Lash
et: Gladiaatori Piits

source: Activate only when you Special Summon a "Gladiator Beast" monster. Your opponent discards 1 card of their choice.
et: Aktiveeri ainult siis, kui sa kutsud eriliselt välja "Gladiaatoribeast" koletise. Sinu vastane viskab oma valikul ühe kaardi ära.

source: Raging Cloudian
et: Raev Pilveke

source: Activate only when a "Cloudian" monster(s) you control is destroyed by its own effect and sent to the Graveyard. Special Summon 1 of those monsters from your Graveyard in Attack Position and place 1 Fog Counter on it. It cannot be changed to Defense Position by a card effect.
et: Aktiveeri ainult siis, kui sinu kontrollitav "Cloudian" koletis(ed) hävitatakse omaenda efekti tõttu ja saadetakse Hauakambrisse. Kutsu eriliselt esile 1 neist koletistest oma Hauakambrist Rünnakupositsioonis ja aseta sellele 1 Udu Loendur. Seda ei saa kaardiefekti tõttu Kaitsepositsiooni muuta.

source: Sanguine Swamp
et: Veripunane Soo

source: If you control any other Spell or Trap Cards, destroy this card. Face-down Spell and Trap Cards cannot be activated. Destroy this card during your 2nd Standby Phase after activation.
et: Kui sa kontrollid mõnda teist Loitsu või Lõksukaarti, hävita see kaart. Näoga allapoole olevad Loitsu ja Lõksukaardid ei saa aktiveeruda. Hävita see kaart oma teise Ootefaasiga pärast aktiveerimist.

source: Lucky Chance
et: Õnnelik Võimalus

source: When an Effect Monster's effect that requires only 1 coin toss is activated, call Heads or Tails. If you call it right, draw 1 card.
et: Kui aktiveeritakse Efektikoletise efekt, mis nõuab ainult ühte mündiviset, vali Kull või Kirss. Kui arvad õigesti, tõmba 1 kaart.

source: Summon Limit
et: Kutsumiste piirang

source: Neither player can Summon more than two times per turn.
et: Kumbki mängija ei saa kutsuda rohkem kui kaks korda käigu jooksul.

source: Dice Try!
et: Täringu katse!

source: Negate the activation of an opponent's Spell Card, Trap Card or Effect Monster's effect that requires a die roll, and destroy that card.
et: Tühista vastase Võlukaardi, Lõksukaardi või Efektkoletise efekti aktiveerimine, mis nõuab täringuviset, ja hävita see kaart.

source: Emperor Sem
et: Keiser Sem

source: Each time you Tribute Summon a monster, each player can select 1 card from their Graveyard and return it to the top of their Deck.
et: Iga kord, kui sa ohverdussummonid koletise, võib iga mängija valida ühe kaardi oma Hauakambrist ja tagastada selle oma Paki tippu.

source: Kuraz the Light Monarch
et: Valgusemonarh Kuraz

source: When this card is Normal or Special Summoned, you can destroy up to 2 cards on the field. For each card destroyed, that card's controller draws 1 card. This card cannot attack during the turn it is Normal or Special Summoned.
et: Kui see kaart on Normaal- või Erikutsutud, võid hävitada kuni 2 kaarti väljakul. Iga hävitatud kaardi eest tõmbab selle kaardi kontrollija 1 kaardi. See kaart ei saa rünnata sellel käigul, mil see on Normaal- või Erikutsutud.

source: Maiden of Macabre
et: Õuduse Neitsi

source: Each time this card destroys a monster by battle, place 1 Spell Counter on this card. This card gains 200 ATK for every Spell Counter on it.
et: Iga kord, kui see kaart hävitab lahingus koletise, pane sellele kaardile 1 loitsuloendur. See kaart saab iga loitsuloenduri eest 200 ATK juurde.

source: During either player's turn, you can discard this card to make any effect damage you take this turn 0.
et: Mõlema mängija käigu ajal saad selle kaardi ära visata, et muuta selle käigu jooksul saadav efektikahju 0-ks.

source: Nimble Musasabi
et: Nobe Musasabi

source: When this card is destroyed by battle and sent to the Graveyard, inflict 500 damage to your opponent. You can also Special Summon up to 21 "<M7662>Nimble Musasabi<M>"s from your Deck to your opponent's side of the field in face-up Attack Position. This card cannot be Tributed for a Tribute Summon.
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse, põhjusta oma vastasele 500 kahju. Sa võid ka eriliselt kutsuda kuni 21 "<M7662>Nimble Musasabi<M>" oma paki seest vastase väljaku poolele rünnakupositsioonis. Seda kaarti ei saa kasutada ohverdusena ohverduskutsumiseks.

source: Oyster Meister
et: Austermeister

source: When this card is sent from the field to the Graveyard, except when destroyed by battle, Special Summon 1 "<M3944>Oyster Token<M>" (Fish-Type/WATER/Level 1/ATK 0/DEF 0).
et: Kui see kaart saadetakse väljakult hauakambrisse, välja arvatud lahingus hävitamise korral, kutsu eriliselt esile 1 "<M3944>Oyster Token<M>" (Kalaliik/VESI/Tase 1/ATK 0/DEF 0).

source: Dharc the Dark Charmer
et: Dharc, Pime Võlur

source: FLIP: Take control of 1 DARK monster your opponent controls, while this card remains face-up on the field.
et: FLIP: Võta kontroll 1 PIMEDA koletise üle, mida sinu vastane kontrollib, kuni see kaart jääb lahinguväljale avatud olekusse.

source: Gigantic Cephalotus
et: Hiiglaslik Tsefalotus

source: This card gains 200 ATK each time a Plant-Type monster is sent from the field to the Graveyard.
et: See kaart saab 200 ATK iga kord, kui Taimetüüpi koletis saadetakse väljakult Hauakambrisse.

source: Nettles
et: Nõgesed

source: If this face-up card would be destroyed, you can destroy 1 face-up Plant-Type monster you control instead.
et: Kui see avatud kaart hävitatakse, võid selle asemel hävitada 1 avatud Taimetüüpi koletis, mida sa kontrollid.

source: Queen of Thorns
et: Okaste Kuninganna
