Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: You can Tribute Summon this card in Attack Position by Tributing 1 Zombie-Type monster. When this card destroys a Zombie-Type monster by battle and sends it to the Graveyard, you can Special Summon that monster to your side of the field.
et: Sa saad selle kaardi rünnakupositsioonis ohverdussummonida, ohverdades 1 zombitüüpi koletise. Kui see kaart hävitab lahingus zombitüüpi koletise ja saadab selle hauakambrisse, saad selle koletise oma väljaku poolele erisummonida.

source: Malevolent Mech - Goku En
et: Paha Mehhik - Goku En

source: You can Normal Summon this card without Tributing. If you do, this card is sent to the Graveyard during the End Phase if it is the only Zombie-Type monster on the field. When it is sent to the Graveyard by this effect, you take damage equal to its ATK.
et: Seda kaarti saab Normaal-Kutsuda ilma ohverdusteta. Kui teete seda, saadetakse see kaart End Phase'i ajal Hauakambrisse, kui see on ainus Zombi-Tüüpi koletis väljakul. Kui see saadetakse selle efekti tõttu Hauakambrisse, saate kahju, mis on võrdne selle ATK-ga.

source: Paladin of the Cursed Dragon
et: Neetud Draakoni Paladiin

source: Once per turn, you can Special Summon 1 Level 4 or lower Zombie-Type monster that was destroyed by battle from your opponent's Graveyard to your side of the field.
et: Korra ühe korra käigu jooksul saad sa eriliselt kutsuda 1 taseme 4 või madalama zombitüüpi koletise, mis hävitati lahingus, oma vastase hauakambrist oma väljaku poolele.

source: Zombie World
et: Zombimaailm

source: All monsters on the field and in any Graveyard become Zombie-Type monsters. Neither player can Tribute Summon monsters, except Zombie-Type monsters.
et: Kõik koletised väljakul ja mis tahes hauakambris muutuvad zombitüüpi koletisteks. Kumbki mängija ei saa ohverdada koletisi, välja arvatud zombitüüpi koletised.

source: Imperial Iron Wall
et: Imperaatorlik Raudsein

source: Cards cannot be removed from play.
et: Kaarte ei saa mängust eemaldada.

source: Avenging Knight Parshath
et: Kättemaksu Rüütel Parshath

source: 1 Tuner + 1 or more non-Tuner LIGHT monsters<BR>Once per turn, you can change the battle position of 1 face-up monster your opponent controls. If this card attacks a Defense Position monster, inflict Piercing Battle Damage to your opponent.
et: 1 Tuner + 1 või rohkem mitte-Tuner VALGUS koletist<BR>Korra käigu jooksul saad muuta ühe vastase kontrollitava avatud koletise lahinguasendit. Kui see kaart ründab kaitseasendis koletist, põhjusta vastasele läbistavat lahingukahju.

source: Counselor Lily
et: Nõustaja Lily

source: When this card is sent to the Graveyard for a Synchro Summon, you can pay 500 Life Points to have that Synchro Monster gain 1000 ATK until the End Phase.
et: Kui see kaart saadetakse Sünkrosummoni jaoks Hauakambrisse, võid maksta 500 Elupunkti, et see Sünkromonster saaks 1000 ATK kuni Lõppfaasini.

source: Grapple Blocker
et: Haardusblokeerija

source: When this card is Normal Summoned, you can select 1 monster your opponent controls. The selected monster cannot attack or be Tributed, while this card remains face-up on the field. During each of your End Phases, pay 500 Life Points or destroy this card.
et: Kui see kaart on Normaal-Kutsutud, saad valida 1 koletise, mida sinu vastane kontrollib. Valitud koletis ei saa rünnata ega olla ohverdatud, kuni see kaart jääb väljale avatud olekusse. Iga sinu lõppfaasi ajal maksa 500 Elupunkti või hävita see kaart.

source: Telekinetic Charging Cell
et: Telekineetiline Laadimisrakk

source: Equip only to a Psychic-Type monster. You do not have to pay Life Points to activate its effect(s). When the equipped monster is destroyed and this card is sent to the Graveyard you can pay 1000 Life Points to return this card to your hand.
et: Varusta ainult Psüühika-tüüpi koletisele. Sa ei pea maksma Elupunkte, et aktiveerida selle mõju(d). Kui varustatud koletis hävitatakse ja see kaart saadetakse Hauakambrisse, võid maksta 1000 Elupunkti, et see kaart oma kätte tagasi tuua.

source: Charge of the Light Brigade
et: Valgusebrigaadi rünnak

source: Send the top 3 cards of your Deck to the Graveyard. Add 1 Level 4 or lower "Lightsworn" monster from your Deck to your hand.
et: Saada oma pakist kolm ülemist kaarti hauakambrisse. Lisa oma pakist üks 4. taseme või madalam "Lightsworn" koletis oma kätte.

source: Healing Wave Generator
et: Tervendav Lainegeneraator

source: Once per turn, you can select another face-up monster you control to gain Life Points equal to that monster's Level x 100.
et: Korra ühe käigu jooksul saad valida teise avatud koletise, mida sa kontrollid, et saada Elupunkte, mis on võrdne selle koletise tasemega x 100.

source: Turbo Synchron
et: Turbo Sünkron

source: When this card declares an attack, you can change the attack target to Defense Position. When you take Battle Damage while this card is attacking, you can Special Summon 1 monster from your hand with ATK equal to or less than the Battle Damage you took.
et: Kui see kaart kuulutab välja rünnaku, saad rünnaku sihtmärgi muuta kaitsepositsiooniks. Kui sa saad lahingukahju, kui see kaart ründab, saad eriliselt kutsuda 1 koletise oma käest, mille ATK on võrdne või väiksem saadud lahingukahjust.

source: Mad Archfiend
et: Hullumeelne Deemon

source: During battle between this attacking card and a Defense Position monster whose DEF is lower than the ATK of this card, inflict the difference as Battle Damage to your opponent. When this face-up Attack Position monster is selected as an attack target, change it to Defense Position.
et: Kui selle ründava kaardi ja kaitseasendis oleva koletise, mille DEF on madalam kui selle kaardi ATK, vahel toimub lahing, põhjusta vahe vastasele Lahingukahjuna. Kui see ülespoole suunatud ründeasendis koletis valitakse rünnaku sihtmärgiks, muuda see kaitseasendisse.

source: Wall of Ivy
et: <translated Luuderohi

source: FLIP: Special Summon 1 "<M3946>Ivy Token<M>" (Plant-Type/EARTH/Level 1/ATK 0/DEF 0) in Defense Position to your opponent's side of the field. When this Token is destroyed, its controller takes 300 damage.
et: FLIP: Kutsu erivälja 1 "<M3946>Ivy Token<M>" (Taim-Tüüp/MAA/Tase 1/ATK 0/DEF 0) kaitsepositsioonis oma vastase väljale. Kui see Token hävitatakse, saab selle kontrollija 300 kahju.

source: Copy Plant
et: Kopeerimistaim

source: Once per turn, you can select 1 face-up Plant-Type monster on the field to have this card's Level become equal to the selected monster's Level, until the End Phase.
et: Korra ühe käigu jooksul saad valida ühe avatud Taimetüüpi koletise väljakul, et selle kaardi tase muutuks valitud koletise tasemega võrdseks kuni lõppfaasini.

source: Morphtronic Celfon
et: Morfotronik Celfon

source: ● While in Attack Position: Once per turn, you can roll a six-sided die. Reveal cards from the top of your Deck equal to the roll and Special Summon 1 Level 4 or lower "Morphtronic" monster from among them, ignoring the Summoning conditions. Shuffle the rest into the Deck.<BR>● While in Defense Position: Once per turn, you can roll a six-sided die. Look at cards from the top of your Deck equal to the roll, then return them in the same order.
et: ● Rünnakupositsioonil olles: Kord ühe käigu jooksul võid veeretada kuuepoolset täringut. Paljasta oma pakist täringuveeretuse tulemusele vastav arv kaarte ja kutsu eriliselt välja 1 tase 4 või madalam "Morphtronic" koletis nende seast, eirates kutsumise tingimusi. Sega ülejäänud kaardid tagasi pakki.<BR>● Kaitsepositsioonil olles: Kord ühe käigu jooksul võid veeretada kuuepoolset täringut. Vaata oma pakist täringuveeretuse tulemusele vastav arv kaarte, seejärel pane need samas järjekorras tagasi.

source: Morphtronic Magnen
et: Morftronik Magnen

source: ● While in Attack Position: If your opponent controls a face-up monster, this card can only select their highest ATK monster as an attack target.<BR>● While in Defense Position: Your opponent cannot select another monster as an attack target.
et: ● Rünnakupositsioonil olles: Kui sinu vastane kontrollib avatud koletist, saab see kaart valida rünnaku sihtmärgiks ainult nende kõrgeima ATK koletise.<BR>● Kaitsepositsioonil olles: Sinu vastane ei saa valida teist koletist rünnaku sihtmärgiks.

source: Morphtronic Datatron
et: Morftronik Datatron

source: ● While in Attack Position: Once per turn, you can Tribute 1 monster to inflict 600 damage to your opponent.<BR>● While in Defense Position: Once per turn, you can inflict 300 damage to your opponent.
et: ● Rünnakupositsioonis olles: Kord ühe käigu jooksul võid ohverdada 1 koletise, et tekitada oma vastasele 600 kahju.<BR>● Kaitsepositsioonis olles: Kord ühe käigu jooksul võid tekitada oma vastasele 300 kahju.

source: Morphtronic Boomboxen
et: Morftroniline Boomboxen

source: ● While in Attack Position: This card can attack twice during each Battle Phase.<BR>● While in Defense Position: Once per turn, when a face-up "Morphtronic" monster you control is selected as an attack target, you can negate that attack.
et: ● Ründepositsioonil olles: See kaart võib rünnata kaks korda iga Lahingufaasi jooksul.<BR>● Kaitsepositsioonil olles: Kord ühe käigu jooksul, kui sinu kontrolli all olevat avatud "Morphtronic" koletist valitakse rünnaku sihtmärgiks, võid selle rünnaku tühistada.

source: Morphtronic Cameran
et: Morftroniline Kaamera

source: ● While in Attack Position: When this card is destroyed by battle, you can Special Summon 1 Level 4 or lower "Morphtronic" monster from your hand or Graveyard, except1 "<M7878>Morphtronic Cameran<M>".<BR>● While in Defense Position: "Morphtronic" monsters on the field cannot be targeted by effects.
et: ● Rünnakupositsioonis olles: Kui see kaart hävitatakse lahingus, saad sa eriliselt kutsuda 1. taseme 4 või madalama "Morphtronic" koletise oma käest või hauast, välja arvatud "<M7878>Morphtronic Cameran<M>".<BR>● Kaitsepositsioonis olles: "Morphtronic" koletisi väljal ei saa sihtida efektidega.

source: Morphtronic Radion
et: Morftronik Radion

source: ● While in Attack Position: "Morphtronic" monsters you control gain 800 ATK.<BR>● While in Defense Position: "Morphtronic" monsters you control gain 1000 DEF.
et: ● Rünnakupositsioonil olles: "Morphtronic" koletised, mida sa kontrollid, saavad 800 ATK.<BR>● Kaitsepositsioonil olles: "Morphtronic" koletised, mida sa kontrollid, saavad 1000 DEF.

source: Morphtronic Clocken
et: Morftronik Kella

source: ● While in Attack Position: This card gains 500 ATK for each Morph Counter on it.<BR>● While in Defense Position: Once per turn, you can place 1 Morph Counter on this card. You can Tribute this card to inflict 1000 damage to your opponent for each Morph Counter on it.
et: ● Rünnakupositsioonis olles: See kaart saab iga sellel oleva Morfi loenduri eest 500 ATK juurde.<BR>● Kaitsepositsioonis olles: Kord käigu jooksul saad sellele kaardile panna 1 Morfi loenduri. Sa saad selle kaardi ohverdada, et tekitada oma vastasele 1000 kahju iga sellel oleva Morfi loenduri eest.

source: Gadget Hauler
et: Gadgeti Vedaja

source: Once per turn, you can send any number of "Morphtronic" monsters from your hand to the Graveyard to have this card gain 800 ATK for each.
et: Korra ühe käigu jooksul saad saata suvalise arvu "Morphtronic" koletisi oma käest Hauakambrisse, et see kaart saaks igaühe eest 800 ATK juurde.

source: Gadget Driver
et: Vidina Juht

source: You can send this card from your hand to the Graveyard and select any number of face-up "Morphtronic" monsters you control. Change the battle position of the selected monster(s). This effect can be activated during either player's turn.
et: Saad selle kaardi oma käest Hauakambrisse saata ja valida suvaline arv ülespööratud "Morphtronic" koletisi, mida sa kontrollid. Muuda valitud koletise(te) lahingupositsiooni. Seda efekti saab aktiveerida mõlema mängija käigu ajal.

source: Search Striker
et: Otsinguründaja

source: If this card attacks a face-down Defense Position monster, you can destroy the monster immediately with this card's effect without flipping it face-up or applying damage calculation. If you do, this card is changed to Defense Position at the end of the Battle Phase. This card's battle position cannot be changed until the end of your next turn, except with a card effect.
et: Kui see kaart ründab tagurpidi kaitseasendis olevat koletist, võid selle kaardi efektiga koletise kohe hävitada, ilma et see pööritataks üles või rakendataks kahjukalkulatsiooni. Kui teed seda, muutub see kaart lahingufaasi lõpus kaitseasendisse. Selle kaardi lahinguasendit ei saa muuta enne sinu järgmise käigu lõppu, välja arvatud kaardi efektiga.

source: Pursuit Chaser
et: Jälituskütt

source: When a Defense Position monster is destroyed by battle and sent to the Graveyard, inflict 500 damage to your opponent.
et: Kui kaitseasendis olev koletis hävitatakse lahingus ja saadetakse hauakambrisse, põhjusta oma vastasele 500 kahju.

source: Iron Chain Repairman
et: Raudkett-remontija

source: When this card destroys a monster by battle and sends it to the Graveyard, inflict 300 damage to your opponent. Once per turn, you can Special Summon 1 Level 4 or lower "Iron Chain" monster from your Graveyard, except1 "<M7885>Iron Chain Repairman<M>". This card cannot attack the turn you activate this effect.
et: Kui see kaart hävitab lahingus koletise ja saadab selle Hauakambrisse, põhjusta oma vastasele 300 kahju. Kord käigu jooksul saad Sa eriliselt kutsuda 1 taseme 4 või madalama "Iron Chain" koletise oma Hauakambrist, välja arvatud "<M7885>Iron Chain Repairman<M>". See kaart ei saa rünnata käigu jooksul, mil Sa selle efekti aktiveerid.

source: Iron Chain Snake
et: Raudkettmadu

source: During your Main Phase, you can equip this card to 1 face-up monster your opponent controls. That monster loses 800 ATK and DEF. When it is destroyed by battle and sent to the Graveyard, its controller sends cards equal to its Level from the top of their Deck to the Graveyard.
et: Oma peafaasiajal saad selle kaardi kinnitada vastase ühele avatud koletisele. See koletis kaotab 800 ATK ja DEF. Kui see hävitatakse lahingus ja saadetakse Hauakambrisse, saadab selle juht kaarte oma paki pealt Hauakambrisse, mis on võrdne selle tasemega.

source: Iron Chain Blaster
et: Raudse ahela plahvataja

source: Once per turn, you can send 1 "Iron Chain" monster you control to the Graveyard to inflict 800 damage to your opponent.
et: Korra ühe käigu jooksul võid saata 1 "Iron Chain" koletise, mida sa kontrollid, Hauakambrisse, et tekitada oma vastasele 800 kahju.

source: Iron Chain Coil
et: Raudkett Coil

source: Once per turn, you can select 1 "Iron Chain" monster you control to have it gain 300 ATK and DEF as long as this card is face-up on the field.
et: Korra ühe korra käigu jooksul saad valida ühe "Iron Chain" koletise, mida sa kontrollid, et see saaks 300 ATK ja DEF juurde, seni kuni see kaart on lahinguväljal avatud.

source: Power Injector
et: Võimu Süstija

source: Once per turn you can pay 600 Life Points to have all face-up Psychic-Type monsters gain 500 ATK during this turn.
et: Korra ühe korra käigu jooksul võid maksta 600 Elupunkti, et kõik avatud Psüühika-tüüpi koletised saaksid selle käigu jooksul 500 ATK juurde.

source: Storm Caller
et: Tormikutsuja

source: You can put your opponent's monsters that are destroyed by battle with other Psychic-Type monsters on the top of their owner's Deck instead of sending them to the Graveyard. When this card is destroyed by a card effect, this card's controller takes damage equal to its original ATK.
et: Sa saad panna oma vastase koletised, mis hävitatakse lahingus teiste Psüühika-tüüpi koletistega, nende omaniku paki peale, selle asemel et saata need Hauakambrisse. Kui see kaart hävitatakse kaardi efekti tõttu, saab selle kaardi kontrollija kahju, mis on võrdne selle algse rünnakujõuga.

source: Psychic Jumper
et: Psüühiline Hüppaja

source: Once per turn, you can pay 1000 Life Points and select 1 face-up monster your opponent controls and 1 Psychic-Type monster you control, except1 "<M7891>Psychic Jumper<M>". Switch control of those monsters. Their battle positions cannot be changed this turn, except with a card effect.
et: Korra ühe korra käigu jooksul, võid maksta 1000 Elupunkti ja valida 1 vastase kontrollitav avatud koletis ja 1 sinu kontrollitav Psüühika-tüüpi koletis, välja arvatud "<M7891>Psychic Jumper<M>". Vaheta nende koletiste kontrolli. Nende lahingupositsioone ei saa sel käigul muuta, välja arvatud kaardi efekti abil.

source: Botanical Girl
et: Botaanikatüdruk

source: When this card is sent from the field to the Graveyard, you can add 1 Plant-Type monster with 1000 or less DEF from your Deck to your hand.
et: Kui see kaart saadetakse väljakult hauakambrisse, saad lisada oma pakist oma kätte 1 taim-tüüpi koletise, mille DEF on 1000 või vähem.

source: Tytannial, Princess of Camellias
et: Tytannial, Kameeliate Printsess

source: You can Tribute 1 face-up Plant-Type monster you control to negate the activation of a card or effect that targets a card(s) on the field and destroy it.
et: Saad ohverdada 1 avatud taim-tüüpi koletis, mida sa kontrollid, et tühistada kaardi või efekti aktiveerimine, mis sihib kaarti või kaarte väljakul, ja hävitada see.

source: Fabled Raven
et: Muinasjutuline Ronk

source: Once per turn, you can discard any number of cards from your hand and increase the Level of this card by the number of discarded cards, until the End Phase. This card also gains ATK equal to the number of discarded cards × 400, until the End Phase.
et: Korra ühe käigu jooksul võid sa oma käest ära visata suvalise arvu kaarte ja suurendada selle kaardi taset ära visatud kaartide arvu võrra kuni lõppfaasini. See kaart saab ka ATK-d juurde võrdse arvuga ära visatud kaartide arv × 400 kuni lõppfaasini.

source: Comrade Swordsman of Landstar
et: Landstari mõõgamees

source: All Warrior-Type monsters you control gain 400 ATK.
et: Kõik Sõdalase-tüüpi koletised, mida sa kontrollid, saavad 400 ATK juurde.

source: Tiger Dragon
et: Tiiiger Draakon

source: If this card is Tribute Summoned by Tributing a Dragon-Type monster, you can destroy up to 2 face-down Spell or Trap Cards your opponent controls.
et: Kui see kaart kutsutakse välja loovutades Draakoni-tüüpi koletise, saad hävitada kuni 2 vastase kontrollitavat peidetud Loitsu või Lõksukaarti.

source: Turbo Warrior
et: Turbo Sõdalane

source: "<M7870>Turbo Synchron<M>" + 1 or more non-Tuner monsters<BR>When this card attacks a Level 6 or higher Synchro Monster, halve the monster's ATK until the end of the Damage Step. This card cannot be targeted by the effects of Level 6 or lower monsters.
et: "<M7870>Turbo Synchron<M>" + 1 või rohkem mittehäälestuskoletist<BR>Kui see kaart ründab 6. või kõrgema taseme sünkroonkoletist, vähenda koletise ATK poole võrra kuni Kahjustuse Sammuni. Seda kaarti ei saa sihtida 6. või madalama taseme koletiste efektid.

source: Black Rose Dragon
et: Must Roosi Draakon

source: 1 Tuner + 1 or more non-Tuner monsters<BR>When this card is Synchro Summoned, you can destroy all cards on the field. Once per turn, you can remove from play 1 Plant-Type monster from your Graveyard to change 1 Defense Position monster your opponent controls to face-up Attack Position, and reduce its ATK to 0 until the End Phase.
et: 1 Tuner + 1 või rohkem mitte-Tuner koletist<BR>Kui see kaart on Sünkrosummonitud, saad hävitada kõik kaardid väljal. Kord käigu jooksul saad eemaldada oma Hauakambrist mängust 1 Taimetüüpi koletise, et muuta 1 kaitseasendis olev vastase koletis ründeseisundisse ja vähendada selle rünnakupunktid 0-ni kuni lõppfaasini.

source: Iron Chain Dragon
et: Raudkett-draakon

source: 1 Tuner + 1 or more non-Tuner monsters<BR>You can remove from play all "Iron Chain" monsters from your Graveyard to have this card gain 200 ATK for each card removed, until the End Phase. When this card inflicts Battle Damage to your opponent, send the top 3 cards of your opponent's Deck to the Graveyard.
et: 1 Tuner + 1 või rohkem mitte-Tuner koletist<BR>Sa võid eemaldada mängust kõik "Iron Chain" koletised oma Hauakambrist, et see kaart saaks iga eemaldatud kaardi eest 200 ATK juurde kuni End Phase'ini. Kui see kaart tekitab lahingukahju sinu vastasele, saada oma vastase paki 3 ülemist kaarti Hauakambrisse.

source: Psychic Lifetrancer
et: Psüühiline Eluülekandja

source: 1 Tuner + 1 or more non-Tuner monsters<BR>Once per turn, you can remove from play 1 Psychic-Type monster from your Graveyard to gain 1200 Life Points.
et: 1 Tuner + 1 või rohkem mitte-Tuner koletist<BR>Kord käigu jooksul saad eemaldada oma Hauakambrist mängust 1 Psüühika-tüüpi koletise, et saada 1200 Elupunkti.

source: Card Rotator
et: Kaardipööraja

source: Send 1 card from your hand to the Graveyard. Change the battle positions of all monsters your opponent controls. (Face-down Defense Position monsters are flipped to face-up Attack Position.)
et: Saada 1 kaart oma käest Hauakambrisse. Muuda kõigi vastase kontrollitavate koletiste lahingupositsioone. (Näoga allapoole kaitsepositsioonis olevad koletised pööratakse näoga ülespoole rünnakupositsiooni.)

source: Seed of Deception
et: Pettuse seeme

source: Special Summon 1 Level 2 or lower Plant-Type monster from your hand.
et: Kutsu oma käest välja 1. taseme või madalama Taimetüüpi koletis.

source: Mark of the Rose
et: Roosi märk

source: Remove from play 1 Plant-Type monster from your Graveyard and equip this card to a monster your opponent controls. Gain control of the equipped monster. During your End Phase, give control of the equipped monster to your opponent. During your Standby Phase, gain control of the equipped monster.
et: Eemalda oma kalmistult mängust 1 Taimetüüpi koletis ja kinnita see kaart vastase koletise külge. Saa kontroll kinnitatud koletise üle. Oma lõppfaasis anna kinnitatud koletise kontroll vastasele tagasi. Oma ootejärgus saa kinnitatud koletise üle kontroll tagasi.

source: Black Garden
et: Must Aed

source: When a monster(s) is Normal or Special Summoned, except by the effect of "<M7904>Black Garden<M>": Halve its ATK, also you Special Summon 1 "<M3948>Rose Token<M>" (Plant-Type/DARK/Level 2/ATK 800/DEF 800) to its controller's opponent's side of the field, in Attack Position. You can target 1 monster in your Graveyard with ATK equal to the total ATK of all face-up Plant-Type monsters on the field: destroy this card and all face-up Plant-Type monsters, then Special Summon that target.
et: Kui koletis(ed) kutsutakse Normaal- või Erikutsumise teel, välja arvatud "<M7904>Black Garden<M>" efekti kaudu: selle ATK väheneb poole võrra, samuti kutsutakse Erikutsumise teel 1 "<M3948>Rose Token<M>" (Taim-Tüüp/PIMEDUS/Tase 2/ATK 800/DEF 800) selle kontrollija vastase väljaku poolele, Rünnakupositsioonis. Sa saad sihtida 1 koletist oma Hauakambris, mille ATK on võrdne kõigi väljaku peal olevate avatud Taim-Tüüpi koletiste kogutud ATK-ga: hävita see kaart ja kõik avatud Taim-Tüüpi koletised, seejärel kutsu Erikutsumise teel see sihtmärk.

source: Factory of 100 Machines
et: 100 Masina Tehas

source: Remove from play all "Morphtronic" monsters from your Graveyard. Target face-up Machine-Type monster you control gains 200 ATK for each card removed, until the End Phase.
et: Eemalda mängust kõik oma Hauakambris olevad "Morphtronic" koletised. Sihtmärgiks olev avatud Masinatüüpi koletis, mida sa kontrollid, saab iga eemaldatud kaardi eest 200 ATK juurde kuni End Phase'ini.

source: Morphtronic Accelerator
et: Morftroniline Kiirendi

source: Return 1 "Morphtronic" monster from your hand to the Deck. Destroy 1 card on the field, and draw 1 card.
et: Tagasta 1 "Morphtronic" koletis oma käest pakki. Hävita 1 kaart väljal ja tõmba 1 kaart.

source: Morphtronic Cord
et: Morftroniline Juhe
