Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: Suit of Sword X
et: Mõõgakomplekt X

source: Toss a coin once. One of the following effects is applied.<BR>● Heads: Destroy all monsters your opponent controls.<BR>● Tails: Destroy all monsters you control
et: Viska üks kord münti. Rakendatakse üks järgmistest efektidest.<BR>● Kull: Hävita kõik vastase kontrollitavad koletised.<BR>● Kiri: Hävita kõik sinu kontrollitavad koletised

source: Malefic Force
et: Paha Jõud

source: Target 1 face-up "Malefic" Monster on your side of the field. The target is unaffected by your opponent's Spell Cards.
et: Vali 1 avatud "Malefic" koletis oma väljaku poolel. Sihtmärk ei ole mõjutatud sinu vastase loitsukaartidest.

source: Malefic Selector
et: Pahaend Valija

source: Remove from play 2 "Malefic" monsters from your Graveyard. Add 2 "Malefic" monsters from your Deck to your hand.
et: Eemalda oma kalmistult mängust 2 "Malefic" koletist. Lisa oma pakist 2 "Malefic" koletist oma kätte.

source: You can only Activate this card when you have less Life Points than your opponent. Destroy all monsters on the field. Inflict 300 damage to each player for each monster they controlled that was destroyed by this effect. Both players cannot Summon or Special Summon until the end of your next Turn.
et: Seda kaarti saad aktiveerida ainult siis, kui sul on vähem Elupunkte kui su vastasel. Hävita kõik koletised väljal. Tekita igale mängijale 300 kahju iga koletise eest, mida nad kontrollisid ja mis hävitati selle efekti tõttu. Mõlemad mängijad ei saa kutsuda ega eriliselt kutsuda kuni sinu järgmise käigu lõpuni.

source: Last Machine Acid Virus
et: Viimane Masina Happeviirus

source: Tribute 1 WATER monster. Check all monsters on your opponent's side of the field, your opponent's hand, and all cards they draw (until the end of your opponent's 3rd turn after his card's activation) and destroy all Machine-Type monsters. Inflict 500 damage to your opponent for each monster destroyed by this effect.
et: Lohista 1 VEE monster. Kontrolli kõiki koletisi oma vastase väljaku poolel, oma vastase kätt ja kõiki kaarte, mida nad tõmbavad (kuni vastase 3. käigu lõpuni pärast selle kaardi aktiveerimist) ja hävita kõik Masinatüüpi koletised. Tekita oma vastasele 500 kahju iga selle efekti tõttu hävitatud koletise eest.

source: Toy Soldier
et: Mängusõdur

source: During your Standby Phase, Special Summon 1 "<M3739>Toy Soldier<M>" in Attack Position from your Deck.
et: Oma Standby-faasis kutsu oma pakist rünnakupositsioonis välja 1 "<M3739>Toy Soldier<M>".

source: Toy Emperor
et: Mängukeiser

source: When this card destroys an opponent's monster by battle, you can add 1 Trap Card from your Deck to your hand.
et: Kui see kaart hävitab lahingus vastase koletise, saad lisada 1 lõksukaardi oma pakist oma kätte.

source: Crowning of the Emperor
et: Keisri kroonimine

source: Tribute 1 face-up "<M3739>Toy Soldier<M>" you control. Special Summon 1 "<M3740>Toy Emperor<M>" from your hand or Deck.
et: Lohista 1 avatud "<M3739>Toy Soldier<M>", mida sa kontrollid. Kutsu eriliselt välja 1 "<M3740>Toy Emperor<M>" oma käest või pakist.

source: White Veil
et: Valge loor

source: If a monster equipped with this card attacks all effects of Spell or Trap Cards your opponent controls are negated until the end of the Damage Step. If the equipped monster is destroyed and this card is sent to the Graveyard, you receive damage equal to the ATK of the equipped monster.
et: Kui selle kaardiga varustatud koletis ründab, tühistatakse kõik sinu vastase kontrollitavate Võlu- või Lõksukaartide efektid kuni Kahjustuse Etapi lõpuni. Kui varustatud koletis hävitatakse ja see kaart saadetakse Hauakambrisse, saad sa kahju, mis on võrdne varustatud koletise RÜN-ga.

source: Scab Scar Knight
et: Kärnaarmastaja Rüütel

source: You can only have 1 "<M3743>Scab Scar Knight<M>" on your side of the field. This card cannot be destroyed by battle. If this card is in face-up Defense Position on the field, destroy this card. All opponent's monsters must attack this card if possible. At the end of the Battle Phase, you can take control of an opponent's monster that battles this card.
et: Sa saad oma väljakul olla ainult 1 "<M3743>Scab Scar Knight<M>". Seda kaarti ei saa lahingus hävitada. Kui see kaart on väljakul avatud kaitsepositsioonis, hävita see kaart. Kõik vastase koletised peavad võimalusel seda kaarti ründama. Lahingufaasi lõpus saad võtta kontrolli vastase koletise üle, mis selle kaardiga võitleb.

source: Efflorescent Knight
et: Õitsev Rüütel

source: Decrease the ATK of this card by 600 points during each of your End Phases.
et: Vähenda selle kaardi ATK-d iga oma lõppfaasi ajal 600 punkti võrra.

source: Cenozoic Fossil Knight - Skullger
et: Kenozoikumi Fossiilrüütel - Kolju

source: 1 Rock-Type monster in your Graveyard + 1 Level 4 or lower monster in your opponent's Graveyard<BR>This card cannot be Special Summoned except by the effect of "<M3748>Fossil Fusion<M>".
et: 1 Kiviliik-tyypi koletis sinu kalmistus + 1 Tase 4 või madalam koletis sinu vastase kalmistus<BR>Seda kaarti ei saa Eriliselt Kutsuda, välja arvatud "<M3748>Fossiilfusion<M>" efektiga.

source: Mesozoic Fossil Knight - Skullknight
et: Mesosoikumifossiilide Rüütel - Kolpknight

source: 1 Rock-Type monster in your Graveyard + 1 Level 7 or higher monster in your opponent's Graveyard.<BR>This card cannot be Special Summoned except by the effect of "<M3748>Fossil Fusion<M>". When there is a monster your opponent controls after this monster's first attack of your Battle Phase, this monster can attack once again during the same Battle Phase. During battle between that attacking card and a Defense Position monster whose DEF is lower than the ATK of that card, inflict the difference as Battle Damage to your opponent's Life Points.
et: 1 Kaljukivimitüüp koletis sinu Hauakambris + 1 Tase 7 või kõrgem koletis sinu vastase Hauakambris.<BR>Seda kaarti ei saa Eriliselt Kutsuda välja, välja arvatud "<M3748>Fossil Fusion<M>" efektiga. Kui pärast selle koletise esimest rünnakut sinu Lahingufaasis on vastasel koletis, mida ta kontrollib, saab see koletis rünnata uuesti sama Lahingufaasi jooksul. Lahingu ajal, kui see ründav kaart võitleb Kaitseasendis koletisega, kelle DEF on madalam kui selle kaardi ATK, põhjusta vahe Lahingukahjuna oma vastase Elupunktidele.

source: Time Stream
et: Aja voog

source: Pay half your Life Points. Return 1 "Cenzoic Fossil Knight" or "Mesozoic Fossil Knight" Fusion Monster on your side of the field to your Fusion Deck. If a "Cenzoic Fossil Knight" monster was returned, Special Summon 1 "Mesozoic Fossil Knight" Fusion Monster from your Fusion Deck. If a "Mesozoic Fossil Knight" Fusion Monster was returned, Special Summon 1 "Paleozoic Fossil Knight" Fusion Monster from your Fusion Deck (This Special Summon is treated as a Fusion Summon)
et: Maksa pool oma Elupunktidest. Tagasta 1 "Cenzoic Fossil Knight" või "Mesozoic Fossil Knight" Fusion Monster oma väljakult oma Fusion Decki. Kui "Cenzoic Fossil Knight" koletis tagastati, kutsu eriliselt välja 1 "Mesozoic Fossil Knight" Fusion Monster oma Fusion Deckist. Kui "Mesozoic Fossil Knight" Fusion Monster tagastati, kutsu eriliselt välja 1 "Paleozoic Fossil Knight" Fusion Monster oma Fusion Deckist (See eriline väljakutse loetakse Fusion Summoniks)

source: Fossil Fusion
et: Fossiilide Sulandumine

source: Remove from play Fusion Material Monsters that are listed on a "Fossil" Fusion Monster Card from your Graveyard and your opponent's Graveyard, and Special Summon that Fusion Monster from your Fusion Deck. (This Special Summon is treated as a Fusion Summon)
et: Eemalda oma kalmistult ja vastase kalmistult Fusion Material Monsters, mis on loetletud "Fossil" Fusion Monster Card'il, ja Special Summon see Fusion Monster oma Fusion Deck'ist. (See Special Summon käsitletakse kui Fusion Summon)

source: B.E.S. Assault Core
et: B.E.S. Rünnakutuum

source: If your opponent controls a monster and you control no monsters, you can Special Summon this card from your hand.
et: Kui sinu vastasel on koletis ja sul ei ole ühtegi koletist, saad selle kaardi oma käest eriliselt kutsuda.

source: Shield Recovery
et: Kilbi taastamine

source: Put 3 counters on 1 "<M6199>Big Core<M>" or "B.E.S." monster on the field.
et: Pange 3 loendurit ühele "<M6199>Big Core<M>" või "B.E.S." koletisele väljal.

source: Load of Darkness Token
et: Pimeduse koorma žetoon

source: Summoned with "<M3723>Infinite Fiend Summoning Mirrors<M>". This card cannot be destroyed by battle. This card cannot attack your opponent directly. For every monster this card destroys by battle, inflict 700 points of damage to your opponent's Life Points. (Damage calculation is applied normally.) If "<M3722>Load of Darkness<M>" is destroyed, destroy this token.
et: Kutsutud "<M3723>Infinite Fiend Summoning Mirrors<M>" abil. Seda kaarti ei saa lahingus hävitada. See kaart ei saa rünnata otse sinu vastast. Iga koletise eest, mille see kaart lahingus hävitab, põhjusta oma vastase Elupunktidele 700 punkti kahju. (Kahju arvutamine toimub tavapäraselt.) Kui "<M3722>Load of Darkness<M>" hävitatakse, hävita see token.

source: Miracle Contact
et: Imeiline Kontakt

source: Select 1 "Elemental HERO" Fusion Monster that lists "<M6653>Elemental Hero Neos<M>" as a Fusion Material Monster in your Extra Deck. Return to your Deck, from your side of the field or your Graveyard, Fusion Material Monsters listed on that Fusion Monster to Special Summon the selected Fusion Monster from your Extra Deck, ignoring the Summoning Conditions. (This Special Summon is treated as a Fusion Summon).
et: Vali 1 "Elemental HERO" Fusion Monster, mis loetleb "<M6653>Elemental Hero Neos<M>" kui Fusion Material Monster sinu Extra Deckis. Tagasta oma Decki, oma väljakult või oma Hauakambrist, Fusion Material Monsters, mis on loetletud sellel Fusion Monsteril, et Special Summon valitud Fusion Monster oma Extra Deckist, ignoreerides Summoning Conditions. (See Special Summon käsitletakse kui Fusion Summon).

source: The Rival's Name
et: Rivaali nimi

source: Select 1 Monster Card in your opponent's Graveyard. Special Summon this card in Defense Position; it is treated as a Normal Monster (Spellcaster-Type/LIGHT/Level 1/ATK 0/DEF 0). This card is treated as the selected Monster Card. (This card is still treated as a Spell Card.)
et: Vali oma vastase kalmistult 1 koletise kaart. Kutsu see kaart eriliselt välja kaitsepositsioonis; seda käsitletakse tavalise koletisena (Loitsija-tüüp/VALGUS/Tase 1/ATK 0/DEF 0). Seda kaarti käsitletakse valitud koletise kaardina. (Seda kaarti käsitletakse endiselt loitsukaardina.)

source: Burst Impact
et: Plahvatuslik Löök

source: You can activate this card when a "<M6311>Elemental HERO Burstinatrix<M>" card is face-up on your side of the field. All cards on the field except "<M6311>Elemental HERO Burstinatrix<M>" are destroyed, and the destroyed monster's controller receives damage equal to the number of monsters destroyed x 300.
et: Saate selle kaardi aktiveerida, kui "<M6311>Elemental HERO Burstinatrix<M>" kaart on teie väljaku poolel avatud. Kõik kaardid väljakul, välja arvatud "<M6311>Elemental HERO Burstinatrix<M>", hävitatakse ja hävitatud koletise kontrollija saab kahju, mis on võrdne hävitatud koletiste arvuga x 300.

source: Battle Fusion
et: Lahingu sulandumine

source: Activate during the Damage Step after a Fusion Monster you control battles. Your monster's ATK is increased by the enemy monster's ATK until the end of the Damage Step.
et: Aktiveeri Kahjustuse Samme ajal pärast seda, kui sinu juhitav Fusion Monster võitleb. Sinu koletise ATK suureneb vaenlase koletise ATK võrra kuni Kahjustuse Samme lõpuni.

source: Final Fusion
et: Lõplik Fusion

source: Activate only when a face-up Fusion Monster you control battles an opponent's Fusion Monster. Each player takes damage equal to the combined ATK of the battling monsters.
et: Aktiveeri ainult siis, kui sinu juhitav avatud Fusion Monster võitleb vastase Fusion Monsteriga. Mõlemad mängijad saavad kahju, mis on võrdne võitlevate koletiste kombineeritud ATK-ga.

source: Advanced Dark
et: Arendatud Pimedus

source: The Attribute of any "Crystal Beast" monsters on the field or Graveyard is treated as DARK. When calculating Battle Damage caused by a "Crystal Beast" monster, you can send 1 "Crystal Beast" monster from your Deck to the Graveyard, to reduce any Battle Damage you take to 0. If a1 "<M7171>Rainbow Dragon<M>" monster attacks, the effect of the monster it attacks is negated during the Battle Phase. When this card is removed from the field, all face-up "Crystal Beast" monsters on the field are destroyed
et: Mis tahes "Kristallkoletise" koletise omadust väljakul või Hauakambris käsitletakse kui PIMEDUST. Kui arvutatakse lahingukahju, mida põhjustab "Kristallkoletise" koletis, võid saata 1 "Kristallkoletise" koletise oma pakist Hauakambrisse, et vähendada mis tahes lahingukahju, mida sa saad, nullini. Kui a1 "<M7171>Vikerkaare Draakon<M>" koletis ründab, siis rünnatava koletise efekt on Lahingufaasis tühistatud. Kui see kaart eemaldatakse väljakult, hävitatakse kõik näoga ülespoole olevad "Kristallkoletise" koletised väljakul

source: Crystal Slicer
et: Kristallilõikur

source: Send 1 "Crystal Beast" monster from your Hand to the Graveyard. The original ATK of 1 face-up monster on your opponent's field is reduced by half. Your opponent draws 1 card.
et: Saada 1 "Kristallibeast" koletis oma käest hauakambrisse. Ühe sinu vastase väljaku avatud koletise algne rünnakujõud väheneb poole võrra. Sinu vastane tõmbab 1 kaardi.

source: Destiny Mind
et: Saatus Mõistus

source: Activate only if you control no "Destiny HERO" monsters. Special Summon 1 Level 3 or lower "Destiny HERO" monster from your Deck.
et: Aktiveeri ainult siis, kui sul pole ühtegi "Destiny HERO" koletist. Kutsu eriliselt välja 1 tase 3 või madalam "Destiny HERO" koletis oma pakist.

source: Pay 1000 Life Points. Special Summon, from your Graveyard, 1 each of "<M5811>Ojama Yellow<M>", "<M5761>Ojama Green<M>", and "<M5812>Ojama Black<M>".
et: Makske 1000 Elupunkti. Kutsu eriliselt välja oma Hauakambrist 1 iga "<M5811>Ojama Yellow<M>", "<M5761>Ojama Green<M>" ja "<M5812>Ojama Black<M>".

source: Pride Shout
et: Uhke Hüüatus

source: Each time a monster with 0 ATK successfully attacks your opponent directly, inflict damage to your opponent equal to that monster's DEF.
et: Iga kord, kui koletis, mille ATK on 0, ründab edukalt sinu vastast otse, põhjusta oma vastasele kahju, mis on võrdne selle koletise DEF-iga.

source: If you would take Battle Damage from a direct attack, you can discard this card instead. Once per Duel, while this card is in your Graveyard, you can remove it from play when an opponent's monster attacks directly. You take no Battle Damage from that monster's attack
et: Kui sa saaksid otsese rünnaku tõttu lahingukahju, võid selle kaardi selle asemel ära visata. Kord Duelli jooksul, kui see kaart on sinu Hauakambris, võid selle mängust eemaldada, kui vastase koletis ründab otse. Sa ei saa selle koletise rünnakust lahingukahju

source: Plasma Warrior Eitom
et: Plasma Sõdalane Eitom

source: This card cannot be Normal Summoned or Set. This card cannot be Special Summoned except by Tributing 1 Level 7 or higher monster. Once per turn, during your Main Phase, you can halve this card's ATK. If you do, this card can attack your opponent directly this turn.
et: Seda kaarti ei saa normaalset kutsuda ega asetada. Seda kaarti ei saa eriliselt kutsuda, välja arvatud, kui ohverdatakse 1. taseme 7 või kõrgem koletis. Kord käigu jooksul, oma peafaasis, saad selle kaardi ATK pooleks jagada. Kui teed seda, saab see kaart sel käigul rünnata otse sinu vastast.

source: Rebirth Judgment
et: Ümberkehastumise Kohtuotsus

source: When you activate this card, declare 1 Type. All monsters in any Graveyard are treated as the declared Type.
et: Kui aktiveerid selle kaardi, kuuluta välja 1 tüüp. Kõiki koletisi ükskõik millises hauakambris käsitletakse kuulutatud tüübina.

source: Lord of Dark Summons
et: Pimedate Kutsete Isand

source: Tribute this card to Special Summon any 1 "<M6563>Uria, Lord of Searing Flames<M>", "<M6564>Hamon, Lord of Striking Thunder<M>", or "<M6565>Raviel, Lord of Phantasms<M>" from your Graveyard, ignoring the Summoning conditions. That card cannot attack the turn you activate this effect.
et: Lohista see kaart, et Kutsuda Eriliselt välja ükskõik milline 1 "<M6563>Uria, Põlevate Leekide Isand<M>", "<M6564>Hamon, Lööva Äikese Isand<M>" või "<M6565>Raviel, Fantaasiate Isand<M>" oma Hauakambrist, eirates Kutsumise tingimusi. See kaart ei saa rünnata sellel käigul, mil sa selle efekti aktiveerid.

source: Zero Sprite
et: Null Sprite

source: Select 1 face-up monster you control. Its original ATK becomes 0. That monster can attack twice during each Battle Phase.
et: Vali 1 avatud näoga koletis, mida sa kontrollid. Selle algne ATK muutub 0-ks. See koletis võib rünnata kaks korda iga Lahingu Faasi jooksul.

source: Fog Castle
et: Udukindlus

source: If a monster you control would be destroyed by battle, you can place that monster in another unused Monster Card Zone on your side of the field instead. If you do, place 1 Beacon Counter on this card (max. 5). For each Beacon Counter on this card, you cannot use 1 of your Monster Card Zones. If you have monster(s) in any Monster Card Zones you can't use, send any number of monsters you control to the Graveyard equal to or less than the number of Beacon Counters on this card. While there are 5 Beacon Counters on this card, you can send this face-up card and all cards in your hand to the Graveyard to select 4 cards in your Graveyard and add them to your hand. If you do, you cannot conduct your Battle Phase this turn.
et: Kui lahingus hävitatakse sinu kontrolli all olev koletis, võid selle koletise asetada oma väljaku teise kasutamata Koletise Kaardi Tsooni. Kui teed seda, aseta sellele kaardile 1 Majaka Loendur (maks. 5). Iga Majaka Loenduri kohta sellel kaardil ei saa sa kasutada ühte oma Koletise Kaardi Tsooni. Kui sul on koletis(ed) mõnes Koletise Kaardi Tsoonis, mida sa ei saa kasutada, saada ükskõik milline arv sinu kontrolli all olevaid koletisi Hauakambrisse, mis on võrdne või väiksem sellel kaardil olevate Majaka Loendurite arvust. Kui sellel kaardil on 5 Majaka Loendurit, võid saata selle avatud kaardi ja kõik kaardid oma käes Hauakambrisse, et valida 4 kaarti oma Hauakambrist ja lisada need oma kätte. Kui teed seda, ei saa sa sel käigul oma Lahingufaasi läbi viia.

source: Sacred Defence Barrier
et: Püha Kaitsebarjäär

source: Each time a Rock-Type monster(s) is Summoned to your side of the field, place 1 Protection Counter on the monster(s). If a monster with a Protection Counter would be destroyed by battle or by a card effect, remove 1 Protection Counter from that monster instead.
et: Iga kord, kui sinu väljale kutsutakse Kiviliigi koletis(ed), aseta koletise(te)le 1 Kaitsemärk. Kui koletis, millel on Kaitsemärk, hävitatakse lahingus või kaardi efekti tõttu, eemalda sellelt koletiselt 1 Kaitsemärk selle asemel.

source: Dark Archtype
et: Tume arhetüüp

source: When this card is destroyed by battle, you can Special Summon 1 monster from your Deck with an ATK less then or equal to the amount of Battle Damage you received from a battle involving this card.
et: Kui see kaart hävitatakse lahingus, saad Sa eriliselt kutsuda 1 koletise oma pakist, mille ATK on väiksem või võrdne lahingukahjuga, mida Sa said selle kaardiga seotud lahingus.

source: Dark Psycho Eye
et: Tume Psühhosilm

source: When this card is destroyed, take control of 1 of your opponent's monsters until the End Phase.
et: Kui see kaart hävitatakse, võta kontroll 1 vastase koletise üle kuni lõppfaasini.

source: Flame Wall
et: Leegisein

source: All damage inflicted to you by your opponent's card effects becomes 0.
et: Kogu kahju, mida sulle tekitavad vastase kaardiefektid, muutub 0-ks.

source: Volcanic Wall
et: Vulkaani sein

source: Once per turn, you can send the top 3 cards of your Deck to the Graveyard to inflict 500 damage to your opponent for each Pyro-Type monster sent to the Graveyard this way. You cannot declare an attack the turn you use this card's effect.
et: Korra ühe korra käigu jooksul saad saata oma paki kolm ülemist kaarti hauakambrisse, et tekitada oma vastasele 500 kahju iga selle viisi kaudu hauakambrisse saadetud Pyro-tüüpi koletise eest. Sa ei saa kuulutada rünnakut käigul, mil kasutad selle kaardi efekti.

source: The Unselected One
et: Valimata

source: You can activate this card when your opponent controls 2 or more monsters. Your opponent selects 1 monster, then you select and destroy 1 other monster. Then, Special Summon the destroyed monster from your opponent's Graveyard in Attack Position. You cannot conduct your Battle Phase during this turn.
et: Sa saad selle kaardi aktiveerida, kui sinu vastasel on 2 või rohkem koletist. Sinu vastane valib 1 koletise, siis valid ja hävitad sina 1 teise koletise. Seejärel, erikutsu hävitatud koletis oma vastase kalmistult rünnakupositsioonis. Sa ei saa sellel käigul oma lahingufaasi läbi viia.

source: Clear Cube
et: Selge Kuup

source: This face-up card is not treated as a DARK monster. When this card is removed from the field, except when it is Tributed, you can Special Summon 1 "<M3774>Clear Cube<M>" from your Deck or hand.
et: Seda avatud kaarti ei käsitleta kui PIMEDUST koletist. Kui see kaart eemaldatakse väljakult, välja arvatud juhul, kui see on ohverdatud, võid Sa eriliselt kutsuda 1 "<M3774>Clear Cube<M>" oma pakist või käest.

source: Clear Phantom
et: Selge Fantoom

source: When this card is face-up on the field, do not treat its attribute as DARK. When this card in face-up Attack Position is destroyed by battle and sent to the Graveyard, the monster that destroyed it is also destroyed and the top 3 cards from your opponent's Deck are sent to the Graveyard.
et: Kui see kaart on lahinguväljal avatud, ära käsitle selle atribuuti kui PIMEDUST. Kui see kaart avatud Rünnakupositsioonis hävitatakse lahingus ja saadetakse Hauakambrisse, hävitatakse ka koletis, kes selle hävitas, ning sinu vastase paki kolm ülemist kaarti saadetakse Hauakambrisse.

source: Clear Rage Golem
et: Selge Raev Golem

source: This face-up card is not treated as a DARK monster. If this card successfully attacks your opponent directly, inflict 300 damage to your opponent for each card in their hand.
et: Seda avatud kaarti ei käsitleta kui PIMEDUST koletist. Kui see kaart ründab edukalt sinu vastast otse, põhjusta oma vastasele 300 kahju iga kaardi eest nende käes.

source: Clear Vicious Knight
et: Selge Vihane Rüütel

source: This face-up card is not treated as a DARK monster. If your opponent controls a monster, you can Normal Summon this card with 1 Tribute. Once per turn, if you control no other monsters, you can have this card gain ATK equal to the highest original ATK of a face-up monster your opponent controls, until the End Phase.
et: Seda avatud kaarti ei käsitleta kui PIMEDUST koletist. Kui sinu vastane kontrollib koletist, saad selle kaardi Normaalset Kutsuda ühe Ohvriga. Kord käigu jooksul, kui sa ei kontrolli teisi koletisi, saad sellel kaardil lasta saada ATK-d, mis on võrdne sinu vastase kontrollitava avatud koletise kõrgeima algse ATK-ga, kuni Lõppfaasini.

source: Final Penalty
et: Lõplik Karistus

source: When a Fiend-Type monster you control is destroyed by battle and sent to the Graveyard, inflict damage to your opponent equal to that monster's ATK. Then destroy the attacking monster.
et: Kui lahingus hävitatakse ja Hauakambrisse saadetakse sinu kontrolli all olev Deemon-tüüpi koletis, põhjusta oma vastasele kahju, mis on võrdne selle koletise rünnakupunktidega. Seejärel hävita ründav koletis.

source: Climactic Barricade
et: Kulmineeruv Tõke
