Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: When a card effect controlled by your opponent is activated which would cause you to discard from your hand, by sending this card from your hand to the Graveyard, negate the activation and the effect of the card and destroy it. Then draw 1 card.
et: Kui sinu vastase kontrollitud kaardi efekt aktiveeritakse, mis sunniks sind oma käest kaarte ära viskama, saad selle kaardi oma käest Hauakambrisse saates aktiveerimise ja kaardi efekti tühistada ning selle hävitada. Seejärel tõmba 1 kaart.

source: Return Zombie
et: Tagasi Zombi

source: During your Standby Phase, if this card is in your Graveyard and you have no cards in your hand, you can pay 500 Life Points to add this card to your hand.
et: Oma Standby Phase'i ajal, kui see kaart on sinu Hauakambris ja sul pole kaarte käes, võid maksta 500 Elupunkti, et lisada see kaart oma kätte.

source: Legacy of Yata-Garasu
et: Yata-Garasu pärand

source: Activate 1 of these effects:<BR>● Draw 1 card.<BR>● Activate only if your opponent controls a face-up Spirit monster. Draw 2 cards.
et: Aktiveeri üks nendest efektidest:<BR>● Tõmba 1 kaart.<BR>● Aktiveeri ainult siis, kui sinu vastane kontrollib avatud Spirit koletist. Tõmba 2 kaarti.

source: Marshmallon Glasses
et: Marshmalloni Prillid

source: While this card and "<M6000>Marshmallon<M>" are face-up on your side of the field, your opponent cannot select a card other than "<M6000>Marshmallon<M>" as an attack target.
et: Kui see kaart ja "<M6000>Marshmallon<M>" on sinu väljaku poolel avatud, ei saa sinu vastane valida rünnaku sihtmärgiks ühtegi teist kaarti peale "<M6000>Marshmallon<M>".

source: Call of the Earthbound
et: Kutsung Maapealsetele

source: Activate only when an opponent's monster declares an attack. You select the target of the attack.
et: Aktiveeri ainult siis, kui vastase koletis kuulutab välja rünnaku. Sina valid rünnaku sihtmärgi.

source: An outcast angel. Nobody knows what he is thinking at all. Sometimes he gets mad and that is dreadful.
et: Väljaheidetud ingel. Keegi ei tea, mida ta mõtleb. Mõnikord läheb ta vihaseks ja see on kohutav.

source: He has a tranquil soul, but carries a destiny that one day his heart shall be tainted by evil....
et: Tal on rahulik hing, kuid tal on saatus, et ühel päeval rüvetab kurjus tema südame....

source: A workaholic fiend who devotes everything to his research into the languages of Dark World. His mind has collapsed because of working too hard.
et: Töönarkomaanist deemon, kes pühendab kõik oma jõupingutused Pimeduse Maailma keelte uurimisele. Tema mõistus on kokku varisenud liigse töö tõttu.

source: Fiend Scorpion
et: Deemon Skorpion

source: A huge scorpion inhabited by the soul of a fiend. Usually it holds back, but has untapped potential.
et: Hiiglaslik skorpion, keda asustab deemoni hing. Tavaliselt hoiab end tagasi, kuid tal on avastamata potentsiaal.

source: Pharaoh's Servant
et: Farao teenija

source: An apparition of those said to formerly serve the Pharaoh. It has tremendous loyalty that does not waiver.
et: Needus, et väidetavalt teenisid vaaraot. Sellel on tohutu lojaalsus, mis ei kõigu.

source: Pharaonic Protector
et: Farao kaitseingel

source: The mummy of a soldier that has been guarding the royal family for thousands of years. Even now, its spirit does not allow anybody to trespass.
et: Sõdurimuumia, kes on tuhandeid aastaid kuninglikku perekonda valvanud. Isegi nüüd ei luba tema vaim kellelgi sissetungida.

source: Spirit of the Pharaoh
et: Vaarao vaim

source: This card cannot be Normal Summoned or Set. This card cannot be Special Summoned except by the effect of "<M6063>The First Sarcophagus<M>". When this card is Special Summoned, you can Special Summon up to 4 Level 2 or lower Zombie-Type Normal Monsters from your Graveyard.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti ei saa eriliselt kutsuda, välja arvatud "<M6063>Esimese Sarkofaagi<M>" efekti abil. Kui see kaart kutsutakse eriliselt, võid oma hauakambrist eriliselt kutsuda kuni 4 taseme 2 või madalama zombitüüpi normaalset koletist.

source: Theban Nightmare
et: Teeba Nightmare

source: While you have no cards in your hand and in your Spell & Trap Card Zones, this card gains 1500 ATK.
et: Kui sul pole kaarte käes ega oma Võlu- ja Lõksukaartide tsoonides, saab see kaart 1500 ATK juurde.

source: Aswan Apparition
et: Aswani ilmutis

source: If this card inflicts Battle Damage to your opponent's Life Points, you can return 1 Trap Card from your Graveyard to the top of your Deck.
et: Kui see kaart tekitab lahingukahju sinu vastase elupunktidele, saad ühe lõksukaardi oma hauast oma paki tippu tagasi panna.

source: Protector of the Sanctuary
et: Pühamu Kaitsja

source: Your opponent cannot draw cards except during Draw Phases.
et: Sinu vastane ei saa kaarte tõmmata, välja arvatud tõmbamisfaaside ajal.

source: Nubian Guard
et: Nubia valvur

source: If this card inflicts Battle Damage to your opponent's Life Points, you can return 1 Continuous Spell Card from your Graveyard to the top of your Deck.
et: Kui see kaart tekitab lahingukahju sinu vastase Elupunktidele, saad ühe Pideva Loitsukaardi oma Hauakambrist oma Paki tippu tagasi panna.

source: Legacy Hunter
et: Pärandikütt

source: When this card attacks a face-down Defense Position monster and destroys it and sends it to the Graveyard as a result of battle, your opponent returns 1 random card from their hand to their Deck. Their Deck is then shuffled.
et: Kui see kaart ründab tagurpidi kaitseasendis olevat koletist ja hävitab selle ning saadab selle lahingu tulemusena Hauakambrisse, saadab sinu vastane ühe juhusliku kaardi oma käest tagasi oma pakki. Seejärel segatakse nende pakk.

source: Desertapir
et: Kõrbetapir

source: FLIP: Flip 1 face-up monster on the field into face-down Defense Position. You cannot select "<M6030>Desertapir<M>".
et: FLIP: Pööra 1 avatud koletis väljal tagurpidi kaitseasendisse. Sa ei saa valida "<M6030>Desertapir<M>".

source: Sand Gambler
et: Liivamängur

source: Toss a coin 3 times. If all 3 results are Heads, destroy all monsters on your opponent's side of the field. If all 3 results are Tails, destroy all monsters on your side of the field. You can only activate this effect once per turn, during your Main Phase.
et: Viska münti 3 korda. Kui kõik 3 tulemust on kull, hävita kõik koletised vastase väljaku poolel. Kui kõik 3 tulemust on kiri, hävita kõik koletised sinu väljaku poolel. Sa saad seda efekti aktiveerida ainult üks kord käigu jooksul, oma peafaasi ajal.

source: 3-Hump Lacooda
et: 3-küürkaamel

source: If there are 3 face-up "<M6032>3-Hump Lacooda<M>" cards on your side of the field, Tribute 2 of them to draw 3 cards.
et: Kui sinu väljaku poolel on 3 avatud "<M6032>3-Hump Lacooda<M>" kaarti, ohverda neist 2, et tõmmata 3 kaarti.

source: Ghost Knight of Jackal
et: Šaakali Kummitusrüütel

source: You can Special Summon an opponent's monster that is destroyed and sent to the Graveyard by this card as a result of battle to your side of the field in face-up Defense Position.
et: Sa saad eriliselt kutsuda vastase koletise, mis on selle kaardi poolt lahingu tulemusena hävitatud ja saadetud Hauakambrisse, oma väljaku poolele avatud kaitseasendis.

source: Absorbing Kid from the Sky
et: Taevast neelav laps

source: When this card destroys a monster and sends it to the Graveyard as a result of battle, increase your Life Points by the Level of the destroyed monster x 300 points.
et: Kui see kaart hävitab koletise ja saadab selle lahingu tulemusena Hauakambrisse, suurenda oma Elupunkte hävitatud koletise taseme x 300 punkti võrra.

source: Elephant Statue of Blessing
et: Õnnistuse elevandi kuju

source: When this card is sent directly from your hand to the Graveyard by an effect of a card controlled by your opponent, increase your Life Points by 2000 points.
et: Kui see kaart saadetakse otse sinu käest hauakambrisse sinu vastase kontrollitava kaardi efekti tõttu, suurenda oma elupunkte 2000 punkti võrra.

source: Elephant Statue of Disaster
et: Katastroofi elevandikuju

source: When this card is sent directly from your hand to the Graveyard by an effect of a card controlled by your opponent, inflict 2000 points of damage to your opponent's Life Points.
et: Kui see kaart saadetakse otse sinu käest hauakambrisse sinu vastase kontrollitava kaardi efekti tõttu, põhjusta oma vastase Elupunktidele 2000 punkti kahju.

source: Spirit Caller
et: Vaimukutsuja

source: FLIP: You can Special Summon 1 Level 3 or lower Normal Monster from your Graveyard to your side of the field.
et: FLIP: Saad spetsiaalset kutsuda 1. taseme 3 või madalama tavalise koletise oma hauakambrist oma väljaku poolele.

source: Emissary of the Afterlife
et: Pärastelu saadik

source: When this card is sent from the field to the Graveyard, each player selects 1 Level 3 or lower Normal Monster from their Deck, and adds it to their hand after showing it to the opponent. The Decks are then shuffled.
et: Kui see kaart saadetakse väljakult Hauakambrisse, valib iga mängija oma pakist ühe 3. taseme või madalama tavalise koletise ja lisab selle oma kätte pärast selle vastasele näitamist. Seejärel segatakse pakid.

source: Grave Protector
et: Hauakaitse

source: While this card is face-up on the field, monsters that are destroyed as a result of battle are returned to the owner's Deck (not sent to the Graveyard). The Deck is then shuffled.
et: Kui see kaart on lahinguväljal avatud, siis lahingu tulemusena hävitatud koletised tagastatakse omaniku pakki (mitte ei saadeta Hauakambrisse). Seejärel segatakse pakk.

source: Double Coston
et: Kahekordne Coston

source: This card can be treated as 2 Tributes for the Tribute Summon of a DARK monster.
et: Seda kaarti saab käsitleda kui 2 ohverdust pimeduse koletise ohverdussummoniks.

source: Regenerating Mummy
et: Regeneratiivne Muumia

source: When this card is sent from your hand to the Graveyard by an opponent's card effect, return it to your hand.
et: Kui see kaart saadetakse vastase kaardi efekti tõttu sinu käest hauakambrisse, tagasta see oma kätte.

source: Night Assailant
et: Öine Ründaja

source: FLIP: Select 1 monster your opponent controls, and destroy it. When this card is sent directly from your hand to the Graveyard, select 1 Flip Effect Monster in your Graveyard, except this card, and return it to your hand.
et: FLIP: Vali 1 koletis, mida sinu vastane kontrollib, ja hävita see. Kui see kaart saadetakse otse sinu käest Hauakambrisse, vali 1 FLIP-efektiga koletis oma Hauakambris, välja arvatud see kaart, ja tagasta see oma kätte.

source: Man-Thro' Tro'
et: Mees-Läbi' Läbi'

source: By Tributing 1 Normal Monster (except a Token) on your side of the field, inflict 800 points of damage to your opponent's Life Points.
et: Ohverdades 1 tavaline koletis (välja arvatud žetoon) oma väljaku poolel, põhjusta oma vastase Elupunktidele 800 punkti kahju.

source: King of the Swamp
et: Soo kuningas

source: You can substitute this card for any 1 Fusion Material Monster. When you do this, the other Fusion Material Monster(s) must be the correct one(s). Discard this card from your hand to the Graveyard to add a "<M4837>Polymerization<M>" from your Deck to your hand. The Deck is then shuffled.
et: Saad seda kaarti kasutada ükskõik millise 1 Fusion Material Monster asendamiseks. Kui teed seda, peavad teised Fusion Material Monster(id) olema õiged. Viska see kaart oma käest Hauakambrisse, et lisada "<M4837>Polymerization<M>" oma Paki seest oma kätte. Seejärel segatakse Pakk.

source: Emissary of the Oasis
et: Oaasi saadik

source: While a face-up Level 3 or lower Normal Monster is on your side of the field, your opponent cannot select this card as an attack target. While this card is face-up on your side of the field, any Battle Damage to the controller of this card from battle involving a Level 3 or lower Normal Monster becomes 0.
et: Kui sinu väljaku poolel on avatud 3. või madalama taseme tavaline koletis, ei saa sinu vastane valida seda kaarti rünnaku sihtmärgiks. Kui see kaart on sinu väljaku poolel avatud, muutub selle kaardi kontrollija lahingukahju, mis on seotud 3. või madalama taseme tavalise koletisega, 0-ks.

source: Special Hurricane
et: Eriline Orkaan

source: Discard 1 card from your hand. Destroy all Special Summoned monsters on the field.
et: Viska 1 kaart oma käest. Hävita kõik eriliselt kutsutud koletised väljal.

source: Order to Charge
et: Käsk rünnakuks

source: Select 1 face-up Normal Monster (except a Token) on your side of the field when you activate this card. When this card resolves, Tribute the selected Normal Monster and destroy 1 monster on your opponent's side of the field.
et: Vali 1 avatud tavaline koletis (välja arvatud Token) oma väljaku poolel, kui aktiveerid selle kaardi. Kui see kaart lahendatakse, ohverda valitud tavaline koletis ja hävita 1 koletis oma vastase väljaku poolel.

source: Sword of the Soul-Eater
et: Hingeõgija mõõk

source: You can only equip this card to a Level 3 or lower Normal Monster on your side of the field. When you activate this card, Tribute all Normal Monsters (except Tokens) on your side of the field, except the equipped monster. Increase the ATK of the equipped monster by 1000 points for each Normal Monster that you Tributed.
et: Sa saad selle kaardi varustada ainult oma väljaku poolel olevale 3. taseme või madalama tavalise koletisega. Kui aktiveerid selle kaardi, ohverda kõik tavalised koletised (välja arvatud tokenid) oma väljaku poolel, välja arvatud varustatud koletis. Suurenda varustatud koletise ATK-d 1000 punkti võrra iga ohverdatud tavalise koletise eest.

source: Dust Barrier
et: Tolmutõke

source: Face-up Normal Monsters on the field are unaffected by your opponent's Spell Cards. This card is destroyed during your second Standby Phase after activation.
et: Avatud tavalised koletised väljakul ei ole mõjutatud sinu vastase loitsukaartidest. See kaart hävitatakse sinu teise ootejärgu faasi ajal pärast aktiveerimist.

source: Soul Reversal
et: Hinge Pööramine

source: Return 1 Flip Effect Monster from your Graveyard to the top of your Deck.
et: Tagasta 1 Pöördefekti Koletis oma Hauakambrist oma Paki tippu.

source: Spell Economics
et: Loitsumajandus

source: You do not have to pay any Life Points to activate a Spell Card.
et: Sa Spell-kaardi aktiveerimiseks ei pea sa maksma ühtegi Elupunkti.

source: Blessings of the Nile
et: Niiluse õnnistused

source: Each time card(s) are discarded from your hand to the Graveyard by the effect of a card controlled by your opponent, increase your Life Points by 1000 points.
et: Iga kord, kui sinu käest visatakse kaarte vastase kontrollitava kaardi efekti tõttu Hauakambrisse, suurenda oma Elupunkte 1000 punkti võrra.

source: When there are 3 face-up "7" cards on your side of the field, draw 3 cards from your Deck. Then destroy all "7" cards. When this card is sent directly from the field to your Graveyard, increase your Life Points by 700 points.
et: Kui sinu väljaku poolel on 3 avatud "7" kaarti, tõmba oma pakist 3 kaarti. Seejärel hävita kõik "7" kaardid. Kui see kaart saadetakse otse väljakult sinu Hauakambrisse, suurenda oma Elupunkte 700 punkti võrra.

source: Level Limit - Area B
et: Taseme Piirang - Ala B

source: All face-up Level 4 or higher monsters on the field are in Defense Position while this card is active.
et: Kõik avatud 4. või kõrgema taseme koletised väljakul on kaitsepositsioonis, kui see kaart on aktiivne.

source: Enchanting Fitting Room
et: Lummav Proovikabiin

source: Pay 800 Life Points. Pick up 4 cards from the top of your Deck and Special Summon to your side of the field all Level 3 or lower Normal Monsters among the picked-up cards. Return all the other picked-up cards to your Deck and the Deck is then shuffled.
et: Makske 800 Elupunkti. Tõsta oma paki pealt 4 kaarti ja Kutsu oma väljale kõik taseme 3 või madalamad Tavalised Koletised, mis on tõstetud kaartide hulgas. Kõik teised tõstetud kaardid tagasta oma pakki ja seejärel sega pakk.

source: The Law of the Normal
et: Normaalse Seadus

source: You can only activate this card while there are 5 face-up Level 2 or lower Normal Monsters on your side of the field. Both players discard all cards in their hands, and destroy all cards on the field except Level 2 or lower Normal Monsters.
et: Seda kaarti saab aktiveerida ainult siis, kui sinu väljakul on 5 avatud 2. taseme või madalama taseme tavalist koletist. Mõlemad mängijad viskavad kõik kaardid oma käest ära ja hävitavad kõik kaardid väljakul, välja arvatud 2. taseme või madalama taseme tavalised koletised.

source: Dark Magic Attack
et: Pimeduse Maagia Rünnak

source: Activate only while you control a face-up "<M4041>Dark Magician<M>". Destroy all Spell and Trap Cards your opponent controls.
et: Aktiveeri ainult siis, kui sa kontrollid avatud "<M4041>Pimeduse Maag<M>". Hävita kõik Võlu- ja Lõksukaardid, mida su vastane kontrollib.

source: Delta Attacker
et: Delta Ründaja

source: You can only activate this card while there are 3 Normal Monsters of the same name (except Tokens) on your side of the field. The 3 Normal Monsters of the same name can attack your opponent's Life Points directly during the turn that this card is activated.
et: Seda kaarti saab aktiveerida ainult siis, kui sinu väljakul on 3 sama nimega tavalist koletist (välja arvatud tokenid). 3 sama nimega tavalist koletist võivad rünnata sinu vastase elupunkte otse sellel käigul, mil see kaart aktiveeritakse.

source: Thousand Energy
et: Tuhande Energia

source: Increase the original ATK and DEF of all face-up Level 2 Normal Monsters (except Tokens) on your side of the field by 1000 points until the End Phase. Destroy all Level 2 Normal Monsters on your side of the field during the End Phase.
et: Suurenda kõigi sinu väljaku poolel olevate avatud 2. taseme tavaliste koletiste (välja arvatud žetoonid) algset ATK ja DEF väärtust 1000 punkti võrra kuni lõppfaasini. Hävita kõik sinu väljaku poolel olevad 2. taseme tavalised koletised lõppfaasi ajal.

source: Triangle Power
et: Kolmnurga Jõud

source: Increase the original ATK and DEF of all face-up Level 1 Normal Monsters (except Tokens) on your side of the field by 2000 points until the End Phase. Destroy all Level 1 Normal Monsters on your side of the field during the End Phase.
et: Suurenda kõigi sinu väljaku poolel olevate avatud 1. taseme tavaliste koletiste (välja arvatud žetoonid) algset ATK ja DEF väärtust 2000 punkti võrra kuni lõppfaasini. Hävita kõik sinu väljaku poolel olevad 1. taseme tavalised koletised lõppfaasi ajal.

source: The Third Sarcophagus
et: Kolmas sarkofaag

source: This card can only be placed on the field by the effect of "<M6063>The First Sarcophagus<M>".
et: Seda kaarti saab väljakule asetada ainult "<M6063>Esimene Sarkofaag<M>" efekti abil.

source: The Second Sarcophagus
et: Teine sarkofaag

source: The First Sarcophagus
et: Esimene Sarkofaag

source: During each of your opponent's End Phases, place 1 card face-up on your side of the field from your hand or Deck in this order: "<M6062>The Second Sarcophagus<M>", "<M6061>The Third Sarcophagus<M>". If 1 "Sarcophagus" card is removed from your side of the field, all of them on your side of the field are sent to the Graveyard. When you have all 3 "Sarcophagus" cards on your side of the field, send all Sarcophagus cards on your side of the field to the Graveyard to Special Summon 1 "<M6024>Spirit of the Pharaoh<M>" from your hand or Deck.
et: Iga kord, kui vastase käigu lõppfaas algab, aseta 1 kaart oma käest või pakist oma väljaku poolele avatud kujul järgmises järjekorras: "<M6062>Teine Sarkofaag<M>", "<M6061>Kolmas Sarkofaag<M>". Kui 1 "Sarkofaag" kaart eemaldatakse sinu väljaku poolelt, saadetakse kõik sinu väljaku poolel olevad sarkofaagikaardid Hauakambrisse. Kui sul on kõik 3 "Sarkofaag" kaarti oma väljaku poolel, saada kõik sarkofaagikaardid oma väljaku poolelt Hauakambrisse, et eriliselt kutsuda 1 "<M6024>Vaarao Vaim<M>" oma käest või pakist.

source: Dora of Fate
et: Saatuse Dora

source: You can only activate this card during your opponent's turn. Select 1 face-up monster on your opponent's side of the field. When you Normal Summon a monster that is 1 Level lower than the selected monster during your next turn, inflict damage to your opponent's Life Points equal to the Level of the selected monster x 500 points.
et: Seda kaarti saad aktiveerida ainult oma vastase käigu ajal. Vali 1 avatud koletis oma vastase väljaku poolel. Kui sa kutsud oma järgmisel käigul normalkutsumisega välja koletise, mis on valitud koletisest 1 taseme võrra madalam, põhjusta oma vastase Elupunktidele kahju, mis on võrdne valitud koletise tasemega x 500 punkti.

source: Judgment of the Desert
et: Kõrbeotsus

source: The Battle Position of face-up monsters that are flipped face-up after activation of this card cannot be changed, except with a card effect.
et: Pärast selle kaardi aktiveerimist ülespoole pööratud koletiste lahingupositsiooni ei saa muuta, välja arvatud kaardi efekti abil.

source: Human-Wave Tactics
et: Inimlaine taktika

source: During the End Phase of each turn, select a number of Level 2 or lower Normal Monsters from your Deck equal to the number of your Level 2 or lower Normal Monsters destroyed as a result of battle during that turn, and Special Summon them to your side of the field. The Deck is then shuffled.
et: End Phase'i ajal vali oma pakist arv 2. või madalama tasemega tavalisi koletisi, mis on võrdne sellel käigul lahingu tulemusena hävitatud 2. või madalama tasemega tavaliste koletiste arvuga, ja kutsu need eriliselt oma väljaku poolele. Seejärel segatakse pakk.

source: Curse of Anubis
et: Anubise needus

source: All face-up Effect Monsters on the field are changed to Defense Position. During the turn this card is activated, the original DEF of those Effect Monsters become 0 and their battle positions cannot be changed, except with a card effect.
et: Kõik avatud Efektikoletised väljakul muudetakse kaitsepositsiooni. Sellel käigul, mil see kaart aktiveeritakse, muutub nende Efektikoletiste algne DEF 0-ks ja nende lahingupositsioone ei saa muuta, välja arvatud kaardi efektiga.

source: Desert Sunlight
et: Kõrbe Päikesevalgus

source: All monsters on your side of the field are changed to face-up Defense Position.
et: Kõik sinu poolel väljakul olevad koletised muudetakse avatud kaitseasendisse.

source: Destroy any monster that inflicts Battle Damage to a player's Life Points by attacking directly.
et: Hävita iga koletis, mis tekitab mängija Elupunktidele Lahingukahju, rünnates otse.

source: Labyrinth of Nightmare
et: Õudusunenägude Labürint

source: During the End Phase of each turn, change the Battle positions of all face-up monsters on the turn player's side of the field.
et: Iga käigu lõppfaasis muuda kõigi käigu mängija poolel väljal olevate avatud koletiste lahingupositsioone.

source: Soul Resurrection
et: Hinge ülestõusmine

source: Special Summon 1 Normal Monster from your Graveyard in Defense Position. When this card is removed from the field, destroy that monster. When that monster is destroyed, destroy this card.
et: Erikutsuge oma kalmistult 1 tavaline koletis kaitsepositsioonis. Kui see kaart eemaldatakse väljakult, hävita see koletis. Kui see koletis hävitatakse, hävita see kaart.

source: Order to Smash
et: Käsk purustada

source: Select 1 face-up Level 2 or lower Normal Monster (except a Token) on your side of the field when you activate this card. When this card resolves, you can Tribute the selected Normal Monster and destroy 1 or 2 Spell or Trap Cards on your opponent's side of the field.
et: Vali 1 avatud näoga 2. taseme või madalam Tavaline Koletis (välja arvatud Token) oma väljaku poolel, kui aktiveerid selle kaardi. Kui see kaart lahendatakse, saad ohverdada valitud Tavalise Koletise ja hävitada 1 või 2 Loitsu või Lõksukaarti oma vastase väljaku poolel.
