Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: "<M4370>Black Luster Soldier<M>" + "<M4386>Blue-Eyes Ultimate Dragon<M>"<BR>This monster cannot be Special Summoned except by Fusion Summon. This card gains 500 ATK for each other Dragon-Type monster you control.
et: "<M4370>Musta Luster Sõdalane<M>" + "<M4386>Sinisilmne Ülim Draakon<M>"<BR>Seda koletist ei saa eriliselt kutsuda, välja arvatud Fusion Summoniga. See kaart saab 500 ATK iga teise Draakoni-tüüpi koletise eest, mida sa kontrollid.

source: Five-Headed Dragon
et: Viiepealine Draakon

source: 5 Dragon-Type monsters<BR>This monster cannot be Special Summoned except by Fusion Summon. This card cannot be destroyed by battle with an EARTH, WATER, FIRE, WIND, or DARK monster. (Damage calculation is applied normally.)
et: 5 Draakoni-tüüpi koletist<BR>Seda koletist ei saa eriliselt kutsuda, välja arvatud Fusion Summon abil. Seda kaarti ei saa hävitada lahingus EARTH, WATER, FIRE, WIND või DARK koletisega. (Kahju arvutamine toimub tavapäraselt.)

source: Queen's Knight
et: Kuninganna Rüütel

source: This knight catches her opponents off guard, dominating them with swift yet graceful attacks.
et: See rüütel tabab oma vastaseid ootamatult, domineerides neid kiirete, kuid graatsiliste rünnakutega.

source: X-Head Cannon
et: X-Peakütt

source: A monster with a mighty cannon barrel, it is able to integrate its attacks. It attacks in many ways by combining and separating with other monsters.
et: Võimsa kahuritoruga koletis, mis suudab oma rünnakuid integreerida. See ründab mitmel viisil, kombineerides ja eraldades end teistest koletistest.

source: Enemy Controller
et: Vastase Kontroller

source: Select and activate 1 of these effects:<BR>●Change the Battle Position of 1 face-up monster your opponent controls.<BR>●Tribute 1 monster. Select 1 face-up monster your opponent controls. Take control of it until the End Phase.
et: Vali ja aktiveeri üks nendest efektidest:<BR>●Muuda ühe vastase kontrollitava avatud positsiooniga koletise lahingupositsiooni.<BR>●Ohverda 1 koletis. Vali üks vastase kontrollitav avatud positsiooniga koletis. Võta selle üle kontroll End Phase'ini.

source: Master Kyonshee
et: Meister Kyonshee

source: A wandering Kyonshee searching for a strong rival to defeat. They say he was known as the master of all martial arts.
et: Rändav Kyonshee, kes otsib tugevat rivaali, keda alistada. Öeldakse, et ta oli kõigi võitluskunstide meister.

source: A huge monster in the shape of a hippopotamus. The sneezing from his gigantic body is so fierce that people mistake it for a hurricane.
et: Hiiglaslik koletis jõehobu kujul. Tema hiiglasliku keha aevastamine on nii tugev, et inimesed ajavad selle segi orkaaniga.

source: A log that attacks lost travelers in the forest. Originally a big tree, it was cut down and possessed by a wicked spirit.
et: Puit, mis ründab metsas eksinud rändureid. Algselt suur puu, see raiuti maha ja selle vallutas kuri vaim.

source: Gravekeeper's Spy
et: Hauakaevuri Spioon

source: FLIP: Special Summon 1 "Gravekeeper's" monster with 1500 or less ATK from your Deck.
et: FLIP: Kutsu oma pakist 1 "Hauavalvuri" koletis, mille ATK on 1500 või vähem.

source: Gravekeeper's Curse
et: Hauakaevurite needus

source: When this monster is Summoned, inflict 500 damage to your opponent.
et: Kui see koletis kutsutakse välja, tekitab see vastasele 500 kahju.

source: Gravekeeper's Guard
et: Hauavalvuri valvur

source: FLIP: Select 1 monster your opponent controls and return it to the hand.
et: FLIP: Vali 1 koletis, mida sinu vastane kontrollib, ja tagasta see käele.

source: Gravekeeper's Spear Soldier
et: Hauakaevuri Odasõdur

source: Gravekeeper's Vassal
et: Hauakaevuri vasall

source: Battle Damage this card inflicts to your opponent is treated as Effect damage instead.
et: Selle kaardi tekitatud lahingukahju käsitletakse hoopis efektikahjuna.

source: Gravekeeper's Watcher
et: Hauavalvuri Vaatleja

source: When your opponent activates an effect whereby your opponent discards a card(s) from his/her hand, you can send this card from your hand to the Graveyard to negate the activation of the effect and destroy it.
et: Kui sinu vastane aktiveerib efekti, mille käigus ta viskab kaardi(d) oma käest ära, saad saata selle kaardi oma käest Hauakambrisse, et efekti aktiveerimine tühistada ja see hävitada.

source: Gravekeeper's Chief
et: Haudavahtide Ülem

source: You can only control 1 "<M5515>Gravekeeper's Chief<M>". Cards in your Graveyard are unaffected by "<M5533>Necrovalley<M>". When this card is Tribute Summoned, you can select 1 "Gravekeeper's" monster from your Graveyard and Special Summon it.
et: Saad kontrollida ainult 1 "<M5515>Hauakaevajate Pealik<M>". Kaardid sinu Hauas ei ole mõjutatud "<M5533>Necrovalley<M>" poolt. Kui see kaart on ohverdamisega kutsutud, saad valida 1 "Hauakaevajate" koletise oma Hauast ja eriliselt kutsuda selle.

source: Gravekeeper's Cannonholder
et: Hauavalvuri kahurimees

source: You can Tribute 1 "Gravekeeper's" monster, expect "<M5516>Gravekeeper's Cannonholder<M>", to inflict 700 damage to your opponent.
et: Saad ohverdada 1 "Hauavalvuri" koletise, välja arvatud "<M5516>Hauavalvuri kahurimees<M>", et tekitada oma vastasele 700 kahju.

source: Gravekeeper's Assailant
et: Haudavahtide Ründaja

source: If "<M5533>Necrovalley<M>" is on the field when this card declares an attack, you can select 1 face-up monster your opponent controls and change its battle position.
et: Kui "<M5533>Necrovalley<M>" on väljakul, kui see kaart kuulutab välja rünnaku, saad valida ühe vastase kontrollitava avatud positsiooniga koletise ja muuta selle lahingupositsiooni.

source: A Man with Wdjat
et: Mees Wdjati märgiga

source: When you Normal Summon this card, and during each of your Standby Phases, select 1 Set card on your opponent's side of the field. Pick it up and look at it, then return it to its original position.
et: Kui sa kutsud selle kaardi tavalisel viisil välja ja iga oma ootejärgu faasi ajal, vali 1 seatud kaart oma vastase väljaku poolelt. Tõsta see üles ja vaata seda, seejärel pane see tagasi algsesse asendisse.

source: Mystical Knight of Jackal
et: Müstiline Šaakali Rüütel

source: When this card destroys 1 monster on your opponent's side of the field and sends it to your opponent's Graveyard as a result of battle, you can then return the card to the top of your opponent's Deck.
et: Kui see kaart hävitab 1 koletise sinu vastase väljakupoolel ja saadab selle lahingu tulemusena sinu vastase Hauakambrisse, siis saad selle kaardi tagasi panna oma vastase paki tippu.

source: A Cat of Ill Omen
et: Halvaende Kass

source: FLIP: Select 1 Trap Card from your Deck and place it on top of your Deck. If "<M5533>Necrovalley<M>" is on the field, you can add the selected card to your hand instead.
et: FLIP: Vali 1 lõksukaart oma pakist ja aseta see oma paki peale. Kui "<M5533>Necrovalley<M>" on väljakul, võid valitud kaardi selle asemel oma kätte lisada.

source: Yomi Ship
et: Yomi Laev

source: When this card is destroyed and sent to the Graveyard as a result of battle, destroy the monster that destroyed this card.
et: Kui see kaart hävitatakse ja saadetakse lahingu tulemusena Hauakambrisse, hävita koletis, mis selle kaardi hävitas.

source: Winged Sage Falcos
et: Tiivuline Tark Falcos

source: You can return your opponent's face-up Attack Position monster, that this card destroyed and sent to the Graveyard as a result of battle, to the top of your opponent's Deck.
et: Sa saad oma vastase lahingu tulemusena hävitatud ja Hauakambrisse saadetud avatud Rünnakupositsioonis oleva koletise tagasi panna oma vastase paki tippu.

source: An Owl of Luck
et: Õnne Öökull

source: FLIP: Select 1 Field Spell Card from your Deck and place it on top of your Deck. If "<M5533>Necrovalley<M>" is on the field, you can add the selected Field Spell Card to your hand, instead.
et: FLIP: Vali 1 Väliloitsu Kaart oma pakist ja aseta see oma paki peale. Kui "<M5533>Necrovalley<M>" on väljal, võid valitud Väliloitsu Kaardi lisada oma kätte, selle asemel.

source: Charm of Shabti
et: Shabti võlu

source: Discard this card from your hand. Until the End Phase, make the Battle Damage to monsters that include "Gravekeeper's" in their card name 0.
et: Viska see kaart oma käest. Kuni lõppfaasini tee lahingukahju koletistele, kelle kaardil on nimi "Hauavalvuri", 0.

source: Cobra Jar
et: Kobra Purg

source: FLIP: Special Summon 1 "<M3909>Poisonous Snake Token<M>" (Reptile-Type/EARTH/3 Stars/ATK 1200/DEF 1200). When the "<M3909>Poisonous Snake Token<M>" is destroyed as a result of battle, inflict 500 points of damage to your opponent's Life Points.
et: FLIP: Kutsu erivälja 1 "<M3909>Mürgine Madu Token<M>" (Roomaja-tüüp/MAA/3 Tähte/ATK 1200/DEF 1200). Kui "<M3909>Mürgine Madu Token<M>" hävitatakse lahingu tulemusena, põhjusta oma vastase Elupunktidele 500 punkti kahju.

source: Spirit Reaper
et: Vaimuniiduk

source: This card cannot be destroyed by battle. Destroy this card when it is targeted by a Spell, Trap, Spell/Trap effect or Effect Monster effect. When this card inflicts Battle Damage to your opponent by a direct attack, your opponent randomly discards 1 card.
et: Seda kaarti ei saa lahingus hävitada. Hävita see kaart, kui sellele on suunatud loits, lõks, loitsu/lõksu efekt või efektkoletise efekt. Kui see kaart tekitab otsese rünnakuga lahingukahju sinu vastasele, siis sinu vastane viskab juhuslikult ühe kaardi ära.

source: Nightmare Horse
et: Õudusunenäo Hobune

source: This card can attack your opponent's Life Points directly even if there is a monster on your opponent's side of the field.
et: See kaart võib rünnata sinu vastase Elupunkte otse, isegi kui sinu vastase väljakul on koletis.

source: Reaper on the Nightmare
et: Õudusunenäo Niiduk

source: "<M5526>Spirit Reaper<M>" + "<M5527>Nightmare Horse<M>"<BR>This card is not destroyed as a result of battle. Destroy this card when it is targeted by the effect of a Spell, Trap or Effect Monster. This card can attack your opponent's Life Points directly even if there is a monster on your opponent's side of the field. If this card successfully attacks your opponent's Life Points directly, your opponent discards 1 card randomly from his/her hand.
et: "<M5526>Vaimude Koristaja<M>" + "<M5527>Õudusunenäo Hobune<M>"<BR>See kaart ei hävine lahingu tulemusena. Hävita see kaart, kui see on sihitud Loitsu, Lõksu või Efektikoletise efekti poolt. See kaart võib rünnata sinu vastase Elupunkte otse, isegi kui sinu vastase poolel on koletis. Kui see kaart ründab edukalt sinu vastase Elupunkte otse, siis sinu vastane viskab juhuslikult ühe kaardi oma käest ära.

source: Card Shuffle
et: Kaardisegamine

source: Pay 300 Life Points to use this card's effect. Shuffle either your or your opponent's Deck. You can use this effect during your own turn, once per turn.
et: Makske 300 Elupunkti, et kasutada selle kaardi efekti. Sega kas enda või vastase pakk. Sa saad seda efekti kasutada oma käigu ajal, üks kord käigu jooksul.

source: Reasoning
et: Arutlus

source: Your opponent declares a monster Level. Then pick up cards from the top of your Deck until a monster that can be Normal Summoned is picked up. If that monster is the same Level as the one declared by your opponent, send all picked up cards to the Graveyard. If not, Special Summon the picked up monster and send the remaining cards to the Graveyard.
et: Sinu vastane kuulutab välja koletise taseme. Seejärel tõsta oma pakist kaarte seni, kuni tõstad üles koletise, mida saab normaalselt kutsuda. Kui see koletis on sama tasemega kui sinu vastase poolt kuulutatud, saada kõik tõstetud kaardid hauakambrisse. Kui ei, kutsu tõstetud koletis eriliselt välja ja saada ülejäänud kaardid hauakambrisse.

source: Dark Room of Nightmare
et: Õudusunenägude Tume Tuba

source: Each time your opponent takes damage from a card effect, except "<M5531>Dark Room of Nightmare<M>", inflict 300 damage to your opponent.
et: Iga kord, kui sinu vastane saab kaardiefektist kahju, välja arvatud "<M5531>Nightmare'i Pime Tuba<M>", tekitab see sinu vastasele 300 kahju.

source: Different Dimension Capsule
et: Teise dimensiooni kapsel

source: Select 1 card from Deck and remove it from play face-down. During your 2nd Standby Phase after activation, destroy this card and add the removed card to your hand.
et: Vali oma pakist 1 kaart ja eemalda see mängust tagurpidi. Teise ootejärgu faasi ajal pärast aktiveerimist hävita see kaart ja lisa eemaldatud kaart oma kätte.

source: Necrovalley
et: Necroorg

source: All "Gravekeeper's" monsters gain 500 ATK and DEF. Cards in either player's Graveyard cannot be removed from play. Cards in either player's Graveyard cannot be affected by card effects, except for their own effects
et: Kõik "Hauavalvuri" koletised saavad 500 ATK ja DEF juurde. Kaarte kummagi mängija Hauas ei saa mängust eemaldada. Kaarte kummagi mängija Hauas ei saa mõjutada kaardiefektid, välja arvatud nende enda efektid

source: Only a monster with an ATK of 1000 points or less can be equipped with this card. During damage calculation, increase the ATK of the monster equipped with this card by 2500 points if the opponent's monster that battles it is in Attack Position and its ATK is 2500 or more, OR if the opponent's monster that battles it is in Defense Position and its DEF is 2500 or more.
et: Selle kaardiga saab varustada ainult koletise, mille ATK on 1000 punkti või vähem. Kahju arvutamise ajal suurendage selle kaardiga varustatud koletise ATK-d 2500 punkti võrra, kui vastase koletis, millega see võitleb, on Rünnakupositsioonis ja selle ATK on 2500 või rohkem, VÕI kui vastase koletis, millega see võitleb, on Kaitsepositsioonis ja selle DEF on 2500 või rohkem.

source: Hieroglyph Lithograph
et: Hieroglüüfide litograafia

source: Pay 1000 Life Points. During the current Duel, your hand size limit becomes 7.
et: Makske 1000 Elupunkti. Praeguse Duelli ajal muutub sinu käe suuruse piirang 7-ks.

source: Dark Snake Syndrome
et: Pimeduse Madu Sündroom

source: Inflict damage to both players' Life Points during each of your Standby Phases. The first damage begins at 200 points and is doubled during each of your following Standby Phases.
et: Tekita mõlema mängija Elupunktidele kahju iga sinu Ootefaaside ajal. Esimene kahju algab 200 punktist ja kahekordistub iga järgneva Ootefaasiga.

source: Terraforming
et: Maavormimine

source: Add 1 Field Spell Card from your Deck to your hand.
et: Lisa oma pakist 1 Väljaloitsu kaart oma kätte.

source: Banner of Courage
et: Vapruse Lipp

source: During your Battle Phase only, all face-up monsters you control gain 200 ATK.
et: Ainult sinu lahingufaasis saavad kõik sinu kontrolli all olevad avatud koletised 200 ATK juurde.

source: Metamorphosis
et: Metamorfoos

source: Tribute 1 monster. Special Summon 1 Fusion Monster from your Extra Deck with the same Level as the Tributed monster.
et: Ohverda 1 koletis. Kutsu oma lisapakist välja 1 Fusion Monster, mille tase on sama, mis ohverdatud koletisel.

source: Royal Tribute
et: Kuninglik austusavaldus

source: Activate only when you control "<M5533>Necrovalley<M>". Both players discard all Monster Cards in their hands to the Graveyard
et: Aktiveeri ainult siis, kui sa kontrollid "<M5533>Necrovalley<M>". Mõlemad mängijad saadavad kõik oma käes olevad Koletiskaardid Hauakambrisse

source: Reversal Quiz
et: Tagurpidi Viktoriin

source: Send all cards in your hand and on your side of the field to the Graveyard. Call the type of card (Spell|, Trap, or Monster) on top of your Deck. If you call it right, exchange your current Life Points with your opponent's current ones.
et: Saada kõik kaardid oma käest ja oma väljaku poolelt Hauakambrisse. Nimeta oma paki pealmise kaardi tüüp (Maagia|, Lõks või Koletis). Kui nimetad õigesti, vaheta oma praegused Elupunktid oma vastase praeguste Elupunktidega.

source: Curse of Aging
et: Vananemise needus

source: Discard 1 card from your hand. Decrease the ATK and DEF of all monster on your opponent's side of the field by 500 points until the end of turn this card is activated.
et: Viska oma käest 1 kaart. Vähenda kõigi vastase poolel oleva koletise ATK ja DEF 500 punkti võrra kuni selle käigu lõpuni, mil see kaart aktiveeritakse.

source: Barrel Behind the Door
et: Uksest Tagasihoidev Tünn

source: Activate only when a card's effect that would inflict damage to you is activated. Your opponent takes the damage instead.
et: Aktiveeri ainult siis, kui aktiveeritakse kaardi efekt, mis tekitaks sulle kahju. Selle asemel saab kahju sinu vastane.

source: Raigeki Break
et: Raigeki Purustus

source: Discard 1 card to target 1 card on the field; destroy it.
et: Viska 1 kaart, et valida 1 kaart väljal; hävita see.

source: Narrow Pass
et: Kitsas Läbipääs

source: This card can only be activated when both players have 2 monsters or less on their respective sides of the field. Both players can only Normal Summon up to 2 additional monsters on their sides of the field.
et: Seda kaarti saab aktiveerida ainult siis, kui mõlemal mängijal on oma väljaku poolel 2 või vähem koletist. Mõlemad mängijad saavad oma väljaku poolele Normaal-Kutsuda kuni 2 lisakoletist.

source: Disturbance Strategy
et: Segadusstrateegia

source: Your opponent adds all cards in his/her hand to the Deck and shuffles the Deck. Your opponent then draws the same number of cards that he/she added to the Deck.
et: Sinu vastane lisab kõik kaardid oma käest tagasi pakki ja segab paki. Seejärel tõmbab sinu vastane sama arvu kaarte, mis ta pakki lisas.

source: Trap of Board Eraser
et: Lõksulaudade Kustutaja

source: You can only activate this card when an effect that inflicts damage to your Life Points is activated (except Battle Damage). Negate the Effect Damage you receive and your opponent then selects 1 card from his/her hand and discards it.
et: Seda kaarti saab aktiveerida ainult siis, kui aktiveeritakse efekt, mis tekitab sinu Elupunktidele kahju (välja arvatud Lahingukahju). Tühista saadud Efektikahju ja seejärel valib sinu vastane ühe kaardi oma käest ja viskab selle ära.

source: Rite of Spirit
et: Vaimu Riitus

source: Select and Special Summon 1 "Gravekeeper's" monster from your Graveyard. This effect cannot be negated by the effect of "<M5533>Necrovalley<M>".
et: Vali ja Kutsu Eriliselt välja 1 "Hauavalvuri" koletis oma Hauakambrist. Seda efekti ei saa tühistada "<M5533>Necrovalley<M>" efekti poolt.

source: Non Aggression Area
et: Mittekallutusala

source: You can only activate this card during your Standby Phase. Discard 1 card from your hand. Your opponent cannot Normal Summon, Set and/or Special Summon during his/her next turn.
et: Seda kaarti saad aktiveerida ainult oma ootejärgus. Viska 1 kaart oma käest ära. Sinu vastane ei saa oma järgmisel käigul normaalset kutsumist, seadmist ja/või erilist kutsumist teha.

source: D. Tribe
et: D. Hõim

source: All monsters on your side of the field are treated as Dragon-Type until the End Phase of this turn.
et: Kõiki sinu väljaku poolel olevaid koletisi käsitletakse selle käigu lõppfaasini Draakoni-tüüpi koletistena.

source: Y-Dragon Head
et: Y-Draakoni Pea

source: Once per turn, during your Main Phase, you can equip this card to "<M5504>X-Head Cannon<M>" you control as an Equip Card, OR unequip it to Special Summon this card in face-up Attack Position. While equipped to a monster by this effect, that monster gains 400 ATK and DEF. (A monster can only be equipped with 11 Union Monster at a time. If the equipped monster would be destroyed by battle, destroy this card instead.)
et: Korra ühe korra käigu jooksul, oma peafaasis, saad selle kaardi kinnitada "<M5504>X-Head Cannon<M>" külge, mida sa kontrollid, kui Varustuskaart, VÕI eemaldada see, et Kutsuda see kaart erilisesse rünnakupositsiooni. Kui see on selle efekti abil kinnitatud koletise külge, saab see koletis 400 ATK ja DEF juurde. (Koletis saab korraga olla kinnitatud ainult 1 Liidu Koletisega. Kui kinnitatud koletis hävitatakse lahingus, hävita selle asemel see kaart.)

source: "<M5504>X-Head Cannon<M>" + "<M5552>Y-Dragon Head<M>"<BR>This card can only be Special Summoned from your Extra Deck by removing from play the above cards on your side of the field. (You do not use "<M4837>Polymerization<M>"). Discard 1 card from your hand to destroy 1 face-up Spell or Trap Card on your opponent's side of the field.
et: "<M5504>X-Head Cannon<M>" + "<M5552>Y-Dragon Head<M>"<BR>Seda kaarti saab eriliselt kutsuda oma lisapakist, eemaldades mängust ülaltoodud kaardid oma väljalt. (Sa ei kasuta "<M4837>Polymerization<M>"). Hävita 1 kaart oma käest, et hävitada 1 avatud Võlu- või Lõksukaart oma vastase väljalt.

source: Z-Metal Tank
et: Z-Metalltank

source: Once per turn, during your Main Phase, you can equip this card to "<M5504>X-Head Cannon<M>" or "<M5552>Y-Dragon Head<M>" you control as an Equip Card, OR unequip it to Special Summon this card in face-up Attack Position. While equipped to a monster by this effect, that monster gains 600 ATK and DEF. (A monster can only be equipped with 11 Union Monster at a time. If the equipped monster would be destroyed by battle, destroy this card instead.)
et: Korra ühe korra oma peafaasil saad selle kaardi varustada "<M5504>X-Head Cannon<M>" või "<M5552>Y-Dragon Head<M>"-le, mida sa kontrollid, kui Varustuskaart, VÕI eemaldada selle varustusest, et Kutsuda see kaart eriliselt esile rünnakupositsioonis. Kui see on selle efekti abil koletisele varustatud, saab see koletis 600 ATK ja DEF juurde. (Koletisele saab korraga varustada ainult ühe Liidu Koletise. Kui varustatud koletis hävitatakse lahingus, hävita selle asemel see kaart.)

source: XYZ-Dragon Cannon
et: XYZ-Draakoni Kahur

source: "<M5504>X-Head Cannon<M>" + "<M5552>Y-Dragon Head<M>" + "<M5555>Z-Metal Tank<M>"<BR>This card can only be Special Summoned from your Extra Deck by removing from play the above cards you control. (You do not use "<M4837>Polymerization<M>".) This card cannot be Special Summoned from the Graveyard. You can discard 1 card to destroy 1 card your opponent controls.
et: "<M5504>X-Head Cannon<M>" + "<M5552>Y-Dragon Head<M>" + "<M5555>Z-Metal Tank<M>"<BR>Seda kaarti saab eriliselt kutsuda oma lisapakist, eemaldades mängust ülaltoodud kaardid, mida sa kontrollid. (Sa ei kasuta "<M4837>Polymerization<M>".) Seda kaarti ei saa kutsuda hauast. Sa võid ühe kaardi ära visata, et hävitada üks kaart, mida su vastane kontrollib.

source: Soul Rope
et: Hinge Köis

source: Activate only by paying 1000 Life Points when a monster you control is destroyed and sent to the Graveyard. Special Summon 1 Level 4 monster from your Deck.
et: Aktiveeri ainult 1000 Elupunkti maksmisega, kui sinu kontrollitav koletis hävitatakse ja saadetakse Hauakambrisse. Kutsu eriliselt välja 1 4. taseme koletis oma pakist.

source: King's Knight
et: Kuningasrüütel

source: When this card is Normal Summoned, if you control "<M5503>Queen's Knight<M>", you can Special Summon 1 "<M5559>Jack's Knight<M>" from your Deck.
et: Kui see kaart on Normaal-Kutsutud ja kui sa kontrollid "<M5503>Queen's Knight<M>", saad sa oma pakist Eriliselt Kutsuda 1 "<M5559>Jack's Knight<M>".

source: Jack's Knight
et: Jacki Rüütel

source: A strong master swordsman. His loyalty is to justice, his duty to protect the weak.
et: Tugev mõõgameister. Tema lojaalsus kuulub õiglusele, tema kohus on kaitsta nõrku.

source: Interdimensional Matter Transporter
et: Interdimensionaalne Aine Transporter

source: Select 1 face-up monster you control and remove it from play until the End Phase of this turn.
et: Vali 1 avatud positsioonis olev koletis, mida sa kontrollid, ja eemalda see mängust kuni selle käigu lõppfaasini.

source: Goblin Zombie
et: Kääbuszombi
