Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: This card is treated as a Normal Monster while face-up on the field or in the Graveyard. While this card is face-up on the field, you can Normal Summon it to have it be treated as an Effect Monster with this effect:<BR>● Once per turn, you can discard 1 "Gem-Knight" card to add 1 of your removed from play monsters to your hand.
et: See kaart loetakse tavaliseks koletiseks, kui see on näoga ülespoole väljakul või hauas. Kui see kaart on näoga ülespoole väljakul, võid selle tavaliselt kutsuda, et seda käsitletaks efektikoletisena järgmise efektiga:<BR>● Kord käigu jooksul võid sa ühe "Gem-Knight" kaardi ära visata, et lisada üks sinu mängust eemaldatud koletis oma kätte.

source: Laval Lady of The Burning Lake
et: Põleva Järve Laval Daam

source: If there are 3 or more different "Laval" monsters in your Graveyard, you can remove from play 1 "Laval" monster and this card from your Graveyard to select 1 Set card your opponent controls. Destroy that card.
et: Kui sinu kalmistul on 3 või rohkem erinevat "Laval" koletist, saad sa eemaldada mängust 1 "Laval" koletise ja selle kaardi oma kalmistult, et valida 1 seatud kaart, mida sinu vastane kontrollib. Hävita see kaart.

source: If you have 3 or more different "Laval" monsters in your Graveyard, you can Special Summon this card from your hand.
et: Kui sul on oma Hauakambris 3 või rohkem erinevat "Laval" koletist, saad selle kaardi oma käest eriliselt välja kutsuda.

source: Laval Gunner
et: Laval Laskur

source: When this card is Normal Summoned while you have a "Laval" monster in your Graveyard other than "<M9587>Laval Gunner<M>", you can send the top 5 cards of your Deck to the Graveyard. This card gains 200 ATK for each "Laval" monster sent to the Graveyard by this effect.
et: Kui see kaart on Normaal-Kutsutud, kui sul on Hauakambris mõni "Laval" koletis peale "<M9587>Laval Gunner<M>", saad sa saata oma Paki 5 ülemist kaarti Hauakambrisse. See kaart saab 200 ATK iga "Laval" koletise kohta, mis selle efekti abil Hauakambrisse saadeti.

source: Once per turn, during your Main Phase, you can equip this card to a face-up "Vylon" monster you control as an Equip Card, OR unequip it to Special Summon this card in face-up Attack Position. While equipped to a monster by this effect, if the equipped monster destroys an opponent's monster by battle, you can select 1 card your opponent controls and destroy it. (A monster can only be equipped with 11 Union Monster at a time. If the equipped monster would be destroyed, destroy this card instead.)
et: Korra ühe korra oma peafaasil saad selle kaardi kinnitada oma kontrollitava avatud "Vylon" koletise külge kui Varustuskaart VÕI eemaldada selle kinnituse, et Kutsuda see kaart eriliselt avatud Rünnakupositsioonis. Kui see kaart on selle efekti abil koletise külge kinnitatud ja kinnitatud koletis hävitab lahingus vastase koletise, saad valida ühe kaardi, mida vastane kontrollib, ja hävitada selle. (Koletis saab korraga olla kinnitatud ainult ühe Liidu Koletisega. Kui kinnitatud koletis hävitatakse, hävita selle asemel see kaart.)

source: Once per turn, during your Main Phase, you can equip this card to a face-up "Vylon" monster you control as an Equip Card, OR unequip it to Special Summon this card in face-up Attack Position. While equipped to a monster by this effect, if the equipped monster destroys an opponent's monster by battle, you can Special Summon 1 Level 4 or lower "Vylon" monster from your Graveyard. (A monster can only be equipped with 11 Union Monster at a time. If the equipped monster would be destroyed, destroy this card instead.)
et: Korra ühe korra oma peafaasis saad selle kaardi kinnitada oma kontrollitava avatud "Vylon" koletise külge kui Varustuskaart VÕI eemaldada see, et Kutsuda see kaart eriliselt avatud Rünnakupositsioonis. Kui see on selle efekti abil koletise külge kinnitatud ja kui kinnitatud koletis hävitab lahingus vastase koletise, saad eriliselt Kutsuda 1 4. taseme või madalama "Vylon" koletise oma Hauakambrist. (Koletise külge saab kinnitada korraga ainult 1 Liidu Koletis. Kui kinnitatud koletis hävitatakse, hävita selle asemel see kaart.)

source: Once per turn, you can select 1 face-up "Vylon" Equip Card. Unequip it, and equip it to another appropriate monster. This effect can be activated during your opponent's turn.
et: Korra ühe korra käigu jooksul saad valida 1 avatud "Vylon" Varustuse Kaardi. Eemalda see ja varusta sellega teine sobiv koletis. Seda efekti saab aktiveerida vastase käigu ajal.

source: Vision Gishki
et: Visioon Gishki

source: If you Ritual Summon a WATER Ritual Monster, this 1 card can be used as the entire Tribute. You can discard this card; add 1 "Gishki" Ritual Monster from your Deck to your hand.
et: Kui sa kutsud rituaaliga välja VEE rituaalikoletise, saab seda 1 kaarti kasutada kogu ohvrina. Sa võid selle kaardi ära visata; lisa 1 "Gishki" rituaalikoletis oma pakist oma kätte.

source: This card cannot be Special Summoned. This card returns to the hand during the End Phase of the turn it is Normal Summoned or flipped face-up. If this card is Normal Summoned or flipped face-up while you control another face-up "Gishki" monster, negate the effects of Trap Cards on the field, until the End Phase.
et: Seda kaarti ei saa eriliselt kutsuda. See kaart naaseb käesoleva käigu lõppfaasis kätte, kui see on normaalne kutsutud või ümber pööratud. Kui see kaart on normaalne kutsutud või ümber pööratud, kui kontrollid teist ülespööratud "Gishki" koletist, tühista lõppfaasini väljaku lõksukaartide efektid.

source: Gishki Shellfish
et: Gishki Karploom

source: When this card is sent to the Graveyard by a card effect, reveal the top 3 cards of your Deck, and return them to the top or bottom of your Deck in any order.
et: Kui see kaart saadetakse kaardiefekti tõttu Hauakambrisse, paljasta oma paki 3 ülemist kaarti ja aseta need oma paki üla- või alaossa suvalises järjekorras tagasi.

source: When this face-up card on the field is sent to the Graveyard, except when destroyed by battle, you can Special Summon 1 "Gusto" monster from your Deck in face-down Defense Position.
et: Kui see avatud kaart väljakul saadetakse kalmistule, välja arvatud lahingus hävitamise korral, võid eriliselt kutsuda 1 "Gusto" koletise oma pakist tagurpidi kaitsepositsioonis.

source: Kamui, Hope of Gusto
et: Kamui, Gusto Lootus

source: FLIP: Special Summon 1 "Gusto" Tuner monster from your Deck.
et: FLIP: Kutsu oma pakist välja 1 "Gusto" häälestuskoletis.

source: Musto, Priest of Gusto
et: Musto, Gusto preester

source: Once per turn, select 1 "Gusto" monster in your Graveyard and 1 face-up monster on the field. Return the monster in the Graveyard to the Deck and Negate the effect(s) of the selected monster on the field, until the End Phase.
et: Üks kord käigu jooksul vali 1 "Gusto" koletis oma Hauakambris ja 1 avatud koletis väljakul. Tagasta koletis Hauakambrist pakki ja tühista valitud koletise efekt(id) väljakul kuni lõppfaasini.

source: Must first be Ritual Summoned with a "Gishki" Ritual Spell Card. When this card is Ritual Summoned: Look at up to 2 random cards in your opponent's hand and shuffle 1 of them into the Deck.
et: Peab kõigepealt Rituaalsummonima "Gishki" Rituaaliloitsukaardiga. Kui see kaart on Rituaalsummonitud: Vaata kuni 2 juhuslikku kaarti oma vastase käest ja sega 1 neist tagasi pakki.

source: Gem-Knight Amethyst
et: Gem-Knight Ametüst

source: 1 "Gem-Knight" monster + 1 Aqua-Type monster<BR>This card can only be Special Summoned by Fusion Summon, from the Extra Deck. When this card is sent from the field to the Graveyard, return all Set Spell/Trap Cards on the field to the hand.
et: 1 "Gem-Knight" koletis + 1 Aqua-tüüpi koletis<BR>Seda kaarti saab eriliselt kutsuda ainult Fusion Summon'i abil, lisapakist. Kui see kaart saadetakse väljakult hauakambrisse, tagasta kõik väljakul olevad seatud loitsu/lõksukaardid kätte.

source: 1 Tuner + 1 or more non-Tuner FIRE monsters<BR>Once per turn, during your Main Phase: You can add 1 "Laval" monster from your Deck to your hand then send 1 "Laval" monster from your hand to the Graveyard.
et: 1 Tuner + 1 või rohkem mitte-Tuner TULEKAHJU koletist<BR>Kord kord, oma peafaasi ajal: Sa võid lisada 1 "Laval" koletise oma pakist oma kätte, seejärel saata 1 "Laval" koletise oma käest hauakambrisse.

source: 1 Tuner + 1 or more non-Tuner "Gusto" monsters<BR>When this card is Synchro Summoned: All face-up "Gusto" monsters gain 600 ATK.
et: 1 Tuner + 1 või rohkem mitte-Tuner "Gusto" koletist<BR>Kui see kaart on Sünkro Kutsutud: Kõik avatud "Gusto" koletised saavad 600 ATK juurde.

source: 2 Level 4 monsters
et: 2. taseme 4 koletist

source: 2 Level 3 monsters<BR>If this card battles, you can activate this effect once during the Damage Step. If you do, detach 1 Xyz Material from this card to have it gain 500 ATK until the End Phase.
et: 2. taseme 3 koletist<BR>Kui see kaart võitleb, saad selle efekti aktiveerida üks kord Kahjustuse Etapi ajal. Kui teed seda, eemalda 1 Xyz Materjal sellelt kaardilt, et see saaks 500 ATK juurde kuni Lõppfaasini.

source: 3 Level 4 monsters<BR>Once per turn: You can detach 1 Xyz Material from this card to target 1 face-up Attack Position Effect Monster your opponent controls; equip that target to this card. When this card battles a monster with the same Attribute as the monster(s) equipped to this card by this card's effect: Destroy that monster at the start of the Damage Step (without applying damage calculation).
et: 3. taseme 4 koletist<BR>Kord kord: Sa võid selle kaardi küljest eemaldada 1 Xyz Materjali, et sihtida 1 vastase kontrollitavat ründepositsioonis Efektkoletist; kinnita see sihtmärk selle kaardi külge. Kui see kaart võitleb koletisega, millel on sama atribuut kui selle kaardi efekti abil kinnitatud koletisel: Hävita see koletis Kahjustusetapi alguses (ilma kahjustuse arvutamiseta).

source: Evigishki Merrowgeist
et: Igavishki Merrowgeist

source: 2 Level 4 monsters<BR>If this card destroys a monster by battle, after damage calculation: You can detach 1 Xyz Material from this card; return that monster to the Deck instead of sending it to the Graveyard.
et: 2. taseme 4 koletist<BR>Kui see kaart hävitab lahingus koletise, pärast kahju arvutamist: Sa võid selle kaardi küljest eemaldada 1 Xyz Materjali; selle asemel, et saata see koletis Hauakambrisse, tagasta see Paki.

source: 2 Level 2 monsters<BR>Once per turn: You can detach 1 Xyz Material from this card to target 1 face-up WIND monster you control; that target can attack twice during this turn's Battle Phase.
et: 2. taseme 2 koletist<BR>Korra käigu jooksul: Sa võid eemaldada 1 Xyz Materjali selle kaardi küljest, et sihtida 1 avatud WIND koletist, mida sa kontrollid; see sihtmärk võib rünnata kaks korda selle käigu Lahingu Faasis.

source: Particle Fusion
et: Osakeste sulandumine

source: Send, from your side of the field to the Graveyard, Fusion Material Monsters listed on a "Gem-Knight" Fusion Monster Card, and Special Summon that monster from your Extra Deck. (This Special Summon is treated as a Fusion Summon.) Then, you can remove from play this card from your Graveyard to select 1 "Gem-Knight" Fusion Material Monster used for that Fusion Summon. Until the End Phase, the Fusion Monster gains ATK equal to the selected monster's ATK.
et: Saada oma väljaku poolelt Hauakambrisse Fusion Material Monsters, mis on loetletud "Gem-Knight" Fusion Monster Card'il, ja Special Summon see koletis oma Extra Deck'ist. (See Special Summon käsitletakse kui Fusion Summon.) Seejärel saad eemaldada selle kaardi oma Hauakambrist, et valida 1 "Gem-Knight" Fusion Material Monster, mida kasutati selle Fusion Summon jaoks. Kuni End Phase'ini saab Fusion Monster ATK, mis on võrdne valitud koletise ATK-ga.

source: Vylon Polytope
et: Vylon Polütoop

source: Select any number of "Vylon" Monster Cards you control that are treated as Equip Cards, and Special Summon them in face-up Defense Position. When a monster Special Summoned by this effect is removed from field, remove it from play.
et: Vali ükskõik milline arv "Vylon" koletise kaarte, mida sa kontrollid ja mida käsitletakse varustuskaartidena, ning kutsu need eriliselt välja avatud kaitsepositsioonis. Kui selle efekti abil eriliselt välja kutsutud koletis eemaldatakse väljakult, eemalda see mängust.

source: Equip only to a "Vylon" monster. It cannot be targeted by the effects of your opponent's Trap Cards or Effect Monsters. If this face-up card is sent to the Graveyard, you can add 1 "Vylon" Spell Card from your Deck to your hand.
et: Varusta ainult "Vylon" koletisega. Sinu vastase Lõksukaartide või Efektikoletiste efektid ei saa seda sihtida. Kui see avatud kaart saadetakse Hauakambrisse, saad lisada oma pakist 1 "Vylon" Loitsukaardi oma kätte.

source: Blazing Dust Explosion
et: Põlev Tolmupuhang

source: Remove from play all "Laval" monsters from your Graveyard. Destroy cards on the field, up to the number of monsters removed from play by this effect.
et: Eemalda mängust kõik "Laval" koletised oma Hauakambrist. Hävita kaardid väljal, kuni eemaldate mängust selle efekti abil koletiste arvu.

source: Ceremonial Mirror of Illusion
et: Iluusiooni Tseremoniaalne Peegel

source: Special Summon a "Gishki" Ritual Monster from your hand, ignoring the Summoning conditions. A Ritual Monster Special Summoned by this effect cannot attack. During the End Phase, return it to the hand.
et: Erikutsuge oma käest välja "Gishki" rituaalikoletis, eirates kutsumistingimusi. Selle efektiga erikutsutud rituaalikoletis ei saa rünnata. Lõppfaasis tagasta see käele.

source: Gusto Whirlwind
et: Gusto Pööris

source: If you control no monsters: Target 2 “Gusto” monsters in your Graveyard and return those targets to the Deck; Special Summon 1 “Gusto” monster with 1000 or less DEF from your Deck.
et: Kui sul pole ühtegi koletist: Sihtmärk 2 “Gusto” koletist oma Hauas ja tagasta need sihtmärgid Pakki; Kutsu eriliselt esile 1 “Gusto” koletis, mille DEF on 1000 või vähem, oma Pakist.

source: Steelswarm Roach
et: Terassülem Prussakas

source: 2 Level 4 monsters<BR>When a Level 5 or higher monster would be Special Summoned: You can detach 1 Xyz Material from this card; negate the Special Summon and destroy it.
et: 2. taseme 4 koletist<BR>Kui 5. taseme või kõrgem koletis kutsutakse eriliselt välja: Sa võid sellelt kaardilt eemaldada 1 Xyz Materjali; tühista eriline väljakutse ja hävita see.

source: Gagaga Magician
et: Gagaga Maag

source: Once per turn, during your Main Phase: You can declare a Level from 1 to 8; this card becomes that Level until the End Phase. You can only control 1 face-up "<M9618>Gagaga Magician<M>". This card cannot be used as a Synchro Material Monster.
et: Kord ühe korra oma peafaasil: Sa võid valida taseme vahemikus 1 kuni 8; see kaart muutub selleks tasemeks kuni lõppfaasini. Sa saad kontrollida ainult ühte avatud "<M9618>Gagaga Maag<M>". Seda kaarti ei saa kasutada Sünkro Materjal Koletisena.

source: Once per turn, this face-up Defense Position card cannot be destroyed by battle.
et: Kord ühe korra käigu jooksul ei saa seda avatud kaitseasendis kaarti lahingus hävitada.

source: Achacha Archer
et: Achacha Ambur

source: When this card is Normal or Flip Summoned: Inflict 500 damage to your opponent.
et: Kui see kaart on normaal- või pöördkutsutud: põhjusta oma vastasele 500 kahju.

source: When this card is Normal Summoned: You can Special Summon 1 Level 4 or lower monster from your hand, then change this card to Defense Position.
et: Kui see kaart on Normaal-Kutsutud: Sa saad Eriliselt Kutsuda 1 Tase 4 või madalama koletise oma käest, seejärel muuta see kaart Kaitsepositsiooni.

source: Big Jaws
et: Suured lõuad

source: At the end of the Battle Phase, if this card attacked: Banish it.
et: Battle Phase'i lõpus, kui see kaart ründas: Eemalda see mängust.

source: Skull Kraken
et: Koljulu Kraken

source: When this card is Normal Summoned: You can target 1 face-up Spell Card your opponent controls; destroy that target. Once per turn: You can change the Battle Position of this card.
et: Kui see kaart on normaalvälja kutsutud: Sa saad valida 1 vastase kontrollitava avatud Võlukaardi; hävita see sihtmärk. Kord käigu jooksul: Sa saad muuta selle kaardi lahingupositsiooni.

source: Drill Barnacle
et: Puurpinn

source: This card can attack your opponent directly. Each time this card inflicts Battle Damage to your opponent by a direct attack: This card gains 1000 ATK.
et: See kaart võib rünnata sinu vastast otse. Iga kord, kui see kaart tekitab sinu vastasele otsese rünnakuga lahingukahju: see kaart saab 1000 ATK juurde.

source: Jawsman
et: <translated Lõuamees

source: Cannot be Special Summoned. If you Tribute Summon this card, all Tributes must be WATER. This card gains 300 ATK for each face-up WATER monster you control, except this card.
et: Ei saa eriliselt kutsuda. Kui sa kutsud selle kaardi ohverdades, peavad kõik ohverdused olema VESI. See kaart saab 300 ATK iga sinu kontrollitava ülespoole suunatud VESI koletise eest, välja arvatud see kaart.

source: Crashbug X
et: Krahhibug X

source: When this card is Normal Summoned: You can Special Summon 1 "<M9628>Crashbug Z<M>" from your Deck. You must control a face-up "<M9627>Crashbug Y<M>" to activate and to resolve this effect.
et: Kui see kaart on Normaal-Kutsutud: Sa võid Eriliselt Kutsuda 1 "<M9628>Crashbug Z<M>" oma Pakist. Selle efekti aktiveerimiseks ja lahendamiseks pead sa kontrollima avatud "<M9627>Crashbug Y<M>".

source: When this card is Normal Summoned: You can Special Summon 1 "<M9626>Crashbug X<M>" from your Deck. You must control a face-up "<M9628>Crashbug Z<M>" to activate and to resolve this effect.
et: Kui see kaart on Normaal-Kutsutud: Sa võid Eriliselt Kutsuda 1 "<M9626>Crashbug X<M>" oma pakist. Selle efekti aktiveerimiseks ja lahendamiseks pead sa kontrollima ülespööratud "<M9628>Crashbug Z<M>".

source: When this card is Normal Summoned: You can Special Summon 1 "<M9627>Crashbug Y<M>" from your Deck. You must control a face-up "<M9626>Crashbug X<M>" to activate and resolve this effect.
et: Kui see kaart on Normaal-Kutsutud: Sa saad Erilis-Kutsuda 1 "<M9627>Crashbug Y<M>" oma pakist. Selle efekti aktiveerimiseks ja lahendamiseks pead sa kontrollima avatud "<M9626>Crashbug X<M>".

source: Super Crashbug
et: Super Krahviga

source: Cannot be Normal Summoned or Set. Must first be Special Summoned (from the hand) in face-up Defense Position, by banishing "<M9626>Crashbug X<M>", "<M9627>Crashbug Y<M>", and "<M9628>Crashbug Z<M>" from your Graveyard. Switch the ATK and DEF of all face-up Attack Position monsters on the field. There can only be 1 face-up "<M9629>Super Crashbug<M>" on the field.
et: Ei saa normaalset kutsuda ega asetada. Esmalt tuleb eriliselt kutsuda (käest) avatud kaitseasendisse, eemaldades oma hauakambrist "<M9626>Crashbug X<M>", "<M9627>Crashbug Y<M>" ja "<M9628>Crashbug Z<M>". Vaheta kõigi lahinguasendis olevate avatud koletiste ATK ja DEF. Väljakul võib olla ainult 1 avatud "<M9629>Super Crashbug<M>".

source: Wind-Up Soldier
et: Mehaaniline Sõdur

source: During your Main Phase: You can increase this card's Level by 1 and ATK by 400, until the End Phase. This effect can only be used once while this card is face-up on the field.
et: Oma peafaasis: Saad selle kaardi taset tõsta 1 võrra ja ATK-d 400 võrra kuni lõppfaasini. Seda efekti saab kasutada ainult üks kord, kui see kaart on lahinguväljal avatud.

source: Wind-Up Magician
et: Tuulekeeris Maag

source: If the effect of a "Wind-Up" monster is activated, except "<M9631>Wind-Up Magician<M>": You can Special Summon 1 Level 4 or lower "Wind-Up" monster from your Deck in face-up Defense Position. This effect can only be used once while this card is face-up on the field.
et: Kui aktiveeritakse "Wind-Up" koletise efekt, välja arvatud "<M9631>Wind-Up Magician<M>": Sa võid oma pakist eriliselt kutsuda 1 taseme 4 või madalama "Wind-Up" koletise avatud kaitsepositsioonis. Seda efekti saab kasutada ainult üks kord, kui see kaart on väljakul avatud.

source: Wind-Up Juggler
et: Tuulekeerutaja Žonglöör

source: After damage calculation, if this card battled an opponent's monster: You can destroy the opponent's monster. This effect can only be used once while this card is face-up on the field.
et: Pärast kahju arvutamist, kui see kaart võitles vastase koletisega: Sa võid hävitada vastase koletise. Seda efekti saab kasutada ainult üks kord, kui see kaart on väljaku peal avatud.

source: Wind-Up Dog
et: Kerivõti Koer

source: During your Main Phase: You can increase this card's Level by 2 and ATK by 600, until the End Phase. This effect can be used only once while this card is face-up on the field.
et: Oma peafaasil: Saad selle kaardi taset tõsta 2 võrra ja ATK-d 600 võrra kuni lõppfaasini. Seda efekti saab kasutada ainult üks kord, kui see kaart on lahinguväljal avatud.

source: Wind-Up Snail
et: Kerimehhanism-Tigu

source: During your Main Phase: You can target 1 Set card on the field; return that target to the hand. This effect can be used only once while this card is face-up on the field.
et: Oma peafaasia ajal: Sa võid valida ühe seatud kaardi väljakul; tagasta see sihtmärk kätte. Seda efekti saab kasutada ainult üks kord, kui see kaart on väljakul avatud.

source: Spearfish Soldier
et: Ogalik Sõdur

source: This card gains 100 ATK for each of your banished Fish, Sea Serpent, and Aqua-Type monsters.
et: See kaart saab 100 ATK iga sinu eemaldatud Kalade, Meremadude ja Vee tüüpi koletise eest.

source: Flyfang
et: Lendhammas

source: If this card attacks a Defense Position monster, inflict piercing Battle Damage to your opponent. At the end of the Battle Phase, if this card inflicted Battle Damage to your opponent: Banish this card until your next Standby Phase.
et: Kui see kaart ründab kaitseasendis olevat koletist, põhjusta vastasele läbistavat lahingukahju. Lahingufaasi lõpus, kui see kaart põhjustas vastasele lahingukahju: eemalda see kaart mängust kuni järgmise ooteetapini.

source: Skystarray
et: Taevakaar

source: This card can attack your opponent directly. At the end of the Battle Phase, if this card attacked directly: Banish this card until your next Standby Phase.
et: See kaart võib rünnata sinu vastast otse. Lahingufaasi lõpus, kui see kaart ründas otse: eemalda see kaart mängust kuni sinu järgmise Ootefaasini.

source: Airorca
et: Õhuorka

source: Once per turn: You can banish 1 Fish, Sea Serpent, or Aqua-Type monster from your hand to target 1 face-up card your opponent controls; destroy that target, then banish this card until your next Standby Phase.
et: Kord korra: Sa võid oma käest eemaldada mängust 1 Kala-, Meremadu- või Vee- tüüpi koletise, et sihtida 1 vastase kontrollitavat avatud kaarti; hävita see sihtmärk, seejärel eemalda see kaart mängust kuni oma järgmise Ootefaasini.

source: Wingtortoise
et: Tiivulise

source: When a face-up Fish, Sea Serpent, or Aqua-Type monster(s) you control is banished: You can Special Summon this card from your hand or Graveyard. (The banished monster(s) must be Fish, Sea Serpent, or Aqua-Type even after being banished.)
et: Kui sinu kontrolli all olevad avatud Kalad, Meremadu või Veeolend-tüüpi koletised eemaldatakse mängust: Sa võid selle kaardi oma käest või Hauast eriliselt kutsuda. (Eemaldatud koletised peavad olema Kalad, Meremadu või Veeolend-tüüpi ka pärast eemaldamist.)

source: Space-Time Police
et: Aja-Ruumi Politsei

source: When this card is Special Summoned: Target 1 face-up card your opponent controls; banish that target. When this card leaves the field: Set the card that was banished by this effect to your opponent's side of the field.
et: Kui see kaart on eriliselt kutsutud: Sihtige 1 avatud kaarti, mida teie vastane kontrollib; pagendage see sihtmärk. Kui see kaart lahkub väljakult: Asetage kaart, mis selle efekti tõttu pagendati, teie vastase väljaku poolele.

source: Time Escaper
et: Aja Põgeneja
