Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: Destroy all monsters equipped with Equip Spell Cards.
et: Hävita kõik koletised, kellel on varustusloitsukaardid.

source: Megamorph
et: Megamorf

source: While your Life Points are lower than your opponent's, the original ATK of the equipped monster is doubled. While your Life Points are higher, the original ATK of the equipped monster is halved.
et: Kui sinu Elupunktid on madalamad kui sinu vastasel, on varustatud koletise algne ATK kahekordne. Kui sinu Elupunktid on kõrgemad, on varustatud koletise algne ATK poole väiksem.

source: Metalmorph
et: Metallimuundaja

source: Target 1 monster; equip this card to that target. That target gains 300 ATK and DEF. If the target attacks, it gains ATK equal to half the ATK of the attack target, during damage calculation only.
et: Sihti 1 koletis; kinnita see kaart sellele sihtmärgile. See sihtmärk saab 300 ATK ja DEF juurde. Kui sihtmärk ründab, saab see rünnaku sihtmärgi ATK-st võrdse ATK juurde, ainult kahju arvutamise ajal.

source: Acid Rain
et: Happesadu

source: Destroy all face-up Machine-Type monsters on the field.
et: Hävita kõik lahinguväljal olevad avatud Masinatüüpi koletised.

source: Crush Card Virus
et: Purustav Kaardiviirus

source: Tribute 1 DARK monster with 1000 or less ATK. Check all monsters your opponent controls, your opponent's hand, and all cards they draw (until the end of your opponent's 3rd turn after this card's activation), and destroy all monsters with 1500 or more ATK.
et: Ohverda 1 PIMEDUS koletis, mille ATK on 1000 või vähem. Kontrolli kõiki vastase kontrollitavaid koletisi, vastase kätt ja kõiki kaarte, mida nad tõmbavad (kuni vastase 3. käigu lõpuni pärast selle kaardi aktiveerimist), ja hävita kõik koletised, mille ATK on 1500 või rohkem.

source: Eradicating Aerosol
et: Hävitatav Aerosool

source: Destroy all face-up Insect-Type monsters on the field.
et: Hävita kõik avatud putukaliiki koletised väljal.

source: Breath of Light
et: Valguse Hingus

source: Destroy all face-up Rock-Type monsters on the field.
et: Hävita kõik lahinguväljal olevad ülespööratud Kivi-tüüpi koletised.

source: Eternal Drought
et: Ikuine Põud

source: Destroy all face-up Fish-Type monsters on the field.
et: Hävita kõik avatud Kalatüüpi koletised väljal.

source: Shine Palace
et: Särav Palee

source: Equip only to a LIGHT monster. It gains 700 ATK.
et: Varusta ainult VALGUSE koletisele. See saab 700 ATK juurde.

source: Shadow Spell
et: Varjuloits

source: Select 1 face-up monster your opponent controls. It loses 700 ATK and cannot attack or change its battle position. When the selected monster is destroyed or removed from the field, destroy this card.
et: Vali 1 avatud positsioonis olev koletis, mida sinu vastane kontrollib. See kaotab 700 ATK ja ei saa rünnata ega muuta oma lahingupositsiooni. Kui valitud koletis hävitatakse või eemaldatakse väljakult, hävita see kaart.

source: Black Luster Ritual
et: Musta Lusteri Rituaal

source: This card is used to Ritual Summon "<M4370>Black Luster Soldier<M>". You must also Tribute monsters from the field or your hand whose total Levels equal 8 or more.
et: Seda kaarti kasutatakse "<M4370>Black Luster Soldier<M>" rituaalsummonimiseks. Sa pead ka ohverdama koletisi väljakult või oma käest, kelle kogutasemed on kokku 8 või rohkem.

source: Zera Ritual
et: Zera rituaal

source: This card is used to Ritual Summon "<M4366>Zera the Mant<M>". You must also Tribute monsters from the field or your hand whose total Levels equal 8 or more.
et: Seda kaarti kasutatakse "<M4366>Zera the Mant<M>" rituaalsummonimiseks. Sa pead ka ohverdama koletisi väljakult või oma käest, kelle kogutasemed on kokku 8 või rohkem.

source: Harpie's Feather Duster
et: Harpyja sulepuhasti

source: Destroy all of your opponent's Spell and Trap Cards on the field.
et: Hävita kõik vastase Väljal olevad Võlu- ja Lõksukaardid.

source: War-Lion Ritual
et: Sõjalõvi rituaal

source: This card is used to Ritual Summon "<M4362>Super War-Lion<M>". You must also offer monsters from the field or your hand whose total Levels equal 7 or more.
et: Seda kaarti kasutatakse "<M4362>Super War-Lion<M>" rituaalsummonimiseks. Sa pead pakkuma ka koletisi väljakult või oma käest, kelle kogutasemed on 7 või rohkem.

source: Beastly Mirror Ritual
et: Metshaldjas Ritus

source: This card is used to Ritual Summon "<M4371>Fiend's Mirror<M>". You must also Tribute monsters whose total Levels equal 6 or more from the field or your hand.
et: Seda kaarti kasutatakse "<M4371>Deemoni Peegel<M>" rituaalsummonimiseks. Sa pead ka ohverdama koletisi, kelle kogutasemed on 6 või rohkem, kas väljakult või oma käest.

source: Commencement Dance
et: Algustants

source: This card is used to Ritual Summon "<M4707>Performance of Sword<M>". You must also Tribute monsters whose total Level Stars equal 6 or more from the field or your hand.
et: Seda kaarti kasutatakse "<M4707>Performance of Sword<M>" rituaalsummonimiseks. Sa pead ka ohverdama koletisi, kelle kogutaseme tähed on 6 või rohkem, kas väljakult või oma käest.

source: Hamburger Recipe
et: Hamburgeri retsept

source: This card is used to Ritual Summon "<M4708>Hungry Burger<M>". You must also Tribute monsters whose total Level Stars equal 6 or more from the field or your hand.
et: Seda kaarti kasutatakse "<M4708>Hungry Burger<M>" rituaalsummonimiseks. Sa pead ka ohverdama koletisi, kelle kogutaseme tähed on võrdne 6 või rohkem, kas väljakult või oma käest.

source: Novox's Prayer
et: Novoxi palve

source: This card is used to Ritual Summon "<M4710>Skull Guardian<M>". You must also offer monsters whose total Level Stars equal 7 or more as a Tribute from the field or your hand.
et: Seda kaarti kasutatakse "<M4710>Skull Guardian<M>" rituaalsummonimiseks. Sa pead ka pakkuma koletisi, kelle kogutaseme tähed on 7 või rohkem, ohvriks väljakult või oma käest.

source: House of Adhesive Tape
et: Kleeplindi Maja

source: If the DEF of a monster summoned by your opponent (excluding Special Summon) is 500 points or less, the monster is destroyed.
et: Kui sinu vastase poolt kutsutud koletise DEF (välja arvatud erikutsumine) on 500 punkti või vähem, hävitatakse koletis.

source: Eatgaboon
et: Sööjaboon

source: If the ATK of a monster summoned by your opponent (excluding Special Summon) is 500 points or less, the monster is destroyed.
et: Kui sinu vastase poolt kutsutud koletise (välja arvatud erikutsumine) ATK on 500 punkti või vähem, hävitatakse koletis.

source: Acid Trap Hole
et: Happes lõksuauk

source: Select 1 face-down Defense Position monster and flip it face-up. If the monster's DEF is 2000 or less, destroy it. If the monster's DEF is more than 2000, flip the monster to face-down Defense Position.
et: Vali 1 tagurpidi kaitseasendis olev koletis ja pööra see näoga ülespoole. Kui koletise DEF on 2000 või vähem, hävita see. Kui koletise DEF on rohkem kui 2000, pööra koletis tagasi tagurpidi kaitseasendisse.

source: Widespread Ruin
et: Üldine Häving

source: Activate only when your opponent declares an attack. Destroy the Attack Position monster your opponent controls with the highest ATK. (If it's a tie, you get to choose.)
et: Aktiveeri ainult siis, kui sinu vastane kuulutab välja rünnaku. Hävita sinu vastase kontrolli all olev rünnakupositsioonis olev koletis, millel on suurim rünnakupunktide arv. (Kui on viik, saad valida sina.)

source: Goblin Fan
et: Goblin Fänn

source: Each time a Level 2 or lower monster is Flip Summoned, destroy it. Its effect are not activateed at this time.
et: Iga kord, kui 2. taseme või madalama taseme koletis on ümberpööratud, hävita see. Selle mõju ei aktiveeru sel ajal.

source: Bad Reaction to Simochi
et: Halb reaktsioon Simochile

source: As long as this card remains face-up on the field, any effect of increasing your opponent's Life Points is changed to inflict the same amount of points in damage to your opponent's Life Points.
et: Niikaua kui see kaart jääb väljale avatud olekusse, muudetakse kõik sinu vastase Elupunkte suurendavad efektid samas koguses kahju tekitamiseks sinu vastase Elupunktidele.

source: Reverse Trap
et: Tagurpidi Lõks

source: All increases and decreases to ATK and DEF are reversed for the turn in which this card is activated.
et: Kõik ATK ja DEF suurendused ja vähendamised pööratakse ümber sellel käigul, mil see kaart aktiveeritakse.

source: Fake Trap
et: Vale lõks

source: You can only activate this card when your opponent uses an effect of a Spell, Trap, or Effect Monster to destroy Trap Card(s) on your side of the field. Destroy this card as a substitute of those Trap Card(s) and the other Trap Card(s) are not destroyed. If a Set card(s) would have been destroyed, pick up and see the Set card(s).
et: Seda kaarti saad aktiveerida ainult siis, kui sinu vastane kasutab Loitsu, Lõksu või Efektkoletise efekti, et hävitada sinu väljaku poolel olevaid Lõksukaarte. Hävita see kaart nende Lõksukaartide asemel ja teisi Lõksukaarte ei hävitata. Kui seatud kaart oleks hävitatud, võta see seatud kaart üles ja vaata seda.

source: Turtle Oath
et: Kilpkonna Vanne

source: This card is used to Ritual Summon "<M4716>Crab Turtle<M>". You must also Tribute monsters whose total Level Stars equal 8 or more from the field or your hand.
et: Seda kaarti kasutatakse "<M4716>Crab Turtle<M>" rituaalsummonimiseks. Sa pead ka ohverdama koletisi, kelle tasemete tähtede koguarv on 8 või rohkem, kas väljakult või oma käest.

source: Resurrection of Chakra
et: Chakra ülestõusmine

source: This card is used to Ritual Summon "<M4715>Chakra<M>". You must also offer monsters whose total Levels equal 7 or more as a Tribute from the field or your hand.
et: Seda kaarti kasutatakse "<M4715>Chakra<M>" rituaalsummonimiseks. Sa pead ka pakkuma koletisi, kelle kogutasemed on 7 või rohkem, ohvriks väljakult või oma käest.

source: Javelin Beetle Pact
et: Odaõuna mardika pakt

source: This card is used to Ritual Summon "<M4723>Javelin Beetle<M>". You must also Tribute monsters from the field or your hand whose total Levels equal 8 or more.
et: Seda kaarti kasutatakse "<M4723>Javelin Beetle<M>" rituaalsummonimiseks. Sa pead ka ohverdama koletisi väljakult või oma käest, kelle kogutasemed on kokku 8 või rohkem.

source: Garma Sword Oath
et: Garma Mõõga Tõotus

source: This card is used to Ritual Summon "<M4722>Garma Sword<M>". You must also Tribute monsters whose total Levels equal 7 or more from the field or your hand.
et: Seda kaarti kasutatakse "<M4722>Garma Sword<M>" rituaalsummonimiseks. Sa pead ka ohverdama koletisi, kelle kogutasemed on 7 või rohkem, kas väljakult või oma käest.

source: Revival of Dokurorider
et: Dokurorideri taaselustamine

source: This card is used to Ritual Summon "<M4725>Dokurorider<M>". You must also offer monsters whose total Level Stars equal 6 or more as a Tribute from the field or your hand.
et: Seda kaarti kasutatakse "<M4725>Dokurorider<M>" rituaalsummonimiseks. Sa pead pakkuma ka koletisi, kelle kogutähe tase on 6 või rohkem, ohvriks väljakult või oma käest.

source: Fortress Whale's Oath
et: Kindlavalaskja vanne

source: This card is used to Ritual Summon "<M4724>Fortress Whale<M>". You must also Tribute monsters whose total Levels equal 7 or more from the field or your hand.
et: Seda kaarti kasutatakse "<M4724>Fortress Whale<M>" rituaalsummonimiseks. Sa pead ka ohverdama koletisi, kelle kogutasemed on 7 või rohkem, kas väljakult või oma käest.

source: Performance of Sword
et: Mõõga etendus

source: This monster can only be Ritual Summoned with the Ritual Spell Card, "<M4682>Commencement Dance<M>". You must also Tribute monsters whose total Level Stars equal 6 or more from the field or your hand.
et: Seda koletist saab Rituaali Kutsuda ainult Rituaali Loitsukaardiga, "<M4682>Algustants<M>". Sa pead ka ohverdama koletisi, kelle kogutähe tase on 6 või rohkem, kas väljakult või oma käest.

source: Hungry Burger
et: Näljane Burger

source: This monster can only be Ritual Summoned with the Ritual Spell Card, "<M4683>Hamburger Recipe<M>". You must also Tribute monsters whose total Level Stars equal 6 or more from the field or your hand.
et: Seda koletist saab Rituaali Kutsuda ainult Rituaalimaagia Kaardiga, "<M4683>Hamburgeri Retsept<M>". Sa pead ka ohverdama koletisi, kelle kogutähe tase on 6 või rohkem, kas väljakult või oma käest.

source: An unstoppable savage that carries Millennium Items.
et: Peatamatu metslane, kes kannab Tuhandeaasta esemeid.

source: Skull Guardian
et: Koljuvalvur

source: This monster can only be Ritual Summoned with the Ritual Spell Card, "<M4685>Novox's Prayer<M>". You must also offer monsters whose total Level Stars equal 7 or more as a Tribute from the field or your hand.
et: Seda koletist saab Rituaali Kutsuda ainult Rituaali Loitsukaardiga, "<M4685>Novoxi Palve<M>". Sa pead pakkuma ka koletisi, kelle kogutähe tase on 7 või rohkem, ohvriks väljakult või oma käest.

source: Tri-Horned Dragon
et: Kolme-Sarvega Draakon

source: An unworthy dragon with three sharp horns sprouting from its head.
et: Ebakvalite draakon, kelle peast turritavad kolm teravat sarve.

source: Serpent Night Dragon
et: Öömaodraakon

source: A dragon created from the soul of a wicked knight.
et: Lohe, mis on loodud kurja rüütli hingest.

source: Skull Knight
et: Kolju Rüütel

source: "<M4168>Tainted Wisdom<M>" + "<M4181>Ancient Brain<M>"
et: "<M4168>Rikutud Tarkus<M>" + "<M4181>Muistne Aju<M>"

source: Cosmo Queen
et: Kosmose Kuninganna

source: Queen of the galaxies and mistress of the stars.
et: Galaktikate kuninganna ja tähtede valitsejanna.

source: This card can only be Ritual Summoned with the Ritual Spell Card, "<M4700>Resurrection of Chakra<M>".
et: Seda kaarti saab rituaalsummonida ainult rituaal-loitsukaardiga "<M4700>Chakra ülestõusmine<M>".

source: Crab Turtle
et: Krabikilpkonn

source: This monster can only be Ritual Summoned with the Ritual Spell Card, "<M4698>Turtle Oath<M>". You must also Tribute monsters whose total Level Stars equal 8 or more from the field or your hand.
et: Seda koletist saab Rituaalsummonida ainult Rituaalimaagia kaardiga, "<M4698>Turtle Oath<M>". Sa pead ka ohverdama koletisi, kelle tasemete tähtede summa on 8 või rohkem, kas väljakult või oma käest.

source: A dragon warrior of the moon armed with a crescent sword.
et: Kuu lohe sõdalane, kes on relvastatud poolkuu mõõgaga.

source: Meteor Dragon
et: Meteori Draakon

source: This dragon appeared from the sky and crashed to the earth.
et: See draakon ilmus taevast ja kukkus maa peale.

source: Meteor B. Dragon
et: Meteori B. Draakon

source: "<M4088>Red Eyes B. Dragon<M>" + "<M4718>Meteor Dragon<M>"
et: "<M4088>Punasilmne B. Draakon<M>" + "<M4718>Meteori Draakon<M>"

source: Firewing Pegasus
et: Tuletiiva Pegasos

source: A heavenly stallion soaring through the skies on crimson wings.
et: Taevane täkk, kes lendab taevas karmiinpunastel tiibadel.

source: Garma Sword
et: Garma Mõõk

source: This card can only be Ritual Summoned with the Ritual Spell Card, "<M4703>Garma Sword Oath<M>".
et: Seda kaarti saab Rituaali Kutsuda ainult Rituaali Loitsukaardiga, "<M4703>Garma Sword Oath<M>".

source: Javelin Beetle
et: Oda mardikas

source: This card can only be Ritual Summoned with the Ritual Spell Card, "<M4702>Javelin Beetle Pact<M>".
et: Seda kaarti saab rituaalikutsuda ainult rituaaliloitsukaardiga "<M4702>Javelin Beetle Pact<M>".

source: Fortress Whale
et: Kindlusvaal

source: This monster can only be Ritual Summoned with the Ritual Spell Card, "<M4706>Fortress Whale's Oath<M>".
et: Seda koletist saab Rituaalsummonida ainult Rituaal Loitsukaardiga, "<M4706>Fortress Whale's Oath<M>".

source: Dokurorider
et: Dokuroratsanik

source: This monster can only be Ritual Summoned with the Ritual Magic Card, "<M4705>Revival of Dokurorider<M>". You must also offer monsters whose total Level Stars equal 6 or more as a Tribute from your field or your hand.
et: Seda koletist saab Rituaali Kutsuda ainult Rituaal Maagia Kaardiga, "<M4705>Dokurorideri Taassünd<M>". Sa pead ka pakkuma koletisi, kelle kogutase on 6 või rohkem, ohvriks oma väljakult või käest.

source: Black Magic Ritual
et: Musta maagia rituaal

source: This card is used to Ritual Summon "<M4728>Magician of Black Chaos<M>". You must also Tribute monsters from the field or your hand whose total Levels equal 8 or more.
et: Seda kaarti kasutatakse "<M4728>Mustade Kaose Maag<M>" rituaal-summonimiseks. Sa pead ka ohverdama koletisi väljakult või oma käest, kelle kogutasemed on kokku 8 või rohkem.

source: Magician of Black Chaos
et: Musta Kaose Maag

source: This card can only be Ritual Summoned with the Ritual Spell Card, "<M4727>Black Magic Ritual<M>".
et: Seda kaarti saab rituaalsummonida ainult rituaaliloitsukaardiga "<M4727>Must Maagia Rituaal<M>".

source: Slot Machine
et: Mänguautomaat

source: The machine's ability is said to vary according to its slot results.
et: Masina võime öeldakse varieeruvat vastavalt selle sloti tulemustele.

source: Red Archery Girl
et: Punane Vibutüdruk

source: A mermaid archer that hides in a protective shell, waiting for the right moment to strike.
et: Merineitsi vibukütt, kes peidab end kaitsvasse kesta, oodates õiget hetke löögiks.

source: A vicious little dragon sheltered in an egg that looks deceptively harmless.
et: Väike kuri draakon, kes peitub munas, mis näeb petlikult kahjutu välja.

source: This card cannot be Normal Summoned or Set. This card can only be Special Summoned while you control "<M4798>Toon World<M>". You can Special Summon this card from your hand (but Tributes are required if it is Level 5 or higher). This card cannot attack during the turn it is Summoned. This card cannot attack unless you pay 500 Life Points. When "<M4798>Toon World<M>" is destroyed, destroy this card. If your opponent doesn't control a Toon Monster, this card can attack your opponent directly. If your opponent controls a face-up Toon Monster, you must select it as an attack target.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti saab eriliselt kutsuda ainult siis, kui sa kontrollid "<M4798>Toon World<M>". Sa saad selle kaardi eriliselt kutsuda oma käest (kuid ohverdused on vajalikud, kui see on 5. või kõrgem tase). See kaart ei saa rünnata sellel käigul, mil see kutsuti. See kaart ei saa rünnata, kui sa ei maksa 500 elupunkti. Kui "<M4798>Toon World<M>" hävitatakse, hävita see kaart. Kui sinu vastane ei kontrolli Toon Koletist, saab see kaart rünnata sinu vastast otse. Kui sinu vastane kontrollib avatud Toon Koletist, pead sa valima selle rünnaku sihtmärgiks.

source: Toon Mermaid
et: Multifilm Merineitsi

source: Toon Summoned Skull
et: Toon Kutsutud Kolju

source: (This card is always treated as an "Archfiend" card.)<BR>This card cannot be Normal Summoned or Set. This card can only be Special Summoned while you control "<M4798>Toon World<M>". You can Special Summon this card from your hand (but Tributes are required if it is Level 5 or higher). This card cannot attack during the turn it is Summoned. This card cannot attack unless you pay 500 Life Points. When "<M4798>Toon World<M>" is destroyed, destroy this card. If your opponent doesn't control a Toon Monster, this card can attack your opponent directly. If your opponent controls a face-up Toon Monster, you must select it as an attack target.
et: (Seda kaarti käsitletakse alati kui "Archfiend" kaarti.)<BR>Seda kaarti ei saa tavaliselt kutsuda ega asetada. Seda kaarti saab eriliselt kutsuda ainult siis, kui sa kontrollid "<M4798>Toon World<M>". Sa saad selle kaardi eriliselt kutsuda oma käest (kuid ohverdused on vajalikud, kui see on 5. või kõrgem tase). See kaart ei saa rünnata sellel käigul, mil see kutsuti. See kaart ei saa rünnata, kui sa ei maksa 500 Elupunkti. Kui "<M4798>Toon World<M>" hävitatakse, hävita see kaart. Kui sinu vastane ei kontrolli Toon Koletist, saab see kaart rünnata sinu vastast otse. Kui sinu vastane kontrollib avatud Toon Koletist, pead sa valima selle rünnaku sihtmärgiks.

source: Dark-Eyes Illusionist
et: Pimedate Silmade Illusionist

source: FLIP: Select 1 monster. While this monster remains face-up on the field that monster cannot attack.
et: FLIP: Vali 1 koletis. Kuni see koletis jääb väljale avatud olekusse, ei saa see koletis rünnata.

source: Relinquished
et: Loovutatud

source: Once per turn, select 1 monster your opponent controls and equip it to this card (only 1 monster can be equipped to it at a time). This card's ATK and DEF become equal to the ATK and DEF of the monster equipped to this card. If this card is destroyed by battle, the equipped monster is destroyed instead, and any battle damage you received from the battle is also inflicted to your opponent.
et: Korra ühe korra käigu jooksul vali 1 koletis, mida sinu vastane kontrollib, ja kinnita see sellele kaardile (ainult 1 koletis saab korraga sellele kinnitatud olla). Selle kaardi ATK ja DEF muutuvad võrdseks selle koletise ATK ja DEF-iga, mis on sellele kaardile kinnitatud. Kui see kaart hävitatakse lahingus, hävitatakse selle asemel kinnitatud koletis ja kõik lahingukahjud, mida sa lahingust said, kantakse ka sinu vastasele.

source: Jigen Bakudan
et: Jigeni pomm

source: FLIP: After this card is flipped. Tribute it during your Standby Phase to destroy all monsters on your side of the field and inflict damage equal to half of the total ATK of the destroyed cards (excluding this monster) to your opponent's Life Points.
et: FLIP: Pärast selle kaardi ümberpööramist. Ohverda see oma Ootefaasil, et hävitada kõik koletised sinu väljaku poolel ja tekitada kahju, mis on võrdne hävitatud kaartide (välja arvatud see koletis) kogurünnaku poolega, sinu vastase Elupunktidele.

source: Thousand-Eyes Idol
et: Tuhande Silma Idool

source: A wicked entity that controls the hearts of men, its thousand eyes are able to see and expand the negative influences in an individual's soul.
et: Kuri vaim, kes kontrollib meeste südameid, selle tuhat silma suudavad näha ja laiendada negatiivseid mõjusid inimese hinges.

source: Thousand-Eyes Restrict
et: Tuhande Silma Piirang

source: "<M4737>Relinquished<M>" + "<M4739>Thousand-Eyes Idol<M>"<BR>Other monsters cannot change their battle position or attack. Once per turn, you can equip 1 monster your opponent controls to this card (max 1). This card's ATK and DEF become the same as the equipped monster's. If this card would be destroyed by battle, the equipped monster is destroyed instead.
et: "<M4737>Relinquished<M>" + "<M4739>Thousand-Eyes Idol<M>"<BR>Teised koletised ei saa oma lahingupositsiooni muuta ega rünnata. Kord käigu jooksul saad varustada selle kaardi külge 1 koletise, mida sinu vastane kontrollib (maksimaalselt 1). Selle kaardi ATK ja DEF muutuvad samaks kui varustatud koletisel. Kui see kaart hävitatakse lahingus, hävitatakse selle asemel varustatud koletis.

source: Steel Ogre Grotto #2
et: Terass Ogre Grotto #2

source: A mechanized iron doll with tremendous strength.
et: Mehhaniseeritud rauast nukk tohutu jõuga.

source: Blast Sphere
et: Plahvatuskera

source: If an opponent's monster attacks this face-down Defense Position card, this card becomes an Equip Card equipped to the attacking monster, before damage calculation. Destroy the equipped monster during your opponent's next Standby Phase, and inflict damage to your opponent equal to the destroyed monster's ATK.
et: Kui vastase koletis ründab seda allapoole suunatud kaitseasendis kaarti, muutub see kaart ründavale koletisele varustuskaardiks enne kahju arvutamist. Hävita varustatud koletis oma vastase järgmise ooteetapi ajal ja tekita oma vastasele kahju, mis on võrdne hävitatud koletise rünnakuga (ATK).

source: A dragon created from a massive diamond that sparkles with blinding light.
et: Draakon, mis on loodud massiivsest teemantist, mis särab pimestava valgusega.

source: Alpha The Magnet Warrior
et: Alfa Magnet Sõdalane
