Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: Malefic Paradox Dragon
et: Kurjuse Paradoksi Draakon

source: "<M9043>Malefic Parallel Gear<M>" + 1 non-Tuner "Malefic" monster<BR>When this card is Synchro Summoned, you can select 1 Synchro Monster in either player's Graveyard, and Special Summon it. There can only be 1 face-up "<M8867>Malefic Paradox Dragon<M>" on the field. If "<M9232>Malefic World<M>" is not face-up on the field, destroy this card.
et: "<M9043>Kurjuse Paralleelkäik<M>" + 1 mittehäälestaja "Kurjuse" koletis<BR>Kui see kaart on Sünkroonitud, saad valida 1 Sünkroonkoletise mõlema mängija Hauakambris ja Kutsuda see Eriliselt välja. Väljakul võib olla ainult 1 avatud "<M8867>Kurjuse Paradoks Draakon<M>". Kui "<M9232>Kurjuse Maailm<M>" ei ole väljakul avatud, hävita see kaart.

source: Blizzard Princess
et: Lumetormide printsess

source: You can Tribute Summon this card by Tributing 1 Spellcaster-Type monster. During the turn this card is Normal Summoned successfully, your opponent cannot activate Spell/Trap Cards.
et: Sa saad selle kaardi pakkuda ohvriks, pakkudes ohvriks 1 Loitsija-tüüpi koletise. Sellel käigul, kui see kaart on edukalt Normaalpüstitatud, ei saa sinu vastane aktiveerida Loitsu/Lõksu Kaardid.

source: Malefic Red-Eyes B. Dragon
et: Pahaend Punasilmne B. Draakon

source: This card cannot be Normal Summoned or Set. This card can only be Special Summoned, by removing from play 1 "<M4088>Red Eyes B. Dragon<M>" from your Deck. There can only be 1 face-up "Malefic" monster on the field. Other monsters you control cannot declare an attack. If there is no face-up Field Spell Card on the field, destroy this card.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti saab eriliselt kutsuda ainult eemaldades mängust 1 "<M4088>Red Eyes B. Dragon<M>" oma pakist. Väljakul võib olla ainult 1 avatud "Malefic" koletis. Teised koletised, mida sa kontrollid, ei saa rünnakut kuulutada. Kui väljakul ei ole avatud väljaloitsu kaarti, hävita see kaart.

source: Gem-Knight Garnet
et: Gem-Knight Granaat

source: The Gem-Knight Warrior who carries the Garnet Soul. His Flaming Iron Fist crushes all enemies.
et: Gem-Knight sõdalane, kes kannab Garnet Hinget. Tema Leegitsev Raudrusikas purustab kõik vaenlased.

source: His Sapphire powers commands the waters to protect him from attack. His comrades trust in his silent protection.
et: Tema safiirivõimed käsivad vetel teda rünnaku eest kaitsta. Tema kaaslased usaldavad tema vaikset kaitset.

source: Gem-Knight Tourmaline
et: Gem-Knight Turmaliin

source: He channels mystic energies and changes them into fighting strength through the power of Tourmaline. Many admire his way of life.
et: Ta kanaliseerib müstilisi energiaid ja muudab need võitlusjõuks turmaliini jõu abil. Paljud imetlevad tema elustiili.

source: Gem-Knight Alexandrite
et: Gem-Knight Aleksandriit

source: You can Tribute this card to Special Summon 1 "Gem-Knight" Normal Monster from your Deck.
et: Saad selle kaardi ohverdada, et Kutsuda Eriliselt 1 "Gem-Knight" Tavaline Koletis oma Pakist.

source: When this card is Normal Summoned, you can add to your hand 1 "Gem-Knight" monster from your Deck.
et: Kui see kaart on Normaal-Kutsutud, saad oma kätte lisada 1 "Gem-Knight" koletise oma pakist.

source: Gem-Merchant
et: Gem-Kaupmees

source: When a face-up EARTH Normal Monster you control battles: You can send this card from your hand to the Graveyard during the Damage Step; increase that monster's ATK and DEF by 1000, until the End Phase.
et: Kui sinu juhitav lahingus olev avatud EARTH Tavaline Koletis võitleb: Sa võid selle kaardi oma käest Hauakambrisse saata Kahjustuse Etapi ajal; suurenda selle koletise ATK ja DEF 1000 võrra kuni Lõppfaasini.

source: When this card is destroyed by battle and sent to the Graveyard: You can send 2 "Laval" monsters from your Deck to the Graveyard.
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse: Sa võid saata 2 "Laval" koletist oma pakist Hauakambrisse.

source: Soaring Eagle Above the Searing Land
et: Põlevate Maade Kohal Lendav Kotkas

source: If this card is sent to the Graveyard for a Synchro Summon while you have 3 or more "Laval" cards with different names in your Graveyard: You can Special Summon this card. When this card leaves the field, if this card is Special Summoned by this effect: Banish this card.
et: Kui see kaart saadetakse Hauakambrisse Sünkrosummoni jaoks, kui sul on Hauakambris 3 või enam erineva nimega "Laval" kaarti: Sa võid selle kaardi Erikutsuda. Kui see kaart lahkub väljakult ja kui see kaart on selle efekti abil Erikutsutud: Eemalda see kaart mängust.

source: Laval Warrior
et: Lavali Sõdalane

source: If this card destroys an opponent's monster by battle while you have 4 or more "Laval" monsters with different names in your Graveyard: Inflict damage to your opponent equal to the ATK of the monster destroyed by that battle.
et: Kui see kaart hävitab lahingus vastase koletise, kui sul on oma Hauakambris 4 või rohkem erineva nimega "Laval" koletist: Põhjusta oma vastasele kahju, mis on võrdne lahingus hävitatud koletise rünnakupunktidega.

source: Magflare the Molten Swordsman
et: Magflare, Sulav Mõõgamees

source: Once per turn: You can banish 1 "Laval" monster from your Graveyard; increase this card's ATK by 300, until the End Phase. This card's effect can be activated during your opponent's turn.
et: Korra ühe korra käigu jooksul: Sa võid oma Hauakambrist eemaldada mängust 1 "Laval" koletise; suurenda selle kaardi ATK-d 300 võrra kuni Lõppfaasini. Selle kaardi efekti saab aktiveerida vastase käigu ajal.

source: Laval Forest Sprite
et: Lavali metsa vaim

source: When this card is sent from the field to the Graveyard: All face-up "Laval" monsters you control gain 200 ATK for each "Laval" monster in your Graveyard, until the End Phase.
et: Kui see kaart saadetakse väljakult hauakambrisse: Kõik avatud "Laval" koletised, mida sa kontrollid, saavad iga hauakambris oleva "Laval" koletise eest 200 ATK juurde kuni lõppfaasini.

source: Kayenn, the Master Magma Blacksmith
et: Kayenn, Magma Meistrisepist

source: You can banish this card in your Graveyard: All face-up "Laval" monsters you control gain 400 ATK.
et: Saad selle kaardi oma hauakambrist eemaldada: Kõik sinu kontrolli all olevad avatud "Laval" koletised saavad 400 ATK juurde.

source: Laval Burner
et: Laval Põletaja

source: If there are 3 or more "Laval" monsters with different names in your Graveyard, you can Special Summon this card (from your hand).
et: Kui sinu kalmistul on 3 või rohkem erineva nimega "Laval" koletist, saad selle kaardi (oma käest) eriliselt välja kutsuda.

source: Laval Judgment Lord
et: Lavali Kohtumõistja Isand

source: Once per turn: You can banish 1 "Laval" monster from your Graveyard; inflict 1000 damage to your opponent. This card cannot declare an attack during the turn you activate this effect.
et: Kord korra käigu jooksul: Sa võid oma kalmistult eemaldada mängust 1 "Laval" koletise; põhjusta oma vastasele 1000 kahju. See kaart ei saa rünnakut kuulutada käigu jooksul, mil sa selle efekti aktiveerid.

source: Vylon Cube
et: Vylon Kuup

source: If this card is sent to the Graveyard for the Synchro Summon of a LIGHT monster: You can target 1 Equip Spell Card from your Deck; add it to your hand.
et: Kui see kaart saadetakse Hauakambrisse LIGHT koletise Sünkrosummonimiseks: Sa saad valida 1 Varustuse Loitsukaardi oma pakist; lisa see oma kätte.

source: When this card is destroyed by a card effect and sent to the Graveyard: You can draw cards equal to the number of Equip Cards that were equipped to this card.
et: Kui see kaart hävitatakse kaardi efekti tõttu ja saadetakse Hauakambrisse: Sa võid tõmmata kaarte, mis on võrdne selle kaardi külge kinnitatud Varustuskaartide arvuga.

source: All face-up LIGHT monsters you control gain 300 ATK for each Equip Card equipped to this card.
et: Kõik sinu kontrolli all olevad avatud LIGHT koletised saavad 300 ATK iga selle kaardiga varustatud Equip Cardi eest.

source: When this card declares an attack: You can target a number of monsters your opponent controls up to the number of Equip Cards equipped to this card; change their battle positions.
et: Kui see kaart kuulutab välja rünnaku: Sa saad valida vastase kontrollitavate koletiste arvu, mis on võrdne selle kaardi külge kinnitatud Varustuskaartide arvuga; muuda nende lahingupositsioone.

source: "<M8893>Gem-Knight Garnet<M>" + 1 "Gem-Knight" monster<BR>This monster can only be Special Summoned by Fusion Summon (from the Extra Deck) using the above cards as Fusion Material Monsters. Once per turn: You can Tribute 1 face-up "Gem" monster you control; increase this card's ATK equal to the Tributed monster's ATK, until the End Phase. During battle between this attacking card and a Defense Position monster, inflict piercing Battle Damage to your opponent.
et: "<M8893>Gem-Knight Garnet<M>" + 1 "Gem-Knight" koletis<BR>Seda koletist saab eriliselt kutsuda ainult Fusion Summon'iga (Extra Deck'ist), kasutades ülaltoodud kaarte Fusion Material Monsters'ina. Kord ühe käigu jooksul: Sa võid ohverdada ühe ülespoole pööratud "Gem" koletise, mida sa kontrollid; suurenda selle kaardi ATK-d ohverdatud koletise ATK võrra kuni End Phase'ini. Lahingu ajal selle ründava kaardi ja kaitsepositsioonis oleva koletise vahel, põhjusta vastasele läbistavat Lahingukahju.

source: Gem-Knight Aquamarine
et: Gem-Knight Akvamariin

source: "<M8894>Gem-Knight Sapphire<M>" + 1 "Gem-Knight" monster<BR>This monster can only be Special Summoned by Fusion Summon (from the Extra Deck) using the above Fusion Material Monsters. If this card attacks: it is changed to Defense Position at the end of the Battle Phase. When this card is sent from the field to the Graveyard: Target 1 card your opponent controls; return it to the hand.
et: "<M8894>Gem-Knight Sapphire<M>" + 1 "Gem-Knight" koletis<BR>Seda koletist saab eriliselt kutsuda ainult Fusion Summon'i abil (Extra Deck'ist), kasutades ülaltoodud Fusion Material Monsters. Kui see kaart ründab: see muudetakse Battle Phase'i lõpus Defense Position'iks. Kui see kaart saadetakse väljakult kalmistule: sihi 1 kaarti, mida sinu vastane kontrollib; tagasta see käele.

source: Gem-Knight Topaz
et: Gem-Knight Topaas

source: "<M8895>Gem-Knight Tourmaline<M>" + 1 "Gem-Knight" monster<BR>This card can only be Special Summoned (from the Extra Deck) by Fusion Summon with the above Fusion Material Monsters. This card can attack twice during the same Battle Phase. When this card destroys an opponent's monster by battle and sends it to the Graveyard: Inflict damage to your opponent equal to that monster's ATK.
et: "<M8895>Gem-Knight Turmaliin<M>" + 1 "Gem-Knight" koletis<BR>Seda kaarti saab eriliselt kutsuda (lisapakist) ainult ühinemiskutsumise teel, kasutades ülaltoodud ühinemismaterjalide koletisi. See kaart võib rünnata kaks korda sama lahingufaasi jooksul. Kui see kaart hävitab lahingus vastase koletise ja saadab selle hauakambrisse: Põhjusta oma vastasele kahju, mis on võrdne selle koletise rünnakupunktidega.

source: Lavalval Dragon
et: Lavalvali Draakon

source: 1 Tuner + 1 or more non-Tuner FIRE monsters.<BR>You can shuffle 2 "Laval" monsters from your Graveyard into your Deck to target 1 card your opponent controls; return that card to the hand.
et: 1 Tuner + 1 või rohkem mitte-Tuner TULEKAHJU koletist.<BR>Sa saad segada 2 "Laval" koletist oma Hauakambrist oma Pakki, et sihtida 1 kaarti, mida su vastane kontrollib; tagasta see kaart kätte.

source: Laval the Greater
et: Laval Suur

source: 1 Tuner + 1 or more non-Tuner FIRE monsters<BR>When this card is Synchro Summoned: Target 1 card from your hand; send it to the Graveyard. If this card would be destroyed by a card effect, you can banish 1 "Laval" monster from your Graveyard, instead.
et: 1 Tuner + 1 või rohkem mitte-Tuner TULEKAHJU koletist<BR>Kui see kaart on Sünkro Kutsutud: Sihtige 1 kaart oma käest; saatke see Hauakambrisse. Kui see kaart hävitatakse kaardi efekti tõttu, võite selle asemel oma Hauakambrist pagendada 1 "Laval" koletise.

source: 1 LIGHT Tuner + 1 or more non-Tuner LIGHT monsters<BR>When this card declares an attack, if it is the only monster you control, you can equip to this card 1 Equip Spell Card from your Deck.
et: 1 VALGUSTI Häälestaja + 1 või rohkem mitte-Häälestaja VALGUSTI koletist<BR>Kui see kaart kuulutab välja rünnaku ja see on ainus koletis, mida sa kontrollid, saad sellele kaardile oma pakist kinnitada 1 Varustuse Võlukaardi.

source: 1 LIGHT Tuner + 1 or more non-Tuner monsters<BR>Equip Cards equipped to this card cannot be targeted by the effects of Spell Cards, Trap Cards, or Effect Monsters. Once per turn: You can send 1 Equip Card equipped to this card to the Graveyard to target 1 monster your opponent controls; destroy it.
et: 1 VALGUSTI Häälestaja + 1 või rohkem mitte-Häälestaja koletist<BR>Selle kaardi külge kinnitatud Varustuskaarte ei saa sihtida Loitsukaartide, Lõksukaartide ega Efektikoletiste efektidega. Kord ühe käigu jooksul: Sa võid saata ühe selle kaardi külge kinnitatud Varustuskaardi Hauakambrisse, et sihtida ühte koletist, mida sinu vastane kontrollib; hävita see.

source: Send, from your hand or your side of the field to the Graveyard, the Fusion Material Monsters that are listed on a "Gem-Knight" Fusion Monster Card, then Special Summon that Fusion Monster from the Extra Deck. (This Special Summon is treated as a Fusion Summon.) If this card is in the Graveyard: You can banish 1 "Gem-Knight" monster from your Graveyard; add this card to your hand.
et: Saada oma käest või oma väljaku poolelt Hauakambrisse Fusion Material Monsters, mis on loetletud "Gem-Knight" Fusion Monster Card'il, seejärel Special Summon see Fusion Monster Extra Deck'ist. (See Special Summon käsitletakse kui Fusion Summon.) Kui see kaart on Hauakambris: Sa võid eemaldada mängust 1 "Gem-Knight" koletise oma Hauakambrist; lisa see kaart oma kätte.

source: Searing Fire Wall
et: Põlev Tulemüür

source: Banish any number of "Laval" monsters from your Graveyard; Special Summon 1 "<M3967>Laval Token<M>" (Pyro-Type/FIRE/Level 1/ATK 0/DEF 0) for each monster banished this way.
et: Eemalda oma kalmistult suvaline arv "Laval" koletisi; Kutsu eriliselt esile 1 "<M3967>Laval Token<M>" (Püro-Tüüp/TULI/Tase 1/ATK 0/DEF 0) iga sel viisil eemalduva koletise eest.

source: Vylon Material
et: Vylon Materjal

source: Equip only to a "Vylon" monster. It gains 600 ATK. If this face-up card is sent from the field to the Graveyard: You can add 1 "Vylon" Spell Card from your Deck to your hand.
et: Varusta ainult "Vylon" koletisega. See saab 600 ATK juurde. Kui see avatud kaart saadetakse väljakult hauakambrisse: Sa võid lisada 1 "Vylon" loitsukaardi oma pakist oma kätte.

source: Gem-Enhancement
et: Gemmi-täiustus

source: Tribute 1 "Gem-Knight" monster you control to target 1 "Gem-Knight" monster in your Graveyard; Special Summon the target from the Graveyard.
et: Ohverda 1 "Gem-Knight" koletis, mida sa kontrollid, et sihtida 1 "Gem-Knight" koletis oma Hauakambris; Kutsu sihtmärk Hauakambrist eriliselt välja.

source: Molten Whirlwind Wall
et: Sulava keeristormi sein

source: All face-up "Laval" monsters you control gain 100 ATK for each "Laval" monster in your Graveyard.
et: Kõik avatud "Laval" koletised, mida sa kontrollid, saavad 100 ATK iga "Laval" koletise eest sinu Hauakambris.

source: Earthquake Giant
et: Maavärina Hiiglane

source: Once per turn, when the battle position of this card is changed, you can select 1 monster your opponent controls and change its battle position.
et: Korra ühe korra käigu jooksul, kui selle kaardi lahingupositsiooni muudetakse, saad valida ühe vastase kontrollitava koletise ja muuta selle lahingupositsiooni.

source: Effect Veiler
et: Efekti Tühistaja

source: During your opponent's Main Phase, you can send this card from your hand to the Graveyard to select 1 face-up Effect Monster your opponent controls. Negate the effect(s) of that monster until the End Phase.
et: Oma vastase peafaasi ajal saad saata selle kaardi oma käest hauakambrisse, et valida 1 vastase kontrollitav avatud efektikoletis. Selle koletise efekt(id) tühistatakse kuni lõppfaasini.

source: Dash Warrior
et: Tormasõdalane

source: If this card attacks, it gains 1200 ATK during the Damage Step only.
et: Kui see kaart ründab, saab see ainult Kahjustuse Etapi ajal 1200 ATK juurde.

source: Damage Eater
et: Kahjukütt

source: During your opponent's turn, when your opponent activates a card or effect that would inflict damage, you can remove from play this card in your Graveyard to change that effect so it increases Life Points by the same amount instead.
et: Oma vastase käigu ajal, kui vastane aktiveerib kaardi või efekti, mis tekitaks kahju, saad eemaldada selle kaardi oma Hauakambrist mängust, et muuta see efekt selliseks, et see suurendaks sama palju Elupunkte.

source: A/D Changer
et: A/D Muutja

source: You can remove from play this card in your Graveyard to select 1 monster on the field. Change its battle position.
et: Saad selle kaardi oma kalmistult mängust eemaldada, et valida 1 koletis väljal. Muuda selle lahingupositsiooni.

source: Stronghold Guardian
et: Tugevuse Kaitsja

source: If a Defense Position monster you control is attacked, during the Damage Step, you can send this card from your hand to the Graveyard to have that monster gain 1500 DEF until the End Phase.
et: Kui sinu juhitavat Kaitseasendis koletist rünnatakse, võid Kahjustuse etapi ajal saata selle kaardi oma käest Hauakambrisse, et see koletis saaks 1500 DEF juurde kuni Lõppfaasini.

source: Playful Possum
et: Mänguline opossum

source: During your Main Phase, if your opponent controls a face-up monster with a higher ATK than the ATK of this card, you can destroy this card on the field. During your Standby Phase, if this card was destroyed by this effect, you can Special Summon this card from the Graveyard.
et: Oma peafaasis, kui sinu vastasel on avatud koletis, mille ATK on kõrgem kui selle kaardi ATK, saad selle kaardi väljal hävitada. Oma ooteetapis, kui see kaart hävitati selle efekti tõttu, saad selle kaardi eriliselt hauast välja kutsuda.

source: Egotistical Ape
et: Egoistlik Ahv

source: This card cannot be Normal Summoned or Set. This card can only be Special Summoned by sending 1 Beast-Type monster from your hand to the Graveyard. When this card is Special Summoned this way, you can activate 1 of these effects:<BR>● Increase the Level of this card by the Level of the Beast-Type monster.<BR>● Decrease the Level of this card by the Level of the Beast-Type monster.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti saab eriliselt kutsuda ainult siis, kui saadad ühe Beast-tüüpi koletise oma käest hauakambrisse. Kui see kaart kutsutakse sel viisil, saad aktiveerida ühe järgmistest efektidest:<BR>● Suurenda selle kaardi taset Beast-tüüpi koletise taseme võrra.<BR>● Vähenda selle kaardi taset Beast-tüüpi koletise taseme võrra.

source: Uni-Horned Familiar
et: Ühesarveline Tuttav

source: When this face-up Defense Position card is selected as an attack target, you can remove from play 1 monster you control other than this card to remove this card from play. The attacking monster must attack. During your next Standby Phase, if this card was removed from play by this effect, this card returns to the field.
et: Kui see avatud Kaitseasendis kaart valitakse rünnaku sihtmärgiks, võid mängust eemaldada ühe teise sinu kontrollitava koletise, et see kaart mängust eemaldada. Ründav koletis peab ründama. Järgmise Ootefaasiga, kui see kaart eemaldati mängust selle efekti tõttu, naaseb see kaart väljakule.

source: This card cannot be Normal Summoned or Set. This card can only be Special Summoned by removing from play 1 Spell Card from your hand. When you Synchro Summon using this card and a Beast-Type Tuner monster as the Synchro Material Monsters, you can select 1 Beast-Type Tuner monster used for the Synchro Summon and Special Summon it from the Graveyard.
et: Seda kaarti ei saa tavaliselt kutsuda ega asetada. Seda kaarti saab eriliselt kutsuda ainult eemaldades oma käest mängust 1 loitsukaardi. Kui sa kutsud sünkroonkaardi kasutades seda kaarti ja ühte metsalise tüüpi häälestuskoletist sünkroonmaterjalina, saad valida ühe sünkroonkaardiks kasutatud metsalise tüüpi häälestuskoletise ja kutsuda see hauakambrist eriliselt välja.

source: D.D. Unicorn Knight
et: D.D. Ühest Sarvest Rüütel

source: This card cannot be Normal Summoned or Set. This card can only be Special Summoned if your opponent controls a monster(s) and you control a face-up Tuner monster(s). When this card is Special Summoned this way, you can select 1 of your removed from play Level 3 or lower non-Tuner monsters and Special Summon it. Its effect(s) are negated. You cannot Normal Summon or Set the turn you Special Summon this card.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti saab eriliselt kutsuda ainult siis, kui sinu vastane kontrollib koletist (koletisi) ja sina kontrollid ülespööratud Tuner-koletist (koletisi). Kui see kaart kutsutakse sel viisil eriliselt, saad valida ühe oma mängust eemaldatud 3. taseme või madalama mitte-Tuner-koletise ja kutsuda selle eriliselt. Selle mõju(d) on tühistatud. Sa ei saa normaalselt kutsuda ega asetada samal käigul, kui sa kutsud selle kaardi eriliselt.

source: Unibird
et: Unilind

source: You can remove from play this face-up card, and 1 face-up monster you control, to select 1 Synchro Monster in your Graveyard with a Level less than or equal to the combined original Levels of the other 2 monsters. Special Summon that Synchro Monster.
et: Saad selle avatud kaardi ja ühe avatud koletise, mida sa kontrollid, mängust eemaldada, et valida oma kalmistul üks Sünkro Koletis, mille tase on väiksem või võrdne nende kahe koletise algsete tasemete summaga. Kutsu see Sünkro Koletis eriliselt välja.

source: Bicorn Re'em
et: Kahesarv Re'em

source: If this card is sent to the Graveyard as a Synchro Material Monster for a Synchro Summon, send the top 2 cards from your opponent's Deck to the Graveyard.
et: Kui see kaart saadetakse Sünkro Materjal Koletisena Sünkro Kutsumiseks Hauakambrisse, siis saadab vastane oma paki kaks ülemist kaarti Hauakambrisse.

source: Mine Mole
et: Minu Mutt

source: Once per turn, this card cannot be destroyed by battle. If this card is sent to the Graveyard as a Synchro Material Monster of a Beast-Type monster, draw 1 card. If this card is removed from the field by your opponent's card effect, remove this card from play.
et: Kord üks kord käigu jooksul ei saa seda kaarti lahingus hävitada. Kui see kaart saadetakse Hauakambrisse kui Sünkro Materjal Koletis, mis on Looma-tüüpi koletis, tõmba 1 kaart. Kui see kaart eemaldatakse väljakult sinu vastase kaardi efekti tõttu, eemalda see kaart mängust.

source: Trident Warrior
et: Kolmeharuline Sõdalane

source: When this card is Normal Summoned: You can Special Summon 1 Level 3 monster from your hand.
et: Kui see kaart on Normaal-Kutsutud: Sa saad Eriliselt Kutsuda 1 Tase 3 koletise oma käest.

source: Delta Flyer
et: Delta Lend

source: Once per turn, you can select 1 other face-up monster you control and increase its Level by 1.
et: Korra ühe korra käigu jooksul saad valida 1 teise avatud koletise, mida sa kontrollid, ja suurendada selle taset 1 võrra.

source: If 2 or more of your opponent's monsters are destroyed by battle with your monsters during the same Battle Phase, this card can attack twice during that Battle Phase.
et: Kui 2 või enam sinu vastase koletist hävitatakse sinu koletistega lahingus sama Lahingufaasi ajal, võib see kaart rünnata kaks korda selle Lahingufaasi jooksul.

source: Hypnocorn
et: Hüpnotorn
