Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: When this card inflicts Battle Damage to your opponent's Life Points, your opponent selects 1 Spell Card from their Deck and sends it to the Graveyard. Then shuffle the Deck.
et: Kui see kaart tekitab lahingukahju sinu vastase Elupunktidele, valib sinu vastane oma pakist ühe Loitsukaardi ja saadab selle Hauakambrisse. Seejärel sega pakk.

source: When this card inflicts Battle Damage to your opponent, you can either:<BR>● Discard 1 random card from your opponent's hand.<BR>● Send the top 2 cards of your opponent's Deck to the Graveyard.
et: Kui see kaart tekitab lahingukahju sinu vastasele, saad valida ühe järgmistest:<BR>● Viska 1 juhuslik kaart oma vastase käest ära.<BR>● Saada oma vastase paki kaks ülemist kaarti hauakambrisse.

source: Once per turn, you can flip this card into face-down Defense Position. When this card is Flip Summoned, draw 1 card.
et: Korra ühe korra käigu jooksul saad selle kaardi pöörata näoga allapoole kaitsepositsiooni. Kui see kaart on pööratud ümber, tõmba 1 kaart.

source: This card cannot be Normal Summoned or Set. This card can only be Special Summoned from your hand or your Deck by Tributing 1 "<M5417>Great Dezard<M>" that has fulfilled the condition. You can flip this card into face-down Defense Position once per turn during your Main Phase. As long as this monster remains face-up on the field, negate the activation and effects of all Spell and Trap Cards that target this card and destroy them. When this card is flipped face-up, you can Special Summon 1 Zombie-Type monster from your Graveyard.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti saab eriliselt kutsuda ainult oma käest või pakist, ohverdades 1 "<M5417>Great Dezard<M>", mis on täitnud tingimuse. Sa saad selle kaardi oma peafaasil kord käigu jooksul ümber pöörata näoga allapoole kaitsepositsiooni. Nii kaua kui see koletis jääb väljale näoga ülespoole, tühista kõigi selle kaarti sihtivate loitsu- ja lõksukaartide aktiveerimine ja efektid ning hävita need. Kui see kaart pööratakse näoga ülespoole, saad sa eriliselt kutsuda 1 zombitüüpi koletise oma hauakambrist.

source: Cobraman Sakuzy
et: Kobramees Sakuzy

source: You can flip this card into face-down Defense Position once per turn during your Main Phase. When this card is flipped face-up, look at all Set Spell and Trap Cards on your opponent's side of the field and then return them to their original position.
et: Saad selle kaardi kord oma põhifaasi jooksul näoga allapoole kaitseasendisse pöörata. Kui see kaart pööratakse näoga ülespoole, vaata kõiki vastase poolel olevaid seatud loitsu- ja lõksukaarte ning seejärel aseta need tagasi oma algsesse asendisse.

source: Book of Life
et: Eluraamat

source: Special Summon 1 Zombie-Type monster from your Graveyard and remove from play 1 monster from your opponent's Graveyard.
et: Erikutsuge oma kalmistult 1 Zombi-tüüpi koletis ja eemalda mängust 1 koletis oma vastase kalmistult.

source: Book of Taiyou
et: Taiyou raamat

source: Flip 1 face-down monster on the field into face-up Attack Position.
et: Pööra 1 näoga all olev koletis väljakul näoga ülespoole Rünnakupositsiooni.

source: Book of Moon
et: Kuu raamat

source: Select 1 face-up monster on the field and flip it into face-down Defense Position.
et: Vali välja 1 avatud koletis väljal ja keera see tagurpidi kaitsepositsiooni.

source: Mirage of Nightmare
et: Õudusunenäo Miraaž

source: Once per turn, during your opponent's Standby Phase: Draw cards until you have 4 cards in your hand. If you do, during your next Standby Phase after that: Randomly discard the same number of cards you drew (or your entire hand, if you do not have enough cards).
et: Kord ühe korra käigu jooksul, oma vastase Ootefaas: Tõmba kaarte, kuni sul on käes 4 kaarti. Kui sa seda teed, siis oma järgmise Ootefaasi ajal pärast seda: Viska juhuslikult ära sama palju kaarte, kui sa tõmbasid (või kogu oma käsi, kui sul ei ole piisavalt kaarte).

source: Call of the Mummy
et: Muumia kutse

source: Once per turn, if you control no monsters, you can Special Summon 1 Zombie-Type monster from your hand.
et: Kord ühe korra käigu jooksul, kui sul pole ühtegi koletist, saad oma käest eriliselt kutsuda 1 Zombi-tüüpi koletise.

source: Timidity
et: Arglikkus

source: Neither player can destroy Set Spell and Trap Cards on the field until your opponent's next End Phase.
et: Kumbki mängija ei saa hävitada laual olevaid seatud loitsu- ja lõksukaarte kuni sinu vastase järgmise lõppfaasini.

source: Pyramid Energy
et: Püramiidienergia

source: You can select and activate 1 of the following effects:<BR>● Increase the ATK of all face-up monsters on your side of the field by 200 points until the End Phase of the turn this card is activated.<BR>● Increase the DEF of all face-up monsters on your side of the field by 500 points until the End Phase of the turn this card is activated.
et: Saad valida ja aktiveerida ühe järgmistest efektidest:<BR>● Suurenda kõigi sinu väljaku avatud positsioonis olevate koletiste ATK-d 200 punkti võrra kuni selle käigu lõppfaasini, mil see kaart aktiveeritakse.<BR>● Suurenda kõigi sinu väljaku avatud positsioonis olevate koletiste DEF-i 500 punkti võrra kuni selle käigu lõppfaasini, mil see kaart aktiveeritakse.

source: Tutan Mask
et: Tutani Mask

source: Negate the activation and the effect of a Spell or Trap Card that targets 1 face-up Zombie-Type monster and destroy it.
et: Tühista ühe ülespoole suunatud Zombi-tüüpi koletise sihtiva Loitsu või Lõksukaardi aktiveerimine ja mõju ning hävita see.

source: Ordeal of a Traveler
et: Ränduri katsumus

source: You can activate this card's effect when your opponent declares an attack. Your opponent selects 1 random card in your hand and calls the type of the card (Monster, Spell, or Trap). If your opponent calls it wrong, the attacking monster is returned to its owner's hand.
et: Saad aktiveerida selle kaardi efekti, kui sinu vastane kuulutab välja rünnaku. Sinu vastane valib juhuslikult ühe kaardi sinu käest ja nimetab kaardi tüübi (Koletis, Loits või Lõks). Kui sinu vastane nimetab valesti, tagastatakse ründav koletis selle omaniku kätte.

source: Bottomless Shifting Sand
et: Põhjatu Liiv

source: At the end of your opponent's turn, destroy the face-up monster(s) with the highest ATK on the field. During your own Standby Phase, if you have 4 or less cards in your hand, this card is destroyed.
et: Oma vastase käigu lõpus hävita lahinguväljal olev(ad) avatud koletis(ed), millel on kõrgeim ATK. Oma Standby Phase'i ajal, kui sul on käes 4 või vähem kaarti, hävitatakse see kaart.

source: Curse of Royal
et: Kuninglik needus

source: Negate the activation and the effect of a Spell or Trap Card that includes the effect of destroying 1 Spell or Trap Card and destroy it.
et: Tühista ühe Võlu- või Lõksukaardi aktiveerimine ja efekt, mis sisaldab ühe Võlu- või Lõksukaardi hävitamise efekti, ning hävita see.

source: Needle Ceiling
et: Nõellagi

source: Activate only when there are 4 or more monsters on the field. Destroy all face-up monsters.
et: Aktiveeri ainult siis, kui väljal on 4 või rohkem koletist. Hävita kõik avatud koletised.

source: Statue of the Wicked
et: Kurja kuju

source: When this face-down card is destroyed and sent to the Graveyard, Special Summon 1 "<M3908>Wicked Token<M>" (Fiend-Type/DARK/Level 4 /ATK 1000/DEF 1000) on your side of the field.
et: Kui see tagurpidi kaart hävitatakse ja saadetakse Hauakambrisse, kutsu eriliselt välja 1 "<M3908>Kurja Mängunupp<M>" (Deemonitüüp/PIMEDUS/Tase 4/ATK 1000/DEF 1000) oma väljaku poolele.

source: Dark Coffin
et: Tume kirst

source: When this face-down card is destroyed and sent to the Graveyard, your opponent selects and executes 1 of the following effects:<BR>● Discard 1 random card in their hand.<BR>● Select 1 monster on their side of the field and destroy it.
et: Kui see tagurpidi kaart hävitatakse ja saadetakse Hauakambrisse, valib ja täidab sinu vastane ühe järgmistest efektidest:<BR>● Viska juhuslikult 1 kaart nende käest ära.<BR>● Vali 1 koletis nende väljalt ja hävita see.

source: Needle Wall
et: Nõelasein

source: During your Standby Phase, roll a six-sided dice once. Treat your opponent's Monster Card Zones as number's 1-5, counting from your right. Destroy the monster that is in the same Monster Card Zone as the dice result. If the result is 6, roll again.
et: Oma Standby Phase'i ajal veereta üks kord kuuepoolset täringut. Kohtle oma vastase Monster Card Zone'e numbritena 1-5, lugedes oma paremalt. Hävita koletis, mis asub samas Monster Card Zone'is kui täringu tulemus. Kui tulemus on 6, veereta uuesti.

source: Trap Dustshoot
et: Lõksutolmuheit

source: Activate only if your opponent has 4 or more cards in their hand. Look at your opponent's hand, select 1 Monster Card in it, and return that card to its owner's Deck.
et: Aktiveeri ainult siis, kui sinu vastasel on käes 4 või rohkem kaarti. Vaata oma vastase kätt, vali sealt 1 Koletisekaart ja tagasta see kaart selle omaniku pakki.

source: Pyro Clock of Destiny
et: Saatuskell

source: Move the turn count forward by 1 turn. The turn in which this card is activated continues as normal.
et: Liiguta käikude arvu edasi 1 käigu võrra. Käik, milles see kaart aktiveeritakse, jätkub tavapäraselt.

source: Reckless Greed
et: Hulljulge ahnus

source: Draw 2 cards, and skip your next 2 Draw Phases.
et: Tõmba 2 kaarti ja jäta vahele oma järgmised 2 tõmbamisfaasi.

source: Pharaoh's Treasure
et: Vaarao aare

source: After activation, put this card face-up in your Deck and shuffle it. When you draw this card, send it to the Graveyard and add 1 card in your Graveyard (except this card) to your hand.
et: Pärast aktiveerimist pane see kaart oma pakki avatud kujul ja sega see läbi. Kui tõmbad selle kaardi, saada see Hauakambrisse ja lisa 1 kaart oma Hauakambrist (välja arvatud see kaart) oma kätte.

source: Toon Dark Magician Girl
et: Multifilmide Tume Maagik Neiu

source: This card cannot be Normal Summoned or Set. This card can only be Special Summoned while "<M4798>Toon World<M>" is on your side of the field. You can Special Summon this monster from your hand, but Tributes are required for monsters Level 5 or more. When "<M4798>Toon World<M>" on the field is destroyed, this card is also destroyed. If your opponent doesn't control a Toon Monster, this card can attack your opponent directly. If a face-up Toon Monster is on your opponent's side of the field, you must select the Toon Monster as an attack target. This card gains 300 ATK for each "<M4041>Dark Magician<M>" or "<M4728>Magician of Black Chaos<M>" in either player's Graveyard.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti saab eriliselt kutsuda ainult siis, kui "<M4798>Toon World<M>" on sinu väljaku poolel. Sa saad selle koletise oma käest eriliselt kutsuda, kuid tase 5 või kõrgemate koletiste jaoks on vaja ohverdusi. Kui väljaku peal olev "<M4798>Toon World<M>" hävitatakse, hävitatakse ka see kaart. Kui sinu vastasel ei ole Toon-koletist, saab see kaart rünnata sinu vastast otse. Kui sinu vastase väljaku poolel on ülespööratud Toon-koletis, pead sa valima Toon-koletise rünnaku sihtmärgiks. See kaart saab 300 ATK iga "<M4041>Dark Magician<M>" või "<M4728>Magician of Black Chaos<M>" eest, mis on kummagi mängija hauas.

source: Gilford the Lightning
et: Välgu-Gilford

source: You can Tribute 3 monsters to Tribute Summon this card. If you do, destroy all monsters your opponent controls.
et: Saad selle kaardi välja kutsuda, ohverdades 3 koletist. Kui teed seda, hävita kõik vastase kontrollitavad koletised.

source: Exarion Universe
et: Exarioni Universum

source: Activate this effect only during your Battle Step. This card loses 400 ATK and during battle between this attacking card and a Defense Position monster whose DEF is lower than the ATK of this card, inflict the difference as Battle Damage to your opponent. This effect continues until the End Phase of this turn.
et: Aktiveeri see efekt ainult oma Lahingusammu ajal. See kaart kaotab 400 ATK ja lahingus selle ründava kaardi ja Kaitseasendis oleva koletise vahel, mille DEF on madalam kui selle kaardi ATK, põhjusta vahe oma vastasele Lahingukahjuna. See efekt kestab kuni selle käigu Lõppfaasini.

source: Legendary Fiend
et: Legendaarne Deemon

source: During each of your Standby Phases, this card gains 700 ATK.
et: Iga oma ootejärgu ajal saab see kaart 700 ATK juurde.

source: Toon Defense
et: Multikakaitse

source: When your opponent's monster attacks a face-up Level 4 or lower Toon Monster on your side of the field, you can make the attack a direct attack to your Life Points.
et: Kui sinu vastase koletis ründab sinu väljaku poolel olevat avatud 4. taseme või madalamat Toon Koletist, võid sa muuta rünnaku otseseks rünnakuks sinu Elupunktidele.

source: Toon Table of Contents
et: Multikaartide sisukord

source: Add 1 card from your Deck to your hand that includes "Toon" in its card name, or is named "<M4733>Manga Ryu-Ran<M>".
et: Lisa oma pakist 1 kaart, mille nimes on "Toon" või mille nimi on "<M4733>Manga Ryu-Ran<M>".

source: Toon Masked Sorcerer
et: Multik Kaval Maskiga

source: This card cannot attack during the turn that it is Normal Summoned, Flip Summoned, or Special Summoned. When "<M4798>Toon World<M>" on the field is destroyed, destroy this card. If "<M4798>Toon World<M>" is on your side of the field and your opponent does not control a Toon Monster, this card can attack your opponent's Life Points directly. When this card inflicts Battle Damage to your opponent's Life Points, draw 1 card from your Deck.
et: See kaart ei saa rünnata sellel käigul, mil see on Normaal-Kutsutud, Pööratud-Kutsutud või Eriliselt Kutsutud. Kui "<M4798>Toon World<M>" väljal hävitatakse, hävita see kaart. Kui "<M4798>Toon World<M>" on sinu väljal ja sinu vastane ei kontrolli Toon Koletist, võib see kaart rünnata sinu vastase Elupunkte otse. Kui see kaart tekitab sinu vastasele Elupunktide Kahju, tõmba 1 kaart oma Paki seest.

source: Toon Gemini Elf
et: Multik Gemini Elf

source: This card cannot attack during the turn that it is Normal Summoned, Flip Summoned, or Special Summoned. When "<M4798>Toon World<M>" on the field is destroyed, this card is also destroyed. If "<M4798>Toon World<M>" is on your side of the field and your opponent does not control a Toon Monster, this card can attack your opponent's Life Points directly. When this card inflicts Battle Damage to your opponent's Life Points, your opponent discards 1 card randomly from his/her hand.
et: See kaart ei saa rünnata sellel käigul, mil see on Normaal-Kutsutud, Pööratud-Kutsutud või Eriliselt Kutsutud. Kui "<M4798>Toon World<M>" väljal hävitatakse, hävitatakse ka see kaart. Kui "<M4798>Toon World<M>" on sinu poolel väljal ja sinu vastane ei kontrolli Toon Koletist, võib see kaart rünnata sinu vastase Elupunkte otse. Kui see kaart tekitab lahingukahju sinu vastase Elupunktidele, viskab sinu vastane juhuslikult 1 kaardi oma käest ära.

source: Toon Cannon Soldier
et: Multikas Kahurimees

source: This card cannot attack during the turn that it is Normal Summoned, Flip Summoned, or Special Summoned. When "<M4798>Toon World<M>" on the field is destroyed, destroy this card. If "<M4798>Toon World<M>" is on your side of the field and your opponent does not control a Toon Monster, this card can attack your opponent's Life Points directly. Tribute 1 monster on your side of the field to inflict 500 points of damage to your opponent's Life Points.
et: See kaart ei saa rünnata sellel käigul, mil see on Normaal-Kutsutud, Pööratud-Kutsutud või Eriliselt Kutsutud. Kui "<M4798>Toon World<M>" väljal hävitatakse, hävita see kaart. Kui "<M4798>Toon World<M>" on sinu poolel väljal ja sinu vastane ei kontrolli Toon Koletist, võib see kaart rünnata sinu vastase Elupunkte otse. Ohverda 1 koletis oma poolel väljal, et tekitada 500 punkti kahju sinu vastase Elupunktidele.

source: Toon Goblin Attack Force
et: Multik Goblinite Rünnakvägi

source: This card cannot attack during the turn that it is Normal Summoned, Flip Summoned, or Special Summoned. When "<M4798>Toon World<M>" on the field is destroyed, this card is also destroyed. If "<M4798>Toon World<M>" is on your side of the field and your opponent does not control a Toon Monster, this card can attack your opponent's Life Points directly. If this card attacks, it is changed to Defense Position at the end of the Battle Phase, and you cannot change this Battle Position until the end of your next turn.
et: See kaart ei saa rünnata sellel käigul, mil see on Normaal-Kutsutud, Pööratud-Kutsutud või Eriliselt Kutsutud. Kui "<M4798>Toon World<M>" väljal hävitatakse, hävitatakse ka see kaart. Kui "<M4798>Toon World<M>" on sinu poolel väljal ja sinu vastane ei kontrolli Toon Koletist, võib see kaart rünnata sinu vastase Elupunkte otse. Kui see kaart ründab, muudetakse see Lahingu Faasi lõpus Kaitsepositsiooniks ja sa ei saa seda Lahingu Positsiooni muuta enne oma järgmise käigu lõppu.

source: Card of Sanctity
et: Pühaduse kaart

source: Remove from play all cards in your hand and on your side of the field. Draw cards until you have 2 cards in your hand.
et: Eemalda mängust kõik kaardid oma käest ja oma väljaku poolelt. Tõmba kaarte, kuni sul on käes 2 kaarti.

source: Dark Designator
et: Tume Määrang

source: Declare 1 Monster Card name. If the declared card is in your opponent's Deck, add 1 of that card to your opponent's hand.
et: Teata 1 koletise kaardi nimi. Kui nimetatud kaart on sinu vastase pakis, lisa 1 selle kaardi oma vastase kätte.

source: Puppet Master
et: Nukumeister

source: When this card is Tribute Summoned you can pay 2000 Life Points to Special Summon 2 Fiend-Type monsters from your Graveyard. They cannot attack this turn.
et: Kui see kaart on ohverdamisega välja kutsutud, võid maksta 2000 Elupunkti, et eriliselt välja kutsuda 2 Deemon-tüüpi koletist oma Hauakambrist. Nad ei saa sellel käigul rünnata.

source: If this face-up card is destroyed and sent to the Graveyard by an opponent's card effect, Special Summon it during your next Standby Phase.
et: Kui see avatud kaart hävitatakse ja saadetakse vastase kaardi efekti tõttu Hauakambrisse, kutsu see oma järgmise Ootefaasiga eriliselt välja.

source: When this card is destroyed by battle and sent to the Graveyard: Target 1 monster on the field; destroy that target.
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse: Sihti 1 koletis väljal; hävita see sihtmärk.

source: Lord Poison
et: Isand Mürk

source: When this card is destroyed by battle and sent to the Graveyard, Special Summon 1 Plant-Type monster from your Graveyard, except "<M5485>Lord Poison<M>".
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse, kutsu eriliselt esile 1 Taimetüüpi koletis oma Hauakambrist, välja arvatud "<M5485>Lord Poison<M>".

source: Spell of Pain
et: Valu loits

source: Activate only when an effect is activated that would inflict effect damage to you. Switch the effect damage to your opponent's Life Points, instead.
et: Aktiveeri ainult siis, kui aktiveeritakse efekt, mis tekitaks sulle efektikahju. Selle asemel suuna efektikahju oma vastase Elupunktidele.

source: Blade Knight
et: Terarüütel

source: While you have 1 or fewer cards in your hand, this card gains 400 ATK. If this is the only monster you control, negate the effects of Flip Effect Monsters it destroys by battle.
et: Kui sul on käes 1 või vähem kaarte, saab see kaart 400 ATK juurde. Kui see on ainus koletis, mida sa kontrollid, tühista Flip Effect Monsters'i efektid, mille ta lahingus hävitab.

source: This card cannot be Special Summoned from the Graveyard. If this card is destroyed by battle and sent to the Graveyard, while it is in the Graveyard, your opponent discards 1 random card at the end of each of their Battle Phases.
et: Seda kaarti ei saa eriliselt kutsuda Hauakambrist. Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse, siis kui see on Hauakambris, viskab sinu vastane iga oma Lahingufaasi lõpus juhuslikult ühe kaardi ära.

source: Hidden Soldiers
et: Varjatud Sõdurid

source: Activate only when your opponent Normal Summons or Flip Summons a monster. Special Summon 1 Level 4 or lower DARK monster from your hand.
et: Aktiveeri ainult siis, kui su vastane kutsub normaal- või pöördkutsumisega välja koletise. Kutsu eriliselt välja 1 tase 4 või madalam PIMEDUS koletis oma käest.

source: This steel-armored terror machine ruthlessly strikes down enemies with its giant katana.
et: See terasest soomustatud hirmumasin lööb halastamatult vaenlasi maha oma hiiglasliku katanaga.

source: Coffin Seller
et: Kirstumüüja

source: Each time a Monster Card(s) is sent to your opponent's Graveyard, inflict 300 damage to your opponent.
et: Iga kord, kui koletise kaart saadetakse sinu vastase hauakambrisse, põhjusta vastasele 300 kahju.

source: Malevolent Catastrophe
et: Pahatahtlik Katastroof

source: Activate only when your opponent's monster declares an attack. Destroy all Spell and Trap Cards on the field.
et: Aktiveeri ainult siis, kui sinu vastase koletis kuulutab välja rünnaku. Hävita kõik Väljal olevad Loitsu- ja Lõksukaardid.

source: Question
et: Küsimus

source: When activating this card, your opponent cannot check cards in your Graveyard. Your opponent calls the name of the first monster found at the bottom of your Graveyard. If he/she calls it right, the monster is removed from play. If he/she calls it wrong, the monster is Special Summoned to your side of the field.
et: Selle kaardi aktiveerimisel ei saa sinu vastane kontrollida kaarte sinu Hauakambris. Sinu vastane nimetab esimese koletise nime, mis leitakse sinu Hauakambri põhjast. Kui ta nimetab õigesti, eemaldatakse koletis mängust. Kui ta nimetab valesti, kutsutakse koletis eriliselt sinu väljaku poolele.

source: This card cannot be Normal Summoned or Set. This card can only be Special Summoned to your opponent's side of the field by Tributing 2 monsters they control. You cannot Normal Summon or Set the turn you Special Summon this card. This monster's controller takes 1000 damage during each of their Standby Phases.
et: Seda kaarti ei saa tavaliselt kutsuda ega asetada. Seda kaarti saab eriliselt kutsuda ainult vastase väljale, ohverdades 2 nende kontrollitavat koletist. Sa ei saa tavaliselt kutsuda ega asetada sellel käigul, mil sa selle kaardi eriliselt kutsud. Selle koletise kontrollija saab iga oma ooteetapi ajal 1000 kahju.

source: Relieve Monster
et: Leevenda Koletis

source: Activate only when an opponent's monster declares an attack. Select 1 monster you control, and return it to the hand. Then Special Summon 1 Level 4 monster from your hand.
et: Aktiveeri ainult siis, kui vastase koletis kuulutab välja rünnaku. Vali 1 koletis, mida sa kontrollid, ja tagasta see kätte. Seejärel kutsu eriliselt välja 1 4. taseme koletis oma käest.

source: Machine Duplication
et: Masina duplikaat

source: Select 1 face-up Machine-Type monster you control with 500 or less ATK. You can Special Summon up to 2 cards with the same name from your Deck.
et: Vali 1 avatud Masina-tüüpi koletis, mida sa kontrollid ja millel on 500 või vähem ATK. Sa võid eriliselt kutsuda kuni 2 kaarti sama nimega oma pakist.

source: Dark Jeroid
et: Tume Jeroid

source: When this card is Summoned, select 1 face-up monster on the field. It loses 800 ATK.
et: Kui see kaart kutsutakse välja, vali 1 avatud koletis väljal. See kaotab 800 ATK.

source: Dragon Master Knight
et: Draakonimeister Rüütel
