Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: A strike force equipped with rocket launchers and bazookas.
et: Raketilaskurite ja bazookadega varustatud löögijõud.

source: Dice Armadillo
et: Täringu Armadillo

source: An armadillo monster that rolls up to form a dice-like shape.
et: Armadillo-koletis, mis rullub kokku täringu sarnaseks kujuks.

source: Sky Dragon
et: Taevadraakon

source: A flying dragon with four wings housing some very dangerous blades.
et: Lendav draakon, kellel on neli tiiba, mis kannavad väga ohtlikke terasid.

source: Thunder Dragon
et: Äikese Draakon

source: You can discard this card to add up to 2 "<M4431>Thunder Dragon<M>"(s) from your Deck to your hand.
et: Saad selle kaardi ära visata, et lisada oma pakist kuni 2 "<M4431>Thunder Dragon<M>" oma kätte.

source: Stone Dragon
et: Kivilohe

source: A dragon formed by huge boulders that are also used to attack the enemy.
et: Hiiglaslikest rändrahnudest moodustatud draakon, mida kasutatakse ka vaenlase ründamiseks.

source: Kaiser Dragon
et: Kaiser Draakon

source: "<M4013>Winged Dragon, Guardian of the Fortress #1<M>" + "<M4609>Fairy Dragon<M>"
et: "<M4013>Tiivuline Draakon, Kindluse Kaitsja #1<M>" + "<M4609>Haldjas Draakon<M>"

source: Magician of Faith
et: Uskumuse Maag

source: FLIP: Add 1 Spell Card from your Graveyard to your hand.
et: FLIP: Lisa oma kalmistult 1 Võlukaar oma kätte.

source: Goddess of Whim
et: Kapriisi Jumalanna

source: Toss a coin and call Heads or Tails. Call it right and this card's ATK will be doubled during this turn. Call it wrong and it will be halved during this turn.
et: Viska münt ja ütle, kas tuleb kull või kiri. Kui arvad õigesti, siis selle kaardi ATK kahekordistub selle käigu ajal. Kui arvad valesti, siis see väheneb poole võrra selle käigu ajal.

source: Water Magician
et: Vee Maag

source: This monster swamps an opponent with an almost endless supply of water.
et: See koletis ujutab vastase peaaegu lõputu veehulgaga üle.

source: Ice Water
et: Jäävesi

source: A very aggressive mermaid that attacks enemies with the spikes growing from its body.
et: Väga agressiivne merineitsi, kes ründab vaenlasi oma kehast kasvavate ogadega.

source: Waterdragon Fairy
et: Veelohe Haldjas

source: A water fairy that is said to be able to summon a giant sea serpent.
et: Veehaldjas, kes väidetavalt suudab kutsuda esile hiiglasliku meremadu.

source: Ancient Elf
et: Muistne Elf

source: This elf is rumored to have lived for thousands of years. He leads an army of spirits against his enemies.
et: Selle päkapiku kohta liiguvad kuulujutud, et ta on elanud tuhandeid aastaid. Ta juhib vaimude armeed oma vaenlaste vastu.

source: Beautiful Beast Trainer
et: Kaunis metsalise treener

source: A rare female beast-master with a very dangerous whip.
et: Haruldane naismeister, kellel on väga ohtlik piits.

source: Water Girl
et: Vee Tüdruk

source: A lovely lady who can launch water projectiles that turn into lethal ice spikes before they reach an opponent.
et: Kaunis daam, kes suudab tulistada veejugasid, mis muutuvad surmavateks jääokasteks enne, kui nad vastaseni jõuavad.

source: White Dolphin
et: Valge Delfiin

source: A white dolphin with a horn that summons huge tidal waves.
et: Valge delfiin sarvega, mis kutsub esile tohutuid tõusulaineid.

source: Deepsea Shark
et: Sügavmere Hai

source: "<M4445>Bottom Dweller<M>" + "<M4549>Tongyo<M>"
et: "<M4445>Põhjaasukas<M>" + "<M4549>Tongyo<M>"

source: Metal Fish
et: Metallkala

source: A metal fish with a razor-sharp caudal fin.
et: Metallist kala, millel on üliterav sabauim.

source: Bottom Dweller
et: Põhjaasukas

source: This is one sea creature whose wrath is something monsters fear to face.
et: See on üks mereelukas, kelle viha on midagi, mida koletised kardavad kohata.

source: 7 Colored Fish
et: 7 värviline kala

source: A rare rainbow fish that has never been caught by mortal man.
et: Haruldane vikerkaarekalad, keda surelik mees pole kunagi püüdnud.

source: Mech Bass
et: Mehh Bass

source: A mechanized bass with a large mouth and a cannon on its back. The cannon fires blinding plasma rays.
et: Mehhaniseeritud bass, millel on suur suu ja kahur seljal. Kahur tulistab pimestavaid plasmakiiresid.

source: Aqua Dragon
et: Aqua Draakon

source: "<M4609>Fairy Dragon<M>" + "<M4632>Amazon of the Seas<M>" + "<M4399>Zone Eater<M>"
et: "<M4609>Haldjas Draakon<M>" + "<M4632>Mere Amazon<M>" + "<M4399>Tsooni Sööja<M>"

source: Sea King Dragon
et: Merekuningas Draakon

source: Protected by a tough shell, this master of sea attacks its enemies with toxic bubbles.
et: Kõva kestaga kaitstud, ründab see mere meister oma vaenlasi mürgiste mullidega.

source: A strange, one-eyed monster that can fell an enemy with a single stab of its spear.
et: Kummaline, ühe silmaga koletis, kes suudab vaenlase maha lüüa ühe odatorkega.

source: Sentinel of the Seas
et: Merevaht

source: A merman warrior dedicated to defending the ocean against anyone who would defile it.
et: Meremees sõdalane, kes on pühendunud ookeani kaitsmisele kõigi vastu, kes seda rüvetada tahavad.

source: Aqua Snake
et: Vee Madu

source: This monster hypnotizes an opponent with the ball on its tail and draws them to a watery doom.
et: See koletis hüpnotiseerib vastase oma sabal oleva palliga ja tõmbab nad vesisesse hukatusse.

source: Giant Red Seasnake
et: Hiiglaslik Punane Meremadu

source: A sea-dwelling snake that attacks passing enemies with its sharp teeth.
et: Mereelav madu, kes ründab mööduvaid vaenlasi oma teravate hammastega.

source: Spike Seadra
et: Ogalik Seadra

source: Using the spikes sprouting from its body, this creature stabs its opponents and floods them with electricity.
et: Kasutades oma kehast välja kasvavaid ogasid, torkab see olend oma vastaseid ja ujutab nad üle elektriga.

source: 30,000-Year White Turtle
et: 30 000-aastane valge kilpkonn

source: A huge turtle that has existed for more than 30,000 years.
et: Hiiglaslik kilpkonn, kes on eksisteerinud üle 30 000 aasta.

source: Kappa Avenger
et: Kappa Kättemaksja

source: An amphibian that sold his soul for unlimited power to avenge his late friend.
et: Amfiib, kes müüs oma hinge piiramatu jõu eest, et kätte maksta oma lahkunud sõbra eest.

source: A monster crab with huge claws for clipping enemies to little pieces.
et: Koletislik krabi, kellel on suured küünised vaenlaste tükkideks lõikamiseks.

source: A lethal crawfish with extremely dangerous claws.
et: Surmav vähk, millel on äärmiselt ohtlikud küünised.

source: Millennium Golem
et: Millenniumi Golem

source: For nearly a millennium, this golem has served as guardian of an ancient treasure trove.
et: Ligi aastatuhande on see golem teeninud iidse aardekambri valvurina.

source: Destroyer Golem
et: Hävitaja Golem

source: A golem with a massive right hand for crushing its victims.
et: Golem, kellel on tohutu parem käsi oma ohvrite purustamiseks.

source: Barrel Rock
et: Tünnikivi

source: Shouldering a pair of machine guns, this monster is unstoppable.
et: Õlgadel paar kuulipildujat, on see koletis peatamatu.

source: Minomushi Warrior
et: Minomushi Sõdalane

source: Stone Ghost
et: Kivikummitus

source: With a head that erupts when angered, this monster launches a dangerous shower of boulders.
et: Kui see koletis vihastub, purskab tema pea ohtlikku kivirahet.

source: Kaminari Attack
et: Kaminari Rünnak

source: Tripwire Beast
et: Tripwire'i metsaline

source: This creature attacks with electromagnetic waves.
et: See olend ründab elektromagnetlainetega.

source: Bolt Escargot
et: Poldi Tigu

source: After rendering an opponent immobile by spitting a sticky goo, this monster closes in for the attack.
et: Pärast vastase liikumatuks muutmist kleepuva limaga sülitades, läheneb see koletis rünnakuks.

source: Bolt Penguin
et: Poldipinguin

source: With both arms forming an electric whip, this monster paralyzes its enemies with electric shocks.
et: Mõlema käega elektripiitsa moodustades halvab see koletis oma vaenlased elektrilöökidega.

source: The Immortal of Thunder
et: Äikese Surematu

source: FLIP: Increase your Life Points by 3000 points. When this card is sent from the field to the Graveyard, you lose 5000 Life Points.
et: FLIP: Suurenda oma Elupunkte 3000 punkti võrra. Kui see kaart saadetakse väljakult Hauakambrisse, kaotad 5000 Elupunkti.

source: Electric Snake
et: Elektriline Madu

source: When this card is discarded from your hand to the Graveyard by an effect controlled by your opponent, draw 2 cards from your Deck.
et: Kui see kaart visatakse sinu käest surnuaeda sinu vastase kontrollitud efekti tõttu, tõmba oma pakist 2 kaarti.

source: Wing Eagle
et: Tiiva Kotkas

source: This flying creature never misses its intended target.
et: See lendav olend ei jäta kunagi oma sihtmärki tabamata.

source: Punished Eagle
et: Karistatud Kotkas

source: "<M4642>Blue-Winged Crown<M>" + "<M4544>Niwatori<M>"
et: "<M4642>Sinitiivuline kroon<M>" + "<M4544>Niwatori<M>"

source: Skull Red Bird
et: Karmiinpunane Kolju Lind

source: This monster swoops down and attacks with a rain of knives stored in its wings.
et: See koletis sööstab alla ja ründab oma tiibadesse peidetud nugade vihmaga.

source: Crimson Sunbird
et: Veripunane Päikeselind

source: "<M4131>Faith Bird<M>" + "<M4472>Skull Red Bird<M>"
et: "<M4131>Usulind Lind<M>" + "<M4472>Punane Kolju Lind<M>"

source: Queen Bird
et: Kuninglind

source: This monster attacks enemies using its huge beak.
et: See koletis ründab vaenlasi oma hiiglasliku nokaga.

source: Armed Ninja
et: Relvastatud Ninja

source: FLIP: Select 1 Spell Card on the field and destroy it. If the selected card is Set, pick up and see the card. If it is a Spell Card, it is destroyed. If it is a Trap Card, return it to its original position.
et: FLIP: Vali 1 Võlukaart väljal ja hävita see. Kui valitud kaart on seatud, tõsta see üles ja vaata kaarti. Kui see on Võlukaart, hävitatakse see. Kui see on Lõksukaart, vii see tagasi oma algsesse asendisse.

source: Magical Ghost
et: Maagiline Kummitus

source: This creature casts a spell of terror and confusion just before attacking its enemies.
et: See olend heidab loitsu, mis tekitab hirmu ja segadust vaenlaste ründamise eel.

source: Soul Hunter
et: Hingejahtija

source: "<M4155>Lord of The Lamp<M>" + "<M4566>Invader from Another Dimension<M>"
et: "<M4155>Lambi Isand<M>" + "<M4566>Sissetungija Teisest Dimensioonist<M>"

source: Air Eater
et: Õhusööja

source: A monster that feeds on oxygen, suffocating any who stand near.
et: Koletis, mis toitub hapnikust, lämmatades kõik, kes seisavad lähedal.

source: Vermillion Sparrow
et: Vermillioni Vares

source: "<M4157>Rhaimundos of the Red Sword<M>" + "<M4297>Fireyarou<M>"
et: "<M4157>Punase Mõõga Rhaimundos<M>" + "<M4297>Fireyarou<M>"

source: Sea Kamen
et: Merekameeleon

source: A merciless monster that tears opponents to shreds with razor-like claws.
et: Halastamatu koletis, kes rebib vastased tükkideks habemenuga meenutavate küünistega.

source: Sinister Serpent
et: Sünge Madu

source: During your Standby Phase, if a "<M4481>Sinister Serpent<M>" exists in your Graveyard, you can return the "<M4481>Sinister Serpent<M>" to your hand.
et: Oma Standby Phase'i ajal, kui sinu Hauakambris on "<M4481>Sinister Serpent<M>", võid sa "<M4481>Sinister Serpent<M>" oma kätte tagasi tuua.

source: A crab that binds its enemies with a sticky web and attacks them with its sharp claws.
et: Krabi, kes seob oma vaenlased kleepuva võrgu abil ja ründab neid teravate küünistega.

source: Alinsection
et: Alinsektsioon

source: A stag beetle with saw-like head and arms.
et: Saagjate pea ja kätega hirvlane mardikas.

source: Insect Soldiers of The Sky
et: Taevased putukasõdurid

source: The ATK of this card increases by 1000 points whenever it attacks a WIND monster.
et: Selle kaardi ATK suureneb 1000 punkti võrra iga kord, kui see ründab WIND koletist.

source: Cockroach Knight
et: Prussakarüütel

source: When this card is sent to the Graveyard, it is returned to the top of the Deck.
et: Kui see kaart saadetakse Hauakambrisse, siis see tagastatakse Paki tippu.

source: A very vicious stag beetle that goes for the head.
et: Väga tige hirvlane, kes ründab pead.

source: Burglar
et: Varas

source: A sly rat. He will come at you with his huge left claw.
et: Kaval rott. Ta ründab sind oma hiiglasliku vasaku küünisega.

source: "<M4576>Trakodon<M>" + "<M4650>Flame Viper<M>"
et: "<M4576>Trakodon<M>" + "<M4650>Leekmadu Viper<M>"

source: A wicked beast that resembles a winged lion.
et: Kuri tiivulist lõvi meenutav õel elajas.

source: Ameba
et: Ameeba

source: When the control of this face-up card on the field shifts to your opponent, inflict 2000 points of damage to your opponent's Life Points. This effect can only be used once as long as this card remains face-up on the field.
et: Kui selle avatud kaardi kontroll väljakul läheb sinu vastasele, tekitab see sinu vastase Elupunktidele 2000 punkti kahju. Seda efekti saab kasutada ainult üks kord, kuni see kaart jääb väljakule avatuks.

source: A high-powered dung beetle that can roll dung larger than itself. It crushes its foes with its massive ball of dung.
et: Võimas sõnnikumardikas, kes suudab veeretada endast suuremat sõnnikupalli. See purustab oma vaenlased oma tohutu sõnnikupalliga.

source: A book-like wizard with a wealth of magic written inside.
et: Raamatulaadne võlur, kelle sees on rikkalikult maagilisi kirjutisi.

source: Flower Wolf
et: Lillehunt

source: "<M4071>Silver Fang<M>" + "<M4573>Darkworld Thorns<M>"
et: "<M4071>Hõbekihv<M>" + "<M4573>Pimeduse Okkad<M>"

source: Rainbow Flower
et: Vikerkaare Lill

source: This card can attack your opponent directly.
et: See kaart võib rünnata sinu vastast otse.

source: Barrel Lily
et: Tünnilill

source: This wicked flower attacks enemies with pollen projectiles.
et: See õel lill ründab vaenlasi õietolmu projektiilidega.

source: Needle Ball
et: Nõelapall

source: FLIP: You can pay 2000 Life Points to inflict 1000 damage to your opponent.
et: FLIP: Sa võid maksta 2000 Elupunkti, et tekitada oma vastasele 1000 kahju.

source: Peacock
et: Paabulind

source: A large peacock that launches its feathers in a lethal attack.
et: Suur paabulind, kes ründab surmavalt oma sulgedega.

source: As long as this card remains face-up on the field, increase the ATK of all LIGHT monsters by 500 points and decrease the ATK of all DARK monsters by 400 points.
et: Niikaua kui see kaart jääb väljale avatud olekusse, suurenda kõigi VALGUSE koletiste ATK-d 500 punkti võrra ja vähenda kõigi PIMEDUSE koletiste ATK-d 400 punkti võrra.

source: This card gains 500 ATK for each Equip Card equipped to this card.
et: See kaart saab 500 ATK iga Varustuskaardi eest, mis sellele kaardile on varustatud.

source: Rainbow Marine Mermaid
et: Vikerkaare Merineitsi

source: A reticent mermaid who appears only on very rare occasions. She emerges only when a large rainbow arches across the sky.
et: Vaikne merineitsi, kes ilmub vaid väga harvadel juhtudel. Ta ilmub ainult siis, kui suur vikerkaar kaardub üle taeva.

source: Musician King
et: Muusikakuningas

source: "<M4580>Witch of the Black Forest<M>" + "<M4618>Lady of Faith<M>"
et: "<M4580>Musta metsa nõid<M>" + "<M4618>Usu daam<M>"

source: A rabid rabbit that shears through opposition with its sharp skewers.
et: Raevukas jänes, kes lõikab vastaseid läbi oma teravate varrastega.

source: When this card is changed from Attack Position to Defense Position, you can place any number of cards from your hand at the bottom of your Deck in any order you desire.
et: Kui see kaart muudetakse rünnakupositsioonist kaitsepositsiooniks, võid asetada suvalise arvu kaarte oma käest oma paki alla ükskõik millises järjekorras.

source: A strange fiend with long arms and razor-sharp talons.
et: Kummaline deemon pikkade käte ja teravate küünistega.

source: Attacks enemies by spitting thin, sticky webs.
et: Ründab vaenlasi, sülitades õhukesi, kleepuvaid võrke.

source: Dragon Seeker
et: Draakoniotsija

source: When this card is Normal Summoned or Flip Summoned, destroy 1 face-up Dragon-Type monster on the field.
et: Kui see kaart on Normaal- või Pöördkutsutud, hävita 1 avatud Draakoni-tüüpi koletis väljal.

source: Man-Eater Bug
et: Inimsööja putukas

source: FLIP: Select and destroy 1 monster on the field.
et: FLIP: Vali ja hävita 1 koletis väljal.

source: D. Human
et: D. Inimene

source: Gifted with the power of dragons, this warrior wields a sword created from a dragon's fang.
et: Draakonite jõuga varustatud sõdalane, kes kasutab draakoni kihvast valmistatud mõõka.

source: Turtle Raccoon
et: Kilpkonn Pesukaru

source: A rotund little raccoon that shoulders a large turtle shell. It tricks foes using transformation and illusion techniques.
et: Ümar väike pesukaru, kes kannab suurt kilpkonna kesta. See petab vaenlasi, kasutades transformatsiooni ja illusioonitehnikaid.

source: Fungi of the Musk
et: Muskuseened

source: Melts away anything that dares to stand before it.
et: Sulabutab kõik, mis julgeb tema ette astuda.

source: This crystalline monster focuses light to create a lethal laser.
et: See kristalliline koletis keskendab valgust, et luua surmav laser.

source: You can pay 3000 Life Points to discard 1 monster from your Extra Deck to the Graveyard.
et: Sa saad maksta 3000 Elupunkti, et saata 1 koletis oma Lisapakist Hauakambrisse.

source: Crazy Fish
et: Hullumeelne Kala

source: A flying fish that attacks with its pointed head.
et: Lendav kala, kes ründab oma terava peaga.

source: Cyber Saurus
et: Kübersaurus

source: "<M4423>Blast Juggler<M>" + "<M4038>Two-Headed King Rex<M>"
et: "<M4423>Plahvatusžonglöör<M>" + "<M4038>Kahestpeast Kuningas Rex<M>"

source: "<M4038>Two-Headed King Rex<M>" + "<M4087>Crawling Dragon #2<M>"
et: "<M4038>Kaherealine Rex<M>" + "<M4087>Roomav Draakon #2<M>"

source: Laughing Flower
et: Naerev lill

source: A flower whose laugh can confuse the minds of enemies.
et: Lill, kelle naer võib vaenlaste meeli segadusse ajada.

source: Bean Soldier
et: Oasõdur

source: A plant-warrior that attacks with seeds and sword.
et: Seemnete ja mõõgaga ründav taim-sõdalane.

source: Cannon Soldier
et: Kahuriväelane

source: You can Tribute 1 monster to inflict 500 damage to your opponent.
et: Sa saad ohverdada 1 koletise, et tekitada oma vastasele 500 kahju.

source: Guardian of the Throne Room
et: Trooniruumi valvur

source: A robot guard built to protect throne rooms, it is armed with homing missiles
et: Trooni ruumide kaitseks ehitatud robotvalvur, mis on varustatud isesihituvate rakettidega

source: Brave Scizzar
et: Vapper Scizzar

source: Armed with a mass of scissors, this monster can clip an enemy into any desired shape and size.
et: Relvastatud kääride massiga, suudab see koletis lõigata vaenlase soovitud kuju ja suurusega.

source: The Statue of Easter Island
et: Lihavõtte saare kuju

source: A stone monument from Easter Island that launches laser blasts from its rock-hewn lips.
et: Ülestõusmispüha saare kivimonument, mis tulistab laserkiiri oma kivist tahutud huultelt.

source: As long as this card remains face-up on the field, increase the ATK and DEF of this card by 300 points for every card in the controller's hand.
et: Niikaua kui see kaart jääb väljale avatud olekus, suurendatakse selle kaardi ATK ja DEF väärtust 300 punkti võrra iga kaardi eest, mis on kontrollija käes.

source: Sand Stone
et: Liivakivi

source: Appears from underground and attacks with long, snake-like tentacles.
et: Ilmub maa alt ja ründab pikkade, maotaoliste kombitsatega.

source: Boulder Tortoise
et: Kivikilpkonn

source: A stone turtle that is nearly indestructible.
et: Kivi kilpkonn, mis on peaaegu hävimatu.

source: Fire Kraken
et: Tulekraak

source: A squid that thrives on fire and heat.
et: Kalmaar, kes õitseb tule ja kuumuse käes.

source: Turtle Bird
et: Kilpkonn Lind

source: An unusual turtle that not only swims at tremendous speeds, but can also sail across the skies.
et: Ebatavaline kilpkonn, kes mitte ainult ei uju tohutu kiirusega, vaid suudab ka taevas purjetada.

source: Skullbird
et: Koljulind

source: "<M4587>Takuhee<M>" + "<M4152>Temple of Skulls<M>"
et: "<M4587>Takuhee<M>" + "<M4152>Kolju tempel<M>"

source: Monstrous Bird
et: Kohutav Lind

source: Few have set eyes on this dive-bombing bird and lived to tell the tale.
et: Vähesed on näinud seda sukeldumislindu ja jäänud ellu, et lugu rääkida.

source: The Bistro Butcher
et: Bistro Lihunik

source: When this card inflicts Battle Damage to your opponent's Life Points, your opponent draws 2 cards from their Deck.
et: Kui see kaart tekitab lahingukahju sinu vastase elupunktidele, tõmbab sinu vastane oma pakist 2 kaarti.

source: Star Boy
et: Tähepoiss

source: As long as this card remains face-up on the field, increase the ATK of all WATER monsters by 500 points and decrease the ATK of all FIRE monsters by 400 points.
et: Niikaua kui see kaart jääb väljale avatud olekusse, suurenda kõigi VEE koletiste ATK-d 500 punkti võrra ja vähenda kõigi TULE koletiste ATK-d 400 punkti võrra.

source: Spirit of the Mountain
et: Mäevaim

source: An elderly magician that raises mountains with his flute.
et: Eakas võlur, kes tõstab oma flöödi abil mägesid.

source: Neck Hunter
et: Kaelakütt

source: A fiend that wields a mean sickle and fires devastating beams from its eyes.
et: Deemon, kes hoiab käes kurja sirpi ja tulistab oma silmadest laastavaid kiiri.

source: As long as this card remains face-up on the field, increase the ATK of all EARTH monsters by 500 points and decrease the ATK of all WIND monsters by 400 points.
et: Niikaua kui see kaart jääb väljale avatud olekusse, suurenda kõigi MAA koletiste ATK-d 500 punkti võrra ja vähenda kõigi TUULE koletiste ATK-d 400 punkti võrra.

source: An agile monster that rolls up to ram its opponents.
et: Väle koletis, kes veereb kokku, et rammida oma vastaseid.

source: Flame Cerebrus
et: Leektsereber

source: Known to many as the "Burning Executioner", this monster is capable of burning enemies to cinders.
et: Tuntud paljudele kui "Põlev Timukas", on see koletis võimeline vaenlasi tuhaks põletama.

source: The cane of this monster is the source of many powerful spells.
et: Selle koletise kepp on paljude võimsate loitsude allikas.

source: Mystical Sand
et: Müstiline Liiv

source: "<M4080>Giant Soldier of Stone<M>" + "<M4439>Ancient Elf<M>"
et: "<M4080>Kivihiid<|vq_15319|><M4439>Muinaself<M>"

source: Gemini Elf
et: Kaksikute Elf

source: Elf twins that alternate their attacks.
et: Haldjate kaksikud, kes vaheldumisi ründavad.

source: "<M4486>Kuwagata α<M>" + "<M4058>Hercules Beetle<M>"
et: "<M4486>Kuwagata α<M>" + "<M4058>Herkulesmardikas<M>"

source: When this card is discarded directly from your hand to the Graveyard by an effect of a card controlled by your opponent, inflict 1000 points of damage to your opponent's Life Points.
et: Kui see kaart visatakse otse sinu käest Hauakambrisse sinu vastase kontrollitava kaardi efekti tõttu, põhjusta oma vastase Elupunktidele 1000 punkti kahju.

source: A man-shaped mantis with two razor-sharp scythes.
et: <translated Mehekujuline palvetajaritsikas kahe terava vikatiga.

source: Mechaleon
et: Mehhaljon

source: A large chameleon with the ability to alter its body coloring. Using this ability, it can conceal itself in any location.
et: Suur kameeleon, kellel on võime muuta oma keha värvust. Seda võimet kasutades suudab ta end peita igas asukohas.

source: Mega Thunderball
et: Mega Äikese Palli

source: Rolls along the ground releasing bolts of electricity to attack its enemies.
et: Veereb mööda maad, vabastades elektrilööke, et rünnata oma vaenlasi.

source: Swallows enemies whole and uses their essence as energy.
et: Neelab vaenlased tervenisti alla ja kasutab nende olemust energiana.

source: Corroding Shark
et: Roostetav Hai

source: A zombie shark that can deliver its lethal curse with a spell.
et: Zombihai, kes suudab oma surmava needuse loitsuga edasi anda.
