Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: This effect can be used during either player's turn. When your opponent activates a Trap Card, Tribute this face-up card to negate the activation of the Trap Card and destroy it.
et: Seda efekti saab kasutada mõlema mängija käigu ajal. Kui sinu vastane aktiveerib Lõksukaardi, ohverda see avatud kaart, et Lõksukaardi aktiveerimine tühistada ja see hävitada.

source: Homunculus the Alchemic Being
et: Alkeemiline Olend Homunculus

source: Once per turn, you can change the Attribute of this monster.
et: Korra ühe käigu jooksul saad muuta selle koletise atribuuti.

source: Dark Blade the Dragon Knight
et: Pimeduse Mõõklohe Rüütel

source: "<M5581>Dark Blade<M>" + "<M5582>Pitch-Dark Dragon<M>"<BR>Each time this card inflicts Battle Damage to your opponent, you can select up to 3 Monster Cards from your opponent's Graveyard and remove them from play.
et: "<M5581>Tume Teras<M>" + "<M5582>Must-Tume Draakon<M>"<BR>Iga kord, kui see kaart tekitab lahingukahju sinu vastasele, saad valida kuni 3 koletisekaarti oma vastase hauakambrist ja eemaldada need mängust.

source: Mokey Mokey King
et: Mokey Mokey Kuningas

source: 3 × "<M6018>Mokey Mokey<M>"<BR>When this card is removed from the field, you can Special Summon as many "<M6018>Mokey Mokey<M>" as possible from your Graveyard.
et: 3 × "<M6018>Mokey Mokey<M>"<BR>Kui see kaart eemaldatakse väljakult, võid eriliselt kutsuda nii palju "<M6018>Mokey Mokey<M>" kui võimalik oma hauakambrist.

source: Serial Spell
et: Seerianõidus

source: Activate only when you activate one of your Normal Spell Cards. Discard all the cards in your hand to the Graveyard. The effect of this card becomes the same as the Normal Spell Card.
et: Aktiveeri ainult siis, kui aktiveerid ühe oma Tavalise Võlusõna Kaardi. Viska kõik kaardid oma käest Hauakambrisse. Selle kaardi efekt muutub samaks kui Tavalise Võlusõna Kaardi efekt.

source: Harpies' Hunting Ground
et: Harpyide jahimaad

source: When "<M4068>Harpie Lady<M>" or "<M4069>Harpie Lady sisters<M>" is Normal Summoned or Special Summoned, destroy 1 Spell or Trap Card on the field. All face-up Winged Beast-Type monsters gain 200 ATK and DEF.
et: Kui "<M4068>Harpie Lady<M>" või "<M4069>Harpie Lady sisters<M>" kutsutakse tavaliselt või eriliselt välja, hävita 1 Väljal olev Loitsu- või Lõksukaart. Kõik ülespoole suunatud Tiivulise Metssiga tüüpi koletised saavad 200 ATK ja DEF juurde.

source: Triangle Ecstasy Spark
et: Kolmnurga Ekstaasi Säde

source: Until the End Phase of this turn, the ATK of all "<M4069>Harpie Lady sisters<M>" becomes 2700, your opponent cannot activate any Trap Cards, and the effect of every Trap Card on your opponent's side of the field is negated.
et: Kuni selle käigu lõppfaasini muutub kõigi "<M4069>Harpie Lady sisters<M>" rünnakupunktid 2700-ks, sinu vastane ei saa aktiveerida ühtegi lõksukaarti ja kõik sinu vastase poolel olevate lõksukaartide efektid on tühistatud.

source: Necklace of Command
et: Käsukee

source: When a monster you control that's equipped with this card is destroyed by battle, and this card is sent to the Graveyard, you can either:<BR>● Draw 1 card. OR<BR>● Discard 1 random card from your opponent's hand.
et: Kui lahingus hävitatakse koletis, mida sa kontrollid ja mis on selle kaardiga varustatud, ning see kaart saadetakse Hauakambrisse, saad teha ühte järgmistest:<BR>● Tõmba 1 kaart. VÕI<BR>● Viska vastase käest juhuslikult 1 kaart ära.

source: Flint
et: Ränikivi

source: A monster equipped with this card loses 300 ATK and cannot change its Battle Position or attack. If the equipped monster is destroyed, select 1 monster on the field and equip this card to that monster.
et: Koletis, millele see kaart on varustatud, kaotab 300 ATK ja ei saa muuta oma lahingupositsiooni ega rünnata. Kui varustatud koletis hävitatakse, vali 1 koletis väljal ja varusta see kaart sellele koletisele.

source: While a face-up "<M6018>Mokey Mokey<M>" is on your side of the field, if a Fairy-Type monster on your side of the field is destroyed, the ATK of all "<M6018>Mokey Mokey<M>" on your side of the field becomes 3000 until the end of this turn.
et: Kui sinu väljaku poolel on avatud "<M6018>Mokey Mokey<M>", siis kui sinu väljaku poolel hävitatakse haldjatüüpi koletis, muutub kõigi sinu väljaku poolel olevate "<M6018>Mokey Mokey<M>" rünnakupunktid 3000-ni kuni selle käigu lõpuni.

source: Back to Square One
et: Tagasi algusesse

source: Discard 1 card from your hand. Return 1 monster on the field to the top of the owner's Deck.
et: Viska 1 kaart oma käest. Tagasta 1 koletis väljal omaniku paki tippu.

source: Monster Reincarnation
et: Koletise taassünd

source: Discard 1 card to select 1 Monster Card in your Graveyard, and add it to your hand.
et: Viska 1 kaart, et valida 1 Koletisekaart oma Hauakambris ja lisa see oma kätte.

source: Ballista of Rampart Smashing
et: Rinnakaitse Ballista

source: If the equipped monster attacks a face-down Defense Position monster, it gains 1500 ATK during damage calculation only.
et: Kui varustatud koletis ründab tagurpidi kaitseasendis koletist, saab see ainult kahju arvutamise ajal 1500 ATK juurde.

source: Lighten the Load
et: Kergenda koormat

source: Once per turn, you can add 1 Level 7 or higher monster from your hand to your Deck and shuffle it, then draw 1 card.
et: Korra ühe korra käigu jooksul saad lisada ühe 7. või kõrgema taseme koletise oma käest oma pakki ja segada see, seejärel tõmmata ühe kaardi.

source: Malice Dispersion
et: Pahatahtlik hajumine

source: Discard 1 card from your hand. Destroy all face-up Continuous Trap Cards.
et: Viska 1 kaart oma käest. Hävita kõik avatud Pidevad Lõksukaardid.

source: Divine Wrath
et: Jumalik Viha

source: Discard 1 card to negate the activation of an Effect Monster's effect, and destroy that Effect Monster.
et: Viska 1 kaart, et tühistada Efektikoletise efekti aktiveerimine ja hävitada see Efektikoletis.

source: Activate by selecting 2 Set Spell or Trap Cards on the field. The selected Spell or Trap Cards cannot be activated.
et: Aktiveeri, valides väljal 2 seatud loitsu- või lõksukaarti. Valitud loitsu- või lõksukaarte ei saa aktiveerida.

source: Rare Metalmorph
et: Haruldane Metalmorf

source: Select 1 face-up Machine-Type monster. It gains 500 ATK. One time only, negate the effect of a Spell Card that targets that monster. When the selected monster is removed from the field, destroy this card.
et: Vali 1 avatud Masina-tüüpi koletis. See saab 500 ATK juurde. Üks kord ainult, tühista selle koletise sihtiva Loitsukaardi efekt. Kui valitud koletis eemaldatakse väljakult, hävita see kaart.

source: Fruits of Kozaky's Studies
et: Kozaky uuringute viljad

source: Look at the top 3 cards of your Deck and return those cards to the top of the Deck in any order.
et: Vaata oma paki kolme ülemist kaarti ja pane need kaardid paki peale tagasi suvalises järjekorras.

source: Mind Haxorz
et: Meelte Haxorz

source: Pay 500 Life Points. Look at your opponent's hand and all Set cards on their side of the field.
et: Maksa 500 Elupunkti. Vaata oma vastase kätt ja kõiki tema poolel väljal olevaid seatud kaarte.

source: You can only activate this card when there are at least 1 monster each of WIND, WATER, FIRE and EARTH Attributes face-up on the field. Select and apply 1 of these effects:<BR>● Destroy all monsters on your opponent's side of the field.<BR>● Destroy all Spell and Trap Cards on your opponent's side of the field.<BR>● Randomly discard 2 cards from your opponent's hand.<BR>● Draw 2 cards.
et: Seda kaarti saab aktiveerida ainult siis, kui väljakul on vähemalt 1 tuule, vee, tule ja maa atribuudi koletis avatud. Vali ja rakenda üks järgmistest efektidest:<BR>● Hävita kõik koletised vastase väljakupoolel.<BR>● Hävita kõik loitsu- ja lõksukaardid vastase väljakupoolel.<BR>● Viska juhuslikult 2 kaarti vastase käest ära.<BR>● Tõmba 2 kaarti.

source: Chain Burst
et: Ahelaplahvatus

source: Each time a player activates a Trap Card, they take 1000 damage immediately after it resolves.
et: Iga kord, kui mängija aktiveerib Lõksukaardi, saavad nad 1000 kahju kohe pärast selle lahendamist.

source: Pikeru's Circle of Enchantment
et: Pikeru võluring

source: Damage to you from card effects becomes 0 until the end of this turn.
et: Kaardiefektidest saadav kahju muutub selle käigu lõpuni 0-ks.

source: Spell Purification
et: Loitsu puhastamine

source: Discard 1 card from your hand. Destroy all face-up Continuous Spell Cards.
et: Viska 1 kaart oma käest. Hävita kõik avatud Pidevad Loitsukaardid.

source: Astral Barrier
et: Astralbarjäär

source: If your opponent's monster attacks a monster on your side of the field, you can make the attack a direct attack.
et: Kui sinu vastase koletis ründab sinu väljaku koletist, saad muuta rünnaku otseseks rünnakuks.

source: Covering Fire
et: Kaitsetuli

source: If your opponent's monster attacks a monster on your side of the field, you can activate this card during the Damage Step. Your attacked monster gains ATK equal to the ATK of 1 other face-up monster on your side of the field during the Damage Step only.
et: Kui sinu vastase koletis ründab sinu väljaku koletist, saad selle kaardi aktiveerida Kahjustuse Etapis. Sinu rünnatud koletis saab ATK-d, mis on võrdne ühe teise sinu väljaku avatud koletise ATK-ga ainult Kahjustuse Etapis.

source: Castle Gate
et: Lossivärav

source: This card cannot be destroyed by battle. Once per turn, if this card is in face-up Attack Position, you can Tribute 1 Level 5 or lower monster to inflict damage to your opponent equal to that monster's original ATK.
et: Seda kaarti ei saa lahingus hävitada. Kord ühe käigu jooksul, kui see kaart on avatud ründeasendis, võid ohverdada ühe 5. taseme või madalama koletise, et tekitada oma vastasele kahju, mis on võrdne selle koletise algse rünnakujõuga.

source: Owner's Seal
et: Omaniku Pitser

source: Return control of all monsters on the field to their original owners.
et: Tagasta kõigi väljakul olevate koletiste kontroll nende algsetele omanikele.

source: Space Mambo
et: Kosmose Mambo

source: A Space Mambo floating in the vast universe. This living relic was found in the ruins of a super civilization on Alphard 4.
et: Kosmoses hõljuv Kosmose Mambo. See elav reliikvia leiti Alphard 4 supertsivilisatsiooni varemetest.

source: Divine Dragon Ragnarok
et: Jumalik Draakon Ragnarok

source: A legendary dragon sent by the gods as their instrument. Legends say that if provoked, the whole world will sink beneath the sea.
et: Legendaarne draakon, mille jumalad saatsid oma instrumendina. Legendide järgi vajub kogu maailm mere alla, kui teda provotseerida.

source: Chu-Ske the Mouse Fighter
et: Hiirevõitleja Chu-Ske

source: A fiery mouse, travelling the world to become the strongest fighter in the world of mice. Be careful not to touch him, or you will get burned.
et: Tuline hiir, kes rändab maailmas, et saada kõige tugevamaks võitlejaks hiirte maailmas. Ole ettevaatlik, et teda mitte puudutada, muidu saad põletada.

source: Insect Knight
et: Putukrüütel

source: Of all Insect fighters, he is the paragon of the Indestructible Insect Invaders, which only the elite of the elite can join. We can no longer ignore their unmatched battle prowess.
et: Kõigist putukavõitlejatest on ta Hävimatute Putukate Sissetungijate eeskuju, kuhu saavad kuuluda vaid eliidi eliit. Me ei saa enam ignoreerida nende ületamatut lahinguvõimekust.

source: Sacred Phoenix of Nephthys
et: Nephthyse Püha Fööniks

source: If this card is destroyed by a card effect, Special Summon this card from the Graveyard during your next Standby Phase. If you Special Summon this card in this way, destroy all Spell and Trap Cards on the field.
et: Kui see kaart hävitatakse kaardi efekti tõttu, kutsu see kaart järgmisel Ootefaasil Hauakambrist eriliselt välja. Kui sa kutsud selle kaardi sel viisil eriliselt välja, hävita kõik Väljal olevad Loitsu- ja Lõksukaardid.

source: Hand of Nephthys
et: Nephthyse käsi

source: You can Tribute this card and 1 other monster to Special Summon 1 "Sacred Phoenix of Nephthys" from your hand or Deck.
et: Saad selle kaardi ja 1 teise koletise ohverdada, et Kutsuda Eriliselt 1 "Nephthyse Püha Fööniks" oma käest või pakist.

source: Ultimate Insect LV5
et: Ülim Putukas LV5

source: If this card was Special Summoned by the effect of "Ultimate Insect LV3", while it remains on the field all of your opponent's monsters lose 500 ATK. During your Standby Phase, by sending this face-up card to the Graveyard, Special Summon 1 "Ultimate Insect LV7" from your hand or Deck. (You cannot activate this effect the turn this card is Normal Summoned, Special Summoned, or flipped face-up.)
et: Kui see kaart kutsuti eriliselt välja "Ultimate Insect LV3" efekti abil, kaotavad kõik sinu vastase koletised 500 ATK, kuni see kaart jääb väljakule. Sinu ooteetapi ajal, saates selle avatud kaardi Hauakambrisse, kutsu eriliselt välja 1 "Ultimate Insect LV7" oma käest või pakist. (Sa ei saa seda efekti aktiveerida sellel käigul, kui see kaart kutsuti tavaliselt välja, eriliselt välja või pöörati avatud asendisse.)

source: Granmarg the Rock Monarch
et: Granmarg, Kivimonarh

source: When this card is Tribute Summoned, destroy 1 face-down card on the field.
et: Kui see kaart on ohverdamisega välja kutsutud, hävita 1 laual olev tagurpidi kaart.

source: Element Valkyrie
et: Elementaalne Valküür

source: This monster gets the following effect(s) while there is a monster(s) with the following Attribute(s) on the field:<BR>● FIRE: This card gains 500 ATK.<BR>● WATER: Control of this card cannot switch.
et: See koletis saab järgmise(d) efekti(d), kui väljakul on järgmise(te) atribuudi(te)ga koletis(ed):<BR>● TULI: See kaart saab 500 ATK juurde.<BR>● VESI: Selle kaardi kontrolli ei saa vahetada.

source: Element Doom
et: Elementaallik

source: This monster gets the following effect(s) while there is a monster(s) with the following Attribute(s) on the field:<BR>● EARTH: Negate the effect of an Effect Monster that this card destroyed by battle.<BR>● WIND: If this card destroyed your opponent's monster by battle, it can attack once again in a row.
et: See koletis saab järgmise(d) efekti(d), kui väljakul on järgmise(te) atribuudi(te)ga koletis(ed):<BR>● MAA: Tühista Efektkoletise efekt, mille see kaart lahingus hävitas.<BR>● TUUL: Kui see kaart hävitas lahingus sinu vastase koletise, võib see rünnata veel kord järjest.

source: Each time a Beast-Type monster(s) on the field is destroyed, this card gains 500 ATK.
et: Iga kord, kui väljal hävitatakse Beast-tüüpi koletis(ed), saab see kaart 500 ATK juurde.

source: Catnipped Kitty
et: Uinutatud Kiisu

source: This card cannot be attacked if there is another Beast-Type monster on your side of the field. Once per turn, you can make the DEF of 1 monster on your opponent's side of the field 0 until the end of this turn.
et: Kui sinu väljakul on veel üks Beast-tüüpi koletis, ei saa seda kaarti rünnata. Kord ühe käigu jooksul saad muuta ühe vastase väljakul oleva koletise DEF-i 0-ks kuni käigu lõpuni.

source: Behemoth the King of All Animals
et: Behemoth, Kõigi Loomade Kuningas

source: This card can be Normal Summoned or Set with 1 Tribute. In that case, the original ATK of this card becomes 2000. When this card is Tribute Summoned, you can return from your Graveyard to the owner's hand a number of Beast-Type monsters equal to the number of Tributed monsters.
et: Seda kaarti saab normaalset kutsuda või asetada ühe ohverdusega. Sel juhul muutub selle kaardi algne rünnak 2000-ks. Kui see kaart on ohverdusega kutsutud, saate oma hauast omaniku kätte tagasi tuua sama arvu metsalist tüüpi koletisi, kui palju oli ohverdatud koletisi.

source: Big-Tusked Mammoth
et: Suurekihvaline mammut

source: Monsters on your opponent's side of the field cannot attack during the same turn that they are Normal Summoned, Flip Summoned, or Special Summoned.
et: Koletised, mis on sinu vastase väljaku poolel, ei saa rünnata samal käigul, mil nad on Normaal-Kutsutud, Pööratud-Kutsutud või Eriliselt Kutsutud.

source: Kangaroo Champ
et: Känguru Meistrivõistlused

source: A monster that battles with this card is changed to Defense Position after damage calculation.
et: Koletis, mis selle kaardiga võitleb, muudetakse pärast kahju arvutamist kaitsepositsiooni.

source: Hyena
et: Hüään

source: When this card is sent to the Graveyard by battle, you can Special Summon any "Hyena"(s) from your Deck. Then shuffle your Deck.
et: Kui see kaart saadetakse lahingus Hauakambrisse, saad oma pakist eriliselt kutsuda ükskõik millise "Hüään"(id). Seejärel sega oma pakk.

source: Blade Rabbit
et: Terajänes

source: When this card is changed from Attack Position to face-up Defense Position, destroy 1 monster on your opponent's side of the field.
et: Kui see kaart muudetakse rünnakupositsioonist avatud kaitsepositsiooniks, hävita 1 koletis oma vastase väljaku poolel.

source: Mecha-Dog Marron
et: Mecha-Koer Marron

source: When this card is destroyed by battle and sent to the Graveyard, inflict 1000 damage to both players. When this card on the field is destroyed and sent to the Graveyard except by battle, inflict 1000 damage to your opponent.
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse, põhjusta mõlemale mängijale 1000 kahju. Kui see kaart väljakul hävitatakse ja saadetakse Hauakambrisse, välja arvatud lahingus, põhjusta oma vastasele 1000 kahju.

source: Blast Magician
et: Plahvatusmaag

source: Each time a Spell Card is activated, place 1 Spell Counter on this card. You can remove any number of Spell Counters from this card to destroy 1 face-up monster on the field with ATK equal to or less than 700 x the number of counters you removed.
et: Iga kord, kui aktiveeritakse Võlukaar, aseta sellele kaardile 1 võluloendur. Sa võid eemaldada sellelt kaardilt suvalise arvu võluloendureid, et hävitada 1 avatud koletis väljal, mille ATK on võrdne või väiksem kui 700 x eemaldatud loendurite arv.

source: Gearfried the Swordmaster
et: Mõõgameister Gearfried

source: This card cannot be Normal Summoned or Set. This card cannot be Special Summoned except by the effect of "Release Restraint". When this card is equipped with an Equip Card, destroy 1 monster on your opponent's side of the field.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti ei saa eriliselt kutsuda, välja arvatud "Release Restraint" efekti abil. Kui see kaart on varustatud varustuskaardiga, hävita 1 koletis oma vastase väljaku poolel.

source: Armed Samurai - Ben Kei
et: Relvastatud samurai - Ben Kei

source: In addition to a normal attack, this card can attack during the same Battle Phase as many times as the number of Equip Cards equipped to it.
et: Lisaks tavarünnakule võib see kaart rünnata sama Lahingu Faasi jooksul nii mitu korda, kui palju Varustuskaarte sellele on varustatud.

source: Shadowslayer
et: Varjude Tapja

source: If all monsters your opponent controls are in Defense Position, this card can attack your opponent directly.
et: Kui kõik sinu vastase kontrollitavad koletised on kaitsepositsioonis, võib see kaart rünnata sinu vastast otse.

source: Golem Sentry
et: Golemi valvur

source: Once per turn, you can flip this card into face-down Defense Position. When this card is Flip Summoned, return 1 monster on your opponent's side of the field to the owner's hand.
et: Korra ühe korra käigu jooksul saad selle kaardi pöörata näoga allapoole kaitsepositsiooni. Kui see kaart on ümber pööratud, tagasta 1 koletis vastase väljalt omaniku kätte.

source: Once per turn, you can toss a coin and call it. If you call it right, inflict 1000 damage to your opponent. If you call it wrong, you take 1000 damage.
et: Korra ühe korra käigu jooksul saad visata münti ja nimetada külje. Kui nimetad õigesti, tekitad oma vastasele 1000 kahju. Kui nimetad valesti, saad ise 1000 kahju.

source: The Light - Hex-Sealed Fusion
et: Valgus - Heks-Pitseeritud Sulandumine

source: You can substitute this card for any 1 Fusion Material Monster. The other Fusion Material Monster(s) must be the correct one(s). By Tributing Fusion Material Monsters on the field, including this card, Special Summon 1 LIGHT Fusion Monster from your Fusion Deck.
et: Saate selle kaardi asendada ükskõik millise 1 Fusion Material Monsteriga. Teised Fusion Material Monster(id) peavad olema õiged. Ohverdades Fusion Material Monsterid väljakul, kaasa arvatud selle kaardi, kutsuge eriliselt välja 1 LIGHT Fusion Monster oma Fusion Deckist.

source: The Dark - Hex-Sealed Fusion
et: Pime - Kuusnurkne Pitseriga Sulandumine

source: You can substitute this card for any 1 Fusion Material Monster. The other Fusion Material Monster(s) must be the correct one(s). By Tributing Fusion Material Monsters on the field, including this card, Special Summon 1 DARK Fusion Monster from your Fusion Deck.
et: Saate asendada selle kaardi ükskõik millise Fusion Material Monsteriga. Teised Fusion Material Monsterid peavad olema õiged. Ohverdades Fusion Material Monsterid väljakul, sealhulgas selle kaardi, kutsuge eriliselt välja 1 DARK Fusion Monster oma Fusion Deckist.

source: The Earth - Hex-Sealed Fusion
et: Maa - Kuusnurkne Pitseriga Sulandumine

source: You can substitute this card for any 1 Fusion Material Monster. The other Fusion Material Monster(s) must be the correct one(s). By Tributing Fusion Material Monsters on the field, including this card, Special Summon 1 EARTH Fusion Monster from your Fusion Deck.
et: Saate selle kaardi asendada ükskõik millise 1 Fusion Material Monster'iga. Teised Fusion Material Monster'id peavad olema õiged. Ohverdades Fusion Material Monster'id väljakul, kaasa arvatud selle kaardi, kutsuge eriliselt välja 1 EARTH Fusion Monster oma Fusion Deck'ist.

source: Whirlwind Prodigy
et: Keeristormi Prodigy

source: When Tribute Summoning a WIND monster, you can treat this 1 monster as 2 Tributes.
et: Kui sa kutsud välja WIND koletise, võid seda ühte koletist käsitleda kui kahte ohverdust.

source: Flame Ruler
et: Leegivalitseja

source: This card is treated as 2 Tributes for the Tribute Summon of a FIRE monster
et: Seda kaarti käsitletakse kui 2 ohverdust FIRE koletise ohverdussummoniks

source: Firebird
et: Tulelind

source: Each time a Winged Beast-Type monster(s) on your side of the field is destroyed, this card gains 500 ATK.
et: Iga kord, kui sinu väljaku poolel hävitatakse Tiivulise Metssiga-tüüpi koletis(ed), saab see kaart 500 ATK juurde.

source: Rescue Cat
et: Päästekass

source: You can send this face-up card to the Graveyard to Special Summon 2 Level 3 or lower Beast-Type monsters from your Deck. Those monsters are destroyed during the End Phase.
et: Saad selle avatud kaardi Hauakambrisse, et Kutsuda Eriliselt 2 3. taseme või madalama Tüüpi Koletist oma Pakist. Need koletised hävitatakse Lõppfaasis.

source: Brain Jacker
et: Aju Röövija

source: FLIP: Equip this card to a monster on your opponent's side of the field and treat it as an Equip Card. Take control of the equipped monster. Your opponent gains 500 Life Points during each of their Standby Phases.
et: FLIP: Pane see kaart vastase poolel olevale koletisele ja käsitle seda kui Varustuskaarti. Võta kontroll varustatud koletise üle. Sinu vastane saab iga oma Ootefaasiga 500 Elupunkti juurde.

source: Gatling Dragon
et: Gatling Draak

source: "<M4749>Barrel Dragon<M>" + "<M5964>Blowback Dragon<M>"<BR>Once per turn, you can toss a coin 3 times. Destroy a number of monsters on the field equal to the number of Heads.
et: "<M4749>Barrel Dragon<M>" + "<M5964>Blowback Dragon<M>"<BR>Korra ühe korra käigu jooksul võid visata münti 3 korda. Hävita väljakul olevate koletiste arv, mis on võrdne saadud kullide arvuga.

source: King Dragun
et: Kuningas Dragun
