Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: Once per turn, when a Machine-Type monster is destroyed by battle and sent to your Graveyard, you can Special Summon 1 Machine-Type monster with lower ATK and the same Attribute from your Deck.
et: Korra ühe korra käigu jooksul, kui Masinatüüpi koletis hävitatakse lahingus ja saadetakse sinu Hauakambrisse, saad sa oma Paki seest eriliselt kutsuda ühe Masinatüüpi koletise, millel on madalam ATK ja sama Atribuut.

source: Lion Alligator
et: Lõvi Alligaator

source: While you control another Reptile-Type monster, if a Reptile-Type monster you control attacks a Defense Position monster, inflict piercing Battle Damage to your opponent.
et: Kui sa kontrollid teist Reptiil-tüüpi koletist, siis kui sinu kontrollitav Reptiil-tüüpi koletis ründab Kaitseasendis koletist, põhjusta vastasele läbistavat Lahingukahju.

source: Transforming Sphere
et: Transformeeruv Kera

source: Once per turn: You can target 1 face-up Defense Position monster your opponent controls; discard 1 card and equip that target to this card. (You can only equip 1 monster at a time to this card with this effect.) This card gains the ATK of the equipped monster. If this card attacks, it is changed to Defense Position at the end of the Battle Phase. During the End Phase: The monster equipped to this card by this card's effect is Special Summoned to your opponent's side of the field in face-up Defense Position.
et: Kord päevas: Sa võid valida 1 vastase kontrollitava avatud kaitseasendis koletise; viska 1 kaart ja kinnita see sihtmärk sellele kaardile. (Sa saad selle efektiga kinnitada sellele kaardile korraga ainult 1 koletise.) See kaart saab kinnitatud koletise rünnakupunktid. Kui see kaart ründab, muudetakse see lahingufaasi lõpus kaitseasendisse. Lõppfaasi ajal: Selle kaardi efektiga sellele kaardile kinnitatud koletis kutsutakse eriliselt vastase väljale avatud kaitseasendis.

source: Spawn Alligator
et: Kudem Alligaator

source: During the End Phase of the turn this card was Tribute Summoned by Tributing a Reptile-Type monster: Target 1 monster that was used for the Tribute Summon of this card; Special Summon it from the Graveyard.
et: Selle kaardi ohverdamisega kutsumise käigus ohverdatud Reptiili-tüüpi koletise käigu lõppfaasis: Sihtige 1 koletis, mida kasutati selle kaardi ohverdamisega kutsumiseks; Kutsuge see Hauakambrist eriliselt välja.

source: If you control a face-up "Flamvell" monster, except "<M8703>Neo Flamvell Origin<M>", and your opponent has 3 or less cards in their Graveyard, you can Special Summon this card from your hand.
et: Kui sa kontrollid avatud "Flamvell" koletist, välja arvatud "<M8703>Neo Flamvell Origin<M>", ja sinu vastasel on nende Hauas 3 või vähem kaarte, saad selle kaardi oma käest eriliselt kutsuda.

source: Neo Flamvell Hedgehog
et: Neo Flamvell Siil

source: If this card is destroyed by battle, select 1 card in your opponent's Graveyard and remove it from play. If this card on the field is destroyed by a card effect, select 1 FIRE monster with 200 or less DEF in your Graveyard, except "<M8704>Neo Flamvell Hedgehog<M>", and add it to your hand.
et: Kui see kaart hävitatakse lahingus, vali 1 kaart oma vastase kalmistul ja eemalda see mängust. Kui see kaart väljal hävitatakse kaardi efekti tõttu, vali 1 TULEMONSTER, mille DEF on 200 või vähem, oma kalmistul, välja arvatud "<M8704>Neo Flamvell Hedgehog<M>", ja lisa see oma kätte.

source: Neo Flamvell Shaman
et: Neo Flamvell'i Šamaan

source: If this card destroys an opponent's monster by battle while there are 3 or more "Flamvell" monsters in your Graveyard, select 1 card in your opponent's Graveyard, and remove it from play. If your opponent has no Spell Cards in their Graveyard when this effect activates, inflict 500 damage to your opponent.
et: Kui see kaart hävitab lahingus vastase koletise, kui sinu Hauakambris on 3 või rohkem "Flamvell" koletist, vali 1 kaart vastase Hauakambrist ja eemalda see mängust. Kui selle efekti aktiveerimisel ei ole vastasel ühtegi Loitsukaarti Hauakambris, põhjusta vastasele 500 kahju.

source: During your End Phase, if you control another face-up "Flamvell" monster, remove from play 1 card in your opponent's Graveyard.
et: Oma lõpuetapi ajal, kui sul on kontrolli all teine avatud "Flamvell" koletis, eemalda mängust 1 kaart oma vastase kalmistult.

source: While there are 4 or less cards in your opponent's Graveyard, this card gains 600 ATK. While there are 8 or more cards in your opponent's Graveyard, this card loses 300 ATK.
et: Kui sinu vastase hauakambris on 4 või vähem kaarte, saab see kaart 600 ATK juurde. Kui sinu vastase hauakambris on 8 või rohkem kaarte, kaotab see kaart 300 ATK.

source: Genex Ally Chemistrer
et: Genexi liitlane Keemik

source: During either player's turn, you can discard this card and declare 1 Attribute to select 1 face-up "Genex" monster you control. That monster's Attribute becomes the declared Attribute.
et: Oma või vastase käigu ajal saad selle kaardi ära visata ja valida 1 atribuudi, et valida 1 avatud "Genex" koletis, mida sa kontrollid. Selle koletise atribuut muutub valitud atribuudiks.

source: Genex Ally Birdman
et: Genexi liitlane Linnumees

source: You can return 1 face-up monster you control to the hand to Special Summon this card from your hand, and this card gains 500 ATK if it was a WIND monster you returned. If this card is Special Summoned with this effect, remove it from play when it is removed from the field.
et: Sa saad ühe enda kontrollitava avatud koletise käesolevasse kätte tagasi saata, et see kaart oma käest eriliselt kutsuda, ja see kaart saab 500 ATK, kui saatsid tagasi TUULE koletise. Kui see kaart kutsutakse selle efektiga eriliselt, eemalda see mängust, kui see väljakult eemaldatakse.

source: Genex Ally Bellflame
et: Genexi liitlane Bellflame

source: Each time a monster(s) you control is sent to the Graveyard, place 1 Genex Counter on this card. Each time a card(s) in your opponent's Graveyard is removed from play, place 2 Genex Counters on this card. This card gains 100 ATK for each Genex Counter on the field. When this card is destroyed by battle and sent to the Graveyard, inflict 300 damage to your opponent for each Genex Counter on this card.
et: Iga kord, kui sinu kontrollitav koletis(ed) saadetakse Hauakambrisse, aseta sellele kaardile 1 Genexi loendur. Iga kord, kui sinu vastase Hauakambrist eemaldatakse mängust kaart(e), aseta sellele kaardile 2 Genexi loendurit. See kaart saab 100 ATK-d iga Genexi loenduri eest, mis on väljakul. Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse, põhjusta oma vastasele 300 kahju iga Genexi loenduri eest, mis on sellel kaardil.

source: Genex Ally Crusher
et: Genexi Liitlane Purustaja

source: Once per turn, when you Normal Summon a monster with this card's Attribute, you can select and destroy 1 card your opponent controls.
et: Korra ühe korra käigu jooksul, kui sa kutsud normaalset summoni selle kaardi atribuudi koletisega, saad valida ja hävitada ühe kaardi, mida su vastane kontrollib.

source: Genex Ally Reliever
et: Genexi liitlane Leevendaja

source: If you negate the activation of a Spell Card, Trap Card, or Effect Monster's effect activated by your opponent, you can Special Summon this card from your hand.
et: Kui tühistad vastase aktiveeritud Võlukaardi, Lõksukaardi või Efektkoletise efekti aktiveerimise, saad selle kaardi oma käest eriliselt välja kutsuda.

source: The Fabled Peggulsus
et: Muinasjutt Peggulsus

source: When this card is discarded to the Graveyard, you can Set this card in face-down Defense Position. When this card is flipped face-up, you can reveal 1 "Fabled" monster in your hand and send 1 "Fabled" monster from your Deck to the Graveyard.
et: Kui see kaart saadetakse Hauakambrisse, võid selle kaardi asetada näoga allapoole kaitsepositsiooni. Kui see kaart pööratakse näoga ülespoole, võid paljastada ühe "Fabled" koletise oma käes ja saata ühe "Fabled" koletise oma pakist Hauakambrisse.

source: The Fabled Kokkator
et: Muinasjutt Kokkator

source: When this card destroys an opponent's monster by battle and sends it to the Graveyard, you can discard 1 "Fabled" monster to the Graveyard to draw 1 card.
et: Kui see kaart hävitab lahingus vastase koletise ja saadab selle Hauakambrisse, võid saata 1 "Fabled" koletise Hauakambrisse, et tõmmata 1 kaart.

source: Fabled Dianaira
et: Muinasjutuline Dianaira

source: You can Tribute 1 "Fabled" monster to Tribute Summon this card in face-up Attack Position. Once per turn, when your opponent activates a Normal Spell Card, its effect become "Your opponent selects and discards 1 card from their hand".
et: Saad selle kaardi avatud ründeasendis ohverdussummonida, ohverdades 1 "Fabled" koletise. Kord kordaja jooksul, kui sinu vastane aktiveerib tavalise loitsukaardi, muutub selle efektiks "Sinu vastane valib ja viskab oma käest 1 kaardi ära".

source: While this card is equipped as an Equip Card to a monster, if the equipped monster destroys an opponent's monster by battle, you can add 1 Level 4 or lower monster with the same Type and Attribute as the equipped monster from your Deck to your hand.
et: Kui see kaart on varustuskaardina koletisele kinnitatud, siis kui varustatud koletis hävitab lahingus vastase koletise, saad lisada oma pakist oma kätte ühe 4. taseme või madalama koletise, millel on sama tüüp ja omadus kui varustatud koletisel.

source: When this card is Normal Summoned, you can Special Summon 1 Winged Beast-Type "Dragunity" monster from your hand and equip this card to it as an Equip Card. If this card is equipped as an Equip Card to a monster, the equipped monster is treated as a Tuner monster.
et: Kui see kaart on Normaal-Kutsutud, saad Erilis-Kutsuda 1 Tiivulise Eluka-tüüpi "Dragunity" koletise oma käest ja kinnitada selle kaardi sellele Varustuskaardina. Kui see kaart on kinnitatud Varustuskaardina koletisele, käsitletakse varustatud koletist kui Häälestaja koletist.

source: When this card is Normal Summoned, you can Special Summon 1 Winged Beast-Type "Dragunity" monster from your hand and equip this card to it as an Equip Card. If this card is equipped as an Equip Card to a monster, the equipped monster can attack your opponent directly. If it attacks using this effect, the Battle Damage it inflicts to your opponent is halved.
et: Kui see kaart on Normaal-Kutsutud, saad Sa Eriliselt Kutsuda 1 Tiivulise Metssiga tüüpi "Dragunity" koletise oma käest ja kinnitada selle kaardi sellele Varustuskaardina. Kui see kaart on kinnitatud Varustuskaardina koletisele, saab varustatud koletis rünnata otse sinu vastast. Kui see ründab kasutades seda efekti, on lahingukahju, mida see sinu vastasele tekitab, poole väiksem.

source: If this card is equipped with a Dragon-Type "Dragunity" monster, during battle between this attacking card and a Defense Position monster whose DEF is lower than the ATK of this card, inflict the difference as Battle Damage to your opponent.
et: Kui see kaart on varustatud Draakoni-tüüpi "Dragunity" koletisega, siis lahingu ajal selle ründava kaardi ja Kaitseasendis oleva koletise vahel, mille DEF on madalam kui selle kaardi ATK, põhjusta vahe oma vastasele Lahingukahjuna.

source: Naturia Stinkbug
et: Naturia Haisevaks

source: When a face-up "Naturia" monster you control is selected as an attack target, you can send this face-up card you control to the Graveyard to negate that attack and end the Battle Phase.
et: Kui sinu juhitav avatud "Naturia" koletis valitakse rünnaku sihtmärgiks, saad saata selle sinu juhitava avatud kaardi Hauakambrisse, et see rünnak tühistada ja Lõppfaas lõpetada.

source: When your opponent Normal Summons a monster, you can send 1 "Naturia" monster from your hand to the Graveyard to destroy that monster.
et: Kui su vastane kutsub normaalselt välja koletise, saad saata 1 "Naturia" koletise oma käest hauakambrisse, et see koletis hävitada.

source: Naturia Ragweed
et: Naturia Ristirohi

source: When your opponent draws a card(s) outside of their Draw Phase, you can send this card from the field to the Graveyard to draw 2 cards.
et: Kui sinu vastane tõmbab kaardi(d) väljaspool nende tõmbamisfaasi, saad saata selle kaardi väljakult hauakambrisse, et tõmmata 2 kaarti.

source: Naturia White Oak
et: Naturia Valge Tamm

source: When this face-up card is targeted by an opponent's card effect, you can send this card to the Graveyard to Special Summon 2 Level 4 or lower "Naturia" monsters from your Deck. Those monsters cannot declare an attack, and are destroyed during your End Phase.
et: Kui see avatud kaart on vastase kaardi efekti sihtmärk, võid saata selle kaardi Hauakambrisse, et Kutsuda Eriliselt 2 4. taseme või madalama "Naturia" koletist oma Pakist. Need koletised ei saa rünnakut kuulutada ja hävitatakse sinu Lõppfaasis.

source: Strategist of the Ice Barrier
et: Jääbarjääri strateeg

source: Once per turn, you can send 1 "Ice Barrier" monster from your hand to the Graveyard to draw 1 card.
et: Korra ühe käigu jooksul võid saata 1 "Jääbarjääri" koletis oma käest Hauakambrisse, et tõmmata 1 kaart.

source: Secret Guards of the Ice Barrier
et: Jääbarjääri salajased valvurid

source: Face-up "Ice Barrier" monsters you control cannot be targeted by the effects of your opponent's Effect Monsters.
et: Avatud "Jääbarjääri" koletisi, mida sa kontrollid, ei saa sihtida sinu vastase Efektikoletiste efektidega.

source: General Gantala of the Ice Barrier
et: Jääbarjääri kindral Gantala

source: Once per turn, during your End Phase, you can select and Special Summon 1 "Ice Barrier" monster from your Graveyard, except "<M8726>General Gantala of the Ice Barrier<M>".
et: Korra ühe korra oma lõppfaasis saad valida ja eriliselt kutsuda 1 "Jääbarjääri" koletise oma kalmistult, välja arvatud "<M8726>Jääbarjääri kindral Gantala<M>".

source: "<M7969>Naturia Beast<M>" + "<M8260>Naturia Barkion<M>"<BR>A Fusion Summon of this card can only be conducted with the above Fusion Material Monsters. While this card is face-up on the field, you can negate the activation of a Spell/Trap Card, and destroy it, by removing from play 1 card from your Graveyard, then sending the top card of your Deck to the Graveyard.
et: "<M7969>Naturia Põder<M>" + "<M8260>Naturia Barkion<M>"<BR>Selle kaardi sulandumise kutse saab toimuda ainult ülaltoodud sulandumismaterjalide koletistega. Kui see kaart on väljakul avatud, saate tühistada Loitsu/Lõksukaardi aktiveerimise ja selle hävitada, eemaldades mängust ühe kaardi oma Hauakambrist, seejärel saates oma Paki ülemise kaardi Hauakambrisse.

source: Ancient Flamvell Deity
et: Muistne Flamvelli Jumalus

source: 1 FIRE Tuner + 1 or more non-Tuner Pyro-Type monsters<BR>When this card is Synchro Summoned, remove from play cards from your opponent's Graveyard, up to the number of cards in their hand. This card gains 200 ATK for each card removed from play by this effect.
et: 1 TULE süüritaja + 1 või rohkem mitte-süüritaja Püro-tüüpi koletist<BR>Kui see kaart on Sünkro Kutsutud, eemalda mängust kaardid oma vastase Hauakambrist, kuni nende käes olevate kaartide arvuni. See kaart saab 200 ATK iga selle efekti abil mängust eemaldatud kaardi eest.

source: Genex Ally Triforce
et: Genexi liitlane Triforce

source: 1 "Genex" Tuner + 1 or more non-Tuner monsters<BR>This card's effect depends on the Attribute(s) of its non-Tuner Synchro Material Monsters.<BR>● EARTH: If this card attacks, your opponent cannot activate any Spell/Trap Cards until the end of the Damage Step.<BR>● FIRE: If this card destroys a monster by battle, inflict damage to your opponent equal to the ATK of the destroyed monster.<BR>● LIGHT: Once per turn, you can select 1 LIGHT monster in your Graveyard and Special Summon it in face-down Defense Position.
et: 1 "Genex" Tuner + 1 või rohkem mitte-Tuner koletist<BR>Selle kaardi efekt sõltub selle mitte-Tuner Sünkro Materjal Koletiste atribuudi(te)st.<BR>● MAA: Kui see kaart ründab, ei saa sinu vastane aktiveerida ühtegi Loitsu/Lõksu Kaarti kuni Kahjustuse Sammuni.<BR>● TULI: Kui see kaart hävitab lahingus koletise, tekita oma vastasele kahju, mis on võrdne hävitatud koletise rünnakuga.<BR>● VALGUS: Kord käigu jooksul saad valida 1 VALGUS koletise oma Hauakambris ja Kutsuda see eriliselt välja näoga all Kaitseasendisse.

source: The Fabled Kudabbi
et: Muinasjutt Kudabbi

source: 1 "Fabled" Tuner + 1 or more non-Tuner monsters<BR>This card gains the following effect based on the number of cards in your hand:<BR>● 0: This card cannot be destroyed by battle or card effects.<BR>● 3 or more: Destroy this card during the End Phase.
et: 1 "Fabled" Tuner + 1 või rohkem mitte-Tuner koletist<BR>See kaart saab järgmise efekti, sõltuvalt sinu käes olevate kaartide arvust:<BR>● 0: Seda kaarti ei saa hävitada lahingus ega kaardi efektidega.<BR>● 3 või rohkem: Hävita see kaart End Phase'i ajal.

source: Dragunity Knight - Barcha
et: Dragunity Rüütel - Barcha

source: 1 Dragon-Type Tuner + 1 or more non-Tuner Winged Beast-Type monsters<BR>When this card is Synchro Summoned, you can select any number of Dragon-Type "Dragunity" monsters in your Graveyard, and equip them to this card. This card gains 300 ATK for each "Dragunity" card equipped to this card.
et: 1 Draakoni-tüüpi Tuner + 1 või rohkem mitte-Tuner Tiivulise Olendi-tüüpi koletisi<BR>Kui see kaart on Sünkro Kutsutud, saad valida suvalise arvu Draakoni-tüüpi "Dragunity" koletisi oma Hauas ja kinnitada need sellele kaardile. See kaart saab 300 ATK iga "Dragunity" kaardi eest, mis on sellele kaardile kinnitatud.

source: Trishula, Dragon of the Ice Barrier
et: Trishula, Jääbarjääri Draakon

source: 1 Tuner + 2 or more non-Tuner monsters<BR>When this card is Synchro Summoned, you can activate this effect to remove from play up to one card each from your opponent's hand, field and Graveyard. (The card in the hand is chosen at random.)
et: 1 Tuner + 2 või rohkem mitte-Tuner koletist<BR>Kui see kaart on Sünkrosummonitud, saad aktiveerida selle efekti, et eemaldada mängust kuni üks kaart vastase käest, väljast ja Hauakambrist. (Käes olev kaart valitakse juhuslikult.)

source: The Tyrant Neptune
et: <translated Türaani Neptuun

source: This card cannot be Special Summoned. You can Tribute Summon this card by Tributing 1 monster. This card gains the total ATK and DEF of the monsters Tributed for its Tribute Summon. When this card is Tribute Summoned, select 1 of the Tributed Effect Monsters in the Graveyard. Treat this card's name as that monster's name, and this card gains the same effects as that monster.
et: Seda kaarti ei saa eriliselt kutsuda. Sa saad selle kaardi pakkuda ohverdades 1 koletise. See kaart saab ohverdatud koletiste kogu ATK ja DEF. Kui see kaart on ohverdatud, vali 1 ohverdatud efektikoletis hauakambris. Kohtle selle kaardi nime nagu selle koletise nime ja see kaart saab samad efektid nagu see koletis.

source: The Atmosphere
et: Atmosfäär

source: This card cannot be Normal Summoned or Set. This card can only be Special Summoned by removing from play 2 monsters you control and 1 monster from your Graveyard. Once per turn, you can select 1 face-up monster your opponent controls, and equip it to this card. (You can only equip 1 monster at a time to this card.) This card gains ATK and DEF equal to the respective ATK and DEF of the monster equipped to it by this effect.
et: Seda kaarti ei saa tavaliselt kutsuda ega asetada. Seda kaarti saab eriliselt kutsuda ainult eemaldades mängust 2 sinu kontrollitavat koletist ja 1 koletise sinu Hauakambrist. Kord käigu jooksul saad valida 1 vastase kontrollitava avatud koletise ja kinnitada selle sellele kaardile. (Sa saad kinnitada sellele kaardile korraga ainult 1 koletise.) See kaart saab ATK ja DEF võrdseks kinnitatud koletise vastava ATK ja DEF-iga, mis on saadud selle efekti kaudu.

source: Junk Blader
et: Rämpsu Mõõgamees

source: You can banish 1 "Junk" monster from your Graveyard to have this card gain 400 ATK until the End Phase.
et: Saad oma kalmistult eemaldada 1 "Junk" koletise, et see kaart saaks 400 ATK juurde kuni lõppfaasini.

source: Lightning Warrior
et: Välgusõdalane

source: 1 Tuner + 1 or more non-Tuner monsters<BR>When this card destroys an opponent's monster by battle and sends it to the Graveyard, inflict 300 damage to your opponent for each card in your opponent's hand.
et: 1 Tuner + 1 või rohkem mitte-Tuner koletist<BR>Kui see kaart hävitab lahingus vastase koletise ja saadab selle Hauakambrisse, tekitab see vastasele 300 kahju iga kaardi eest, mis on vastase käes.

source: Samurai Sword Baron
et: Samurai Mõõga Parun

source: Once per turn, you can select 1 Defense Position monster your opponent controls. Change it to face-up Attack Position.
et: Korra ühe korra käigu jooksul saad valida ühe kaitseasendis oleva koletise, mida sinu vastane kontrollib. Muuda see rünnakuasendisse.

source: Stygian Security
et: Stügia turvamees

source: When this card is destroyed by battle and sent to the Graveyard, Special Summon 1 Level 1 Fiend-Type monster from your Deck.
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse, kutsu eriliselt välja 1. taseme Deemon-tüüpi koletis oma pakist.

source: Stygian Sergeants
et: Stygia seersandid

source: 1 Fiend-Type Tuner + 1 or more non-Tuner monsters<BR>When this card destroys an opponent's monster by battle and sends it to the Graveyard, it can gain 800 ATK (until the end of the Battle Phase) and attack once again in a row.
et: 1 Deemonitüüpi Tuner + 1 või rohkem mitte-Tuner koletisi<BR>Kui see kaart hävitab lahingus vastase koletise ja saadab selle Hauakambrisse, võib see saada 800 ATK (kuni Lahingufaasi lõpuni) ja rünnata uuesti järjest.

source: Stygian Street Patrol
et: Stügia tänavapatrull

source: When this card destroys a monster by battle and sends it to the Graveyard; Inflict damage to your opponent equal to the Level of the destroyed monster in the Graveyard x 100. You can banish this card from your Graveyard; Special Summon 1 Fiend-Type monster with 2000 or less ATK from your hand.
et: Kui see kaart hävitab lahingus koletise ja saadab selle Hauakambrisse; Põhjusta oma vastasele kahju, mis on võrdne Hauakambris hävitatud koletise tasemega x 100. Sa saad selle kaardi oma Hauakambrist pagendada; Kutsu eriliselt välja 1 Deemon-tüüpi koletis, mille ATK on 2000 või vähem, oma käest.

source: Armored Bee
et: Soomustatud Mesilane

source: Once per turn, you can select 1 face-up monster your opponent controls and halve its ATK, until the End Phase.
et: Korra ühe käigu jooksul saad valida ühe vastase kontrollitava avatud koletise ja vähendada selle ATK-d poole võrra kuni lõppfaasini.

source: Poseidon Giant Beetle
et: Poseidoni hiidkärbes

source: If this card attacks a face-up Attack Position monster your opponent controls, and that monster is not destroyed by battle, this card can attack that same monster again in a row. This effect can only be used up to twice per turn.
et: Kui see kaart ründab vastase kontrollitavat avatud rünnakupositsioonis olevat koletist ja see koletis ei hävine lahingus, võib see kaart rünnata sama koletist uuesti järjest. Seda efekti saab kasutada ainult kuni kaks korda käigu jooksul.

source: Quick-Span Knight
et: Kiir-rüütel

source: If this card is used for a Synchro Summon and sent to the Graveyard, 1 face-up monster your opponent controls loses 500 ATK.
et: Kui seda kaarti kasutatakse Sünkrosummoniks ja saadetakse Hauakambrisse, kaotab 1 vastase kontrollitav avatud koletis 500 ATK.

source: When this card is destroyed by battle and sent to the Graveyard: You can Special Summon 1 Level 4 or lower "X-Saber" monster from your Deck.
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse: Sa võid eriliselt kutsuda 1. taseme või madalama "X-Saber" koletise oma pakist.

source: Alchemist of Black Spells)
et: Mustade loitsude alkeemik)
