Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: During your opponent's Battle Phase, if you control no monsters, you can remove from play this card from the Graveyard to select 1 Synchro Monster in your Graveyard, and Special Summon it. It is removed from play at the end of the Battle Phase.
et: Oma vastase lahingufaasis, kui sul ei ole kontrolli all ühtegi koletist, saad eemaldada selle kaardi oma hauast, et valida 1 Sünkro Koletis oma hauast ja kutsuda see eriliselt välja. See eemaldatakse mängust lahingufaasi lõpus.

source: Tanngrisnir of the Nordic Beasts
et: Põhjala metsaliste Tanngrisnir

source: When this card is destroyed by battle and sent to the Graveyard, Special Summon 2 "<M3973>Nordic Beast Token<M>"s (EARTH/Beast-Type/Level 3/ATK 0/DEF 0).
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse, kutsu eriliselt välja 2 "<M3973>Nordic Beast Token<M>"it (MAA/Beast-Tüüp/Tase 3/ATK 0/DEF 0).

source: Guldfaxe of the Nordic Beasts
et: Põhjamaade metsaliste Guldfaxe

source: If your opponent controls a Synchro Monster and you control no monsters, you can Special Summon this card from your hand.
et: Kui sinu vastasel on Sünkro Koletis ja sul ei ole ühtegi koletist, saad selle kaardi oma käest eriliselt välja kutsuda.

source: Garmr of the Nordic Beasts
et: Põhjala metsaliste Garmr

source: If this card battles with a Level 4 or lower monster, you can return that monster to the hand after damage calculation.
et: Kui see kaart võitleb 4. taseme või madalama koletisega, võid pärast kahju arvutamist selle koletise käele tagasi saata.

source: Tanngnjostr of the Nordic Beasts
et: Tanngnjostr Põhjala metsalistest

source: When a monster you control is destroyed by battle and sent to the Graveyard, you can Special Summon this card from your hand. Once per turn, when this Defense Position card is changed to face-up Attack Position, you can Special Summon 1 "Nordic Beast" monster from your Deck, except "<M9304>Tanngnjostr of the Nordic Beasts<M>".
et: Kui sinu kontrolli all olev koletis hävitatakse lahingus ja saadetakse Hauakambrisse, saad selle kaardi oma käest Eriliselt Kutsuda. Kord ühe käigu jooksul, kui see Kaitseasendis kaart muudetakse Nähtavaks Rünnakuasendiks, saad Eriliselt Kutsuda 1 "Põhjamaade Metshaldja" koletise oma Pakist, välja arvatud "<M9304>Põhjamaade Metshaldjate Tanngnjostr<M>".

source: Ljosalf of the Nordic Alfar
et: Põhjala Alfarite Ljosalf

source: When this card is Normal Summoned, you can select 1 face-up monster you control except this card. Special Summon 1 "Nordic" monster from your hand with a Level less than or equal the selected monster's level.
et: Kui see kaart on normaalvälja kutsutud, saad valida 1 avatud koletise, mida sa kontrollid, välja arvatud see kaart. Kutsu erivälja 1 "Nordic" koletis oma käest, mille tase on väiksem või võrdne valitud koletise tasemega.

source: Svartalf of the Nordic Alfar
et: Põhjala Alfarite Svartalf

source: When this card is Normal Summoned, you can select 1 "Nordic" monster in your Graveyard and add it to your hand.
et: Kui see kaart on Normaal-Kutsutud, saad valida 1 "Nordic" koletise oma Hauakambris ja lisada selle oma kätte.

source: Dverg of the Nordic Alfar
et: Dverg Põhjala Alfarist

source: During the turn this card is Normal Summoned, you can Normal Summon 1 "Nordic" in addition to your Normal Summon or Set. (You can only gain this effect once per turn.) When this face-up card on the field is sent to the Graveyard, select 1 "Nordic Relic" card in your Graveyard and add it to your hand.
et: Selle kaardi normaalsummonimise käigus saad lisaks oma normaalsummonile või asetamisele normaalsummonida 1 "Nordic" kaardi. (Seda efekti saab kasutada ainult üks kord käigu jooksul.) Kui see avatud kaart väljakul saadetakse hauakambrisse, vali 1 "Nordic Relic" kaart oma hauakambris ja lisa see oma kätte.

source: Valkyrie of the Nordic Ascendan
et: Põhjala Ülestõusmise Valküür

source: When this card is Normal Summoned, if your opponent controls a monster and you control no other cards, you can remove from play 2 "Nordic" monsters from your hand to Special Summon 2 "<M3974>Einherjar Token<M>"s (Warrior-Type/EARTH/Level 4/ATK 1000/DEF 1000) in face-up Defense Position.
et: Kui see kaart on Normaal-Kutsutud ja kui sinu vastane kontrollib koletist ning sul ei ole teisi kaarte, saad sa eemaldada mängust 2 "Nordic" koletist oma käest, et Erikutsuda 2 "<M3974>Einherjar Token<M>"it (Sõdalane-Tüüp/MAA/Tase 4/ATK 1000/DEF 1000) avatud Kaitseasendisse.

source: Mimir of the Nordic Ascendant
et: Põhjala Tõusja Mimir

source: Once per turn, at the start of your Standby Phase, if you control a face-up "Nordic" monster, you can send 1 Spell Card from your hand to the Graveyard to Special Summon this card from your Graveyard.
et: Korra ühe korra käigu jooksul, oma Ootefaaside alguses, kui sa kontrollid avatud "Nordic" koletist, saad saata ühe Loitsukaardi oma käest Hauakambrisse, et Kutsuda see kaart Hauakambrist Eriliselt välja.

source: Tyr of the Nordic Champions
et: Põhjala Meistrite Tyr

source: Your opponent cannot select a "Nordic" monster as an attack target, except "<M9310>Tyr of the Nordic Champions<M>". If there is no other face-up "Nordic" monster on the field, destroy this card.
et: Sinu vastane ei saa valida "Nordic" koletist rünnaku sihtmärgiks, välja arvatud "<M9310>Tyr of the Nordic Champions<M>". Kui väljakul ei ole teist avatud "Nordic" koletist, hävita see kaart.

source: Legendary Six Samurai - Kizan
et: Legendaarne Kuus Samuraid - Kizan

source: If you control a face-up "Six Samurai" monster other than "<M9311>Legendary Six Samurai - Kizan<M>", you can Special Summon this card from your hand. While you control 2 or more other face-up "Six Samurai" monsters, this card gains 300 ATK and DEF.
et: Kui sa kontrollid avatud "Kuue Samuraid" koletist peale "<M9311>Legendary Six Samurai - Kizan<M>", saad selle kaardi oma käest eriliselt kutsuda. Kui sa kontrollid 2 või enamat muud avatud "Kuue Samuraid" koletist, saab see kaart 300 ATK ja DEF juurde.

source: Legendary Six Samurai - Enishi
et: Legendaarne Kuus Samuraid - Enishi

source: During either player's turn, if you control another face-up "Six Samurai" monster with a different name, you can remove from play 2 "Six Samurai" monsters from your Graveyard to select 1 face-up monster on the field and return it to the hand. You can only use this effect once per turn. While you control 2 or more face-up "Six Samurai" monsters other than "<M9312>Legendary Six Samurai - Enishi<M>", this card gains 500 ATK and DEF.
et: Mõlema mängija käigu ajal, kui sa kontrollid teist avatud "Kuue Samuraid" koletist erineva nimega, saad sa eemaldada mängust 2 "Kuue Samuraid" koletist oma Hauakambrist, et valida 1 avatud koletis väljal ja tagastada see kätte. Sa saad seda efekti kasutada ainult üks kord käigu jooksul. Kui sa kontrollid 2 või enamat avatud "Kuue Samuraid" koletist peale "<M9312>Legendary Six Samurai - Enishi<M>", saab see kaart 500 ATK ja DEF juurde.

source: Legendary Six Samurai - Kageki
et: Legendaarne Kuus Samuraid - Kageki

source: When this card is Normal Summoned, you can Special Summon 1 Level 4 or lower "Six Samurai" monster from your hand. While you control another face-up "Six Samurai" monster with a different name, this card gains 1500 ATK.
et: Kui see kaart on Normaal-Summonitud, saad sa oma käest Special Summonida 1 Level 4 või madalama "Kuue Samuraid" koletise. Kui sa kontrollid teist näoga ülespoole "Kuue Samuraid" koletist erineva nimega, saab see kaart 1500 ATK juurde.

source: Legendary Six Samurai - Shinai
et: Legendaarne Kuus Samuraid - Shinai

source: If you control a face-up "<M9315>Legendary Six Samurai - Mizuho<M>", you can Special Summon this card from your hand. If this card is Tributed, select 1 "Six Samurai" monster in your Graveyard, and add it to your hand, except "<M9314>Legendary Six Samurai - Shinai<M>".
et: Kui sa kontrollid avatud "<M9315>Legendary Six Samurai - Mizuho<M>", saad selle kaardi oma käest eriliselt välja kutsuda. Kui see kaart on ohverdatud, vali 1 "Six Samurai" koletis oma hauakambris ja lisa see oma kätte, välja arvatud "<M9314>Legendary Six Samurai - Shinai<M>".

source: Legendary Six Samurai - Mizuho
et: Legendaarne Kuus Samuraid - Mizuho

source: If you control a face-up "<M9314>Legendary Six Samurai - Shinai<M>", you can Special Summon this card from your hand. Once per turn, you can Tribute another "Six Samurai" monster to select and destroy 1 card on the field.
et: Kui sa kontrollid avatud "<M9314>Legendary Six Samurai - Shinai<M>", saad selle kaardi oma käest eriliselt kutsuda. Kord ühe käigu jooksul saad ohverdada teise "Six Samurai" koletise, et valida ja hävitada 1 kaart väljal.

source: Kagemusha of the Six Samurai
et: Kuue Samuraid Kagemusha

source: When (exactly) 1 face-up "Six Samurai" monster you control is targeted by a Spell Card, Trap Card, Spell/Trap effect, or Effect Monster's effect, you can change the target to this face-up card on the field, instead.
et: Kui (täpselt) 1 avatud "Kuue Samuraid" koletis, mida sa kontrollid, on sihitud Loitsukaardi, Lõksukaardi, Loitsu/Lõksu efekti või Efektikoletise efekti poolt, saad sihtmärgi muuta selleks avatud kaardiks väljakul.

source: Shien's Squire
et: Shieni kannupoiss

source: If a "Six Samurai" monster you control battles, during damage calculation you can send this card from your hand to the Graveyard. That "Six Samurai" monster cannot be destroyed by battle during this turn.
et: Kui sinu kontrollitav "Kuue Samuraid" koletis võitleb, saad sa kahjuarvutuse ajal saata selle kaardi oma käest Hauakambrisse. See "Kuue Samuraid" koletis ei saa sellel käigul lahingus hävitatud.

source: Karakuri Watchdog mdl 313 "Saizan"
et: Karakuri Valvekoer mdl 313 "Saizan"

source: This card must attack if able. When this face-up card on the field is selected as an attack target, change its Battle Position. When you take Battle Damage from a battle involving this card, all face-up "Karakuri" monsters you control gain 800 ATK and DEF until the End Phase. While this card is in face-up Attack Position, it cannot be destroyed by battle.
et: See kaart peab ründama, kui võimalik. Kui see avatud kaart väljal valitakse rünnaku sihtmärgiks, muuda selle lahingupositsiooni. Kui sa saad lahingukahju lahingus, mis hõlmab seda kaarti, saavad kõik avatud "Karakuri" koletised, mida sa kontrollid, 800 ATK ja DEF kuni lõppfaasini. Kui see kaart on avatud rünnakupositsioonis, ei saa seda lahingus hävitada.

source: This card must attack if able. When this face-up card is selected as an attack target, change its battle position. When this card destroys an opponent's monster by battle and sends it to the Graveyard, select 1 Level 4 or lower "Karakuri" monster in your Graveyard, and Special Summon it in face-up Defense Position.
et: See kaart peab ründama, kui võimalik. Kui see avatud kaart valitakse rünnaku sihtmärgiks, muuda selle lahingupositsiooni. Kui see kaart hävitab lahingus vastase koletise ja saadab selle Hauakambrisse, vali 1. taseme 4 või madalama "Karakuri" koletis oma Hauakambris ja Kutsu see eriliselt avatud Kaitsepositsioonis välja.

source: Scrap Worm
et: <translated Roosteväät

source: This card can attack your opponent directly. If this card attacks, it is destroyed at the end of the Battle Phase. If this card is destroyed by the effect of a "Scrap" card and sent to the Graveyard, you can select 1 "Scrap" monster in your Graveyard, except "<M9320>Scrap Worm<M>", and add it to your hand.
et: See kaart võib rünnata sinu vastast otse. Kui see kaart ründab, hävitatakse see Lahingu Faasi lõpus. Kui see kaart hävitatakse "Scrap" kaardi efekti tõttu ja saadetakse Hauakambrisse, saad valida 1 "Scrap" koletise oma Hauakambris, välja arvatud "<M9320>Scrap Worm<M>", ja lisada selle oma kätte.

source: Scrap Shark
et: <translated Raibe Hai

source: When an Effect Monster's effect or a Spell Card, Trap Card is activated, destroy this face-up card on the field. If this card is destroyed by the effect of a "Scrap" card and sent to the Graveyard, you can send 1 "Scrap" monster from your Deck to the Graveyard.
et: Kui aktiveeritakse Efektikoletise efekt või Loitsukaart, Lõksukaart, hävita see avatud kaart väljal. Kui see kaart hävitatakse "Scrap" kaardi efekti tõttu ja saadetakse Hauakambrisse, võid saata 1 "Scrap" koletise oma Pakist Hauakambrisse.

source: When this card inflicts Battle Damage to your opponent by a direct attack, discard 1 random card from your opponent's hand
et: Kui see kaart tekitab sinu vastasele otsese rünnakuga lahingukahju, viska sinu vastase käest juhuslikult 1 kaart ära

source: Wattmole
et: Wattmutt

source: This card can attack twice during each Battle Phase. If this card attacks a face-down Defense Position monster, you can destroy that monster immediately with this card's effect without flipping it face-up or applying damage calculation.
et: See kaart võib rünnata kaks korda iga Lahingu Faasi jooksul. Kui see kaart ründab tagurpidi Kaitseasendis olevat koletist, saad selle koletise kohe hävitada selle kaardi efektiga ilma seda püstiasendisse pööramata või kahjustuse arvutust rakendamata.

source: Symphonic Warrior Basses
et: Sümfooniline Sõdalane Bassid

source: Once per turn, you can select 1 face-up "Symphonic Warrior" monster on the field. Increase its Level by the number of cards in your hand; this increase lasts until the End Phase. You can remove from play this card from your Graveyard to select 1 face-up "Symphonic Warrior" monster you control and increase its Level by the number of cards in your hand; this increase lasts until the End Phase.
et: Korra ühe korra käigu jooksul saad valida ühe avatud "Symphonic Warrior" koletise väljakul. Suurenda selle taset oma käes olevate kaartide arvu võrra; see suurenemine kestab kuni lõppfaasini. Sa saad eemaldada selle kaardi oma hauast mängust, et valida üks avatud "Symphonic Warrior" koletis, mida sa kontrollid, ja suurendada selle taset oma käes olevate kaartide arvu võrra; see suurenemine kestab kuni lõppfaasini.

source: Symphonic Warrior Drumss
et: Sümfooniline Sõdalane Trummid

source: Once per turn, you can declare 1 Attribute and select 1 face-up "Symphonic Warrior" monster on the field. That monster becomes that Attribute. You can declare 1 Attribute and remove from play this card from your Graveyard to select 1 face-up "Symphonic Warrior" monster you control, and make it that Attribute.
et: Korra ühe korra käigu jooksul saad valida 1 atribuudi ja valida 1 avatud "Symphonic Warrior" koletise väljakul. See koletis muutub selleks atribuudiks. Sa saad valida 1 atribuudi ja eemaldada see kaart oma kalmistult mängust, et valida 1 avatud "Symphonic Warrior" koletis, mida sa kontrollid, ja muuta see selleks atribuudiks.

source: Symphonic Warrior Piaano
et: Sümfooniline Sõdalane Piaano

source: Once per turn, you can declare 1 Monster Type and select 1 face-up "Symphonic Warrior" monster on the field. That monster becomes that Monster Type. You can declare 1 Monster Type and remove from Play this card from your Graveyard to select 1 face-up "Symphonic Warrior" monster you control and make it that Monster Type.
et: Korra ühe korra käigu jooksul saad valida 1 Koletise Tüübi ja valida 1 avatud "Sümfooniline Sõdalane" koletise väljal. See koletis muutub selleks Koletise Tüübiks. Sa saad valida 1 Koletise Tüübi ja eemaldada selle kaardi oma Hauakambrist mängust, et valida 1 avatud "Sümfooniline Sõdalane" koletise, mida sa kontrollid, ja muuta see selleks Koletise Tüübiks.

source: While your opponent controls a Spell/Trap Card, they cannot select this card as an attack target. During battle between this attacking card and a Defense Position monster whose DEF is lower than the ATK of this card, inflict the difference as Battle Damage to your opponent.
et: Kui sinu vastasel on kontrolli all Püünis- või Võlukaarte, ei saa nad valida seda kaarti rünnaku sihtmärgiks. Kui selle ründava kaardi ja kaitseasendis oleva koletise, mille DEF on madalam kui selle kaardi ATK, vahel toimub lahing, põhjusta vahe oma vastasele Lahingukahjuna.

source: This card cannot be Special Summoned. This card returns to its owner's hand during the End Phase of the turn it is Normal Summoned or flipped face-up. When this card is Normal Summoned or flipped face-up, you can select 1 Spell/Trap Card your opponent controls, and return it to the hand.
et: Seda kaarti ei saa eriliselt kutsuda. See kaart naaseb omaniku kätte selle käigu lõppfaasis, mil see on tavakutsutud või ümber pööratud. Kui see kaart on tavakutsutud või ümber pööratud, saad valida 1 loitsu/lõksukaardi, mida su vastane kontrollib, ja tagastada selle kätte.

source: Thor, Lord of the Aesir
et: Thor, Aesiri isand

source: 1 "Nordic Beast" Tuner + 2 or more non-Tuner monsters<BR>Once per turn, you can negate the effects of all face-up monsters your opponent controls, until the End Phase. During the End Phase, if this face-up card on the field was destroyed by your opponent's card (either by battle or by card effect) and sent to the Graveyard this turn, you can remove from play 1 "Nordic Beast" Tuner monster from your Graveyard to Special Summon this card from the Graveyard. When it is Special Summoned by this effect, inflict 800 damage to your opponent.
et: 1 "Põhjamaade metsaline" Tuner + 2 või rohkem mitte-Tuner koletist<BR>Korra käigu jooksul saad tühistada kõigi vastase kontrollitavate avatud koletiste efektid kuni lõppfaasini. Lõppfaasi ajal, kui see avatud kaart väljal hävitati vastase kaardi (kas lahingus või kaardi efekti tõttu) ja saadeti sel käigul Hauakambrisse, saad eemaldada mängust 1 "Põhjamaade metsaline" Tuner koletise oma Hauakambrist, et eriliselt kutsuda see kaart Hauakambrist. Kui see kutsutakse eriliselt selle efekti abil, tekitab see vastasele 800 kahju.

source: Loki, Lord of the Aesir
et: Loki, Aesiri isand

source: 1 "Nordic Alfar" Tuner + 2 or more non-Tuner monsters<BR>Once per turn, when your opponent activates a Spell/Trap Card during your Battle Phase, you can negate its activation and destroy it. During the End Phase, if this face-up card on the field was destroyed by your opponent's card (either by battle or by card effect) and sent to the Graveyard this turn, you can remove from play 1 "Nordic Alfar" Tuner monster from your Graveyard to Special Summon this card from the Graveyard. When this card is Special Summoned by this effect, you can select 1 Trap Card in your Graveyard, and add it to your hand.
et: 1 "Nordic Alfar" häälestus + 2 või rohkem mitte-häälestus koletist<BR>Korra ühe käigu jooksul, kui sinu vastane aktiveerib Loitsu/Lõksukaardi sinu Lahingu Faasis, saad selle aktiveerimise tühistada ja hävitada. Lõppfaasis, kui see avatud kaart väljal hävitati sinu vastase kaardi poolt (kas lahingus või kaardi efekti tõttu) ja saadeti sel käigul Hauakambrisse, saad eemaldada mängust 1 "Nordic Alfar" häälestuskoletise oma Hauakambrist, et eriliselt kutsuda see kaart Hauakambrist. Kui see kaart kutsutakse eriliselt selle efekti abil, saad valida 1 Lõksukaardi oma Hauakambrist ja lisada selle oma kätte.

source: Odin, Father of the Aesir
et: Odin, Aesiri isa

source: 1 "Nordic Ascendant" Tuner + 2 or more non-Tuner monsters<BR>Once per turn, during your Main Phase, you can activate this effect to have this card become unaffected by the effects of Spell/Trap Cards until the End Phase. During the End Phase, if this face-up card on the field was destroyed by your opponent's card (either by battle or by card effect) and sent to the Graveyard this turn, you can remove from play 1 "Nordic Ascendant" Tuner monster from your Graveyard to Special Summon this card from the Graveyard. When this card is Special Summoned by this effect, you can draw 1 card.
et: 1 "Põhjala Tõusja" Tuuner + 2 või rohkem mitte-Tuuner koletist<BR>Kord käigu jooksul, oma Põhifaasis, saad aktiveerida selle efekti, et muuta see kaart loitsude/lõksukaartide efektide suhtes immuunseks kuni Lõppfaasini. Lõppfaasis, kui see avatud kaart väljal hävitati sinu vastase kaardi (kas lahingus või kaardi efektiga) poolt ja saadeti sel käigul Hauakambrisse, saad eemaldada mängust 1 "Põhjala Tõusja" Tuuner koletise oma Hauakambrist, et Kutsuda see kaart Hauakambrist Eriliselt. Kui see kaart kutsutakse selle efektiga Eriliselt, saad tõmmata 1 kaardi.

source: Legendary Six Samurai - Shi En
et: Legendaarne Kuus Samuraid - Shi En

source: 1 Warrior-Type Tuner + 1 or more non-Tuner "Six Samurai" monsters<BR>Once per turn, when your opponent activates a Spell/Trap Card, you can negate its activation and destroy it. If this face-up card on the field would be destroyed, you can destroy another face-up "Six Samurai" monster you control instead.
et: 1 Sõdalase-tüüpi Tuner + 1 või rohkem mitte-Tuner "Kuue Samuraid" koletist<BR>Kord kord käigu jooksul, kui sinu vastane aktiveerib Loitsu/Lõksukaardi, saad selle aktiveerimise tühistada ja hävitada. Kui see avatud kaart väljakul hävitatakse, saad selle asemel hävitada teise avatud "Kuue Samuraid" koletise, mida sa kontrollid.

source: Karakuri Steel Shogun mdl 00X "Bureido"
et: Karakuri Terassõdalane mdl 00X "Bureido"

source: 1 Tuner + 1 or more non-Tuner Machine-Type monsters<BR>When this card is Synchro Summoned, you can Special Summon 1 "Karakuri" monster from your Deck. Once per turn, when the battle position of a face-up "Karakuri" monster you control is changed, draw 1 card.
et: 1 Tuner + 1 või rohkem mitte-Tuner Masina-tüüpi koletist<BR>Kui see kaart on Sünkro Kutsutud, saad Sa oma Pakist eriliselt kutsuda 1 "Karakuri" koletise. Kord kord käigu jooksul, kui sinu kontrollitava ülespoole pööratud "Karakuri" koletise lahingupositsioon muutub, tõmba 1 kaart.

source: Atomic Scrap Dragon
et: Atoomne Rämpsdraakon

source: 1 "Scrap" Tuner + 2 or more non-Tuner monsters<BR>Once per turn, you can select 1 card you control and up to 3 cards in your opponent's Graveyard. Destroy your selected card and return the opponent's cards to the Deck. When this card is destroyed by your opponent's card (either by battle or by card effect) and sent to the Graveyard, Select 1 non-Synchro "Scrap" monster from your Graveyard. and Special Summon it.
et: 1 "Scrap" Tuner + 2 või rohkem mitte-Tuner koletist<BR>Korra käigu jooksul saad valida 1 kaardi, mida sa kontrollid, ja kuni 3 kaarti oma vastase Hauakambris. Hävita oma valitud kaart ja tagasta vastase kaardid pakki. Kui see kaart hävitatakse sinu vastase kaardi poolt (kas lahingus või kaardi efekti tõttu) ja saadetakse Hauakambrisse, vali 1 mitte-Sünkroonne "Scrap" koletis oma Hauakambrist ja Kutsu see Eriliselt välja.

source: Watthydra
et: Watthüdra

source: 1 "Watt" Tuner + 1 or more non-Tuner Thunder-Type monsters<BR>This card can attack your opponent directly. When this card inflicts Battle Damage to your opponent by a direct attack, choose 1 card in your Deck and remove it from play. Add that card to your hand during your 2nd Standby Phase after activating this effect.
et: 1 "Watt" Tuner + 1 või rohkem mitte-Tuner Äikese-tüüpi koletist<BR>See kaart võib rünnata otse sinu vastast. Kui see kaart tekitab sinu vastasele lahingukahju otsese rünnakuga, vali 1 kaart oma pakist ja eemalda see mängust. Lisa see kaart oma kätte oma 2. ootejärgus pärast selle efekti aktiveerimist.

source: Nordic Relic Draupnir
et: Põhjala Relikt Draupnir

source: Equip only to a "Aesir" or "Nordic" monster. It gains 800 ATK. If this face-up card is destroyed by a card effect, you can add 1 "Nordic Relic" card from your Deck to your hand.
et: Varusta ainult "Aesir" või "Nordic" koletisele. See saab 800 ATK juurde. Kui see avatud kaart hävitatakse kaardi efekti tõttu, saad lisada 1 "Nordic Relic" kaardi oma pakist oma kätte.
