Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: After activation, Special Summon this card in Defense Position; it is treated as an Effect Monster Card (Zombie-Type/DARK/Level 4/ATK 1800/DEF 500). If this card is destroyed by battle, inflict damage to your opponent equal to the ATK of the monster that destroyed it. (This card is also still treated as a Trap Card.)
et: Pärast aktiveerimist kutsu see kaart välja kaitsepositsioonis; seda käsitletakse kui Efektikoletise Kaarti (Zombie-Tüüp/PIMEDUS/Tase 4/RÜNNAK 1800/KAITSE 500). Kui see kaart hävitatakse lahingus, põhjusta oma vastasele kahju, mis on võrdne selle koletise RÜNNAKuga, mis selle hävitas. (Seda kaarti käsitletakse endiselt ka kui Lõksukaarti.)

source: Maximum Six
et: Maksimum Kuus

source: When this card is Tribute Summoned, roll a six-sided die. This card gains ATK equal to the result of the die roll x 200.
et: Kui see kaart on ohverdamisega välja kutsutud, veereta kuuepoolset täringut. See kaart saab ATK-d juurde võrdse täringu tulemuse x 200-ga.

source: Dangerous Machine Type-6
et: Ohtlik Masin Tüüp-6

source: During each of your Standby Phases, roll a six-sided die.<BR>● 1: Discard 1 card.<BR>● 2: Your opponent discards 1 card.<BR>● 3: Draw 1 card.<BR>● 4: Your opponent draws 1 card.<BR>● 5: Destroy 1 monster your opponent controls.<BR>● 6: Destroy this card.
et: Iga oma ootejärgu ajal veereta kuuepoolset täringut.<BR>● 1: Viska 1 kaart ära.<BR>● 2: Sinu vastane viskab 1 kaardi ära.<BR>● 3: Tõmba 1 kaart.<BR>● 4: Sinu vastane tõmbab 1 kaardi.<BR>● 5: Hävita 1 koletis, mida sinu vastane kontrollib.<BR>● 6: Hävita see kaart.

source: Sixth Sense
et: Kuues meel

source: Declare two numbers from 1 to 6. Your opponent rolls 1 six-sided die. If the die result is either of the two declared numbers, draw that number of cards. If not, send cards from the top of your Deck to the Graveyard equal to the die result.
et: Teata kaks numbrit vahemikus 1 kuni 6. Sinu vastane veeretab 1 kuuepoolset täringut. Kui täringu tulemus on üks kahest teatatud numbrist, tõmba sama arv kaarte. Kui ei, saada oma pakist täringu tulemusele vastav arv kaarte hauakambrisse.

source: His soul long since collapsed, his body recklessly continues onward, driven by a lust for more power. He no longer resembles his former self....
et: Tema hing on juba ammu kokku varisenud, tema keha jätkab hoolimatult edasi, ajendatuna ihast suurema võimu järele. Ta ei sarnane enam oma endise minaga....

source: Warrior of Zera
et: Zera Sõdalane

source: A wandering warrior who seeks the sanctuary where he can gain the power of the Archlords. To escape the temptation of evil fiends, he fights solo day by day.
et: Rändav sõdalane, kes otsib pühamut, kus ta saaks Archlordide jõu. Kurjade deemonite kiusatuse eest põgenemiseks võitleb ta päevast päeva üksi.

source: Sealmaster Meisei
et: Meister Meisei

source: One of the few people who has a good command of Talismans. His history is a mystery.
et: Üks vähestest inimestest, kes valdab hästi talismane. Tema ajalugu on mõistatus.

source: Mystical Shine Ball
et: Müstiline Sära Palli

source: A soul of light covered by mystical shine. When you see its beautiful shape, your dream will come true.
et: Valguse hing, mida katab müstiline sära. Kui näed selle kaunist kuju, täitub sinu unistus.

source: Metal Armored Bug
et: Metallsoomustatud Putukas

source: A gigantic insect-like creature covered by thick armor. Everything in his path is destroyed.
et: Hiiglaslik putukalaadne olend, kaetud paksu soomusega. Kõik tema teel hävib.

source: The Agent of Judgment - Saturn
et: Kohtuotsuse Agent - Saturn

source: While your Life Points are higher than your opponent's, you can Tribute this card to inflict damage to your opponent equal to the difference. If you do not control a face-up "<M5982>The Sanctuary in the Sky<M>", this effect is not applied. You cannot conduct your Battle Phase the turn you activate this effect.
et: Kui sinu Elupunktid on kõrgemad kui sinu vastasel, võid sa ohverdada selle kaardi, et tekitada vastasele kahju, mis on võrdne erinevusega. Kui sul ei ole kontrolli all avatud "<M5982>The Sanctuary in the Sky<M>", siis seda efekti ei rakendata. Sa ei saa läbi viia oma Lahingufaasi sellel käigul, mil sa aktiveerid selle efekti.

source: The Agent of Wisdom - Mercury
et: Tarkuse Agent - Merkuur

source: If you control this face-up card and have no cards in your hand at the end of your opponent's End Phase, draw 1 card from your Deck during your next Standby Phase.
et: Kui sa kontrollid seda avatud kaarti ja sul pole oma käes kaarte oma vastase lõppfaasi lõpus, tõmba oma järgmise ootejärgu ajal 1 kaart oma pakist.

source: The Agent of Creation - Venus
et: Loomise Agent - Veenus

source: Pay 500 Life Points to Special Summon 1 "<M5949>Mystical Shine Ball<M>" from your hand or Deck.
et: Maksa 500 Elupunkti, et Kutsuda 1 "<M5949>Mystical Shine Ball<M>" oma käest või pakist.

source: The Agent of Force - Mars
et: Jõu Agent - Mars

source: This card is unaffected by any Spell Cards. While you control a face-up "<M5982>The Sanctuary in the Sky<M>" and your Life Points are higher than your opponent's, this card gains ATK and DEF by the difference between your and your opponent's Life Points.
et: See kaart ei ole mõjutatud ühegi loitsukaardi poolt. Kui sa kontrollid avatud "<M5982>The Sanctuary in the Sky<M>" ja sinu Elupunktid on kõrgemad kui sinu vastasel, saab see kaart ATK ja DEF juurde vahe võrra sinu ja sinu vastase Elupunktide vahel.

source: The Unhappy Girl
et: Õnnetu Tüdruk

source: While this card is in face-up Attack Position on the field, this card is not destroyed as a result of battle. (Damage calculation is applied normally.) A monster that battled with this card cannot change its battle position, except with a card effect, or attack while this card is in face-up Attack Position on the field.
et: Kui see kaart on lahinguväljal avatud rünnakupositsioonis, siis see kaart ei hävine lahingu tulemusena. (Kahju arvutamine toimub tavapäraselt.) Koletis, kes võitles selle kaardiga, ei saa muuta oma lahingupositsiooni, välja arvatud kaardi efekti abil, ega rünnata, kui see kaart on lahinguväljal avatud rünnakupositsioonis.

source: Soul-Absorbing Bone Tower
et: Hingeid Neelav Luutorn

source: While there is another Zombie-Type monster on your side of the field, your opponent cannot select this card as an attack target. Each time a Zombie-Type monster(s) is Special Summoned successfully, send 2 cards from the top of your opponent's Deck to the Graveyard.
et: Kui sinu väljakul on veel üks Zombi-tüüpi koletis, ei saa sinu vastane valida seda kaarti rünnaku sihtmärgiks. Iga kord, kui Zombi-tüüpi koletis(ed) kutsutakse edukalt eriliselt välja, saada 2 kaarti oma vastase paki pealt Hauakambrisse.

source: The Kick Man
et: Löögimees

source: When this card is Special Summoned, you can equip 1 appropriate Equip Spell Card from your Graveyard to this card.
et: Kui see kaart on eriliselt kutsutud, saad sellele kaardile oma hauakambrist ühe sobiva Varustuse Loitsukaardi varustada.

source: Vampire Lady
et: Vampiiridaam

source: Each time this card inflicts Battle Damage to your opponent's Life Points, declare 1 card type (Monster, Spell or Trap). Your opponent selects 1 card of that type from their Deck and sends it to the Graveyard.
et: Iga kord, kui see kaart tekitab lahingukahju sinu vastase Elupunktidele, kuuluta välja 1 kaarditüüp (Koletis, Loits või Lõks). Sinu vastane valib oma pakist 1 selle tüübi kaardi ja saadab selle Hauakambrisse.

source: Rocket Jumper
et: Raketi Hüppaja

source: If the only cards on your opponent's side of field are Defense Position monsters, this card can attack your opponent's Life Points directly.
et: Kui ainsad kaardid sinu vastase väljakupoolel on kaitseasendis koletised, võib see kaart rünnata sinu vastase elupunkte otse.

source: Avatar of The Pot
et: Poti Avatar

source: By sending 1 "<M4844>Pot of Greed<M>" from your hand to the Graveyard, draw 3 cards from your Deck.
et: Saates oma käest Hauakambrisse 1 "<M4844>Pot of Greed<M>", tõmmake oma pakist 3 kaarti.

source: Legendary Jujitsu Master
et: Legendaarne Jujitsu Meister

source: A monster that battles with this Defense Position card is returned to the top of its owner's Deck at the end of the Damage Step.
et: Koletis, mis võitleb selle kaitseasendis kaardiga, tagastatakse oma omaniku paki tippu Kahjustuse etapi lõpus.

source: KA-2 Des Scissors
et: KA-2 Des Käärid

source: When this card destroys a monster and sends it to the Graveyard as a result of battle, inflict damage to your opponent's Life Points equal to the Level of the monster x 500 points.
et: Kui see kaart hävitab koletise ja saadab selle lahingu tulemusena Hauakambrisse, põhjusta oma vastase Elupunktidele kahju, mis on võrdne koletise tasemega x 500 punkti.

source: Needle Burrower
et: Nõelapuurija

source: When this card destroys a monster and sends it to the Graveyard as a result of battle, inflict damage to your opponent's Life Points equal to the Level of the destroyed monster x 500 points.
et: Kui see kaart hävitab koletise ja saadab selle lahingu tulemusena Hauakambrisse, põhjusta oma vastase Elupunktidele kahju, mis on võrdne hävitatud koletise tasemega x 500 punkti.

source: Blowback Dragon
et: Tagasilöögi Draakon

source: Once per turn, you can toss a coin 3 times. If at least 2 of the results are Heads, destroy 1 card your opponent controls.
et: Korra ühe korra käigu jooksul võid visata münti 3 korda. Kui vähemalt 2 tulemust on kull, hävita 1 kaart, mida sinu vastane kontrollib.

source: Zaborg the Thunder Monarch
et: Zaborg, Äikese Monarh

source: When this card is Tribute Summoned, destroy 1 monster on the field.
et: Kui see kaart on ohverdatud, hävita 1 koletis väljal.

source: Atomic Firefly
et: Atoomne Tulekärbes

source: When this face-up card on the field attacks or is attacked and it is destroyed as a result of battle, the player who destroyed it takes 1000 points of damage.
et: Kui see avatud kaart väljakul ründab või teda rünnatakse ja ta hävitatakse lahingu tulemusena, saab mängija, kes selle hävitas, 1000 punkti kahju.

source: Mermaid Knight
et: Mererüütel

source: While "<M4340>Umi<M>" is face-up on the field, this card can attack twice during the same Battle Phase.
et: Kui "<M4340>Umi<M>" on väljakul avatud, võib see kaart rünnata kaks korda sama Lahingufaasi jooksul.

source: Piranha Army
et: Piraaja armee

source: The Battle Damage this card inflicts by attacking your opponent's Life Points directly is doubled.
et: Selle kaardi rünnakuga vastase Elupunktidele tekitatud Lahingukahju kahekordistatakse.

source: Two Thousand Needles
et: Kaks tuhat nõela

source: When this Defense Position card is attacked and the ATK of the attacking monster is lower than the DEF of this card, destroy the attacking monster at the end of the Damage Step.
et: Kui seda kaitseasendis kaarti rünnatakse ja ründava koletise ATK on madalam kui selle kaardi DEF, hävita ründav koletis Kahjustuse Etapi lõpus.

source: Disc Fighter
et: Kettavõitleja

source: If this card attacks a Defense Position monster with DEF 2000 or more, destroy that monster with this card's effect without applying damage calculation.
et: Kui see kaart ründab kaitsepositsioonis olevat koletist, mille DEF on 2000 või rohkem, hävita see koletis selle kaardi efektiga ilma kahjukalkulatsiooni rakendamata.

source: Arcane Archer of the Forest
et: Metsa Arkaanvibu

source: While there is a Plant-Type monster on your side of the field, this card cannot be attacked. By Tributing 1 Plant-Type monster on your side of the field, destroy 1 Spell or Trap Card on the field.
et: Kui sinu väljaku poolel on Taimetüüpi koletis, ei saa seda kaarti rünnata. Ohverdades 1 Taimetüüpi koletise oma väljaku poolelt, hävita 1 Väljal olev Võlu- või Lõksukaart.

source: Lady Ninja Yae
et: Daami Ninja Yae

source: By discarding 1 WIND monster from your hand to the Graveyard, return all Spell and Trap Cards on your opponent's side of the field to the owner's hand.
et: Kui saadad 1 WIND koletise oma käest Hauakambrisse, tagasta kõik Võlu- ja Lõksukaardid oma vastase väljaku poolelt omaniku kätte.

source: Goblin King
et: Goblinikuningas

source: While you control another Fiend-Type monster, this card cannot be attacked. The ATK and DEF of this card are each equal to the number of Fiend-Type monsters on the field (excluding this card) x 1000.
et: Kui sa kontrollid teist Deemon-tüüpi koletist, ei saa seda kaarti rünnata. Selle kaardi ATK ja DEF on võrdsed väljal olevate Deemon-tüüpi koletiste arvuga (välja arvatud see kaart) x 1000.

source: Solar Flare Dragon
et: Päikesepõletuse Draakon

source: While you control another Pyro-Type monster, this card cannot be attacked. Inflict 500 damage to your opponent during the End Phase of your turn.
et: Kui sa kontrollid teist Püro-tüüpi koletist, ei saa seda kaarti rünnata. Teise faasi lõpus tee oma vastasele 500 kahju.

source: White Magician Pikeru
et: Valge Maag Pikeru

source: During your Standby Phase, increase your Life Points by 400 points for each monster on your side of the field.
et: Oma Standby Phase'i ajal suurenda oma Elupunkte 400 punkti võrra iga sinu poolel oleva koletise eest.

source: Archlord Zerato
et: Ülikuningas Zerato

source: This card cannot be Normal Summoned or Set. This card cannot be Special Summoned except by Tributing 1 face-up "<M5947>Warrior of Zera<M>" on your side of the field while "<M5982>The Sanctuary in the Sky<M>" is on the field. If "<M5982>The Sanctuary in the Sky<M>" is on your side of the field, by discarding 1 LIGHT Monster Card from your hand to the Graveyard, destroy all monsters on your opponent's side of the field. If "<M5982>The Sanctuary in the Sky<M>" is not on your side of the field, this effect is not applied.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti ei saa eriliselt kutsuda, välja arvatud, kui ohverdate 1 avatud "<M5947>Warrior of Zera<M>" oma väljaku poolel, kui "<M5982>The Sanctuary in the Sky<M>" on väljakul. Kui "<M5982>The Sanctuary in the Sky<M>" on teie väljaku poolel, hävitage, visates 1 LIGHT koletise kaardi oma käest hauakambrisse, kõik koletised teie vastase väljaku poolel. Kui "<M5982>The Sanctuary in the Sky<M>" ei ole teie väljaku poolel, siis seda efekti ei rakendata.

source: Opti-Camouflage Armor
et: Opti-kamuflaaži soomus

source: You can only equip this card to a Level 1 monster. A monster equipped with this card can attack your opponent's Life Points directly.
et: Seda kaarti saab varustada ainult 1. taseme koletisele. Selle kaardiga varustatud koletis võib rünnata otse sinu vastase Elupunkte.

source: Mystik Wok
et: Müstiline Wok

source: Tribute 1 monster. Select either its ATK or DEF and gain that many Life Points.
et: Ohverda 1 koletis. Vali kas selle ATK või DEF ja saa sama palju Elupunkte.

source: Burst Stream of Destruction
et: Hävituse Purustusvoog

source: Activate only while you control a face-up "<M4007>Blue-Eyes White Dragon<M>". Destroy all monsters your opponent controls. "<M4007>Blue-Eyes White Dragon<M>" cannot attack the turn you activate this card.
et: Aktiveeri ainult siis, kui sa kontrollid avatud olekus "<M4007>Sinisilmne Valge Draakon<M>". Hävita kõik koletised, mida sinu vastane kontrollib. "<M4007>Sinisilmne Valge Draakon<M>" ei saa rünnata sellel käigul, mil sa selle kaardi aktiveerid.

source: Monster Gate
et: Koletise Värav

source: Tribute 1 monster on your side of the field. Pick up cards from your Deck until you pick up a monster that can be Normal Summoned, and Special Summon it. Send any other cards picked up to the Graveyard.
et: Lohista 1 koletis oma väljaku poolelt. Tõsta kaarte oma pakist, kuni tõstad koletise, mida saab normaalselt kutsuda, ja kutsu see eriliselt välja. Saada kõik teised tõstetud kaardid hauakambrisse.

source: Weapon Change
et: Relvavahetus

source: Once during each of your Standby Phases, you can pay 700 Life Points to activate this card's effect. Switch the ATK and DEF of 1 Warrior-Type or Machine-Type monster on your side of the field until the end of your opponent's next turn. When this card is destroyed, the effect is negated.
et: Kord oma iga Standby Phase'i ajal, saad maksta 700 Life Pointsi, et aktiveerida selle kaardi efekt. Vaheta 1 Warrior-Type või Machine-Type koletise ATK ja DEF oma väljaku poolel kuni sinu vastase järgmise käigu lõpuni. Kui see kaart hävitatakse, efekt tühistatakse.

source: The Sanctuary in the Sky
et: Taevane Pühamu

source: Battle Damage to the controller of a Fairy-Type monster from a battle involving that Fairy-Type monster becomes 0.
et: Lahingu kahjustus, mis tekib haldjatüüpi koletise juhile lahingus, kus osaleb see haldjatüüpi koletis, muutub 0-ks.

source: Earthquake
et: Maavärin

source: Change all face-up monsters to Defense Position.
et: Muuda kõik avatud koletised kaitsepositsiooni.

source: Talisman of Trap Sealing
et: Lõksu Pitseerimise Talismann

source: You can only activate this card while there is a face-up "<M5948>Sealmaster Meisei<M>" on your side of the field. While this card is face-up on the field, Trap Cards cannot be activated and the effects of face-up Trap Cards on the field are negated. When "<M5948>Sealmaster Meisei<M>" is removed from the field, destroy this card.
et: Seda kaarti saab aktiveerida ainult siis, kui sinu väljaku poolel on avatud "<M5948>Sealmaster Meisei<M>". Kui see kaart on väljakul avatud, ei saa Lõksukaardid aktiveeruda ja väljakul olevate avatud Lõksukaartide efektid on tühistatud. Kui "<M5948>Sealmaster Meisei<M>" eemaldatakse väljakult, hävita see kaart.

source: Goblin Thief
et: Goblini Varas

source: Inflict 500 points of damage to your opponent's Life Points and increase your Life Points by 500 points.
et: Tekita oma vastase Elupunktidele 500 punkti kahju ja suurenda oma Elupunkte 500 punkti võrra.

source: Backfire
et: Tagasilöök

source: When a FIRE monster(s) on your side of the field is destroyed and sent to the Graveyard, inflict 500 points of damage to your opponent's Life Points.
et: Kui sinu väljaku tule-atribuutidega koletis(ed) hävitatakse ja saadetakse Hauakambrisse, tekitab see sinu vastase Elupunktidele 500 punkti kahju.

source: Micro Ray
et: Mikrokiir

source: The DEF of 1 face-up monster on the field becomes 0 until the end of this turn.
et: 1 lahinguväljal oleva avatud koletise DEF muutub selle käigu lõpuni 0-ks.

source: Light of Judgment
et: Kohtu valgus

source: Activate this card by discarding 1 LIGHT Monster Card from your hand to the Graveyard while "<M5982>The Sanctuary in the Sky<M>" is on the field. Select 1 card on the field controlled by your opponent or 1 card in your opponent's hand (you can look at your opponent's hand), and send it to the Graveyard.
et: Aktiveeri see kaart, saates 1 VALGUSE Monsterkaardi oma käest Hauakambrisse, kui "<M5982>Taeva Pühamu<M>" on väljakul. Vali 1 kaart väljakul, mida kontrollib sinu vastane, või 1 kaart sinu vastase käes (sa võid vaadata oma vastase kätt) ja saada see Hauakambrisse.

source: Talisman of Spell Sealing
et: Loitsude pitseerimise talisman

source: You can only activate this card while there is a face-up "<M5948>Sealmaster Meisei<M>" on your side of the field. While this card is face-up on the field, Spell Cards cannot be activated and the effects of face-up Spell Cards on the field are negated. When "<M5948>Sealmaster Meisei<M>" is removed from the field, destroy this card.
et: Seda kaarti saab aktiveerida ainult siis, kui sinu väljaku poolel on avatud "<M5948>Sealmaster Meisei<M>". Kui see kaart on väljakul avatud, ei saa aktiveerida Võlukaartide ja väljakul olevate avatud Võlukaartide efektid on tühistatud. Kui "<M5948>Sealmaster Meisei<M>" eemaldatakse väljakult, hävita see kaart.

source: Wall of Revealing Light
et: Paljastava valguse sein

source: When you activate this card, pay any multiple of 1000 Life Points. None of your opponent's monsters with an ATK equal to or less than the Life Points you paid can attack.
et: Kui aktiveerid selle kaardi, maksa ükskõik milline 1000 Elupunkti kordne. Ükski sinu vastase koletis, mille ATK on võrdne või väiksem kui makstud Elupunktid, ei saa rünnata.

source: Solar Ray
et: Päikesekiir

source: Inflict 600 points of damage to your opponent's Life Points for each face-up LIGHT monster on your side of the field.
et: Tekita oma vastase Elupunktidele 600 punkti kahju iga sinu poolel väljakul oleva avatud VALGUSE koletise eest.

source: Ninjitsu Art of Transformation
et: Transformatsiooni Ninjitsu Kunst

source: Activate this card by Tributing 1 face-up "Ninja" monster on your side of the field. Special Summon 1 Beast, Winged Beast, or Insect-Type monster with a Level equal to or less than the Level of the Tributed card + 3 from your hand or Deck to your side of the field. When this card is removed from your side of the field, destroy the monster.
et: Aktiveeri see kaart, ohverdades 1 avatud "Ninja" koletis oma väljaku poolel. Kutsu eriliselt välja 1 Metssiga, Tiivuline Metssiga või Putuka-tüüpi koletis, mille tase on võrdne või väiksem kui ohverdatud kaardi tase + 3, oma käest või pakist oma väljaku poolele. Kui see kaart eemaldatakse sinu väljaku poolelt, hävita koletis.

source: Beckoning Light
et: Kutsuv Valgus

source: Discard all the cards in your hand to the Graveyard. Then add the same number of LIGHT monsters from your Graveyard to your hand.
et: Viska kõik kaardid oma käest Hauakambrisse. Seejärel lisa sama arv VALGUS koletisi oma Hauakambrist oma kätte.

source: Draining Shield
et: Tühjendav Kilp

source: Negate the attack of 1 of your opponent's monsters and gain Life Points equal to its ATK.
et: Tühista ühe vastase koletise rünnak ja saa Elupunkte, mis on võrdsed selle ATK-ga.

source: Armor Break
et: Rüü purustamine

source: Negate the activation of an Equip Spell Card and destroy it.
et: Tühista Varustuse Võlusõna Kaardi aktiveerimine ja hävita see.

source: This card cannot be Normal Summoned or Set. This card cannot be Special Summoned except by Tributing 1 face-up "<M5947>Warrior of Zera<M>" on your side of the field while "<M5791>Pandemonium<M>" is on the field. If "<M5791>Pandemonium<M>" is on your side of the field when you Special Summon this card, your opponent discards 3 random cards from their hand. If "<M5791>Pandemonium<M>" is not on your side of the field, this effect is not applied.
et: Seda kaarti ei saa normaalset kutsuda ega asetada. Seda kaarti ei saa eriliselt kutsuda, välja arvatud, kui ohverdate 1 avatud "<M5947>Zera sõdalane<M>" oma väljaku poolel, kui "<M5791>Pandemonium<M>" on väljakul. Kui "<M5791>Pandemonium<M>" on teie väljaku poolel, kui te selle kaardi eriliselt kutsute, viskab teie vastane oma käest 3 juhuslikku kaarti ära. Kui "<M5791>Pandemonium<M>" ei ole teie väljaku poolel, siis seda efekti ei rakendata.

source: The controller of a monster that attacks this face-down card takes 1000 damage after damage calculation. This card cannot be destroyed by battle. (Damage calculation is applied normally.)
et: Monstrumi, kes ründab seda tagurpidi kaarti, juht saab pärast kahju arvutamist 1000 kahju. Seda kaarti ei saa lahingus hävitada. (Kahju arvutamine toimub tavapäraselt.)

source: Doomcaliber Knight
et: Hukukaliberi Rüütel

source: This card cannot be Special Summoned. When an Effect Monster's effect is activated, you must Tribute this face-up card. Negate that effect's activation and destroy the monster.
et: Seda kaarti ei saa eriliselt kutsuda. Kui Efektikoletise efekt aktiveeritakse, pead sa ohverdama selle avatud kaardi. Tühista selle efekti aktiveerimine ja hävita koletis.

source: Shield Crush
et: Kilbi purustamine

source: Select 1 Defense Position monster on the field and destroy it.
et: Vali välja 1 kaitseasendis olev koletis väljakul ja hävita see.

source: Gemini Imps
et: Kaksikute Impid
