Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: Activate only when a Dinosaur-Type monster on your side of the field is destroyed and sent to the Graveyard. Select 3 of your opponent's Spell & Trap Card Zones. You cannot select a Zone if a card is already in it. The selected Zones cannot be used. Destroy this card during your 3rd Standby Phase after activation. Then you can return 1 Dinosaur-Type monster from your Graveyard to your hand.
et: Aktiveeri ainult siis, kui sinu väljaku Dinosauruse-tüüpi koletis hävitatakse ja saadetakse Hauakambrisse. Vali 3 oma vastase Loitsu & Lõksu Kaardi Tsooni. Sa ei saa valida Tsooni, kui seal on juba kaart. Valitud Tsoone ei saa kasutada. Hävita see kaart oma 3. Ootefaasil pärast aktiveerimist. Seejärel saad sa ühe Dinosauruse-tüüpi koletise oma Hauakambrist oma kätte tagasi tuua.

source: Cyberdark Horn
et: Küberpime Sarv

source: When this card is Normal Summoned, select 1 Level 3 or lower Dragon-Type monster in your Graveyard and equip it to this card. This card gains ATK equal to the equipped card's ATK. During battle between this attacking card and a Defense Position monster whose DEF is lower than the ATK of this card, inflict the difference as Battle Damage to your opponent. If this card would be destroyed by battle, the equipped monster is destroyed instead.
et: Kui see kaart on Normaal-Kutsutud, vali 1. taseme 3 või madalama tasemega Draakoni-tüüpi koletis oma Hauakambris ja kinnita see sellele kaardile. See kaart saab ATK-d võrdse kinnitatud kaardi ATK-ga. Lahingu ajal selle ründava kaardi ja Kaitseasendis koletise vahel, kelle DEF on madalam kui selle kaardi ATK, põhjusta vahe vastasele Lahingukahjuna. Kui see kaart hävitatakse lahingus, hävitatakse selle asemel kinnitatud koletis.

source: Cyberdark Edge
et: Küberpime Serv

source: When this card is Normal Summoned, select 1 Level 3 or lower Dragon-Type monster in your Graveyard and equip it to this card. This card gains ATK equal to the equipped card's ATK. This card can attack your opponent directly. If it attacks using this effect, its ATK is halved during damage calculation only. If this card would be destroyed by battle, the equipped monster is destroyed instead.
et: Kui see kaart on Normaal-Kutsutud, vali 1 Tase 3 või madalam Draakon-Tüüpi koletis oma Hauakambris ja kinnita see sellele kaardile. See kaart saab ATK-d, mis on võrdne kinnitatud kaardi ATK-ga. See kaart võib rünnata sinu vastast otse. Kui see ründab kasutades seda efekti, siis selle ATK on poole väiksem ainult kahju arvutamise ajal. Kui see kaart hävitatakse lahingus, hävitatakse selle asemel kinnitatud koletis.

source: Cyberdark Keel
et: Küberpime Kiil

source: When this card is Normal Summoned, select 1 Level 3 or lower Dragon-Type monster in your Graveyard and equip it to this card. This card gains ATK equal to the equipped card's ATK. If this card destroys an opponent's monster by battle, inflict 300 damage to your opponent. If this card would be destroyed by battle, the equipped monster is destroyed instead.
et: Kui see kaart on Normaal-Kutsutud, vali 1 Tase 3 või madalam Draakon-Tüüpi koletis oma Hauakambris ja kinnita see sellele kaardile. See kaart saab ATK-d, mis on võrdne kinnitatud kaardi ATK-ga. Kui see kaart hävitab lahingus vastase koletise, põhjusta oma vastasele 300 kahju. Kui see kaart hävitatakse lahingus, hävitatakse selle asemel kinnitatud koletis.

source: Cyberdark Dragon
et: Küberpime Draakon

source: "<M6830>Cyberdark Horn<M>" + "<M6831>Cyberdark Edge<M>" + "<M6832>Cyberdark Keel<M>"<BR>This monster cannot be Special Summoned except by Fusion Summon. When this monster is Special Summoned, select 1 Dragon-Type monster in your Graveyard and equip it to this card. This card gains ATK equal to the equipped card's ATK. This card gains 100 ATK for each Monster Card in your Graveyard. If this card would be destroyed by battle, the equipped monster is destroyed instead.
et: "<M6830>Cyberdark Horn<M>" + "<M6831>Cyberdark Edge<M>" + "<M6832>Cyberdark Keel<M>"<BR>Seda koletist ei saa eriliselt kutsuda välja, välja arvatud fusion summon'i teel. Kui see koletis kutsutakse eriliselt välja, vali oma hauakambris 1 draakonitüüpi koletis ja varusta see selle kaardiga. See kaart saab ATK-d juurde võrdse varustatud kaardi ATK-ga. See kaart saab 100 ATK-d juurde iga sinu hauakambris oleva koletise kaardi eest. Kui see kaart peaks lahingus hävima, hävitatakse selle asemel varustatud koletis.

source: Power Wall
et: Võimusein

source: Activate only when an opponent's monster declares an attack. Send any number of cards from the top of your Deck to the Graveyard. Decrease the amount of Battle Damage by 100 for each card you sent to the Graveyard by this effect.
et: Aktiveeri ainult siis, kui vastase koletis kuulutab välja rünnaku. Saada suvaline arv kaarte oma paki pealt hauakambrisse. Vähenda lahingukahju 100 võrra iga kaardi kohta, mille sa selle efekti abil hauakambrisse saatsid.

source: "<M6743>Truckroid<M>" + "<M6735>Expressroid<M>" + "<M6387>Drillroid<M>" + "<M6741>Stealthroid<M>"<BR>When this card attacks, its original ATK is halved until the end of the Damage Step. During battle between this attacking card and a Defense Position monster whose DEF is lower than the ATK of this card, inflict the difference as Battle Damage to your opponent. Once per turn, you can select 1 monster on the field, except a Machine-Type monster, and equip it to this card. While equipped by this effect, this card can attack all monsters your opponent controls once each.
et: "<M6743>Truckroid<M>" + "<M6735>Expressroid<M>" + "<M6387>Drillroid<M>" + "<M6741>Stealthroid<M>"<BR>Kui see kaart ründab, siis selle algne ATK väheneb poole võrra kuni Kahjustuse Etapi lõpuni. Lahingu ajal selle ründava kaardi ja Kaitseasendis oleva koletise vahel, mille DEF on madalam kui selle kaardi ATK, tekitage vahe vastasele Lahingukahjuna. Kord kord käigu jooksul võid valida 1 koletise väljakul, välja arvatud Masinatüüpi koletis, ja kinnitada see sellele kaardile. Selle efekti abil varustatuna võib see kaart rünnata kõiki vastase kontrollitavaid koletisi üks kord igaüht.

source: Ancient Gear Engineer
et: Muinasvarustuse Insener

source: Negate the effect of any Trap Card that targets this card, and destroy that Trap Card. If this card attacks, your opponent cannot activate any Spell or Trap Cards until the end of the Damage Step. When this card attacks, destroy 1 Spell or Trap Card on your opponent's side of the field at the end of the Damage Step.
et: Tühista selle kaarti sihtiva lõksukaardi efekt ja hävita see lõksukaart. Kui see kaart ründab, ei saa sinu vastane aktiveerida ühtegi loitsu- ega lõksukaarti kuni Kahjustuse Etapi lõpuni. Kui see kaart ründab, hävita Kahjustuse Etapi lõpus 1 loitsu- või lõksukaart sinu vastase väljakupoolel.

source: Ancient Gear Tank
et: Muinasvarustuse Tank

source: Equip only to an "Ancient Gear" monster. It gains 600 ATK. When this card is destroyed and sent to the Graveyard, inflict 600 damage to your opponent.
et: Varusta ainult "Ancient Gear" koletisega. See saab 600 ATK juurde. Kui see kaart hävitatakse ja saadetakse Hauakambrisse, tekitab see sinu vastasele 600 kahju.

source: Ancient Gear Explosive
et: Muinasaja Käikude Plahvatus

source: Target 1 face-up "Ancient Gear" monster on your side of the field when you activate this card. Destroy the targeted monster and inflict damage equal to half its original ATK to your opponent.
et: Vali 1 avatud "Ancient Gear" koletis oma väljaku poolel, kui aktiveerid selle kaardi. Hävita sihitud koletis ja tekita vastasele kahju, mis on võrdne poolega selle algsest rünnakust.

source: Ancient Gear Fist
et: Muinasaja Käe Rusikas

source: Equip only to an "Ancient Gear" monster. Destroy any monster that battles with it, at the end of the Damage Step.
et: Varusta ainult „Ancient Gear“ koletisele. Hävita iga koletis, mis sellega võitleb, Kahjustuse etapi lõpus.

source: Cyber Angel - Benten
et: Küberingel - Benten

source: This card can only be Ritual Summoned with the Ritual Spell Card, "<M6850>Machine Angel Ritual<M>". If this card destroys an opponent's monster by battle, inflict damage to your opponent equal to the destroyed monster's DEF.
et: Seda kaarti saab Rituaali Kutsuda ainult Rituaali Loitsukaardiga, "<M6850>Masina Ingli Rituaal<M>". Kui see kaart hävitab lahingus vastase koletise, põhjusta oma vastasele kahju, mis on võrdne hävitatud koletise DEF-iga.

source: Cyber Angel - Idaten
et: Küberingel - Idaten

source: This card can only be Ritual Summoned with the Ritual Spell Card, "<M6850>Machine Angel Ritual<M>". When this card is Special Summoned, you can add 1 Spell Card from your Graveyard to your hand.
et: Seda kaarti saab Rituaali Kutsuda ainult Rituaali Loitsukaardiga, "<M6850>Masinaingli Rituaal<M>". Kui see kaart on Eriliselt Kutsutud, saad lisada 1 Loitsukaardi oma Hauakambrist oma kätte.

source: Cyber Angel - Dakini
et: Küberingel - Dakini

source: This card can only be Ritual Summoned with the Ritual Spell Card, "<M6850>Machine Angel Ritual<M>". When this card is Special Summoned, your opponent must select 1 monster they control and destroy it. When this card attacks a Defense Position monster, inflict piercing damage to your opponent.
et: Seda kaarti saab Rituaali Kutsuda ainult Rituaali Loitsukaardiga, "<M6850>Masinaingli Rituaal<M>". Kui see kaart on Eriliselt Kutsutud, peab sinu vastane valima ühe koletise, mida ta kontrollib, ja hävitama selle. Kui see kaart ründab Kaitseasendis koletist, tekitab see sinu vastasele läbistavat kahju.

source: Machine Angel Ritual
et: Masinaingli rituaal

source: This card is used to Ritual Summon any "Cyber Angel" Ritual Monster. You must also Tribute monsters from the field or your hand whose total Levels equal the Level of the Ritual Monster you are attempting to Ritual Summon.
et: Seda kaarti kasutatakse mis tahes "Cyber Angel" rituaalikoletise rituaalsummonimiseks. Samuti peate ohverdama koletisi väljakult või oma käest, kelle kogutasemed on võrdsed rituaalikoletise tasemega, mida proovite rituaalsummonida.

source: Cyber Ogre
et: Küber Ogre

source: By discarding this card from your hand to the Graveyard, negate 1 battle involving a "<M6854>Cyber Ogre<M>" on your side of the field, and it gains 2000 ATK until the end of its next battle. This effect can be activated during either player's turn.
et: Kui saadad selle kaardi oma käest Hauakambrisse, tühista 1 lahing, milles osaleb sinu väljaku "<M6854>Cyber Ogre<M>", ja see saab 2000 ATK-d kuni järgmise lahingu lõpuni. Seda efekti saab aktiveerida mõlema mängija käigu ajal.

source: Cyber Esper
et: Küber-Esper

source: While this card is in face-up Attack Position, you can look at every card your opponent draws.
et: Kui see kaart on avatud rünnakupositsioonis, saad vaadata iga kaarti, mille su vastane tõmbab.

source: Cyber Ogre 2
et: Küber Ogre 2

source: "<M6854>Cyber Ogre<M>" + "<M6854>Cyber Ogre<M>"<BR>A Fusion Summon of this monster can only be conducted with the above Fusion Material Monsters. When this card attacks, it gains ATK equal to half the ATK of the attack target, during damage calculation only.
et: "<M6854>Küber Ogre<M>" + "<M6854>Küber Ogre<M>"<BR>Selle koletise sulandumine saab toimuda ainult ülaltoodud sulandumismaterjalide koletistega. Kui see kaart ründab, saab see rünnaku sihtmärgi rünnakujõu poolse suuruse võrra rünnakujõudu juurde ainult kahju arvutamise ajal.

source: Cyber Shadow Gardna
et: Kübervari Aednik

source: Activate only during your opponent's Main Phase. After activation, Special Summon this card; it is treated as an Effect Monster Card (Machine-Type/EARTH/Level 4/ATK ?/DEF ?). (This card is still treated as a Trap Card.) If this card is selected as an attack target, the ATK and DEF of this card become the ATK and DEF of the attacking monster. This card is Set in its Spell & Trap Card Zone during your opponent's End Phase.
et: Aktiveeri ainult oma vastase peafaasis. Pärast aktiveerimist, Kutsu see kaart eriliselt välja; seda käsitletakse kui Efektikoletise Kaarti (Masina-Tüüp/MAA/Tase 4/ATK ?/DEF ?). (Seda kaarti käsitletakse endiselt kui Lõksukaarti.) Kui see kaart valitakse rünnaku sihtmärgiks, muutuvad selle kaardi ATK ja DEF ründava koletise ATK ja DEF-iks. See kaart asetatakse oma Loitsu & Lõksukaartide tsooni vastase lõppfaasis.

source: Byroad Sacrifice
et: Ohverdamine teel

source: Activate only if a monster on your side of the field is destroyed by battle. Special Summon 1 "<M6854>Cyber Ogre<M>" from your hand.
et: Aktiveeri ainult siis, kui sinu poolel väljal olev koletis hävitatakse lahingus. Kutsu eriliselt välja 1 "<M6854>Cyber Ogre<M>" oma käest.

source: Trojan Blast
et: Trooja plahvatus

source: Activate only when an opponent's card effect shifts control of a monster from your side of the field to theirs. Destroy that 1 monster and inflict damage to your opponent equal to it's ATK.
et: Aktiveeri ainult siis, kui vastase kaardi efekt nihutab kontrolli sinu poolelt väljal oleva koletise üle nende poolele. Hävita see 1 koletis ja tekita vastasele kahju, mis on võrdne selle ATK-ga.

source: Elemental Hero Knospe
et: Elementaalne Kangelane Knospe

source: Each time this card inflicts Battle Damage to your opponent: It gains 100 ATK and loses 100 DEF. While you control another face-up "Elemental HERO" monster, your opponent cannot target this card for an attack, and this card can attack your opponent directly.
et: Iga kord, kui see kaart tekitab lahingukahju sinu vastasele: see saab 100 ATK juurde ja kaotab 100 DEF. Kui sa kontrollid teist avatud "Elemental HERO" koletist, ei saa sinu vastane seda kaarti rünnaku sihtmärgiks valida ja see kaart võib sinu vastast otse rünnata.

source: Rose Bud
et: Roosi Pung

source: Tribute 1 "<M6863>Elemental Hero Knospe<M>"; Special Summon 1 "<M6866>Elemental Hero Poison Rose<M>" from your hand or Deck.
et: Ohverda 1 "<M6863>Elemental Hero Knospe<M>"; Kutsu erivälja 1 "<M6866>Elemental Hero Poison Rose<M>" oma käest või pakist.

source: Elemental Hero Poison Rose
et: Elementaalne Kangelane Mürgi Roos

source: Cannot be Normal Summoned or Set. Must be Special Summoned with "<M6865>Rose Bud<M>" and cannot be Special Summoned by other ways. Each time this card inflicts Battle Damage to your opponent: It gains 200 ATK and loses 200 DEF. Your opponent can only target "<M6866>Elemental Hero Poison Rose<M>" for attacks.
et: Ei saa normaalset kutsuda ega asetada. Peab olema eriliselt kutsutud "<M6865>Roosi Pung<M>" abil ja ei saa olla eriliselt kutsutud muul viisil. Iga kord, kui see kaart tekitab lahingukahju sinu vastasele: see saab 200 ATK ja kaotab 200 DEF. Sinu vastane saab rünnakuteks sihtida ainult "<M6866>Elementaalkangelane Mürgiroos<M>".

source: Greed Quasar
et: Ahnitse Kvasaari

source: This card's original ATK and DEF are each equal to its Level x 300. This monster's Level is increased by the Level of monsters it destroys by battle.
et: Selle kaardi algne ATK ja DEF on võrdsed selle tasemega x 300. Selle koletise tase suureneb lahingus hävitatud koletiste taseme võrra.

source: Allure Queen LV3
et: Võluvõlur LV3

source: Once per turn, during your Main Phase 1, you can select 1 Level 3 or lower monster on your opponent's side of the field and equip it to this card. (Only 1 card at a time can be equipped due to this effect.) If this card would be destroyed by battle, the equipped monster is destroyed instead. During your Standby Phase, by sending this card to the Graveyard while it's equipped due to its effect, Special Summon 1 "<M6871>Allure Queen LV5<M>" from your hand or Deck.
et: Korra ühe korra oma peafaas 1 jooksul saad valida ühe 3. taseme või madalama koletise oma vastase väljaku poolel ja kinnitada see kaart sellele kaardile. (Selle efekti tõttu saab korraga kinnitada ainult ühe kaardi.) Kui see kaart hävitatakse lahingus, hävitatakse selle asemel kinnitatud koletis. Oma ooteetapi jooksul, saates selle kaardi Hauakambrisse, kui see on kinnitatud oma efekti tõttu, kutsu eriliselt välja 1 "<M6871>Allure Queen LV5<M>" oma käest või pakist.

source: Allure Queen LV5
et: Võluvõlur LV5

source: Once per turn, during your Main Phase, if this card was Special Summoned by the effect of "<M6870>Allure Queen LV3<M>", you can select 1 Level 5 or lower monster on your opponent's side of the field and equip it to this card. (Only 1 card at a time can be equipped due to this effect.) If this card would be destroyed by battle, the equipped monster is destroyed instead. During your Standby Phase, by sending this card to the Graveyard while it's equipped due to its effect, Special Summon 1 "<M6872>Allure Queen LV7<M>" from your hand or Deck.
et: Korra ühe korra oma peafaasil, kui see kaart kutsuti eriliselt välja "<M6870>Allure Queen LV3<M>" efekti abil, saad valida 1 taseme 5 või madalama koletise oma vastase väljaku poolel ja kinnitada see kaart sellele kaardile. (Ainult 1 kaart korraga saab olla kinnitatud selle efekti tõttu.) Kui see kaart hävitatakse lahingus, hävitatakse selle asemel kinnitatud koletis. Oma ooteetapis, saates selle kaardi Hauakambrisse, kui see on kinnitatud oma efekti tõttu, kutsu eriliselt välja 1 "<M6872>Allure Queen LV7<M>" oma käest või pakist.

source: Allure Queen LV7
et: Võluvõimu Kuninganna LV7

source: Once per turn, during your Main Phase, if this card was Special Summoned by the effect of "<M6871>Allure Queen LV5<M>", you can select 1 monster on your opponent's side of the field and equip it to this card. (Only 1 card at a time can be equipped due to this effect.) If this card would be destroyed by battle, the equipped monster is destroyed instead.
et: Kord ühe korra oma peafaasis, kui see kaart kutsuti eriliselt välja "<M6871>Allure Queen LV5<M>" efekti abil, saad valida ühe koletise oma vastase väljaku poolelt ja kinnitada selle sellele kaardile. (Selle efekti tõttu saab korraga kinnitada ainult ühe kaardi.) Kui see kaart hävitatakse lahingus, hävitatakse selle asemel kinnitatud koletis.

source: Dark Lucius LV4
et: Tume Lucius LV4

source: The effects of your opponent's monsters that this card destroys by battle are negated. During your next Standby Phase after this card destroys a monster by battle, by sending this card to the Graveyard, Special Summon 1 "<M6877>Dark Lucius LV6<M>" from your hand or Deck.
et: Selle kaardi poolt lahingus hävitatud vastase koletiste efektid on tühistatud. Järgmise Ootefaasil pärast seda, kui see kaart hävitab lahingus koletise, saad selle kaardi Hauakambrisse saates eriliselt kutsuda 1 "<M6877>Dark Lucius LV6<M>" oma käest või pakist.

source: Dark Lucius LV6
et: Tume Lucius LV6

source: If this card was Special Summoned by the effect of "<M6876>Dark Lucius LV4<M>", the effects of your opponent's monsters that this card destroys by battle are negated. During your next Standby Phase after this card has negated your opponent's monster effect, by sending this card to the Graveyard, Special Summon 1 "<M6878>Dark Lucius LV8<M>" from your hand or Deck.
et: Kui see kaart kutsuti eriliselt välja "<M6876>Dark Lucius LV4<M>" efekti abil, siis selle kaardi poolt lahingus hävitatud vastase koletiste efektid tühistatakse. Järgmise Ootefaasina pärast seda, kui see kaart on tühistanud vastase koletise efekti, saad selle kaardi Hauakambrisse saates eriliselt välja kutsuda 1 "<M6878>Dark Lucius LV8<M>" oma käest või pakist.

source: Dark Lucius LV8
et: Tume Lucius LV8

source: If this card was Special Summoned by the effect of "<M6877>Dark Lucius LV6<M>", your opponent's monsters that this card destroys by battle are removed from play, and their effects are negated.
et: Kui see kaart kutsuti eriliselt välja "<M6877>Dark Lucius LV6<M>" efekti abil, eemaldatakse sinu vastase koletised, mille see kaart lahingus hävitab, mängust ja nende efektid tühistatakse.

source: Snipe Hunter
et: Viskejaht

source: You can discard 1 card to select 1 card on the field and roll a six-sided die. If the result is not 1 or 6, destroy the selected card.
et: Saad ühe kaardi ära visata, et valida üks kaart väljal ja veeretada kuuepoolset täringut. Kui tulemus ei ole 1 või 6, hävita valitud kaart.

source: Blast Asmodian
et: Plahvatus Asmodian

source: If any Spell or Trap Card(s) are Chained, inflict 500 damage to your opponent.
et: Kui mõni Võlu- või Lõksukaart on aheldatud, põhjusta oma vastasele 500 kahju.

source: Vanity's Fiend
et: Edvistuse Deemon

source: This card cannot be Special Summoned. While this card is on the field, neither player can Special Summon monsters.
et: Seda kaarti ei saa eriliselt kutsuda. Kui see kaart on väljakul, ei saa kumbki mängija eriliselt kutsuda koletisi.

source: Barrier Statue of the Abyss
et: Kuristiku barjäär

source: No monsters can be Special Summoned, except for DARK monsters.
et: Ühtegi koletist ei saa eriliselt kutsuda, välja arvatud PIMEDAD koletised.

source: Barrier Statue of the Torrent
et: Tõkestuskuju - Vool

source: No monsters can be Special Summoned, except for WATER monsters.
et: Erilisi ei saa kutsuda ühtegi koletist, välja arvatud VEE koletised.

source: Barrier Statue of the Inferno
et: Põrgu barjäärkuju

source: No monsters can be Special Summoned, except for FIRE monsters.
et: <translated Ühtegi koletist ei saa eriliselt kutsuda, välja arvatud TULE koletised.

source: Barrier Statue of the Stormwinds
et: Tormituulte Tõkkestaat

source: No monsters can be Special Summoned, except for WIND monsters.
et: Erilisi ei saa eriliselt kutsuda, välja arvatud TUULE koletised.

source: Barrier Statue of the Drought
et: Kuivuse Barjäärist Kuju

source: No monsters can be Special Summoned, except for EARTH monsters.
et: Ühtegi koletist ei saa eriliselt kutsuda, välja arvatud MAA koletised.

source: Barrier Statue of the Heavens
et: Taevane tõkkekuju

source: No monsters can be Special Summoned, except for LIGHT monsters.
et: Erilisi ei saa kutsuda ühtegi koletist peale VALGUSE koletiste.

source: Vanity's Ruler
et: Edvistuse Valitseja

source: This card cannot be Special Summoned. While this card is on the field, your opponent cannot Special Summon monsters.
et: Seda kaarti ei saa eriliselt kutsuda. Kui see kaart on väljakul, ei saa sinu vastane eriliselt kutsuda koletisi.

source: Iris, the Earth Mother
et: Iiris, Maaema

source: After a Chain with 3 or more Links resolves, draw 1 card. This effect cannot activate if multiple cards/effects with the same name were activated in that Chain.
et: Pärast 3 või enama lingiga ahela lahendamist tõmba 1 kaart. See efekt ei saa aktiveeruda, kui selles ahelas aktiveeriti mitu sama nimega kaarti/efekti.

source: Lightning Punisher
et: Piksekaristaja

source: After a Chain with 3 or more Links resolves, destroy 1 card on your opponent's side of the field. This effect cannot activate if multiple cards/effects with the same name were activated in that Chain.
et: Pärast 3 või enama lingiga ahela lahendamist hävita 1 kaart oma vastase väljaku poolel. Seda efekti ei saa aktiveerida, kui selles ahelas aktiveeriti mitu sama nimega kaarti/efekti.

source: Queen's Bodyguard
et: Kuninganna ihukaitsja

source: "Allure Queen" monsters on your side of the field cannot be selected as an attack target.
et: Sinu väljaku "Allure Queen" koletisi ei saa valida rünnaku sihtmärgiks.

source: Combo Fighter
et: Kombovõitleja

source: If a Chain (of 2 or more Links) occurred in your Main Phase 1, this card can attack twice during the Battle Phase this turn.
et: Kui sinu peafaas 1 ajal toimus ahel (2 või enama lüliga), võib see kaart sellel käigul lahingufaasis kaks korda rünnata.

source: Combo Master
et: Kombomeister

source: Man Beast of Ares
et: Aresi Meesloom

source: After a Chain (of 2 or more Links) resolves, this card gains 500 ATK.
et: Pärast ahela (2 või enama lüliga) lahendamist saab see kaart 500 ATK juurde.

source: Rampaging Rhynos
et: Möllav Rhynos
