Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: Many have been deceived by the beauty of this vampire.
et: Paljud on selle vampiiri ilu poolt petetud.

source: Shining Abyss
et: Särav Kuristik

source: This monster employs the powers of both Light and Darkness.
et: See koletis kasutab nii Valguse kui Pimeduse jõude.

source: Archfiend of Gilfer
et: Gilferi deemon

source: When this card is sent to the Graveyard, you can select 1 monster on the field and equip it with this card. The equipped monster loses 500 ATK.
et: Kui see kaart saadetakse Hauakambrisse, saad valida 1 koletise väljal ja varustada see selle kaardiga. Varustatud koletis kaotab 500 ATK.

source: Gadget Soldier
et: Vidina Sõdur

source: A rust free machine warrior born to battle.
et: Lahinguks sündinud roostevaba masinasõdalane.

source: Grand Tiki Elder
et: Suure Tiki Vanem

source: A masked monster that wields the most deadly of curses.
et: Maskiga koletis, kes valdab kõige surmavamaid needusi.

source: The Masked Beast
et: Maskeeritud metsaline

source: This card can only be Ritual Summoned with the Ritual Spell Card, "<M5103>Curse of the Masked Beast<M>".
et: Seda kaarti saab rituaalsummonida ainult rituaal-loitsukaardiga "<M5103>Maskeeritud metsalise needus<M>".

source: Melchid the Four-Face Beast
et: Neljanäoline metsaline Melchid

source: This monster has four different masks for four different attacks.
et: Sellel koletisel on neli erinevat maski nelja erineva rünnaku jaoks.

source: Nuvia the Wicked
et: Kuri Nuvia

source: If this monster is Normal Summoned, destroy this card. If your opponent controls any monster, decrease the ATK of this card by 200 points for each monster on your opponent's side of the field.
et: Kui see koletis on normaalne kutsutud, hävita see kaart. Kui sinu vastane kontrollib mõnda koletist, vähenda selle kaardi ATK-d 200 punkti võrra iga koletise eest, mis on sinu vastase poolel väljal.

source: Masked Beast Des Gardius
et: Maskeeritud metsaline Des Gardius

source: This card cannot be Normal Summoned or Set. This card cannot be Special Summoned except by Tributing 2 monsters, including at least 1 "<M5093>Grand Tiki Elder<M>" or "<M5095>Melchid the Four-Face Beast<M>". When this card is sent from the field to the Graveyard, equip 1 "<M5098>The Mask of Remnants<M>" from your Deck to 1 monster on the field.
et: Seda kaarti ei saa normaalset kutsuda ega asetada. Seda kaarti ei saa eriliselt kutsuda, välja arvatud 2 koletise ohverdamise teel, sealhulgas vähemalt 1 "<M5093>Grand Tiki Elder<M>" või "<M5095>Melchid the Four-Face Beast<M>". Kui see kaart saadetakse väljakult hauakambrisse, varusta 1 "<M5098>The Mask of Remnants<M>" oma pakist ühele koletisele väljakul.

source: The Mask of Remnants
et: Jäänuste Mask

source: Shuffle this card into its owner's Deck, OR if this card was put into play by the effect of "<M5097>Masked Beast Des Gardius<M>", this card is treated as an Equip Card. Control of the equipped monster is switched.
et: Sega see kaart selle omaniku pakki, VÕI kui see kaart pandi mängu "<M5097>Masked Beast Des Gardius<M>" efekti abil, käsitletakse seda kaarti kui Varustuskaarti. Varustatud koletise kontroll vahetatakse.

source: Soul Exchange
et: Hingede vahetus

source: Select 1 monster your opponent controls. This turn you can Tribute that monster as if you controlled it. You cannot conduct your Battle Phase the turn you activate this card.
et: Vali 1 koletis, mida sinu vastane kontrollib. Sellel käigul saad sa selle koletise ohverdada, justkui sa kontrolliksid seda. Sa ei saa läbi viia oma Lahingufaasi sellel käigul, mil sa aktiveerid selle kaardi.

source: Chosen One
et: Valitu

source: Select 1 Monster Card and 2 non-Monster Cards from your hand. Your opponent randomly selects 1 card among them. If it is a Monster Card, it is Special Summoned and send the remaining 2 cards to the Graveyard. If not, send all the cards to the Graveyard.
et: Vali oma käest 1 Koletis Kaart ja 2 mitte-Koletis Kaarti. Sinu vastane valib juhuslikult ühe kaardi nende seast. Kui see on Koletis Kaart, kutsutakse see eriliselt välja ja ülejäänud 2 kaarti saadetakse Hauakambrisse. Kui ei, saadetakse kõik kaardid Hauakambrisse.

source: Mask of Weakness
et: Nõrkuse Mask

source: Target attacking monster loses 700 ATK until the end of this turn.
et: Sihtmärgiks olev ründav koletis kaotab 700 ATK-d kuni selle käigu lõpuni.

source: Curse of the Masked Beast
et: Maskeeritud metsalise needus

source: This card is used to Ritual Summon "<M5094>The Masked Beast<M>". You must also Tribute monsters whose total Level equal 8 or more from the field or your hand.
et: Seda kaarti kasutatakse "<M5094>The Masked Beast<M>" rituaalsummonimiseks. Sa pead ka ohverdama koletisi, kelle kogutase on 8 või rohkem, kas väljakult või oma käest.

source: Mask of Dispel
et: Hajutamise Mask

source: Select 1 face-up Spell Card on the field. The controller of the Spell Card must take 500 points of damage during each of your Standby Phases. When the selected card is removed from the field, destroy this card.
et: Vali 1 avatud Võlukaart väljal. Võlukaardi kontrollija peab võtma 500 punkti kahju iga sinu Ootefaaside ajal. Kui valitud kaart eemaldatakse väljast, hävita see kaart.

source: Mask of Restrict
et: Piirangumask

source: Monsters cannot be Tributed.
et: Koletisi ei saa ohverdada.

source: Mask of the Accursed
et: Neetud mask

source: The monster equipped with this card cannot attack. The controller of the equipped monster takes 500 points of damage during each of your Standby Phases.
et: Selle kaardiga varustatud koletis ei saa rünnata. Varustatud koletise kontrollija saab iga sinu Ootefaasiga 500 punkti kahju.

source: Mask of Brutality
et: Brutaalsuse Mask

source: Increase the ATK of a monster equipped with this card by 1000 points and decrease its DEF by 1000 points. Pay 1000 Life Points during each of your Standby Phases. If you do not, destroy this card.
et: Suurenda selle kaardiga varustatud koletise ATK-d 1000 punkti võrra ja vähenda selle DEF-i 1000 punkti võrra. Maksa iga oma Ootefaaside ajal 1000 Elupunkti. Kui sa seda ei tee, hävita see kaart.

source: Return of the Doomed
et: Hukkunute tagasitulek

source: Discard 1 Monster Card from your hand to the Graveyard. Return 1 of your monsters destroyed and sent to your Graveyard as a result of battle during this turn to your hand at the end of this turn.
et: Viska 1 koletise kaart oma käest hauakambrisse. Tagasta 1 oma koletistest, mis hävitati ja saadeti selle käigu jooksul lahingu tulemusena hauakambrisse, oma kätte selle käigu lõpus.

source: Lightning Blade
et: Välgunuga

source: Equip only to a Warrior-Type monster. It gains 800 ATK. All WATER monsters lose 500 ATK.
et: Varusta ainult Sõdalase-tüüpi koletisele. See saab 800 ATK juurde. Kõik VEE koletised kaotavad 500 ATK.

source: Tornado Wall
et: Tornaadimüür

source: Activate only while "<M4340>Umi<M>" is on the field. As long as "<M4340>Umi<M>" remains face-up on the field, you take no damage from attacking monsters. When "<M4340>Umi<M>" is removed from the field, destroy this card.
et: Aktiveeri ainult siis, kui "<M4340>Umi<M>" on väljakul. Kuni "<M4340>Umi<M>" jääb väljakule avatud olekus, ei saa sa ründavatelt koletistelt kahju. Kui "<M4340>Umi<M>" eemaldatakse väljakult, hävita see kaart.

source: Infinite Dismissal
et: Lõputu Tagasilükkamine

source: Level 3 or lower monsters are destroyed during the End Phase of the turn that they are Normal Summoned or Flip Summoned.
et: 3. või madalama tasemega koletised hävitatakse selle käigu lõppfaasis, mil nad on Normaal- või Pöördkutsutud.

source: Fairy Box
et: Haldjakarp

source: Each time a monster on your opponent's side of the field attacks, toss a coin and call Heads or Tails. If you call it right, the attacking monster's ATK becomes 0 only during the Battle Phase. Pay 500 Life Points during each of your Standby Phases. If you do not, this card is destroyed.
et: Iga kord, kui sinu vastase poolel olev koletis ründab, viska münti ja ütle "Kull" või "Kiri". Kui arvad õigesti, muutub ründava koletise ATK ainult Lahingu Faasi ajal 0-ks. Maksa iga oma Ootefaasi ajal 500 Elupunkti. Kui sa seda ei tee, hävitatakse see kaart.

source: Torrential Tribute
et: Torrentialne ohverdus

source: Activate only when a monster is Summoned. Destroy all monsters on the field.
et: Aktiveeri ainult siis, kui koletis kutsutakse välja. Hävita kõik koletised väljakul.

source: Multiplication of Ants
et: Sipelgate paljunemine

source: Offer 1 Insect-Type Monster on your side of the field as a Tribute. Special Summon 2 "<M3906>Army Ant Token<M>"(s) (Insect-Type/EARTH/4 Stars/ATK 500/DEF 1200) on your side of the field. The tokens cannot be used as a Tribute for a Tribute Summon.
et: Paku 1 putuka-tüüpi koletis oma väljaku poolelt ohvriks. Kutsu eriliselt välja 2 "<M3906>Armee Sipelga Token<M>"(it) (Putuka-tüüpi/MAA/4 Tähte/ATK 500/DEF 1200) oma väljaku poolele. Tokeneid ei saa kasutada ohvriks ohverdamise jaoks.

source: De-Fusion
et: De-Fusioon

source: Select 1 face-up Fusion Monster on the field and return it to the Extra Deck. If all the Fusion Material Monsters that were used for the Fusion Summon of that Fusion Monster are in your Graveyard, you can Special Summon them.
et: Vali 1 avatud Nähtavuse Fusion Monster väljal ja tagasta see Extra Decki. Kui kõik Fusion Material Monsters, mida kasutati selle Fusion Monsteri Fusion Summoniks, on sinu Hauakambris, saad need Special Summonida.

source: Jam Breeding Machine
et: Limamassina

source: During each of your Standby Phases, Special Summon 1 "<M3907>Slime Token<M>" (Aqua-Type/WATER/LEVEL 1/ATK 500/DEF 500) in Attack Position to your side of the field. As long as this card remains face-up on the field, you cannot Normal Summon, Flip Summon, or Special Summon any other monster (except Slime Tokens).
et: Iga oma ootejärgu ajal kutsu eriliselt välja 1 "<M3907>Slime Token<M>" (Aqua-tüüp/VEES/TASE 1/RÜNNAK 500/KAITSE 500) rünnakupositsioonis oma väljaku poolele. Nii kaua kui see kaart jääb väljale avatud olekusse, ei saa sa normaalset kutsumist, ümberpööramist ega erilist kutsumist teha ühegi teise koletisega (välja arvatud Slime Tokenid).

source: Nightmare's Steelcage
et: Õudusunenäo Teraspuur

source: This card remains face-up on the field for 2 of your opponent's turns. No monsters can attack. Destroy this card during your opponent's 2nd End Phase after this card was activated.
et: See kaart jääb lahinguväljale avatud olekus 2 vastase käigu jooksul. Ükski koletis ei saa rünnata. Hävita see kaart oma vastase 2. lõppfaasis pärast selle kaardi aktiveerimist.

source: Infinite Cards
et: Lõputud Kaardid

source: There is no limit to the number of cards in players' hands.
et: Mängijate käes olevate kaartide arvule ei ole piirangut.

source: Jam Defender
et: Moosi Kaitsja

source: When your opponent attacks a monster you control, you can change the attack target to a "<M5063>Revival Jam<M>" you control.
et: Kui sinu vastane ründab sinu kontrollitavat koletist, saad rünnaku sihtmärgi muuta sinu kontrollitava "<M5063>Revival Jam<M>" peale.

source: Card of Safe Return
et: Turvalise naasmise kaart

source: When a monster is Special Summoned from your Graveyard, you can draw 1 card.
et: Kui sinu kalmistult kutsutakse eriliselt välja koletis, saad tõmmata 1 kaardi.

source: Magic Cylinder
et: Maagiline Silinder

source: Negate the attack of 1 of your opponent's monsters and inflict damage to your opponent equal to its ATK.
et: Tühista 1 vastase koletise rünnak ja tekita vastasele kahju, mis on võrdne selle ATK-ga.

source: Solemn Wishes
et: Pühalikud Soovid

source: Increase your Life Points by 500 points each time you draw a card (or cards).
et: Suurenda oma Elupunkte 500 punkti võrra iga kord, kui tõmbad kaardi (või kaarte).

source: Burning Land
et: Põlev Maa

source: Destroy all Field Spell Cards on the field. Inflict 500 points of damage to each player's Life Points during his/her Standby Phases.
et: Hävita kõik väliloitsukaardid väljal. Tekita 500 punkti kahju iga mängija elupunktidele tema ooteetappide ajal.

source: Cold Wave
et: Külm Laine

source: This card can only be activated at the start of your Main Phase 1. Until your next turn, you and your opponent cannot play or Set any Spell or Trap Cards.
et: Seda kaarti saab aktiveerida ainult oma peafase 1 alguses. Kuni sinu järgmise käiguni ei saa sina ega sinu vastane mängida ega asetada ühtegi loitsu- või lõksukaarti.

source: Fairy Meteor Crush
et: Haldja Meteori Purustus

source: When a monster equipped with this card attacks a Defense Position monster, it inflicts piercing damage.
et: Kui selle kaardiga varustatud koletis ründab kaitseasendis koletist, tekitab see läbistavat kahju.

source: Limiter Removal
et: Piiraja eemaldamine

source: Double the ATK of all face-up Machine-Type monsters you control, until the end of this turn. During the End Phase, destroy all monsters that were affected by this effect.
et: Kahekordista kõigi sinu kontrolli all olevate avatud Masinatüüpi koletiste ATK selle käigu lõpuni. Lõppfaasi ajal hävita kõik koletised, mida see efekt mõjutas.

source: Shift
et: Vahetus

source: You can activate this card when your opponent designates 1 monster on your side of the field as a target of a Spell, Trap, or battle attack. Switch the target to another monster on your side of the field.
et: Sa saad selle kaardi aktiveerida, kui su vastane määrab 1 sinu väljaku poolel oleva koletise Loitsu, Lõksu või lahingurünnaku sihtmärgiks. Vaheta sihtmärk teise sinu väljaku poolel oleva koletise vastu.

source: Insect Imitation
et: Putuka Imitatsioon

source: Tribute 1 monster. Special Summon 1 Insect-Type monster from your Deck whose Level is 1 higher than the Tributed monster's.
et: Ohverda 1 koletis. Kutsu oma pakist välja 1 putuk-tüüpi koletis, mille tase on 1 võrra kõrgem kui ohverdatud koletisel.

source: Dimensionhole
et: Dimensiooniauk

source: Select 1 monster on your side of the field and remove it from play until your next Standby Phase. While the monster is removed from play, the Monster Card Zone of the selected monster cannot be used.
et: Vali 1 koletis oma väljaku poolelt ja eemalda see mängust kuni oma järgmise Ootefaasini. Kui koletis on mängust eemaldatud, ei saa valitud koletise Koletise Kaardi Tsooni kasutada.

source: Magic Drain
et: Maagiatõmme

source: Negate the activation of an opponent's Spell Card, and destroy it. Your opponent can discard 1 Spell Card to negate this card's effect.
et: Vastase Võlusõnakaardi aktiveerimine tühistatakse ja see hävitatakse. Sinu vastane võib ühe Võlusõnakaardi ära visata, et selle kaardi mõju tühistada.

source: Gravity Bind
et: Gravitatsiooni Sidumine

source: Level 4 or higher monsters cannot attack.
et: Taseme 4 või kõrgemad koletised ei saa rünnata.

source: Shadow of Eyes
et: Silmade Vari

source: Activate only when your opponent Sets a Monster Card in Defense Position. Change it to face-up Attack Position. If it has a Flip Effect, it is not activated.
et: Aktiveeri ainult siis, kui sinu vastane seab koletise kaardi kaitsepositsiooni. Muuda see avatud rünnakupositsiooniks. Kui sellel on pööramise efekt, siis see ei aktiveeru.

source: Despite its small size, this monster has powerful jaws that can rip metal to shreds.
et: Vaatamata oma väikesele suurusele on sellel koletisel võimsad lõuad, mis suudavad metalli tükkideks rebida.

source: Hayabusa Knight
et: Hayabusa Rüütel

source: This card can attack twice during the same Battle Phase.
et: See kaart võib rünnata kaks korda sama Lahingu Faasi jooksul.

source: Bombardment Beetle
et: Pommitusmardikas

source: FLIP: Pick up and see 1 face-down Defense Position Monster Card on your opponent's side of the field. If it is an Effect Monster, destroy it (its Flip Effect is not activated), and if the card is not, return it to its original position.
et: FLIP: Tõsta üles ja vaata 1 vastase väljaku poolel olevat tagurpidi kaitsepositsioonis olevat koletise kaarti. Kui see on efektikoletis, hävita see (selle flip-efekt ei aktiveeru) ja kui see kaart ei ole, siis pane see tagasi algsesse asendisse.

source: 4-Starred Ladybug of Doom
et: 4-tärniline Hukkumise Leedimardikas

source: FLIP: Destroy all Level 4 monsters your opponent controls.
et: FLIP: Hävita kõik 4. taseme koletised, mida sinu vastane kontrollib.

source: A high-performance jet fighter with power capsules for variable attack capabilities.
et: Kõrge jõudlusega hävituslennuk, millel on võimekapslid muutuva rünnakuvõime jaoks.

source: Red-Moon Baby
et: Punase Kuu Beebi

source: You can Special Summon to your side of the field a monster destroyed and sent to the Graveyard as a result of battle by this card at the end of the Battle Phase.
et: Sa saad eriliselt kutsuda oma väljale koletise, mille see kaart lahingu tulemusena hävitas ja Hauakambrisse saatis Lahingufaasi lõpus.

source: Mad Sword Beast
et: Hullumeelne Mõõgakiskja

source: During battle between this attacking card and a Defense Position monster whose DEF is lower than the ATK of this card, inflict the difference as Battle Damage to your opponent.
et: Kui selle ründava kaardi ja kaitsepositsioonis oleva koletise, mille DEF on madalam kui selle kaardi ATK, vahel toimub lahing, põhjusta vahe vastasele lahingukahjuna.

source: Skull Mariner
et: Koljumeer

source: A pirate ship that appears out of the mist and sinks any seagoing vessels.
et: Piraadilaev, mis ilmub udust ja uputab kõik meresõidukid.

source: The All-Seeing White Tiger
et: Kõikenägev Valge Tiiger

source: A proud ruler of the jungle that some fear and others respect.
et: Džungli uhke valitseja, keda mõned kardavad ja teised austavad.

source: Goblin Attack Force
et: Goblinite rünnakvägi

source: If this card attacks, it is changed to Defense Position at the end of the Battle Phase. This card's battle position cannot be changed until the end of your next turn, except with a card effect.
et: Kui see kaart ründab, muudetakse see lahingufaasi lõpus kaitsepositsiooniks. Selle kaardi lahingupositsiooni ei saa muuta enne teie järgmise käigu lõppu, välja arvatud kaardi efekti abil.

source: Island Turtle
et: Saare Kilpkonn

source: A huge turtle that is often mistaken for an island.
et: Hiiglaslik kilpkonn, mida sageli peetakse saareks.

source: Wingweaver
et: Tiivulooja

source: A six-winged fairy who prays for peace and hope.
et: Kuue tiivaga haldjas, kes palvetab rahu ja lootuse eest.

source: Science Soldier
et: Teadussõdur

source: Soldiers equipped with state-of-the-art weaponry to face unknown creatures.
et: Sõdurid, kes on varustatud tipptasemel relvastusega, et seista vastu tundmatutele olenditele.

source: Souls of the Forgotten
et: Unustatud Hinged

source: A wicked spirit created by the hateful souls of those who fell in battle. It grows by assimilating the souls of its enemies.
et: Õel vaim, mille on loonud lahingus langenute vihased hinged. See kasvab, assimileerides oma vaenlaste hingi.

source: A boomerang with brains that will pursue a target to the ends of the earth.
et: Ajudega, millel on ajud, mis jälitab sihtmärki maa äärteni.

source: Rain of Mercy
et: Halastusevihm

source: Increases the Life Points of both players by 1000 points.
et: Suurendab mõlema mängija Elupunkte 1000 punkti võrra.

source: Monster Recovery
et: Koletise taastamine

source: Unite 1 of your own monsters on your side of the field and your hand with your Deck and then shuffle it. Draw the same number of cards that were in your hand from the Deck. (You cannot activate this card if you have your opponent's card in your hand.)
et: Ühenda 1 oma koletis oma väljaku poolel ja oma käes oma pakiga ning sega see läbi. Tõmba pakist sama palju kaarte, kui oli sinu käes. (Sa ei saa seda kaarti aktiveerida, kui sul on vastase kaart oma käes.)

source: Type Zero Magic Crusher
et: Tüüp Null Maagiapurustaja

source: Discard 1 Spell Card from your hand to inflict 500 points of damage to your opponent's Life Points.
et: Viska 1 loitsukaart oma käest, et tekitada vastase Elupunktidele 500 punkti kahju.

source: Yellow Luster Shield
et: Kollane Luster Kilp

source: Increase the DEF of all monsters on your side of the field by 300 points.
et: Suurenda kõigi sinu poolel olevate koletiste DEF-i 300 punkti võrra.

source: Creature Swap
et: Olendite vahetus

source: Each player chooses 1 monster they control and switches control of those monsters with each other. Those monsters cannot change their battle positions for the rest of this turn.
et: Iga mängija valib 1 koletise, mida ta kontrollib, ja vahetab nende koletiste kontrolli omavahel. Need koletised ei saa selle käigu lõpuni oma lahingupositsioone muuta.

source: Spring of Rebirth
et: Uuenemise Allikas

source: Increase your Life Points by 500 points every time monsters return from the field to the owner's hand.
et: Suurenda oma Elupunkte 500 punkti võrra iga kord, kui koletised naasevad väljakult omaniku kätte.

source: Thousand Knives
et: Tuhat Nuga

source: Activate only while you control a face-up "<M4041>Dark Magician<M>". Destroy one monster your opponent controls.
et: Aktiveeri ainult siis, kui sa kontrollid avatud "<M4041>Tume Maag<M>". Hävita üks koletis, mida sinu vastane kontrollib.

source: Mystic Box
et: Müstiline Kast

source: Select 1 monster on each side of the field. Destroy the selected opponent's monster and shift control of your selected monster to your opponent.
et: Vali 1 koletis mõlemalt väljaku poolelt. Hävita valitud vastase koletis ja anna oma valitud koletise kontroll vastasele üle.

source: Ground Collapse
et: Maa Varisemine

source: Select 2 Monster Card Zones on the field. Neither player can use the selected zones. You cannot select a zone that is occupied by a Monster Card.
et: Vali välja 2 koletise kaardi tsooni väljal. Kumbki mängija ei saa valitud tsoone kasutada. Sa ei saa valida tsooni, mis on hõivatud koletise kaardiga.

source: Dizzy Tiger
et: Pööritav Tiiger

source: Negate the effect of face-down Defense Position Flip Effect Monsters attacked by this card.
et: Tühista selle kaardiga rünnatud peidetud kaitseasendis Flip Effect Monsterite efekt.

source: Dizzy Angel
et: Pööritav Ingel

source: This card is not destroyed by the effect of "<M5174>Flipping the Table<M>".
et: Seda kaarti ei hävita "<M5174>Flipping the Table<M>" efekt.

source: Hot Sauce Bottle
et: Tšillikastme Pudel

source: When this face-down card is destroyed and sent to the Graveyard, inflict 500 damage to your opponent.
et: Kui see tagurpidi kaart hävitatakse ja saadetakse Hauakambrisse, põhjusta oma vastasele 500 kahju.

source: Flipping the Table
et: Laua ümberlükkamine

source: You can only use this card's effect while a monster that includes "Dizzy" in its card name is face-up on your side of the field. Destroy all cards except this card on your side of the field. Select and destroy cards on your opponent's field equal to the number of cards you have destroyed by this effect. You cannot Normal Summon or Set a monster the turn you use this effect.
et: Seda kaardi efekti saad kasutada ainult siis, kui sinu väljaku poolel on avatud koletis, mille kaardinimes sisaldub "Dizzy". Hävita kõik kaardid, välja arvatud see kaart, sinu väljaku poolel. Vali ja hävita vastase väljaku poolel olevad kaardid, mis on võrdne arvuga, kui palju kaarte sa selle efektiga hävitasid. Sa ei saa sellel käigul, mil sa seda efekti kasutad, normaalset kutsumist ega seadmist teha.

source: Swordsman of Doom Lithmus
et: Hukatusmees Lithmus
