Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: When a "Steelswarm" monster is Tribute Summoned by Tributing this card: You can Special Summon 1 Level 4 or lower "Steelswarm" monster from your Deck.
et: Kui "Steelswarm" koletis kutsutakse välja ohverdades selle kaardi: Sa võid eriliselt välja kutsuda 1 4. taseme või madalama "Steelswarm" koletise oma pakist.

source: Steelswarm Mantis
et: Terassülem Mantis

source: When this card is Tribute Summoned by Tributing a "Steelswarm" monster: You can pay 1000 Life Points to target 1 "Steelswarm" monster in your Graveyard: Special Summon it.
et: Kui see kaart kutsutakse välja ohverdades "Steelswarm" koletise: Sa võid maksta 1000 Elupunkti, et sihtida 1 "Steelswarm" koletis oma Hauakambris: Kutsu see eriliselt välja.

source: Steelswarm Moth
et: Terassülem Koi

source: When this card is Tribute Summoned by Tributing 1 "Steelswarm" monster: You can pay 1000 Life Points to target up to 2 cards your opponent controls; return them to the hand.
et: Kui see kaart kutsutakse välja ohverdades 1 "Steelswarm" koletise: Sa võid maksta 1000 Elupunkti, et sihtida kuni 2 kaarti, mida sinu vastane kontrollib; tagasta need käele.

source: Steelswarm Girastag
et: Terasvaar Girastag

source: You can Tribute Summon this monster in face-up Attack Position by Tributing 1 "Steelswarm" monster. When you Tribute Summon this card with a "Steelswarm" monster as a Tribute: You can target 1 card your opponent controls; send it to the Graveyard, and you gain 1000 Life Points.
et: Sa saad selle koletise ohverdussummonida avatud ründeasendis, ohverdades 1 "Steelswarm" koletise. Kui sa ohverdussummonid selle kaardi, kasutades "Steelswarm" koletist ohverdusena: Sa saad valida 1 kaardi, mida sinu vastane kontrollib; saata see Hauakambrisse ja sa saad 1000 Elupunkti.

source: Steelswarm Caucastag
et: Teraskude Caucastag

source: When this card is Tribute Summoned by Tributing 2 "Steelswarm" monsters: Activate 1 of the following effects:<BR>● Destroy all other monsters on the field.<BR>● Destroy all Spell and Trap Cards on the field.
et: Kui see kaart kutsutakse välja ohverdades 2 "Steelswarm" koletist: Aktiveeri üks järgmistest efektidest:<BR>● Hävita kõik teised koletised väljal.<BR>● Hävita kõik Võlu- ja Lõksukaardid väljal.

source: Evigishki Mind Augus
et: Evigishki Mõtte-Augus

source: This card can only be Ritual Summoned with a "Gishki" Ritual Spell Card. When this card is Ritual Summoned: Target up to 5 cards from either player's Graveyards; return them to the Deck(s)
et: Seda kaarti saab Rituaali Kutsuda ainult "Gishki" Rituaaliloitsukaardiga. Kui see kaart on Rituaali Kutsutud: Sihtige kuni 5 kaarti kummagi mängija Hauakambrist; tagastage need Pakkidesse

source: Evigishki Soul Ogre
et: Evigishki Hinge Ogre

source: This card can only be Ritual Summoned with a "Gishki" Ritual Spell Card. Once per turn: You can discard 1 "Gishki" monster to target 1 face-up card your opponent controls; return it to the Deck.
et: Seda kaarti saab Rituaali Kutsuda ainult "Gishki" Rituaali Loitsukaardiga. Kord ühe käigu jooksul: Sa võid ühe "Gishki" koletise ära visata, et sihtida ühte vastase kontrollitavat avatud kaarti; tagasta see pakki.

source: 1 Tuner + 1 or more non-Tuner "Gusto" monsters<BR>Once per turn: You can return 2 "Gusto" monsters from your Graveyard to your Deck to target 1 face-up monster your opponent controls; destroy that target.
et: 1 Tuner + 1 või rohkem mitte-Tuner "Gusto" koletist<BR>Kord ühe käigu jooksul: Sa võid oma Hauakambrist oma Paki tagasi saata 2 "Gusto" koletist, et sihtida 1 vastase kontrollitavat avatud koletist; hävita see sihtmärk.

source: 1 Tuner + 1 or more non-Tuner "Gusto" monsters<BR>Once per turn, during your End Phase: You can banish 1 WIND monster from your Graveyard to target 1 face-down card your opponent controls; destroy that target.
et: 1 Tuner + 1 või rohkem mitte-Tuner "Gusto" koletist<BR>Korra käigu jooksul, oma lõppfaasis: Sa võid oma kalmistult pagendada 1 WIND koletise, et sihtida 1 vastase kontrollitavat allapoole kaarti; hävita see sihtmärk.

source: Gishki Aquamirror
et: Gishki Vesipeegel

source: This card is used to Ritual Summon a "Gishki" Ritual Monster. You must also Tribute monsters from your field or your hand whose total Levels equal the Level of the Ritual Monster you are attempting to Ritual Summon. If this card is in your Graveyard: You can return this card to the Deck; add 1 "Gishki" Ritual Monster from your Graveyard to your hand.
et: Seda kaarti kasutatakse "Gishki" rituaalikoletise rituaaliks kutsumiseks. Sa pead ka ohverdama koletisi oma väljakult või käest, mille kogutasemed on võrdsed rituaalikoletise tasemega, mida sa üritad rituaaliks kutsuda. Kui see kaart on sinu hauas: Sa võid selle kaardi tagasi paki panna; lisa 1 "Gishki" rituaalikoletis oma hauast oma kätte.

source: Contact with Gusto
et: Kontakt Gustoga

source: Select 2 "Gusto" monsters in your Graveyard and add them to your Deck. Then, select 1 card your opponent controls, and destroy it.
et: Vali oma kalmistult 2 "Gusto" koletist ja lisa need oma pakki. Seejärel vali 1 kaart, mida sinu vastane kontrollib, ja hävita see.

source: First Step Towards Infestation
et: Esimene Samm Nakatumise Suunas

source: Return 1 face-up Tribute Summoned "Steelswarm" monster to the hand: Draw 1 card.
et: Tagasta 1 avatud ohverdamisega kutsutud "Steelswarm" koletis käes: Tõmba 1 kaart.

source: Ceremonial Mirror Meditation
et: Tseremoniaalne peeglimeditatsioon

source: Reveal 1 Ritual Spell Card in your hand to target 2 "Gishki" monsters in your Graveyard; add those targets to your hand.
et: Paljasta 1 rituaaliloitsukaart oma käes, et valida sihtmärgiks 2 "Gishki" koletist oma kalmistul; lisa need sihtmärgid oma kätte.

source: Blessings for Gusto
et: Õnnistused Gustole

source: Select 2 "Gusto" monsters in your Graveyard, and return them to your Deck. Then, select 1 "Gusto" monster in your Graveyard, and Special Summon it.
et: Vali 2 "Gusto" koletist oma Hauakambris ja tagasta need oma Pakki. Seejärel vali 1 "Gusto" koletis oma Hauakambris ja Kutsu see Eriliselt välja.

source: Infestation Wave
et: Infestatsiooni Laine

source: Return 1 face-up Tribute Summoned "Steelswarm" monster to the hand; destroy 1 card your opponent controls.
et: Tagasta 1 avatud ohverdamisega kutsutud "Steelswarm" koletis käes; hävita 1 kaart, mida sinu vastane kontrollib.

source: 1 Tuner + 1 or more non-Tuner LIGHT monsters<BR>If this card is in face-up Defense Position during your End Phase, you can add 1 Equip Spell Card from your Deck to your hand.
et: 1 Tuner + 1 või rohkem mitte-Tuner VALGUS koletist<BR>Kui see kaart on sinu lõppfaasis avatud kaitsepositsioonis, saad lisada 1 Varustuse Loitsukaardi oma pakist oma kätte.

source: Seven Swords Warrior
et: Seitsme Mõõga Sõdalane

source: 1 Tuner + 1 or more non-Tuner monsters<BR>Once per turn, when an Equip Card is equipped to this card, inflict 800 damage to your opponent. Once per turn, you can send 1 Equip Card equipped to this card to the Graveyard. When an Equip Card equipped to this card is sent to the Graveyard, you can select 1 face-up monster your opponent controls, and destroy it.
et: 1 Tuner + 1 või rohkem mitte-Tuner koletist<BR>Kord ühe käigu jooksul, kui sellele kaardile on varustuskaart varustatud, põhjusta oma vastasele 800 kahju. Kord ühe käigu jooksul, saad saata ühe sellele kaardile varustatud varustuskaardi Hauakambrisse. Kui sellele kaardile varustatud varustuskaart saadetakse Hauakambrisse, saad valida ühe vastase kontrollitava avatud koletise ja hävitada selle.

source: Ignition Beast Volcannon
et: Süütepõletaja Volcannon

source: 1 Machine-Type monster + 1 Pyro-Type monster<BR>When this card is Fusion Summoned: You can target 1 monster your opponent controls; destroy and send this card and the target to the Graveyard, and inflict damage to your opponent equal to the ATK of that target.
et: 1 Masina-tüüpi koletis + 1 Püro-tüüpi koletis<BR>Kui see kaart on Fusion Summoned: Sa võid sihtida 1 koletist, mida su vastane kontrollib; hävita ja saada see kaart ja sihtmärk Hauakambrisse ning tekita oma vastasele kahju, mis on võrdne sihtmärgi ATK-ga.

source: Vision HERO Trinity
et: Visioni KANGEL Trinity

source: 3 "HERO" monsters<BR>During the turn this card was Fusion Summoned, its ATK is double its original ATK. This Fusion Summoned card can attack 3 times during each Battle Phase. This card cannot attack your opponent directly.
et: 3 "KANGELASE" koletist<BR>Selle kaardi sulandumise ajal on selle rünnakujõud kahekordne algse rünnakujõuga. See sulandunud kaart võib rünnata 3 korda iga lahingufaasi jooksul. See kaart ei saa rünnata otse sinu vastast.

source: Troposphere
et: Troposfäär

source: If you Tribute Summon this card, the Tribute must be Winged Beast-Type. This card is unaffected by the effects of Trap Cards.
et: Kui sa ohverdad selle kaardi kutsumiseks, peab ohver olema Tiivuline Metssiga. See kaart ei ole lõksukaartide efektidest mõjutatud.

source: Fleur Synchron
et: Fleur Sünkron

source: If this card is sent to the Graveyard as a Synchro Material Monster, you can Special Summon 1 Level 2 or lower monster from your hand.
et: Kui see kaart saadetakse hauakambrisse sünkromaterjalina, saad oma käest eriliselt välja kutsuda 1. taseme 2 või madalama koletise.

source: Chevalier de Fleur
et: Fleur'i Rüütel

source: "<M9198>Fleur Synchron<M>" + 1 or more non-Tuner monsters<BR>Once during each of your turns, when your opponent activates a Spell/Trap Card, you can negate the activation and destroy that card.
et: "<M9198>Fleur Synchron<M>" + 1 või rohkem mittehäälestuskoletist<BR>Kord iga sinu käigu jooksul, kui sinu vastane aktiveerib Loitsu/Lõksukaardi, saad aktiveerimise tühistada ja selle kaardi hävitada.

source: Liberty at Last!
et: Vabadus lõpuks!

source: Activate only when a monster you control is destroyed by battle and sent to the Graveyard. Select 2 face-up monsters on the field and return them to the Deck.
et: Aktiveeri ainult siis, kui sinu kontrollitav koletis hävitatakse lahingus ja saadetakse Hauakambrisse. Vali 2 avatud koletist väljal ja tagasta need pakki.

source: Sacred Knight Joan
et: Püha Rüütel Joan

source: If this card attacks, it loses 300 ATK during the Damage Step only. When this card is destroyed by your opponent's card (either by battle or by card effect) and sent to the Graveyard, you can send 1 card from your hand to the Graveyard to add 1 Level 4 or lower Warrior-Type monster from your Graveyard to your hand.
et: Kui see kaart ründab, kaotab see ainult Kahjustuse Etapi ajal 300 ATK. Kui see kaart hävitatakse sinu vastase kaardi (kas lahingus või kaardi efekti tõttu) poolt ja saadetakse Hauakambrisse, saad saata 1 kaardi oma käest Hauakambrisse, et lisada 1 Tase 4 või madalama Tüüp-Sõdalane koletis oma Hauakambrist oma kätte.

source: Scrap Archfiend
et: Rämpsu Kuradikutsar

source: Amazoness Scouts
et: Amazoonia skaudid

source: During either player's turn, you can Tribute this card. If you do, during this turn, face-up "Amazoness" monsters you control cannot be targeted by Effect Monsters' effects and cannot be destroyed by the effects of Spells, Traps or Effect Monsters.
et: Mõlema mängija käigu ajal võid sa ohverdada selle kaardi. Kui sa seda teed, siis selle käigu ajal ei saa sinu kontrollitavaid avatud "Amazoness" koletisi sihtida Efektikoletiste efektidega ning neid ei saa hävitada Loitsude, Lõksude või Efektikoletiste efektidega.

source: Naturia Pineapple
et: Naturia Ananass

source: All face-up monsters you control are treated as Plant-Type. During your Standby Phase, if you do not control a face-up "<M9204>Naturia Pineapple<M>", and have no monsters in your Graveyard except Plant or Beast-Type: You can Special Summon this card from your Graveyard. You must not control any Spell or Trap Cards to activate and resolve this effect.
et: Kõiki sinu kontrolli all olevaid avatud koletisi käsitletakse Taim-Tüüpi koletistena. Sinu Ootefaasil, kui sa ei kontrolli avatud "<M9204>Naturia Pineapple<M>", ja sinu Hauas ei ole ühtegi koletist peale Taim- või Metssiga-Tüüpi koletiste: Sa võid selle kaardi oma Hauast Eriliselt Kutsuda. Selle efekti aktiveerimiseks ja lahendamiseks ei tohi sul olla ühtegi Loitsu ega Lõksu Kaarti kontrolli all.

source: D.D. Destroyer
et: D.D. Hävitaja

source: When this card on the field is removed from play, you can select 1 face-up card your opponent controls and destroy it.
et: Kui see kaart mänguväljakult eemaldatakse, saad valida ühe vastase kontrollitava avatud kaardi ja hävitada selle.

source: Dark Desertapir
et: Tume Kõrbeapir

source: When this card is removed from play, you can select 1 Level 4 or lower Beast-Type monster in your Graveyard and Special Summon it.
et: Kui see kaart mängust eemaldatakse, saad valida oma kalmistul ühe 4. taseme või madalama metsalise tüüpi koletise ja kutsuda see eriliselt välja.

source: Psychic Nightmare
et: Psüühiline Õudusunenägu

source: 1 Tuner + 1 or more non-Tuner Psychic-Type monsters<BR>Once per turn, during your Main Phase, you can pick 1 random card in your opponent's hand and call what type of card it is (Monster, Spell or Trap). If you call it right, this card gains 1000 ATK until your opponent's End Phase.
et: 1 Tuner + 1 või rohkem mitte-Tuner Psüühika-tüüpi koletist<BR>Kord käigu jooksul, oma peafaasis, saad valida 1 juhusliku kaardi oma vastase käest ja nimetada, mis tüüpi kaart see on (Koletis, Loits või Lõks). Kui nimetad õigesti, saab see kaart 1000 ATK kuni sinu vastase lõppfaasini.

source: Guts of Steel
et: Terassüda

source: Select 3 "Scrap" monsters in your Graveyard. Your opponent picks 1 of them, you Special Summon it to either player's side of the field, and remove the others from play.
et: Vali 3 "Scrap" koletist oma kalmistul. Sinu vastane valib neist ühe, sina kutsud selle eriliselt välja kas enda või vastase väljale, ja eemalda teised mängust.

source: Amazoness Heirloom
et: Amazoniite pärand

source: Equip only to an "Amazoness" monster. Once per turn, that monster cannot be destroyed by battle. When the equipped monster attacks, after damage calculation, destroy the attack target.
et: Varusta ainult "Amazoness" koletisega. Kord korduse jooksul ei saa seda koletist lahingus hävitada. Kui varustatud koletis ründab, hävita pärast kahju arvutamist rünnaku sihtmärk.

source: Amazoness Shamanism
et: Amazoonlaste šamanism

source: Destroy all face-up "Amazoness" monsters you control. Then, you can Special Summon any number of Level 4 or lower "Amazoness" monsters from your Graveyard in face-up Defense Position, up to the number of monsters destroyed by this effect.
et: Hävita kõik avatud "Amazoness" koletised, mida sa kontrollid. Seejärel saad sa eriliselt kutsuda ükskõik millise arvu 4. taseme või madalamaid "Amazoness" koletisi oma hauakambrist avatud kaitsepositsioonis, kuni selle efekti poolt hävitatud koletiste arvuni.

source: Super Rush Recklessly
et: Super Kiir Rünnak

source: Select 1 face-up Beast-Type monster you control and 1 monster your opponent controls. Destroy your monster, and return the opponent's monster to the Deck.
et: Vali 1 avatud Nähtav Looma-tüüpi koletis, mida sa kontrollid, ja 1 koletis, mida sinu vastane kontrollib. Hävita oma koletis ja tagasta vastase koletis pakki.

source: You can banish both this face-up card and one face-up Normal Monster you control to Special Summon 1 "Gem-Knight" Fusion Monster from your Graveyard.
et: Saad selle avatud kaardi ja ühe avatud Tavalise Koletise, mida sa kontrollid, eemaldada mängust, et Kutsuda Eriliselt välja 1 "Gem-Knight" Fusion Koletis oma Hauakambrist.

source: When this card is Normal Summoned: Target 1 Equip Spell Card in your Graveyard; banish it, and add it to your hand during your next Standby Phase.
et: Kui see kaart on Normaal-Kutsutud: Sihti 1 Varustusloitsu Kaart oma Hauakambris; pagenda see ja lisa see oma kätte oma järgmise Ootefaasil.

source: Laval Twin Slayer
et: Laval Kaksikute Tapja

source: 1 Tuner + 1 or more non-Tuner FIRE monsters<BR>This card gains effects based on the number of "Laval" monsters in your Graveyard.<BR>● 2+: Once per turn, if this card destroys a Defense Position monster by battle: it can attack once again in a row.<BR>● 3+: During a battle between this attacking card and a Defense Position monster, inflict piercing Battle Damage to your opponent.
et: 1 Tuner + 1 või rohkem mitte-Tuner FIRE koletist<BR>See kaart saab efekte, mis põhinevad sinu Hauakambris olevate "Laval" koletiste arvul.<BR>● 2+: Kord ühe käigu jooksul, kui see kaart hävitab lahingus Kaitseasendis koletise: see võib rünnata veel kord järjest.<BR>● 3+: Lahingu ajal selle ründava kaardi ja Kaitseasendis koletise vahel, põhjusta vastasele läbistavat Lahingukahju.

source: Junk Defender
et: Rämekaitsja

source: When an opponent's monster declares a direct attack: You can Special Summon this card from your hand. Once per turn: You can have this card gain 300 DEF, until the End Phase. This effect can be activated during your opponent's turn.
et: Kui vastase koletis kuulutab välja otsese rünnaku: Sa võid selle kaardi oma käest eriliselt kutsuda. Kord käigu jooksul: Sa võid sellel kaardil lasta saada 300 DEF juurde kuni lõppfaasini. Seda efekti saab aktiveerida vastase käigu ajal.

source: 1 DARK Tuner + 1 non-Tuner Beast-Type monster<BR>If this card attacks, your opponent cannot activate any Spell or Trap Cards until the end of the Damage Step. When this card is destroyed by battle and sent to the Graveyard, while you control no monsters, you can discard 1 card to Special Summon this card from the Graveyard in face-up Defense Position.
et: 1 Pimeduse Tüürihäälestaja + 1 mitte-Tüürihäälestaja Koletis-Tüüpi koletis<BR>Kui see kaart ründab, ei saa sinu vastane aktiveerida ühtegi Loitsu ega Lõksukaarti kuni Kahjustuse Etapi lõpuni. Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse, samal ajal kui sul pole ühtegi koletist, võid sa ühe kaardi ära visata, et see kaart Hauakambrist eriliselt kutsuda näoga üles Kaitseasendisse.

source: 1 DARK Tuner + 1 non-Tuner Insect-Type monster<BR>This card cannot be destroyed by battle. If this card attacks an opponent's monster that has higher ATK than this card: That monster's ATK becomes the same as this card's, until the end of the Battle Phase. When this card destroys an opponent's monster by battle and sends it to the Graveyard: Send the top 3 cards of your opponent's Deck to the Graveyard.
et: 1 Pimeduse Tüüri + 1 mitte-Tüüri Putukate-tüüpi koletis<BR>Seda kaarti ei saa lahingus hävitada. Kui see kaart ründab vastase koletist, mille ATK on sellest kaardist kõrgem: Selle koletise ATK muutub sama suureks kui selle kaardi oma kuni Lahingufaasi lõpuni. Kui see kaart hävitab lahingus vastase koletise ja saadab selle Hauakambrisse: Saada vastase paki 3 ülemist kaarti Hauakambrisse.

source: 1 DARK Tuner + 1 or more non-Tuner Machine-Type monsters<BR>Once per turn: You can target 1 "Reactor" monster or1 "<M7999>Giant Bomber Air Raid<M>" in your Graveyard; Special Summon it, ignoring the Summoning conditions. When this card is destroyed and sent to the Graveyard: You can Special Summon 1 Level 5 or lower Machine-Type monster from your hand.
et: 1 Pimeduse Tüüri + 1 või rohkem mitte-Tüüri Masinatüüpi koletist<BR>Kord kord: Sa võid sihtida 1 "Reaktori" koletist või 1 "<M7999>Giant Bomber Air Raid<M>" oma Hauas; Kutsu see eriliselt välja, ignoreerides kutsumise tingimusi. Kui see kaart hävitatakse ja saadetakse Hauale: Sa võid eriliselt välja kutsuda 1 5. taseme või madalama Masinatüüpi koletise oma käest.

source: Driven Daredevil
et: Julge Julgeolek

source: 1 Warrior-Type Tuner + 1 or more non-Tuner Warrior-Type monsters<BR>If this card is attacked by an opponent's monster that has more ATK than this card, this card cannot be destroyed by battle. Then, destroy the monster that this card battled with at the end of the Damage Step.
et: 1 Sõdalase-tüüpi Tuner + 1 või rohkem mitte-Tuner Sõdalase-tüüpi koletisi<BR>Kui selle kaardi ründab vastase koletis, mille ATK on suurem kui sellel kaardil, siis seda kaarti ei saa lahingus hävitada. Seejärel hävita koletis, millega see kaart lahingus oli, Kahjustuse etapi lõpus.

source: Blood Mefist
et: Veri Mefist

source: 1 Tuner + 1 or more non-Tuner monsters<BR>Once per turn, during your opponent's Standby Phase: You can inflict 300 damage to your opponent for each card your opponent controls. Each time your opponent Sets a Spell or Trap Card(s): Inflict 300 damage to your opponent.
et: 1 Tuner + 1 või rohkem mitte-Tuner koletist<BR>Kord käigu jooksul, oma vastase Standby Phase ajal: Sa võid oma vastasele tekitada 300 kahju iga kaardi eest, mida su vastane kontrollib. Iga kord, kui su vastane seab loitsu- või lõksukaardi(d): Tekita oma vastasele 300 kahju.

source: Malefic World
et: Kurjuse Maailm

source: While this card is face-up on the field, you can activate this effect instead of conducting a normal draw during your Draw Phase. Choose 3 "Malefic" cards from your Deck and have your opponent pick 1 of them at random to add to your hand. Shuffle the rest back into your Deck.
et: Kui see kaart on lahinguväljal avatud, võid selle efekti aktiveerida tavalise tõmbamise asemel oma Tõmbefaasis. Vali oma pakist 3 "Malefic" kaarti ja lase oma vastasel valida neist juhuslikult 1, mis lisatakse sinu kätte. Sega ülejäänud tagasi oma pakki.

source: Malefic Claw Stream
et: Kurja küünisvoog

source: Activate only if you control a face-up "Malefic" monster. Select 1 monster your opponent controls, and destroy it.
et: Aktiveeri ainult siis, kui sa kontrollid avatud "Malefic" koletist. Vali 1 koletis, mida sinu vastane kontrollib, ja hävita see.

source: Boost Warrior
et: Tugevdussõdalane

source: If you control a face-up Tuner monster, you can Special Summon this card from your hand in face-up Defense Position. All Warrior-Type monsters you control gain 300 ATK.
et: Kui sa kontrollid avatud Tuner koletist, saad selle kaardi oma käest eriliselt kutsuda avatud kaitsepositsioonis. Kõik Sõdalase-tüüpi koletised, mida sa kontrollid, saavad 300 ATK juurde.

source: Justice Bringer
et: Õigluse Tooja

source: Once per turn, when a Special Summoned monster your opponent controls activates its effect, you can negate the activation.
et: Korra ühe korra käigu jooksul, kui sinu vastase kontrollitav erikutsutud koletis aktiveerib oma efekti, saad sa aktiveerimise tühistada.

source: Bri Synchron
et: Bri Sünkron

source: If this card is sent to the Graveyard as a Synchro Material Monster, until the End Phase of this turn, the Synchro Monster that used this card as a Synchro Material Monster gains 600 ATK but its effects are negated.
et: Kui see kaart saadetakse Hauakambrisse Sünkro Materjal Koletisena, saab Sünkro Koletis, mis kasutas seda kaarti Sünkro Materjal Koletisena, kuni selle käigu Lõppfaasini 600 ATK juurde, kuid selle efektid tühistatakse.

source: Big One Warrior
et: Suur Üks Sõdalane

source: During your Main Phase, you can send 1 Level 1 monster, except this card, from your hand to the Graveyard to Special Summon this card from your hand.
et: Oma peafaasi ajal saad saata 1. taseme koletise, välja arvatud see kaart, oma käest hauakambrisse, et kutsuda see kaart oma käest eriliselt välja.

source: Battle Waltz
et: Lahingvalss

source: Select 1 face-up Synchro Monster you control. Special Summon 1 "<M3970>Waltz Token<M>" with the same Type, Attribute, Level, ATK and DEF as that monster. Players take no Battle Damage from battles involving this Token.
et: Vali 1 avatud Sünkroonkoletis, mida sa kontrollid. Kutsu eriliselt välja 1 "<M3970>Waltz Token<M>", millel on sama Tüüp, Atribuut, Tase, RÜN ja KAIT nagu sellel koletisel. Mängijad ei saa lahingukahju lahingutest, milles see Token osaleb.

source: Synchro Gift
et: Sünkroonkingitus
