Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: Once during each player's End Phase, the turn player Tributes 1 face-up monster on their side of the field and inflicts damage to the opponent equal to half of the original ATK of the Tributed Monster.
et: Kord mängija lõppfaasis ohverdab käigu sooritaja ühe avatud koletise oma väljaku poolelt ja tekitab vastasele kahju, mis on võrdne poolega ohverdatud koletise algsest rünnakust.

source: Dark Magic Curtain
et: Pimeduse Maagia Kardin

source: If you activate this card, you cannot Normal Summon, Flip Summon or Special Summon this turn. Pay half your Life Points to Special Summon 1 "<M4041>Dark Magician<M>" from your Deck.
et: Kui aktiveerid selle kaardi, ei saa sa sellel käigul Normaalset Kutsumist, Pöördkutsumist ega Erilist Kutsumist teha. Maksa pool oma Elupunktidest, et Eriliselt Kutsuda 1 "<M4041>Pimeduse Maag<M>" oma pakist.

source: Insect Barrier
et: Putukate Tõke

source: Your opponent's cannot declare an attack with any Insect-Type monsters on his/her side of the field.
et: Sinu vastane ei saa oma väljaku ühelgi putukaliigi koletisel rünnakut kuulutada.

source: Magical Arm Shield
et: Maagiline käekaitse

source: Activate only when your opponent declares an attack while you control a monster. Take control of 1 of your opponent's face-up monsters, except the attacking monster, until the end of the Battle Phase. It is attacked instead.
et: Aktiveeri ainult siis, kui sinu vastane kuulutab välja rünnaku, kui sul on koletis kontrolli all. Võta kontroll 1 oma vastase avatud koletise üle, välja arvatud ründav koletis, kuni Lahingu Faasi lõpuni. Seda rünnatakse selle asemel.

source: Fissure
et: Lõhe

source: Destroy the 1 face-up monster your opponent controls that has the lowest ATK. (If it's a tie, you get to choose.)
et: Hävita 1 avatud näoga koletis, mida sinu vastane kontrollib ja millel on madalaim ATK. (Kui on viik, saad valida.)

source: Trap Hole
et: Lõksuauk

source: When your opponent Normal Summons or Flip Summons 1 monster with 1000 or more ATK: Target that monster; destroy that target.
et: Kui su vastane kutsub normaal- või ümberpööramiskutsumisega välja 1 koletise, millel on 1000 või rohkem ATK: Sihtmärk on see koletis; hävita see sihtmärk.

source: Polymerization
et: Polümerisatsioon

source: Send, from your hand or your side of the field to the Graveyard, the Fusion Material Monsters that are listed on a Fusion Monster Card, then Special Summon that monster from your Extra Deck.
et: Saada oma käest või oma väljaku poolelt Hauakambrisse Fusion Materjal Koletised, mis on loetletud Fusion Koletise Kaardil, seejärel Kutsu see koletis oma Lisapakist Eriliselt välja.

source: Remove Trap
et: Eemalda Lõks

source: Select 1 face-up Trap Card on the field and destroy it.
et: Vali 1 avatud lõksukaart väljal ja hävita see.

source: Two-Pronged Attack
et: Kahesuunaline Rünnak

source: Select and destroy 2 of your monsters and 1 of your opponent's monsters.
et: Vali ja hävita 2 oma koletist ja 1 vastase koletis.

source: Blue Medicine
et: Sinine Meditsiin

source: Increase your Life Points by 400 points.
et: Suurenda oma Elupunkte 400 punkti võrra.

source: Decrease your opponent's Life Points by 300 points.
et: Vähenda oma vastase Elupunkte 300 punkti võrra.

source: Monster Reborn
et: Koletise taassünd

source: Special Summon 1 monster from either player's Graveyard to your side of the field.
et: Erikutsuge 1 koletis kas tahes mängija kalmistult oma väljaku poolele.

source: De-Spell
et: De-loits

source: Select 1 Spell Card on the field and destroy it. If the selected card is Set, pick up and see the card. If it is a Spell Card, it is destroyed. If it is a Trap Card, return it to its original position.
et: Vali 1 Võlukaart väljakul ja hävita see. Kui valitud kaart on seatud, tõsta see üles ja vaata kaarti. Kui see on Võlukaart, hävitatakse see. Kui see on Lõksukaart, vii see tagasi algsesse asendisse.

source: Pot of Greed
et: Ahninapott

source: Draw 2 cards.
et: Tõmba 2 kaarti.

source: Gravedigger Ghoul
et: Hauakaevaja Kool

source: Select up to 2 Monster Card(s) from your opponent's Graveyard. Remove the selected card(s) from play.
et: Vali oma vastase kalmistult kuni 2 koletise kaarti. Eemalda valitud kaart(id) mängust.

source: Burning Spear
et: Põlev Oda

source: A FIRE monster equipped with this card increases its ATK by 400 points and decreases its DEF by 200 points.
et: TULE monster, millele see kaart on varustatud, suurendab oma ATK-d 400 punkti võrra ja vähendab oma DEF-i 200 punkti võrra.

source: Gust Fan
et: Tuuletusventilaator

source: A WIND monster equipped with this card increases its ATK by 400 points and decreases its DEF by 200 points.
et: TUULETÜÜPI koletis, kellele see kaart on varustatud, suurendab oma ATK-d 400 punkti võrra ja vähendab oma DEF-i 200 punkti võrra.

source: The Inexperienced Spy
et: Kogenematu spioon

source: Select and see 1 card in your opponent's hand.
et: Vali ja vaata 1 kaarti oma vastase käes.

source: Reinforcements
et: Täiendused

source: Target monster gains 500 ATK until the end of this turn.
et: Sihtmärgiks olev koletis saab selle käigu lõpuni 500 ATK juurde.

source: Castle Walls
et: Lossimüürid

source: Increase the DEF of 1 face-up monster on the field by 500 points until the end of this turn.
et: Suurenda ühe avatud koletise DEF-i väljal 500 punkti võrra kuni selle käigu lõpuni.

source: Ultimate Offering
et: Ülim Ohverdus

source: You can pay 500 Life Points to Normal Summon or Set 1 extra monster. You can only activate this effect during your Main Phase or your opponent's Battle Phase.
et: Sa saad maksta 500 Elupunkti, et Normaal-Kutsuda või Asetada 1 lisakoletis. Sa saad seda efekti aktiveerida ainult oma Peafaasis või vastase Lahingufaasis.

source: Ancient Telescope
et: Muistne teleskoop

source: See the top 5 cards of your opponent's Deck. Return the cards to the Deck in the same order.
et: Vaata oma vastase paki viit ülemist kaarti. Pane kaardid samas järjekorras tagasi pakki.

source: White Hole
et: Valge Auk

source: Activate only when your opponent activates "<M4342>Dark Hole<M>". The monsters you control are not destroyed.
et: Aktiveeri ainult siis, kui sinu vastane aktiveerib "<M4342>Dark Hole<M>". Sinu kontrollitavad koletised ei hävine.

source: Call of the Grave
et: Hauakutse

source: When your opponent activates "<M4842>Monster Reborn<M>": Negate its effect
et: Kui sinu vastane aktiveerib "<M4842>Monster Reborn<M>": Tühista selle efekt

source: When your opponent activates "<M4343>Raigeki<M>", all of your opponent's monsters are destroyed in place of your own.
et: Kui sinu vastane aktiveerib "<M4343>Raigeki<M>", hävitatakse kõik sinu vastase koletised sinu enda omade asemel.

source: Tribute to the Doomed
et: Hukatusse määratud ohver

source: Discard 1 card. Destroy 1 monster on the field.
et: Viska 1 kaart. Hävita 1 koletis väljal.

source: Soul Release
et: Hinge Vabastamine

source: Select up to 5 cards from the Graveyard(s) and remove them from play.
et: Vali kuni 5 kaarti Hauakambrist ja eemalda need mängust.

source: The Cheerful Coffin
et: Rõõmus Kirst

source: Discard up to 3 Monster Cards from your hand to the Graveyard.
et: Viska kuni 3 koletiskaarti oma käest hauakambrisse.

source: Call of Darkness
et: Pimeduse Kutse

source: Send any monster that was Special Summoned by "<M4842>Monster Reborn<M>" to the Graveyard. While this card is on on the field, "<M4842>Monster Reborn<M>" cannot be activated.
et: Saada kõik koletised, mis on eriliselt kutsutud "<M4842>Monster Reborn<M>" abil, Hauakambrisse. Kuni see kaart on väljakul, ei saa "<M4842>Monster Reborn<M>" aktiveerida.

source: Change of Heart
et: Südame Muutus

source: Select 1 monster on your opponent's side of the field. Take control of the selected monster until the End Phase of this turn.
et: Vali välja 1 koletis oma vastase väljaku poolelt. Võta valitud koletise üle kontroll kuni selle käigu lõppfaasini.

source: Solemn Judgment
et: Pühalik Otsus

source: Pay half of your Life Points. Negate an activation of a Spell / Trap Card / Normal Summon / Flip Summon / Special Summon and destroy the Spell Card, Trap Card, or Summoned monster.
et: Maksa pool oma Elupunktidest. Tühista Loitsu / Lõksukaardi / Tavalise Kutsumise / Pöördkutsumise / Erikutsumise aktiveerimine ja hävita Loitsukaart, Lõksukaart või kutsutud koletis.

source: Magic Jammer
et: Maagia Summutaja

source: Discard 1 card. Negate the activation of a Spell Card and destroy it.
et: Viska 1 kaart. Tühista Võlusõna Kaardi aktiveerimine ja hävita see.

source: Seven Tools of the Bandit
et: Seitsme tööriista bandiidile

source: When a Trap Card is activated: Pay 1000 Life Points; negate the activation and destroy it.
et: Kui aktiveeritakse lõksukaart: Maksa 1000 Elupunkti; tühista aktiveerimine ja hävita see.

source: Horn of Heaven
et: Taeva Sarv

source: Tribute 1 monster on your side of the field. Negate the Normal Summon / Flip Summon / Special Summon of a monster and destroy it.
et: Ohverda 1 koletis oma väljaku poolelt. Tühista koletise Normaalne Kutsumine / Pöördkutsumine / Eriline Kutsumine ja hävita see.

source: Just Desserts
et: Õiglane karistus

source: Inflict 500 points of damage to your opponent's Life Points for each monster on your opponent's side of the field.
et: Tehke oma vastase Elupunktidele 500 punkti kahju iga koletise eest, mis on teie vastase väljaku poolel.

source: Royal Decree
et: Kuninglik dekreet

source: Negate the effects of all other Trap Cards on the field.
et: Negateeri kõigi teiste lõksukaartide efektid väljal.

source: Last Day of Witch
et: Nõia Viimane Päev

source: Destroy all face-up Spellcaster-Type monsters on the field.
et: Hävita kõik lahinguväljal olevad avatud Nõiduri-tüüpi koletised.

source: Exile of the Wicked
et: Pahade pagendus

source: Destroys all face-up Fiend-Type monsters on the field.
et: Hävitab kõik avatud Paha tüüpi koletised väljal.

source: Magical Thorn
et: Maagiline Okas

source: When your opponent's card(s) in their hand are discarded to the Graveyard, inflict 500 points of damage to their Life Points for each card that was discarded.
et: Kui sinu vastase kaardid tema käest saadetakse Hauakambrisse, põhjusta 500 punkti kahju tema Elupunktidele iga saadetud kaardi eest.

source: Restructer Revolution
et: Struktuuri revolutsioon

source: Inflict 200 points of damage to your opponent's Life Points for each card in your opponent's hand.
et: Tehke oma vastase Elupunktidele 200 punkti kahju iga kaardi eest, mis on teie vastase käes.

source: Fusion Sage
et: Fusioni Tark

source: SpellAdd 1 "<M4837>Polymerization<M>" card from your Deck to your hand. Then shuffle your Deck.
et: Lisa oma pakist 1 "<M4837>Polümerisatsioon<M>" kaart oma kätte. Seejärel sega oma pakk.

source: Sword of Deep-seated
et: Sügavalt juurdunud mõõk

source: A Monster Card equipped with this card increase its ATK and DEF by 500 points. When this card is sent to the Graveyard, place it on top of your Deck.
et: Koletiskaart, millele see kaart on varustatud, suurendab oma ATK ja DEF 500 punkti võrra. Kui see kaart saadetakse Hauakambrisse, aseta see oma Paki peale.

source: Block Attack
et: Rünnaku Blokeerimine

source: Select 1 face-up Attack Position monster on your opponent's side of the field and change it to Defense Position.
et: Vali oma vastase väljaku poolelt 1 avatud ründepositsioonis olev koletis ja muuda see kaitsepositsiooniks.

source: The Unhappy Maiden
et: Õnnetu Neitsi

source: When this card is sent to the Graveyard as a result of battle, the Battle Phase for that turn ends immediately.
et: Kui see kaart saadetakse lahingu tulemusena Hauakambrisse, lõpeb selle käigu Lahingufaasi kohe.

source: Robbin' Goblin
et: Röövli Goblin

source: Each time a monster you control inflicts Battle Damage to your opponent, your opponent discards 1 random card.
et: Iga kord, kui sinu kontrollitav koletis tekitab lahingukahju sinu vastasele, viskab sinu vastane juhuslikult ühe kaardi ära.

source: Germ Infection
et: Idudeinfektsioon

source: The ATK of a non Machine-Type monster equipped with this card is decreased by 300 points at each of its Standby Phases.
et: Selle kaardiga varustatud mitte-Masinatüüpi koletise ATK väheneb iga tema Ootefaasiga 300 punkti võrra.

source: Paralyzing Potion
et: Halvav jook

source: A non Machine-Type monster equipped with this card cannot attack.
et: Mitteküborg-tüüpi koletis, kellele see kaart on varustatud, ei saa rünnata.

source: The Stern Mystic
et: Karm Mystic

source: FLIP: All face-down cards on the field are turned face-up, and then returned to their original positions. No card effects are activated when cards are turned face-up.
et: FLIP: Kõik väljaku allapoole pööratud kaardid pööratakse ülespoole ja seejärel tagastatakse oma algsetele positsioonidele. Ühtegi kaardi efekti ei aktiveerita, kui kaardid pööratakse ülespoole.

source: Wall of Illusion
et: Illusioonide sein

source: A monster that attacks this card is returned to its owner's hand after damage calculation. Damage calculation is applied normally.
et: Koletis, kes ründab seda kaarti, tagastatakse pärast kahju arvutamist omaniku kätte. Kahju arvutamine toimub tavapäraselt.

source: Neo the Magic Swordsman
et: Neo Maagiline Mõõgamees

source: A dimensional drifter who not only practices sorcery, but is also a sword and martial arts master.
et: Dimensioonide rändur, kes mitte ainult ei praktiseeri nõidust, vaid on ka mõõga ja võitluskunstide meister.

source: Baron of the Fiend Sword
et: Deemonimõõga Parun

source: An aristocrat who wields a sword possessed by a malicious spirit that preys on the weak.
et: Aristokraat, kes kasutab mõõka, mida valdab nõrkadele saaki tegev pahatahtlik vaim.

source: Man-Eating Treasure Chest
et: Inimesi sööv aardekirst

source: A monster disguised as a treasure chest that is known to attack the unwary adventurer.
et: Kirstuna, kes on maskeeritud aardekirstuks ja on tuntud selle poolest, et ründab ettevaatamatuid seiklejaid.

source: Sorcerer of the Doomed
et: Hukule määratud nõid

source: A slave of the dark arts, this sorcerer is a master of life-extinguishing spells.
et: Pimedate kunstide ori, see nõid on elu kustutavate loitsude meister.

source: Last Will
et: Viimane tahe

source: If a monster on your side of the field was sent to your Graveyard this turn, you can Special Summon 1 monster with an ATK of 1500 points or less from your Deck once during this turn. Then shuffle your Deck.
et: Kui sinu väljaku poolel olev koletis saadeti sel käigul sinu Hauakambrisse, saad selle käigu jooksul üks kord eriliselt kutsuda 1 koletise, mille ATK on 1500 punkti või vähem, oma pakist. Seejärel sega oma pakk.

source: You take no Battle Damage this turn. Your monsters cannot be destroyed by battle this turn.
et: Sa ei saa sellel käigul lahingukahju. Sinu koletisi ei saa sellel käigul lahingus hävitada.

source: Mirror Force
et: Peeglijõud

source: When an opponent's monster declares an attack, Destroy all Attack Position monsters your opponent controls.
et: Kui vastase koletis kuulutab välja rünnaku, hävita kõik vastase kontrolli all olevad rünnakupositsioonis koletised.

source: Ring of Magnetism
et: Magnetismi Rõngas

source: You can only equip this card to a monster on your side of the field. Decrease the ATK and DEF of a monster equipped with this card by 500 points. In addition, all the monsters on your opponents side of the field can only attack the monster equipped with this card, if they attack.
et: Seda kaarti saab varustada ainult sinu väljaku poolel olevale koletisele. Vähenda selle kaardiga varustatud koletise ATK ja DEF 500 punkti võrra. Lisaks saavad kõik sinu vastase väljaku poolel olevad koletised rünnata ainult seda kaardiga varustatud koletist, kui nad ründavad.

source: Share the Pain
et: Jaga valu

source: You can Tribute 1 monster you control to make your opponent Tribute 1 monster they control (for no effect).
et: Saad ohverdada 1 koletise, mida sa kontrollid, et sundida oma vastast ohverdama 1 koletise, mida nad kontrollivad (ilma efektita).

source: A monster equipped with this card increases its ATK by 700 points. Its ATK is then decreased by 200 points at each of its Standby Phases.
et: Selle kaardiga varustatud koletis suurendab oma ATK-d 700 punkti võrra. Selle ATK väheneb seejärel iga oma Ootefaasiga 200 punkti võrra.

source: Heavy Storm
et: Raske Torm

source: Destroy all Spell and Trap Cards on the field.
et: Hävita kõik Väljal olevad Võlu- ja Lõksukaardid.

source: Gryphon Wing
et: Grifi Tiib

source: When your opponent activates "<M4678>Harpie's Feather Duster<M>", all of your opponent's Spell and Trap Cards are destroyed in place of your own.
et: Kui sinu vastane aktiveerib "<M4678>Harpyia Sulgedest Tolmuimeja<M>", hävitatakse kõik sinu vastase Maagia- ja Lõksukaardid sinu enda asemel.

source: Gravekeeper's Servant
et: Hauakaevurite Teenija

source: Your opponent must send 1 card from the top of their Deck to the Graveyard to declare an attack.
et: Sinu vastane peab rünnaku kuulutamiseks saatma ühe kaardi oma pakist hauakambrisse.

source: Curse of Fiend
et: Deemoni needus

source: Change the battle positions of all Attack Position monsters on the fields to Defense Position and vice-versa. These positions cannot be changed during the turn this card is activated except by the effect of a Spell, Trap or Effect Monster Card. You can only activate this card during your Standby Phase.
et: Muuda kõigi Väljal olevate Ründepositsioonis olevate koletiste positsioon Kaitsepositsiooniks ja vastupidi. Neid positsioone ei saa muuta selle käigu jooksul, kui see kaart aktiveeritakse, välja arvatud Loitsu, Lõksu või Efektikoletise kaardi mõju tõttu. Sa saad seda kaarti aktiveerida ainult oma Ootefaasil.

source: Upstart Goblin
et: Edukas Goblin

source: Draw 1 card from your Deck. Increase your opponent's Life Points by 1000 Life Points.
et: Tõmba 1 kaart oma pakist. Suurenda oma vastase Elupunkte 1000 Elupunkti võrra.

source: Toll
et: Tasu

source: Each player must pay 500 Life Points to declare an attack.
et: Iga mängija peab rünnaku kuulutamiseks maksma 500 elupunkti.

source: Final Destiny
et: Lõplik Saatus

source: Discard 5 cards from your hand. Destroy all cards on the field.
et: Viska 5 kaarti oma käest. Hävita kõik kaardid väljal.

source: Snatch Steal
et: Varastatud Võit

source: Take control of a monster on your opponent's side of the field that is equipped with this card. Increase your opponent's Life Points by 1000 points during each of their Standby Phases.
et: Võta kontroll vastase väljaku poolel oleva koletise üle, millele see kaart on varustatud. Suurenda oma vastase Elupunkte 1000 punkti võrra iga nende Ootefaaside ajal.

source: Chorus of Sanctuary
et: Pühamu koor

source: Increase the DEF of all Defense Position monsters by 500 points.
et: Suurenda kõigi kaitseasendis olevate koletiste DEF-i 500 punkti võrra.

source: Confiscation
et: Konfiskeerimine

source: Pay 1000 Life Points. Look at your opponent's hand, select 1 card in it, and discard that card.
et: Makske 1000 Elupunkti. Vaata oma vastase kätt, vali sealt 1 kaart ja viska see kaart ära.

source: Delinquent Duo
et: Kuritegelik Duo

source: Pay 1000 Life Points. Your opponent randomly selects and discards 1 card from his/her hand and then selects and discards another card from his/her hand.
et: Makske 1000 Elupunkti. Sinu vastane valib juhuslikult ja viskab oma käest ära 1 kaardi ning seejärel valib ja viskab ära teise kaardi oma käest.

source: Darkness Approaches
et: Pimedus Lähendab

source: Discard 2 cards from your hand. Select 1 face-up monster and flip it face-down, but do not change its battle position.
et: Viska 2 kaarti oma käest. Vali 1 avatud koletis ja keera see tagurpidi, kuid ära muuda selle lahingupositsiooni.

source: Fairy's Hand Mirror
et: Haldja Käe Peegel

source: Switch the opponent's Spell Card effect that specifically designates 1 monster as a target to another correct target.
et: Suuna vastase Loitsukaardi efekt, mis määrab sihtmärgiks ühe konkreetse koletise, teisele sobivale sihtmärgile.

source: Tailor of the Fickle
et: Kapriisne rätsep

source: Switch 1 Equip Spell Card equipped to a monster to another correct target.
et: Vaheta 1 Varustuse Võluskaart, mis on kinnitatud koletise külge, teise sobiva sihtmärgi külge.

source: Rush Recklessly
et: Tormakas Torm

source: Target face-up monster gains 700 ATK until the End Phase.
et: Sihtmärgiks olev avatud koletis saab 700 ATK juurde kuni lõppfaasini.

source: The Reliable Guardian
et: Usaldusväärne Kaitsja

source: Increase 1 face-up monster's DEF by 700 points until the end of this turn.
et: Suurenda 1 avatud koletise DEF 700 punkti võrra kuni selle käigu lõpuni.

source: The Forceful Sentry
et: Jõuline valvur

source: Look at your opponent's hand. Select 1 card among them and return it to his/her Deck. The Deck is then shuffled.
et: Vaata oma vastase kätt. Vali nende seast 1 kaart ja pane see tagasi tema pakki. Seejärel paki segatakse.

source: Chain Energy
et: Ahelaenergia

source: Each player must pay 500 Life Points per card to Normal Summon, Special Summon, Set or activate cards from his/her respective hand.
et: Iga mängija peab maksma 500 Elupunkti kaardi kohta, et Normaal-Kutsuda, Eriliselt Kutsuda, Seada või aktiveerida kaarte oma käest.

source: Mystical Space Typhoon
et: Müstiline Kosmosetorm

source: Target 1 Spell/Trap Card on the field; destroy that target.
et: Vali 1 Võlu-/Lõksukaart väljal; hävita see sihtmärk.

source: Giant Trunade
et: Hiiglaslik Torm

source: Return all Spell and Trap Cards on the field to their owners' hands.
et: Tagasta kõik Väljal olevad Võlu- ja Lõksukaardid nende omanike kätte.

source: Painful Choice
et: Valulik Valik

source: Select 5 cards from your Deck and reveal them to your opponent. Your opponent selects 1 card among them. Add that card to your hand and discard the other cards.
et: Vali oma pakist 5 kaarti ja näita neid oma vastasele. Sinu vastane valib neist ühe kaardi. Lisa see kaart oma kätte ja viska ülejäänud kaardid ära.

source: Snake Fang
et: Maohammas

source: Decrease 1 face-up monster's DEF by 500 points until the end of this turn.
et: Vähenda 1 avatud koletise DEF 500 punkti võrra kuni selle käigu lõpuni.

source: Cyber Jar
et: Küberpott

source: FLIP: Destroy all monsters on the field. Both players then pick up 5 cards from the top of their Decks and Special Summon all Level 4 or lower Monster Cards among them in face-up Attack Position or face-down Defense Position. The rest of the cards picked up are added to their hands.
et: FLIP: Hävita kõik koletised väljal. Mõlemad mängijad võtavad seejärel oma pakist 5 kaarti ja kutsuvad eriliselt esile kõik nende seast leitud 4. taseme või madalamad koletiskaardid avatud rünnakupositsioonis või kinnises kaitsepositsioonis. Ülejäänud võetud kaardid lisatakse nende kätte.

source: Banisher of the Light
et: Valguse Väljaheitja

source: As long as this card remains face-up on the field, any card sent to the Graveyard is removed from play instead.
et: Niikaua kui see kaart jääb väljale avatud olekus, eemaldatakse kõik kaardid, mis saadetakse Hauakambrisse, mängust.

source: Giant Rat
et: Hiidrott

source: When this card is destroyed by battle and sent to the Graveyard: You can Special Summon 1 EARTH monster with 1500 or less ATK from your Deck, in face-up Attack Position.
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse: Sa võid eriliselt kutsuda 1 MAA koletise, millel on 1500 või vähem ATK-d, oma pakist, avatud rünnakupositsioonis.

source: Senju of the Thousand Hands
et: Tuhande käe Senju

source: When this card is Normal Summoned or Flip Summoned, you can add 1 Ritual Monster Card from your Deck to your hand.
et: Kui see kaart on Normaal- või Pöördkutsutud, saad lisada ühe Rituaal Koletise Kaardi oma pakist oma kätte.

source: UFO Turtle
et: UFO Kilpkonn
