Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: This card is treated as a Normal Monster while face-up on the field or in the Graveyard. While this card is face-up on the field, you can Normal Summon it to have it be treated as an Effect Monster with this effect:<BR>● The original ATK of this card becomes 2100.
et: Seda kaarti käsitletakse Tavalise Koletisena, kui see on lahinguväljal või Hauas. Kui see kaart on lahinguväljal, võid selle Tavalisena Kutsuda, et seda käsitletaks Efektikoletisena järgmise efektiga:<BR>● Selle kaardi algne RÜ on 2100.

source: Dawnbreak Gardna
et: Koidumurdja Gardna

source: This card is treated as a Normal Monster while face-up on the field or in the Graveyard. While this card is face-up on the field, you can Normal Summon it to have it be treated as an Effect Monster with this effect:<BR>● The original DEF of this card becomes 2300.
et: Seda kaarti käsitletakse tavalise koletisena, kui see on väljaku peal või hauas. Kui see kaart on väljaku peal, võid selle normaalselt kutsuda, et seda käsitletaks efektikoletisena järgmise efektiga:<BR>● Selle kaardi algne DEF muutub 2300-ks.

source: Doom Shaman
et: Hukatus Šamaan

source: This card is treated as a Normal Monster while face-up on the field or in the Graveyard. While this card is face-up on the field, you can Normal Summon it to have it be treated as an Effect Monster with this effect:<BR>● Once per turn, you can Special Summon 1 Fiend-Type monster from your hand or from either player's Graveyard. When this card is removed from the field, destroy all Fiend-Type monsters Special Summoned by this effect.
et: See kaart loetakse tavaliseks koletiseks, kui see on lahinguväljal või hauas. Kui see kaart on lahinguväljal, võid selle tavaliselt kutsuda, et seda käsitletaks efektkoletisena järgmise efektiga:<BR>● Kord kordamööda võid eriliselt kutsuda ühe deemonitüüpi koletise oma käest või mõlema mängija hauast. Kui see kaart eemaldatakse lahinguväljalt, hävita kõik selle efektiga eriliselt kutsutud deemonitüüpi koletised.

source: King Pyron
et: Kuningas Pyron

source: This card is treated as a Normal Monster while face-up on the field or in the Graveyard. While this card is face-up on the field, you can Normal Summon it to have it be treated as an Effect Monster with this effect:<BR>● Once per turn, you can inflict 1000 damage to your opponent.
et: See kaart loetakse tavaliseks koletiseks, kui see on väljaku peal või hauas. Kui see kaart on väljaku peal, võid selle tavaliseks kutsuda, et seda käsitletaks efektkoletisena järgmise efektiga:<BR>● Kord käigu jooksul võid oma vastasele tekitada 1000 kahju.

source: Shadow Delver
et: Varjude Otsija

source: This card is treated as a Normal Monster while face-up on the field or in the Graveyard. While this card is face-up on the field, you can Normal Summon it to have it be treated as an Effect Monster with this effect:<BR>● Once per turn, you can select 1 face-up level 4 or lower DARK monster you control. It can attack your opponent directly this turn.
et: Seda kaarti käsitletakse tavalise koletisena, kui see on väljaku peal või hauas. Kui see kaart on väljaku peal, võid selle normaalselt kutsuda, et seda käsitletaks efektikoletisena järgmise efektiga:<BR>● Kord käigu jooksul võid valida ühe oma kontrollitava näoga ülespoole oleva 4. või madalama taseme PIMEDA koletise. See võib sel käigul rünnata otse sinu vastast.

source: Once per turn, you can equip a "<M6210>Flint<M>" on the field to this card. You can take any "<M6210>Flint<M>" equipped to this card and equip it to another face-up monster. This card can only be equipped with one "<M6210>Flint<M>" at a time. While equipped with "<M6210>Flint<M>", this card is unaffected by "<M6210>Flint<M>"'s effect and cannot be destroyed by battle.
et: Korra ühe korra käigu jooksul saad varustada selle kaardi "<M6210>Flint<M>"-iga, mis on väljakul. Sa saad võtta selle kaardiga varustatud "<M6210>Flint<M>" ja varustada see teisele avatud koletisele. See kaart saab olla varustatud ainult ühe "<M6210>Flint<M>"-iga korraga. Kui see kaart on varustatud "<M6210>Flint<M>"-iga, siis see kaart ei ole mõjutatud "<M6210>Flint<M>" efektist ja seda ei saa lahingus hävitada.

source: FLIP: Change the Battle Positions of all face-up monsters your opponent controls.
et: FLIP: Muuda kõigi vastase kontrolli all olevate avatud koletiste lahingupositsioone.

source: Phantom Cricket
et: Fantoomkriiks

source: FLIP: Return 1 face-down monster from the field to the top of its owner's Deck.
et: FLIP: Tagasta 1 näoga all olev koletis väljakult selle omaniku paki tippu.

source: Crystal Seer
et: Kristallseltskond

source: FLIP: Pick up 2 cards from the top of your Deck. Select 1 of those cards and add it to your hand, and place the other card on the bottom of your Deck.
et: FLIP: Tõsta oma paki pealt 2 kaarti. Vali neist üks kaart ja lisa see oma kätte, ning aseta teine kaart oma paki põhja.

source: Neo Space Pathfinder
et: Neo Kosmose Teerajaja

source: You can discard this card to the Graveyard to add 1 "Neo Space" from your Deck or Graveyard to your hand.
et: Saad selle kaardi Hauakambrisse, et lisada oma käele 1 "Neo Space" oma pakist või Hauakambrist.

source: Frost and Flame Dragon
et: Külma ja Leegi Draakon

source: This card cannot be Normal Summoned or Set. This card cannot be Special Summoned except by removing from play 1 FIRE and 2 WATER monsters from your Graveyard. Once per turn, you can discard 1 card to destroy 1 monster on the field.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti ei saa eriliselt kutsuda, välja arvatud juhul, kui eemaldate mängust 1 TULE ja 2 VEE koletist oma kalmistult. Kord ühe käigu jooksul võite ühe kaardi ära visata, et hävitada üks koletis väljakul.

source: Desert Twister
et: Kõrbekeeris

source: This card cannot be Normal Summoned or Set. This card cannot be Special Summoned except by removing from play 1 EARTH and 2 WIND monsters from your Graveyard. Once per turn, you can discard 1 card to destroy 1 Spell or Trap Card on the field.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti ei saa eriliselt kutsuda, välja arvatud eemaldades mängust 1 MAA ja 2 TUULE koletist oma kalmistult. Kord ühe käigu jooksul võid sa ühe kaardi ära visata, et hävitada üks Võlu- või Lõksukaart väljakul.

source: Razor Lizard
et: Raseerija Sisalik

source: When this card attacks a face-down Defense Position monster while there is another Reptile-Type monster on your side of the field besides this card, destroy the monster immediately with this card's effect without flipping it face-up, or applying damage calculation.
et: Kui see kaart ründab tagurpidi kaitsepositsioonis olevat koletist, samal ajal kui sinu väljakul on veel üks Reptiil-tüüpi koletis peale selle kaardi, hävita koletis kohe selle kaardi efektiga ilma seda püstiasendisse pööramata või kahjustuse arvutust rakendamata.

source: Light Effigy
et: Valguse Effigy

source: If you Tribute Summon a LIGHT Normal Monster, you can treat this 1 monster as 2 Tributes.
et: Kui sa kutsud välja LIGHT tavalise koletise, võid seda ühte koletist käsitleda kui kahte ohverdust.

source: Dark Effigy
et: Tume Effigy

source: If you Tribute Summon a DARK Normal Monster, you can treat this 1 monster as 2 Tributes.
et: Kui sa kutsud ohverdades välja PIMEDA tavalise koletise, võid seda ühte koletist käsitleda kui kahte ohverdust.

source: Zombie Master
et: Zombimeister

source: Once per turn: You can send 1 Monster Card from your hand to the Graveyard, then target 1 Level 4 or lower Zombie-Type monster in either player's Graveyard; Special Summon that target. This card must remain face-up on the field to activate and to resolve this effect.
et: Kord korra: Sa võid saata 1 koletise kaardi oma käest hauakambrisse, seejärel sihtida 1 taseme 4 või madalama zombitüüpi koletist mõlema mängija hauakambris; Kutsu see sihtmärk eriliselt välja. Selle efekti aktiveerimiseks ja lahendamiseks peab see kaart jääma väljale avatud olekus.

source: Cocoon Rebirth
et: Kookoni taassünd

source: You can Tribute 1 face-up "Chrysalis" monster you control to Special Summon 1 "Neo-Spacian" monster written in the card text of that card from either player's Graveyard.
et: Saad ohverdada 1 avatud "Chrysalis" koletise, mida sa kontrollid, et Kutsuda Eriliselt 1 "Neo-Spacian" koletis, mis on kirjutatud selle kaardi tekstis, kas enda või vastase Hauakambrist.

source: Cyberdark Impact!
et: Küberpime Mõju!

source: Return 1 "<M6830>Cyberdark Horn<M>", "<M6831>Cyberdark Edge<M>" and "<M6832>Cyberdark Keel<M>" from your side of the field, hand, or Graveyard to your Deck. Special Summon 1 "<M6833>Cyberdark Dragon<M>" from your Extra Deck. (This Special Summon is treated as a Fusion Summon.)
et: Tagasta oma väljalt, käest või Hauakambrist oma pakki 1 "<M6830>Cyberdark Horn<M>", "<M6831>Cyberdark Edge<M>" ja "<M6832>Cyberdark Keel<M>". Kutsu eriliselt välja 1 "<M6833>Cyberdark Dragon<M>" oma Ekstra pakist. (See eriline väljakutse loetakse Fusion Summoniks.)

source: Flint Missile
et: Flindi rakett

source: Destroy 1 monster equipped with "<M6210>Flint<M>". You can return this card to your Deck instead of sending it to the Graveyard after it resolves.
et: Hävita 1 koletis, millele on varustatud "<M6210>Flint<M>". Selle kaardi saab pärast lahendamist Haua asemel tagasi oma pakki panna.

source: Double Summon
et: Kahekordne Kutsumine

source: You can Normal Summon 1 additional time this turn. You can only gain this effect once per turn.
et: Saad sellel käigul veel ühe korra normaalset kutsuda. Seda efekti saab kasutada ainult üks kord käigu jooksul.

source: Summoner's Art
et: Kutsuja kunst

source: Add 1 Level 5 or higher Normal Monster from your Deck to your hand.
et: Lisa oma pakist 1. taseme 5 või kõrgem tavaline koletis oma kätte.

source: Creature Seizure
et: Olendi hõivamine

source: Each player gives their opponent control of 1 of their monsters (controller's choice). You must choose a face-up Normal Monster.
et: Iga mängija annab oma vastasele kontrolli ühe oma koletise üle (kontrollija valik). Sa pead valima ülespööratud Tavalise Koletise.

source: Phalanx Pike
et: Falaanxi Piik

source: The equipped monster gains 900 ATK for each card in either Graveyard that has the same name it does.
et: Varustatud koletis saab 900 ATK iga kaardi eest, mis on kummaski Hauakambris ja millel on sama nimi nagu tal.

source: Symbols of Duty
et: Kohustuse sümbolid

source: Send 1 Normal Monster you control to the Graveyard. Select and Special Summon 1 monster from either Graveyard and equip it with this card. When this card is removed from the field, destroy the equipped monster.
et: Saada 1 tavaline koletis, mida sa kontrollid, Hauakambrisse. Vali ja Kutsu Eriliselt esile 1 koletis kas ühest või teisest Hauakambrist ja varusta see selle kaardiga. Kui see kaart eemaldatakse väljakult, hävita varustatud koletis.

source: Amulet of Ambition
et: Ambitsiooni Amulett

source: Equip only to a Normal Monster. If it battles a monster with a higher Level, the equipped monster gains 500 ATK x the difference in Levels (during that battle only). When this card is sent to the Graveyard, you can return it to the top of your Deck.
et: Varusta ainult tavalise koletisega. Kui see võitleb kõrgema tasemega koletisega, saab varustatud koletis 500 ATK x tasemete erinevus (ainult selle lahingu ajal). Kui see kaart saadetakse Hauakambrisse, võid selle oma paki tippu tagasi panna.

source: Broken Bamboo Sword
et: Murtud Bambusmõõk

source: The equipped monster gains 0 ATK.
et: Varustatud koletis saab 0 ATK juurde.

source: Ambush Fangs
et: Varitsushambad

source: Activate only when a face-up "Venom" monster you control is declared as an attack target. Negate the attack and end the Battle Phase. Then place 1 Venom Counter on the monster that attacked.
et: Aktiveeri ainult siis, kui sinu kontrollitav avatud "Venom" koletis on kuulutatud rünnaku sihtmärgiks. Tühista rünnak ja lõpeta Lahingu Faas. Seejärel aseta 1 Venomi Loendur rünnanud koletisele.

source: Venom Burn
et: Mürgi Põletus

source: Select 1 monster with a Venom Counter(s). Remove all Venom Counters from that card, and inflict 700 damage to your opponent for each Venom Counter removed.
et: Vali 1 koletis, millel on Mürgi Loendur(id). Eemalda kõik Mürgi Loendurid sellelt kaardilt ja tekita oma vastasele 700 kahju iga eemaldatud Mürgi Loenduri eest.

source: Common Charity
et: Ühine Heategevus

source: Draw 2 cards, then remove from play 1 Normal Monster Card from your hand. If you don't have any Normal Monster Cards in your hand to remove, send all cards in your hand to the Graveyard.
et: Tõmba 2 kaarti, seejärel eemalda mängust 1 Tavaline Koletiskaart oma käest. Kui sul ei ole käes ühtegi Tavalist Koletiskaarti, mida eemaldada, saada kõik kaardid oma käest Hauakambrisse.

source: Destructive Draw
et: Hävitav Tõmme

source: If either player has no cards in their hand at the start of their Draw Phase, they can draw 1 more card in addition to their normal draw. This card's controller loses 700 Life Points during their End Phase. (If less than 700, they become 0 instead). When this face-up card is removed from the field, inflict 3000 damage to the player who controlled it.
et: Kui kummalgi mängijal ei ole oma Tõmbamisfaasi alguses kaarte käes, võivad nad lisaks oma tavapärasele tõmbele tõmmata veel ühe kaardi. Selle kaardi kontrollija kaotab oma Lõppfaasis 700 Elupunkti. (Kui vähem kui 700, muutuvad need 0-ks). Kui see avatud kaart eemaldatakse väljakult, tekitatakse 3000 kahju mängijale, kes seda kontrollis.

source: Shield Spear
et: Kilbispea

source: Target 1 face-up monster on the field; it gains 400 ATK and DEF until the End Phase.
et: Vali 1 avatud näoga koletis väljal; see saab 400 ATK ja DEF juurde kuni lõppfaasini.

source: Strike Slash
et: Löögilõige

source: Activate only when a monster you control declares an attack. Until the end of this turn, that monster gains 700 ATK and during battle between that attacking monster and a Defense Position monster whose DEF is lower than the ATK of that card, inflict the difference as Battle Damage to your opponent.
et: Aktiveeri ainult siis, kui sinu kontrollitav koletis kuulutab välja rünnaku. Kuni selle käigu lõpuni saab see koletis 700 ATK juurde ja lahingus selle ründava koletise ja Kaitseasendis oleva koletise vahel, mille DEF on madalam kui selle kaardi ATK, põhjusta vahe oma vastasele Lahingukahjuna.

source: Spell Reclamation
et: Loitsu Taastamine

source: Discard 1 card and chain this card to a Spell Card you activated. Whenever that Spell Card is sent to the Graveyard, return it to its owner's hand.
et: Viska 1 kaart ja ahelda see kaart sinu aktiveeritud Võlukaardile. Iga kord, kui see Võlukaart saadetakse Hauakambrisse, tagasta see omaniku kätte.

source: Trap Reclamation
et: Lõksu Taastamine

source: Discard 1 card and chain this card to a Trap Card you activated. Whenever that Trap Card is sent to the Graveyard, return it to its owner's hand.
et: Viska 1 kaart ja ahelda see kaart lõksukaardile, mille aktiveerisid. Kui see lõksukaart saadetakse Hauakambrisse, tagasta see omaniku kätte.

source: Gift Card
et: Kinkekaart

source: Your opponent gains 3000 Life Points.
et: Sinu vastane saab 3000 Elupunkti juurde.

source: The Gift of Greed
et: Ahneuse kingitus

source: Your opponent draws 2 cards.
et: Sinu vastane tõmbab 2 kaarti.

source: Counter Counter
et: Vastuvõtu Vastuvõtt

source: Negate the activation of a Counter Trap Card, and destroy it.
et: Tühista Vastulõksukaardi aktiveerimine ja hävita see.

source: Volcanic Rocket
et: Vulkaani Rakett

source: When this card is Summoned, you can add 1 "<M7086>Blaze Accelerator<M>" card from your Deck or Graveyard to your hand.
et: Kui see kaart kutsutakse välja, saad lisada 1 "<M7086>Blaze Accelerator<M>" kaardi oma pakist või hauast oma kätte.

source: Felgrand Dragon
et: Felgrandi Draakon

source: This card cannot be Special Summoned except from the Graveyard and only if it was sent there from the field. When this card is Special Summoned, select 1 monster in your Graveyard. This card gains ATK equal to the Level of that monster x 200.
et: Seda kaarti ei saa eriliselt kutsuda välja, välja arvatud Hauakambrist ja ainult siis, kui see saadeti sinna väljakult. Kui see kaart kutsutakse eriliselt välja, vali 1 koletis oma Hauakambris. See kaart saab ATK-d, mis on võrdne selle koletise tasemega x 200.

source: Darkblaze Dragon
et: Pimedaleek Draakon

source: When this card is Special Summoned from the Graveyard, its ATK and DEF increases to become twice its original ATK and DEF. When this card destroys a monster by battle and sends it to the Graveyard, inflict Damage to your opponent equal to the ATK of the destroyed monster.
et: Kui see kaart on eriliselt välja kutsutud Hauakambrist, suureneb selle ATK ja DEF kahekordseks oma algsest ATK-st ja DEF-st. Kui see kaart hävitab lahingus koletise ja saadab selle Hauakambrisse, põhjusta oma vastasele kahju, mis on võrdne hävitatud koletise ATK-ga.

source: Herald of Creation
et: Loomise Kuulutaja

source: Once per turn, you can discard 1 card from your hand to add 1 Level 7 or higher monster from your Graveyard to your hand.
et: Korra ühe korra käigu jooksul saad sa oma käest ühe kaardi ära visata, et lisada oma käest üks 7. taseme või kõrgem koletis oma Hauakambrist.

source: Decoy Dragon
et: Peibelo Draakon

source: When this card is selected as an attack target by your opponent's monster, select 1 Level 7 or higher Dragon-Type monster from your Graveyard, Special Summon it and switch the attack target to that monster.
et: Kui see kaart valitakse sinu vastase koletise rünnaku sihtmärgiks, vali oma kalmistult 1. taseme 7 või kõrgem Draakoni-tüüpi koletis, kutsu see eriliselt välja ja vaheta rünnaku sihtmärk selle koletise vastu.

source: Trade-In
et: Vahetus

source: Discard 1 Level 8 monster to draw 2 cards.
et: Viska 1 8. taseme koletis, et tõmmata 2 kaarti.

source: The Big Saturn
et: Suur Saturn

source: This card cannot be Special Summoned from the hand or Deck. Once per turn, during your Main Phase, you can discard 1 card and pay 1000 Life Points to have this card gain 1000 ATK until the End Phase. When this card is destroyed and sent to the Graveyard by an opponent's card effect, both players take damage equal to this card's ATK.
et: Seda kaarti ei saa eriliselt kutsuda käest ega pakist. Kord ühe käigu jooksul, oma peafaasis, võid sa ühe kaardi ära visata ja maksta 1000 elupunkti, et see kaart saaks 1000 ATK-d kuni lõppfaasini. Kui see kaart hävitatakse ja saadetakse vastase kaardi efekti tõttu hauakambrisse, saavad mõlemad mängijad kahju, mis on võrdne selle kaardi ATK-ga.

source: Elemental HERO Plasma Vice
et: Elementaalne KANGELANE Plasma Vice

source: "<M6313>Elemental HERO Sparkman<M>" + "<M6477>Elemental Hero Bladedge<M>"<BR>Must be Fusion Summoned and cannot be Special Summoned by other ways. If this card attacks a Defense Position monster, inflict piercing Battle Damage to your opponent. You can discard 1 card to target 1 Attack Position monster your opponent controls; destroy that target.
et: "<M6313>Elementaalne Kangelane Sädemeinimene<M>" + "<M6477>Elementaalne Kangelane Teraserv<M>"<BR>Peab olema sulandatud ja ei saa olla eriliselt kutsutud muul viisil. Kui see kaart ründab kaitsepositsioonis olevat koletist, tekitab see vastasele läbistavat lahingukahju. Sa võid ühe kaardi ära visata, et sihtida ühte rünnakupositsioonis olevat koletist, mida sinu vastane kontrollib; hävita see sihtmärk.

source: Fossil Warrior Skullking
et: Fossiilsõdalane Koljukuningas

source: 1 Rock-Type monster in your Graveyard + 1 Level 7 or higher monster in your opponent's Graveyard.<BR>This card cannot be Special Summoned except by the effect of "<M3748>Fossil Fusion<M>". When there is a monster your opponent controls after this monster's first attack of your Battle Phase, this monster can attack once again during the same Battle Phase. During battle between that attacking card and a Defense Position monster whose DEF is lower than the ATK of that card, inflict piercing damage to your opponent's Life Points.
et: 1 Kaljukivimitüüp koletis sinu Hauakambris + 1 Tase 7 või kõrgem koletis sinu vastase Hauakambris.<BR>Seda kaarti ei saa Eriliselt Kutsuda, välja arvatud "<M3748>Fossil Fusion<M>" efektiga. Kui sinu vastasel on koletis pärast selle koletise esimest rünnakut sinu Lahingufaasis, võib see koletis rünnata veel kord sama Lahingufaasi jooksul. Lahingu ajal, kui see ründav kaart võitleb Kaitseasendis koletisega, kelle DEF on madalam kui selle kaardi ATK, põhjusta läbistavat kahju oma vastase Elupunktidele.

source: Over Limit
et: Piirist Üle

source: Pay 500 Life Points. Special Summon from both player's Graveyards as many Normal Monsters as possible with 1000 or less ATK that were destroyed by battle this turn.
et: Makske 500 Elupunkti. Kutsu eriliselt välja mõlema mängija Hauakambrist nii palju Tavalisi Koletisi kui võimalik, mille ATK on 1000 või vähem ja mis hävitati sellel käigul lahingus.

source: Contact Out
et: Kontaktist Välja

source: Return 1 "Neos" Fusion Monster you control to the Extra Deck. If all the Fusion Material Monsters listed on that Fusion Monster are in your Deck, you can Special Summon them.
et: Tagasta 1 "Neos" Fusion Monster, mida sa kontrollid, Ekstra Paki. Kui kõik Fusion Material Monsters, mis on loetletud selle Fusion Monsteri peal, on sinu Pakis, saad sa need Special Summon'ida.

source: Swing of Memories
et: Mälestuste Kiik

source: Special Summon 1 Normal Monster from your Graveyard. It is destroyed during the End Phase of this turn.
et: Erikutsuge oma kalmistult 1 tavaline koletis. See hävitatakse selle käigu lõppfaasis.

source: Evil HERO Inferno Wing
et: Kuri Kangel Inferno Tiib

source: "<M6310>Elemental HERO Avian<M>" + "<M6311>Elemental HERO Burstinatrix<M>"<BR>Must be Special Summoned with "<M7262>Dark Fusion<M>" and cannot be Special Summoned by other ways. If this card attacks a Defense Position monster, inflict piercing Battle Damage to your opponent. When this card destroys a monster by battle and sends it to the Graveyard: Inflict damage to your opponent equal to either the ATK or DEF (whichever is higher) of the destroyed monster in the Graveyard.
et: "<M6310>Elemental HERO Avian<M>" + "<M6311>Elemental HERO Burstinatrix<M>"<BR>Peab olema eriliselt kutsutud "<M7262>Dark Fusion<M>" abil ja seda ei saa kutsuda muul viisil. Kui see kaart ründab kaitsepositsioonis olevat koletist, tekitab see vastasele läbistavat lahingukahju. Kui see kaart hävitab lahingus koletise ja saadab selle Hauakambrisse: Tekitab vastasele kahju, mis on võrdne kas Hauakambris oleva hävitatud koletise rünnaku- või kaitsepunktidega (olenevalt sellest, kumb on suurem).

source: Evil HERO Malicious Edge
et: Kuri Kangelas Malicious Edge

source: If your opponent controls a monster, you can Tribute Summon this card with 1 Tribute. If this card attacks a Defense Position monster, inflict piercing Battle Damage to your opponent.
et: Kui sinu vastasel on koletis, saad selle kaardi välja kutsuda ühe ohvriga. Kui see kaart ründab kaitseasendis koletist, tekitab see vastasele läbistavat lahingukahju.

source: Evil HERO Infernal Gainer
et: Kuri Kangelas Põrgulik Võitja

source: During your Main Phase 1: You can banish this card to target 1 face-up Fiend-Type monster you control; that target can attack twice during each Battle Phase. During your second Standby Phase after this effect was activated: Special Summon this banished card in face-up Attack Position.
et: Oma peafaasi 1 ajal: Sa võid selle kaardi eemaldada mängust, et valida sihtmärgiks 1 ülespööratud Deemon-tüüpi koletis, mida sa kontrollid; see sihtmärk võib rünnata kaks korda iga lahingufaasi ajal. Teise ooteetapi ajal pärast selle efekti aktiveerimist: Kutsu see eemaldatud kaart eriliselt välja ülespööratud rünnakupositsioonis.

source: Evil HERO Lightning Golem
et: Kuriangli KANGEL Välgu Golem
