Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: Inflict damage to your opponent equal to the original ATK of 1 face-up "<M4088>Red Eyes B. Dragon<M>" you control. "<M4088>Red Eyes B. Dragon<M>" cannot attack the turn you activate this card.
et: Tekita oma vastasele kahju, mis on võrdne sinu kontrollitava 1 avatud "<M4088>Red Eyes B. Dragon<M>" algse rünnakuga. "<M4088>Red Eyes B. Dragon<M>" ei saa rünnata sellel käigul, mil sa aktiveerid selle kaardi.

source: The Graveyard in the Fourth Dimension
et: Neljas dimensioonis asuv surnuaed

source: Add 2 "LV" monsters from your Graveyard to your Deck and shuffle it.
et: Lisa oma kalmistult 2 "LV" koletist oma pakki ja sega see läbi.

source: Two-Man Cell Battle
et: Kahe Mehe Lahing

source: During each player's End Phase, the turn player can Special Summon 1 Level 4 Normal Monster from their hand.
et: Iga mängija lõppfaasis võib käigu mängija eriliselt kutsuda 1. taseme 4 tavalise koletise oma käest.

source: Big Wave Small Wave
et: Suur laine, väike laine

source: Destroy all face-up WATER monsters on your side of the field. Then you can Special Summon WATER monsters from your hand, up to the same number of monsters destroyed by this effect.
et: Hävita kõik sinu väljaku avatud positsioonis olevad VEE koletised. Seejärel saad eriliselt kutsuda VEE koletisi oma käest, kuni sama arv koletisi, mis selle efekti tõttu hävitati.

source: Fusion Weapon
et: Fusioonirelv

source: Equip only to a Level 6 or lower Fusion Monster. The equipped monster gains 1500 ATK and DEF.
et: Varusta ainult 6. taseme või madalama Fusion Monsteriga. Varustatud koletis saab 1500 ATK ja DEF juurde.

source: Ritual Weapon
et: Rituaalrelv

source: Equip only to a Level 6 or lower Ritual Monster. The equipped monster gains 1500 ATK and DEF.
et: Varusta ainult 6. taseme või madalama rituaalikoletisega. Varustatud koletis saab 1500 ATK ja DEF juurde.

source: Activate only during your opponent's Main Phase 1, select 1 monster on your side of the field. While the selected card remains on the field, if your opponent attacks with a monster(s) this turn, they must select the selected monster as the attack target.
et: Aktiveeri ainult oma vastase peafaas 1 ajal, vali 1 koletis oma väljaku poolelt. Kuni valitud kaart jääb väljale, peab vastane sellel käigul koletisega rünnates valima rünnaku sihtmärgiks valitud koletise.

source: Absolute End
et: Absoluutne Lõpp

source: Activate only during your opponent's turn. This turn, the attacks from your opponent's monsters become direct attacks.
et: Aktiveeri ainult oma vastase käigu ajal. Sellel käigul muutuvad sinu vastase koletiste rünnakud otsesteks rünnakuteks.

source: Spirit Barrier
et: Vaimu Barjäär

source: While you control a monster(s), you take no Battle Damage.
et: Kui sa kontrollid koletist(eid), ei saa sa lahingukahju.

source: Ninjitsu Art of Decoy
et: Peibutuse Ninjitsu Kunst

source: Activate by selecting 1 face-up "Ninja" monster on your side of the field. The selected monster cannot be destroyed by battle (damage calculation is applied normally).
et: Aktiveeri, valides oma väljaku poolelt 1 avatud "Ninja" koletise. Valitud koletist ei saa lahingus hävitada (kahju arvutamine toimub tavapäraselt).

source: Enervating Mist
et: Nõrgestav Udu

source: Your opponent's hand size limit becomes 5.
et: Sinu vastase käe suuruse piiranguks saab 5.

source: Heavy Slump
et: Raske langus

source: Activate only when your opponent has 8 or more cards in their hand. Your opponent adds their hand to the Deck, shuffles it, and draws 2 cards.
et: Aktiveeri ainult siis, kui sinu vastasel on käes 8 või rohkem kaarti. Sinu vastane lisab oma käe pakki, segab selle ja tõmbab 2 kaarti.

source: Greed
et: Ahnus

source: Each time a player draws cards because of a card effect, they take 500 damage during the End Phase for each card drawn by the card effect.
et: Iga kord, kui mängija tõmbab kaarte kaardiefekti tõttu, saavad nad End Phase'i ajal 500 kahju iga kaardiefekti tõttu tõmmatud kaardi eest.

source: Mind Crush
et: Mõttepurustus

source: Declare 1 card name; if that card is in your opponent's hand, they must discard all copies of it from their hand to the Graveyard, otherwise you discard 1 random card.
et: Teata 1 kaardi nimi; kui see kaart on sinu vastase käes, peavad nad kõik selle kaardi koopiad oma käest Hauakambrisse viskama, vastasel juhul viskad sa ühe juhusliku kaardi ära.

source: Cemetary Bomb
et: Kalmistupomm

source: Inflict 100 damage to your opponent for each card in their Graveyard.
et: Tekita oma vastasele 100 kahju iga kaardi eest nende Hauakambris.

source: Hallowed Life Barrier
et: Pühitsetud Elu Barjäär

source: Discard 1 card. This turn, any damage you take from your opponent's cards and effects becomes 0.
et: Viska 1 kaart. Sellel käigul muutub kogu kahju, mida saad vastase kaartidest ja efektidest, nulliks.

source: The Tricky
et: Trikimees

source: You can Special Summon this card from your hand by discarding 1 card.
et: Saad selle kaardi oma käest eriliselt välja kutsuda, kui viskad ühe kaardi ära.

source: Green Gadget
et: Roheline Vidin

source: When you Normal Summon or Special Summon this card, you can add 1 "<M6155>Red Gedget<M>" from your Deck to your hand.
et: Kui sa kutsud selle kaardi Normaal- või Erikutsega välja, saad lisada 1 "<M6155>Red Gedget<M>" oma pakist oma kätte.

source: Stronghold the Moving Fortress
et: Liikuv kindlus Stronghold

source: After activation, Special Summon this card in Defense Position: it is treated as an Effect Monster Card (Machine-Type/EARTH/Level 4/ATK 0/DEF 2000). (This card is still treated as a Trap Card.) While "<M6151>Green Gadget<M>", "<M6155>Red Gedget<M>", and "<M6156>Yellow Gadget<M>" are all face-up on your side of the field, the ATK of this card becomes 3000.
et: Pärast aktiveerimist kutsu see kaart välja kaitsepositsioonis: seda käsitletakse kui Efektikoletise Kaarti (Masina-Tüüp/MAA/Tase 4/RÜN 0/KAITSE 2000). (Seda kaarti käsitletakse endiselt kui Lõksukaarti.) Kui "<M6151>Roheline Vidin<M>", "<M6155>Punane Vidin<M>" ja "<M6156>Kollane Vidin<M>" on kõik sinu väljaku poolel avatud, muutub selle kaardi RÜN 3000-ks.

source: Red Gedget
et: Punane Gedžet

source: When you Normal Summon or Special Summon this card, you can add 1 "<M6156>Yellow Gadget<M>" from your Deck to your hand.
et: Kui sa kutsud selle kaardi normaalselt või eriliselt välja, saad lisada 1 "<M6156>Yellow Gadget<M>" oma pakist oma kätte.

source: Yellow Gadget
et: Kollane Vidin

source: When you Normal Summon or Special Summon this card, you can add 1 "<M6151>Green Gadget<M>" from your Deck to your hand.
et: Kui sa kutsud selle kaardi tavakutsumise või erikutsumise teel välja, saad lisada oma pakist ühe "<M6151>Roheline Vidin<M>" oma kätte.

source: Tricky Spell 4
et: Trikkiloits 4

source: Send 1 face-up "The Tricky" you control to the Graveyard. For each monster your opponent controls, Special Summon a "<M3920>Tricky Token<M>" (Spellcaster-Type/WIND/Level 5/ATK 2000/DEF 1200) in Defense Position. "<M3920>Tricky Token<M>"(s) cannot declare an attack.
et: Saada 1 avatud "The Tricky", mida sa kontrollid, Hauakambrisse. Iga vastase kontrollitava koletise kohta kutsu eriliselt välja "<M3920>Tricky Token<M>" (Loitsija-tüüp/TUUL/Tase 5/ATK 2000/DEF 1200) kaitseasendis. "<M3920>Tricky Token<M>"(id) ei saa rünnakut kuulutada.

source: Shattered Axe
et: Purustatud Kirves

source: Select 1 face-up monster on the field. It loses 500 ATK during each of your Standby Phases. When the monster is destroyed, destroy this card.
et: Vali 1 avatud koletis väljal. See kaotab 500 ATK iga sinu Ootefaaside ajal. Kui koletis hävitatakse, hävita see kaart.

source: Blockman
et: Blokimees

source: By Tributing this face-up card, Special Summon in Defense Position a number of "<M3921>Block Token<M>"(s) (Rock-Type/EARTH/Level 4/ATK 1000/DEF 1500) equal to the number of turns this card has been face-up on your side of the field. These tokens cannot declare an attack.
et: Ohverdades selle avatud kaardi, kutsu kaitsepositsioonis erikutsungiga välja arv "<M3921>Blokimärgi<M>"(e) (Kiviliik/MAA/Tase 4/ATK 1000/DEF 1500), mis on võrdne selle kaardi sinu väljaku poolel avatud oleku pöörete arvuga. Need märgid ei saa rünnakut kuulutada.

source: Gold Sarcophagus
et: Kuldne Sargofag

source: Select and remove from play 1 card in your Deck. During your second Standby Phase after this card's activation, add the removed card to your hand.
et: Vali ja eemalda mängust 1 kaart oma pakist. Teise ootejärgu ajal pärast selle kaardi aktiveerimist lisa eemaldatud kaart oma kätte.

source: Silent Swordsman LV3
et: Vaikne Mõõgamees LV3

source: Negate the effects of your opponent's Spell Cards that target this card. During your Standby Phase, you can send this face-up card to the Graveyard to Special Summon 1 "Silent Swordsman LV5" from your hand or Deck. (You cannot activate this effect the turn this card is Normal Summoned, Special Summoned, or flipped face-up.)
et: Negateeri oma vastase Võlukaartide efektid, mis sihivad seda kaarti. Oma Ootefaasil saad saata selle avatud kaardi Hauakambrisse, et Kutsuda Eriliselt välja 1 "Vaikne Mõõgamees LV5" oma käest või Pakist. (Sa ei saa seda efekti aktiveerida sellel käigul, kui see kaart on Tavaliselt Kutsutud, Eriliselt Kutsutud või avatud.)

source: Silent Swordsman LV5
et: Vaikne Mõõgamees LV5

source: This card is unaffected by the effects of your opponent's Spell Cards. If this card inflicts Battle Damage to your opponent by a direct attack, during your next Standby Phase, you can send this face-up card to the Graveyard to Special Summon 1 "Silent Swordsman LV7" from your hand or Deck.
et: See kaart ei ole mõjutatud sinu vastase Loitsukaartide efektidest. Kui see kaart tekitab sinu vastasele lahingukahju otsese rünnakuga, siis oma järgmise Ootefaasiga saad sa saata selle avatud kaardi Hauakambrisse, et Kutsuda Eriliselt välja 1 "Silent Swordsman LV7" oma käest või Pakist.

source: Silent Swordsman LV7
et: Vaikne Mõõgamees LV7

source: This card cannot be Normal Summoned or Set. This card cannot be Special Summoned except by the effect of "Silent Swordsman LV5". As long as this card remains face-up on your side of the field, negate the effect of all Spell Cards on the field.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti ei saa eriliselt kutsuda, välja arvatud "Silent Swordsman LV5" efekti abil. Kuni see kaart jääb sinu väljale avatud olekusse, tühista kõigi väljal olevate loitsukaartide efekt.

source: Silent Magician LV4
et: Vaikne Maag LV4

source: Each time your opponent draws a card(s), place 1 Spell Counter on this card (max. 5). This card gains 500 ATK for each Spell Counter on it. During the Standby Phase of your next turn after the 5th Counter is placed on this card, you can send this card with 5 Spell Counters on it to the Graveyard to Special Summon 1 "Silent Magician LV8" from your hand or Deck.
et: Iga kord, kui sinu vastane tõmbab kaardi(d), pane sellele kaardile 1 Loitsuloendur (max. 5). See kaart saab iga Loitsuloenduri eest 500 ATK-d. Järgmise käigu Ootefaasil pärast 5. Loenduri paigutamist sellele kaardile, saad saata selle kaardi koos 5 Loitsuloenduriga Hauakambrisse, et Kutsuda Eriliselt välja 1 "Vaikne Maag LV8" oma käest või Pakist.

source: Magician's Circle
et: Maagiring

source: Activate only when a Spellcaster-Type monster declares an attack. Each player Special Summons 1 Spellcaster-Type monster with 2000 or less ATK from their Deck in face-up Attack Position.
et: Aktiveeri ainult siis, kui Loitsija-tüüpi koletis kuulutab välja rünnaku. Iga mängija kutsub oma pakist eriliselt välja ühe Loitsija-tüüpi koletise, millel on 2000 või vähem rünnakupunkti, avatud rünnakupositsioonis.

source: Magician's Unite
et: Maagide Ühendus

source: Activate only while you control 2 or more face-up Attack Position Spellcaster-Type monsters; select 1 of them. That monster's ATK becomes 3000 until the end of this turn. Other Spellcaster-Type monsters you control cannot attack this turn.
et: Aktiveeri ainult siis, kui sul on kontrolli all 2 või rohkem ründepositsioonis ülespööratud Loitsija-tüüpi koletist; vali üks neist. Selle koletise ATK muutub selle käigu lõpuni 3000-ks. Teised sinu kontrolli all olevad Loitsija-tüüpi koletised ei saa sellel käigul rünnata.

source: Silent Magician LV8
et: Vaikne Maag LV8

source: This card cannot be Normal Summoned or Set. This card cannot be Special Summoned except by the effect of "Silent Magician LV4". This card is unaffected by the effects of your opponent's Spell Cards.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti ei saa eriliselt kutsuda, välja arvatud "Silent Magician LV4" efekti abil. See kaart ei ole mõjutatud sinu vastase loitsukaartide efektidest.

source: The new form of the enigmatic Inpachi, remodeled by cutting-edge Dark World technology. Maneuverability has been sacrificed for strong armor, which is considered more important.
et: Enigmatilise Inpachi uus vorm, mis on ümber kujundatud tipptasemel Dark World tehnoloogia abil. Manööverdusvõime on ohverdatud tugeva soomuse nimel, mida peetakse olulisemaks.

source: Mighty Guard
et: Võimas Kaitsja

source: A machine soldier that was developed as a guard. It is made of rust-proof metal.
et: Masinsõdur, mis töötati välja valvurina. See on valmistatud roostevabast metallist.

source: Bokoichi the Freightening Car
et: Bokoichi, Hirmutav Auto

source: A freight car that is exclusively for Dekoichi. It can transport anything, but most cargo arrives broken.
et: Dekoichi jaoks mõeldud kaubavagun. See võib transportida kõike, kuid enamik lastist jõuab kohale purunenuna.

source: Harpie Girl
et: Harpyetüdruk

source: A Harpie chick who aspires to flit about beautifully and gorgeously, but attack sharply.
et: Harpyetibu, kes ihkab lennelda kaunilt ja suurejooneliselt, kuid rünnata teravalt.

source: The Creator
et: Looja

source: This card cannot be Special Summoned from the Graveyard. Once per turn, you can select 1 monster in your Graveyard, then send 1 card from your hand to the Graveyard and Special Summon that monster.
et: Seda kaarti ei saa eriliselt kutsuda hauast. Kord käigu jooksul võid valida 1 koletise oma hauas, seejärel saata 1 kaardi oma käest hauasse ja eriliselt kutsuda see koletis.

source: The Creator Incarnate
et: Looja kehastus

source: You can Tribute this card to Special Summon 1 "The Creator" from your hand.
et: Saate selle kaardi ohverdada, et Kutsuda 1 "Looja" oma käest.

source: Ultimate Insect LV3
et: Ülim Putukas LV3

source: If this card was Special Summoned by the effect of "Ultimate Insect LV1", while it remains on the field all of your opponent's monsters lose 300 ATK. During your Standby Phase, by sending this face-up card to the Graveyard, Special Summon 1 "Ultimate Insect LV5" from your hand or Deck. (You cannot activate this effect the turn this card is Normal Summoned, Special Summoned, or flipped face-up.)
et: Kui see kaart kutsuti eriliselt välja "Ultimate Insect LV1" efekti abil, kaotavad kõik sinu vastase koletised 300 ATK, kuni see jääb väljakule. Sinu ootejärgus, saates selle avatud kaardi Hauakambrisse, kutsu eriliselt välja 1 "Ultimate Insect LV5" oma käest või pakist. (Sa ei saa seda efekti aktiveerida sellel käigul, kui see kaart kutsuti tavaliselt välja, eriliselt välja või pöörati avatud asendisse.)

source: Mystic Swordsman LV6
et: Müstiline Mõõgamees LV6

source: If you Normal Summon this card, you must place it in face-down Defense Position. If this card attacks a face-down Defense Position monster, destroy the monster immediately with this card's effect without flipping it face-up or applying damage calculation. You can return the monster destroyed with this effect to the top of its owner's Deck, instead of sending it to the Graveyard.
et: Kui sa kutsud selle kaardi tavakutsena, pead selle asetama näoga allapoole kaitseasendisse. Kui see kaart ründab näoga allapoole kaitseasendis olevat koletist, hävita koletis kohe selle kaardi efektiga, ilma et see ümber pöörataks või rakendataks kahju arvutust. Sa võid hävitatud koletise selle efektiga saata selle omaniku paki tippu, selle asemel et saata see hauakambrisse.

source: Heavy Mech Support Platform
et: Raske Mehhanismi Toetusplatvorm

source: Once per turn, during your Main Phase, you can equip this card to a Machine-Type monster you control as an Equip Card, OR unequip it and Special Summon it in face-up Attack Position. While equipped to a monster by this effect, that monster gains 500 ATK and DEF. (A monster can only be equipped with 11 Union Monster at a time. If the equipped monster would be destroyed, this card is destroyed instead.)
et: Korra ühe korra oma peafaasil saad selle kaardi kinnitada oma juhitavale Masinatüüpi koletisele Varustuskaardina VÕI eemaldada selle ja Kutsuda see Eriliselt esile rünnakupositsioonis. Kui see on selle efekti abil koletisele kinnitatud, saab see koletis 500 ATK ja DEF juurde. (Koletisele saab korraga kinnitada ainult ühe Liidu Koletise. Kui kinnitatud koletis hävitatakse, hävitatakse selle asemel see kaart.)

source: Element Magician
et: Elementide Maag

source: This monster gets the following effect(s) while there is a monster(s) with the following Attribute(s) on the field:<BR>● WATER: Control of this card cannot switch.<BR>● WIND: If this card destroyed your opponent's monster by battle, it can attack once again in a row.
et: See koletis saab järgmise(d) efekti(d), kui väljakul on järgmise(te) atribuudi(te)ga koletis(ed):<BR>● VESI: Selle kaardi kontrolli ei saa vahetada.<BR>● TUUL: Kui see kaart hävitas lahingus sinu vastase koletise, võib see rünnata veel kord järjest.

source: This monster gets the following effect(s) while there is a monster(s) with the following Attribute(s) on the field:<BR>● FIRE: This card gains 500 ATK.<BR>● EARTH: Negate the effect of an Effect Monster that this card destroyed by battle.
et: See koletis saab järgmise(d) efekti(d), kui väljakul on järgmise(te) atribuudi(te)ga koletis(ed):<BR>● TULI: See kaart saab 500 ATK juurde.<BR>● MAA: Tühista Efektikoletise efekt, mille see kaart lahingus hävitas.

source: Roc from the Valley of Haze
et: Uduorg Hägude Orust

source: When this card is sent directly from your hand to the Graveyard, add this card to the Deck and shuffle it.
et: Kui see kaart saadetakse otse sinu käest Hauakambrisse, lisa see kaart tagasi Paki ja sega see läbi.

source: If this card battles a monster, toss a coin and call heads or tails before damage calculation. If you call it right, destroy the opponent's monster with this effect.
et: Kui see kaart võitleb koletisega, viska münti ja ütle "kull" või "kiri" enne kahju arvutamist. Kui arvad õigesti, hävita vastase koletis selle efektiga.

source: Harpie Lady 1
et: Harpyia Leedi 1

source: This card's name is always treated as "<M4068>Harpie Lady<M>". All WIND monsters gain 300 ATK.
et: Selle kaardi nimeks loetakse alati "<M4068>Harpie Lady<M>". Kõik TUULE-elemendi koletised saavad 300 ATK juurde.

source: Harpie Lady 2
et: Harpyia Leedi 2

source: This card's name is always treated as "<M4068>Harpie Lady<M>". Negate the effects of any Flip Effect Monsters that this monster destroys by battle.
et: Selle kaardi nimeks loetakse alati "<M4068>Harpie Lady<M>". Tühista kõigi Flip Effect Monsterite efektid, mille see koletis lahingus hävitab.

source: Harpie Lady 3
et: Harpy Daam 3

source: This card's name is always treated as "<M4068>Harpie Lady<M>". Your opponent's monster that battles with this card cannot declare an attack for your opponent's next 2 turns.
et: Selle kaardi nimeks loetakse alati "<M4068>Harpie Lady<M>". Sinu vastase koletis, kes selle kaardiga võitleb, ei saa sinu vastase järgmise 2 käigu jooksul rünnakut kuulutada.

source: Raging Flame Sprite
et: <translated Raev Leegisprite

source: This card can attack your opponent directly. Each time this card successfully attacks directly, it gains 1000 ATK.
et: See kaart saab rünnata otse sinu vastast. Iga kord, kui see kaart ründab edukalt otse, saab see 1000 ATK juurde.

source: Thestalos the Firestorm Monarch
et: Thestalos, Tormoneeride Monarh

source: When this card is Tribute Summoned, discard 1 random card from your opponent's hand. If it was a Monster Card, inflict damage to your opponent equal to its Level x 100.
et: Kui see kaart on ohverdamisega välja kutsutud, viska oma vastase käest juhuslikult 1 kaart ära. Kui see oli koletisekaart, tekita oma vastasele kahju, mis on võrdne selle taseme x 100-ga.

source: Eagle Eye
et: Kotkasilm

source: When this card is Normal Summoned successfully, no Trap Cards can be activated.
et: Kui see kaart on edukalt Normaal-Kutsutud, ei saa lõksukaarte aktiveerida.

source: Tactical Espionage Expert
et: Taktikaline spionaažiekspert

source: Invasion of Flames
et: Leekide sissetung

source: Creeping Doom Manta
et: Hiiliv Manta

source: Pitch-Black Warwolf
et: Süsimust Sõjasusi

source: Your opponent cannot activate Trap Cards during the Battle Phase.
et: Sinu vastane ei saa Lahingufaasis lõksukaarte aktiveerida.

source: Mirage Dragon
et: Mirage Draakon

source: Gaia Soul the Combustible Collective
et: Gaia Hing, Põlev Kollektiiv

source: You can tribute up to 2 Pyro-Type monsters. If you do this, this card gains ATK equal to the number of tributed monsters x 1000. During battle between this card and a Defense Position monster whose DEF is lower than the ATK of this card, inflict the difference as Battle Damage to your opponent. Destroy this card at the end of this turn.
et: Saad ohverdada kuni 2 Pyro-tüüpi koletist. Kui teed seda, saab see kaart ATK-d võrdse ohverdatud koletiste arvuga x 1000. Lahingu ajal selle kaardi ja kaitseasendis koletise vahel, mille DEF on madalam kui selle kaardi ATK, põhjusta vahe oma vastasele lahingukahjuna. Hävita see kaart selle käigu lõpus.

source: Fox Fire
et: Rebane Tuli

source: During the End Phase of a turn when this face-up card attacked or was attacked and was destroyed by battle, Special Summon this card from the Graveyard. This card cannot be Tributed for a Tribute Summon.
et: End Phase'i ajal, kui see avatud kaart ründas või teda rünnati ja ta hävitati lahingus, kutsu see kaart Hauakambrist eriliselt välja. Seda kaarti ei saa kasutada Tribuutkutsumiseks.

source: Big Core
et: Suur Südamik

source: Put 3 counters on this card when you Normal Summon it. This card cannot be destroyed as a result of battle. If this card battles a monster, remove 1 counter from this card at the end of the Damage Step. If this card battles without a counter, destroy this card at the end of the Damage Step.
et: Pange sellele kaardile 3 loendurit, kui sa selle Normaal-Kutsud. Seda kaarti ei saa lahingu tulemusena hävitada. Kui see kaart võitleb koletisega, eemalda 1 loendur selle kaardi pealt Kahjustuse Etapi lõpus. Kui see kaart võitleb ilma loendurita, hävita see kaart Kahjustuse Etapi lõpus.

source: Fusilier Dragon, the Dual-Mode Beast
et: Fusilier-draakon, kahe režiimiga metsaline

source: You can Normal Summon or Set this card without Tributing. If you do, its original ATK and DEF are halved.
et: Seda kaarti saab tavaliselt välja kutsuda või asetada ilma ohverdusteta. Kui teete seda, siis selle algne ATK ja DEF vähenevad poole võrra.

source: Dekoichi the Battlechanted Locomotive
et: Dekoichi, lahingulauluga vedur

source: FLIP: Draw 1 card. For each face-up "Bokoichi the Freightening Car" you control, draw an additional card.
et: FLIP: Tõmba 1 kaart. Iga avatud "Bokoichi the Freightening Car" eest, mida sa kontrollid, tõmba lisakaart.

source: A-Team: Trap Disposal Unit
et: A-Rühm: Lõksude Likvideerimise Üksus
