Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: FLIP: Draw 1 card.
et: FLIP: Tõmba 1 kaart.

source: FLIP: Return 1 monster on the field to its owner's hand.
et: FLIP: Tagasta 1 koletis väljakult selle omaniku kätte.

source: A missile-launching fish protected by deadly spikes.
et: Surmavate ogadega kaitstud rakette tulistav kala.

source: This monster captures other fish with its long tongue and sucks the energy out of them.
et: See koletis püüab oma pika keelega teisi kalu ja imeb neist energia välja.

source: Dharma Cannon
et: Dharma kahur

source: A monstrous creature whose body is fitted with cannons that never miss their targets.
et: Kohutav olend, kelle keha on varustatud kahuritega, mis ei eksi kunagi oma sihtmärkidest.

source: "<M4042>The Snake Hair<M>" + "<M4016>Blackland Fire Dragon<M>"
et: "<M4042>Madude Juuksed<M>" + "<M4016>Mustamaa Tuld Hingav Draakon<M>"

source: Wow Warrior
et: Vau Sõdalane

source: A fish with arms, legs, and some very sharp teeth.
et: Kala, kellel on käed, jalad ja väga teravad hambad.

source: When the control of this face-up card on the field shifts to your opponent, increase your Life Points by 3000 points. This effect can only be used once as long as this card remains face-up on the field.
et: Kui selle avatud kaardi kontroll väljakul läheb sinu vastasele, suurenda oma Elupunkte 3000 punkti võrra. Seda efekti saab kasutada ainult üks kord, kuni see kaart jääb väljakule avatuks.

source: Bone Mouse
et: Luukhiir

source: A mouse that has returned as a zombie to seek revenge on cats
et: Kasside vastu kättemaksu otsiv zombina naasnud hiir

source: Frog the Jam
et: Konna-Konna

source: A slime with the head of a frog, it attacks by croaking terribly.
et: Konnapea limukas, kes ründab kohutavalt krooksudes.

source: With an enormous maw and massive teeth, this monstrosity is one dangerous and strange Serpent from the deep.
et: Oma suure lõuaga ja massiivsete hammastega on see koletis üks ohtlik ja kummaline madu sügavikust.

source: Dark Elf
et: Tume Elf

source: This card requires a cost of 1000 of your own Life Points to attack
et: Selle kaardi ründamiseks on vaja maksta 1000 oma Elupunkti

source: Winged Dragon, Guardian of the Fortress #2
et: Tiivuline Draakon, Kindluse Valvur #2

source: This monster's wings are capable of generating tornadoes.
et: Selle koletise tiivad on võimelised tekitama tornaadosid.

source: Mushroom Man #2
et: Seene Mees #2

source: A player controlling this monster loses 300 Life Points during each of his/her Standby Phases when this card is face-up on the field. Control of this card is shifted to your opponent by paying 500 Life Points at your own End Phase.
et: Mängija, kes kontrollib seda koletist, kaotab 300 Elupunkti iga oma Ootefaasiga, kui see kaart on lahinguväljal avatud. Selle kaardi kontroll antakse vastasele üle, makstes oma Lõppfaasis 500 Elupunkti.

source: Lava Battleguard
et: Lava Lahingvalvur

source: Increase the ATK of this monster by 500 points for each face-up "<M4018>Swamp Battleguard<M>" on your side of the field.
et: Suurenda selle koletise ATK-d 500 punkti võrra iga sinu väljaku poolel oleva avatud "<M4018>Swamp Battleguard<M>" eest.

source: A crimson dragon that spits fireballs to create a blazing sea of fire.
et: Karmiinpunane draakon, kes sülitab tulepalle, et luua leegitsev tulemeri.

source: The Wandering Doomed
et: Rändav Hukatus

source: A monster that wanders the edges of the netherworld.
et: Koletis, kes rändab allilma äärealadel.

source: Steel Ogre Grotto #1
et: Terass Ogre Grotto #1

source: A steel idol worshipped in the Land of Machines.
et: Teraseest iidol, mida kummardatakse Masinate Maal.

source: Pot the Trick
et: Triki Pott

source: A not-so-powerful servant, he is an errand boy of a master sorcerer.
et: Mitte eriti võimas teenija, ta on meistersorceri jooksupoiss.

source: Oscillo Hero
et: Ostsillo Kangelane

source: A strange warrior from another dimension.
et: Kummaline sõdalane teisest dimensioonist.

source: Invader from Another Dimension
et: Sissetungija teisest dimensioonist

source: An extraterrestrial monster that came from a distant galaxy.
et: Ekstraterrestraalne koletis, kes tuli kaugelt galaktikast.

source: Lesser Dragon
et: Väike Draakon

source: A minor dragon incapable of breathing fire.
et: Väike draakon, kes ei suuda tuld hingata.

source: Needle Worm
et: Nõeluss

source: FLIP: Discard 5 cards from the top of your opponent's Deck to the Graveyard.
et: FLIP: Saada 5 kaarti oma vastase paki pealt hauakambrisse.

source: Wretched Ghost of the Attic
et: Pööningul kummitav vaim

source: A harmless monster found lurking in just about any attic.
et: Kahjutu koletis, keda võib leida peaaegu igas pööningul.

source: Great Mammoth of Goldfine
et: Suurepärane Goldfine'i mammut

source: "<M4042>The Snake Hair<M>" + "<M4103>Dragon Zombie<M>"
et: "<M4042>Madude Juuksed<M>" + "<M4103>Draakoni Zombi<M>"

source: Man-eating Black Shark
et: Inimsööja Must Hai

source: "<M4480>Sea Kamen<M>" + "<M4652>Gruesome Goo<M>" + "<M4632>Amazon of the Seas<M>"
et: "<M4480>Merekameele<M>" + "<M4652>Õudne Lima<M>" + "<M4632>Mere-Amazon<M>"

source: Yormungarde
et: Jormungarde

source: An extremely long snake that dwells in the world of myth.
et: Äärmiselt pikk madu, kes elab müütide maailmas.

source: Darkworld Thorns
et: Pimeduse Okkad

source: A thorny plant found in the darklands that wraps itself around any unwary traveler.
et: Okastaimed, mida leidub pimedates maades ja mis mässivad end ümber iga ettevaatamatu ränduri.

source: Man-like dinosaur with a high I.Q. that is lacking in strength.
et: Inimese sarnane dinosaurus, kellel on kõrge I.Q., kuid kes on jõuetu.

source: Drooling Lizard
et: Nirisev Sisalik

source: A blood-sucking snake in human form that attacks any living being that passes nearby.
et: Veriimev madu inimkujul, kes ründab kõiki läheduses mööduvaid elusolendeid.

source: A tiger-striped dragon that is often seen racing across the wasteland at tremendous speeds.
et: Tiigriribaline draakon, keda sageli nähakse tohutu kiirusega üle tühermaa kihutamas.

source: B. Dragon Jungle King
et: B. Draakoni Džunglikuningas

source: A jet-black dragon found in the deepest jungles who normally devours trees.
et: Sügavates džunglites leitud süsimust draakon, kes tavaliselt sööb puid.

source: Empress Judge
et: Keisrinna Kohtunik

source: "<M4641>Queen's Double<M>" + "<M4655>Hibikime<M>"
et: "<M4641>Kuninganna Duubel<M>" + "<M4655>Hibikime<M>"

source: Little D
et: Väike D

source: A tyrannosaurus offspring with a vicious disposition.
et: Türannosauruse järglane, kellel on õel iseloom.

source: Witch of the Black Forest
et: Musta metsa nõid

source: When this card is sent from the field to the Graveyard, select 1 monster with a DEF of 1500 or less from your Deck, show it to your opponent, and add to your hand. Then shuffle your Deck.
et: Kui see kaart saadetakse väljakult Hauakambrisse, vali oma pakist 1 koletis, mille DEF on 1500 või vähem, näita seda oma vastasele ja lisa see oma kätte. Seejärel sega oma pakk.

source: Ancient One of the Deep Forest
et: Sügava metsa iidne olend

source: This creature adopts the form of a white goat living in the forest, but is actually a Forest Elder.
et: See olend võtab metsas elava valge kitse kuju, kuid tegelikult on ta Metsavanem.

source: Giant Scorpion of the Tundra
et: Tundra hiigelskorpion

source: An extraordinary blue scorpion found in the tundra, not in the desert.
et: Ebatavaline sinine skorpion, kes leidub tundras, mitte kõrbes.

source: Crow Goblin
et: Vares Goblin

source: A clever long-nosed goblin, he is a force to be reckoned with.
et: Taibukas pika ninaga goblin, kellega tuleb arvestada.

source: Leo Wizard
et: Leo Võlur

source: A mysterious magician that cloaks itself with a black cape. Its identity is a talking lion beast.
et: Salapärane musta keepi kandev mustkunstnik. Tema tegelik identiteet on rääkiv lõvimõrsja.

source: Abyss Flower
et: Kuristiku Õis

source: A rarely seen flower that blossoms quietly on the edge of darkness.
et: Harva nähtav lill, mis õitseb vaikselt pimeduse äärel.

source: Patrol Robo
et: Patrull-Robo

source: During your Standby Phase, you can look at 1 face-down card that's been Set by your opponent as long as this card remains face-up on the field.
et: Oma Ooteva Faasi ajal saad vaadata ühte vastase poolt asetatud kinnist kaarti, seni kuni see kaart jääb lahinguväljale avatud olekusse.

source: This bird is known far and wide as a harbinger of doom.
et: Seda lindu tuntakse laialdaselt kui hukatuse kuulutajat.

source: Dark Witch
et: Tume Nõid

source: A popular creature in mythology that delivers fatal attacks with a sharp spear.
et: Populaarne olend mütoloogias, kes annab surmavaid lööke terava odaga.

source: Weather Report
et: Ilmateade

source: FLIP: Destroys all of your opponent's face-up "<M4354>Swords of Revealing Light<M>" cards on the field. If "<M4354>Swords of Revealing Light<M>" is destroyed, you can perform your Battle Phase twice this turn (or your next turn, if activated during opponent's turn).
et: FLIP: Hävita kõik sinu vastase avatud "<M4354>Paljastava Valguse Mõõgad<M>" kaardid väljal. Kui "<M4354>Paljastava Valguse Mõõgad<M>" hävitatakse, saad sellel käigul (või järgmisel käigul, kui aktiveeriti vastase käigu ajal) sooritada oma Lahingufaasi kaks korda.

source: Binding Chain
et: Siduv ahel

source: The mystic links of this chain can rob enemies of their power.
et: Selle ahela müstilised lülid võivad vaenlastelt nende jõu röövida.

source: Mechanical Snail
et: Mehaaniline Tigu

source: A cyborg snail that still travels at a slow pace.
et: Küborg-tigu, kes liigub endiselt aeglaselt.

source: Greenkappa
et: Rohekappa

source: FLIP: Target 2 face-down Spell/Trap Cards on the field; destroy both.
et: FLIP: Sihti 2 näoga all olevat Võlu-/Lõksukaarti väljal; hävita mõlemad.

source: A further step in the evolutionary chain, it is much more powerful than "Larvas".
et: Edasine samm evolutsioonilises ahelas, see on palju võimsam kui "Larvas".

source: Living Vase
et: Elav vaas

source: A living vase that bites enemies and blinds them with a blast of its flower.
et: Elav vaas, mis hammustab vaenlasi ja pimestab neid oma lille purskega.

source: Tentacle Plant
et: <translated Kombitsent

source: A carnivorous plant that has an outgrowth of tentacles. It attacks someone nearby by extending its tentacles.
et: Lihasööja taim, millel on kombitsate väljakasv. See ründab lähedal asuvat isikut, sirutades oma kombitsaid.

source: Beaked Snake
et: Nokaga Madu

source: This monster wraps itself around an opponent and pecks away with its huge beak.
et: See koletis mähib end vastase ümber ja nokib oma hiiglasliku nokaga.

source: Morphing Jar
et: Muundumispurk

source: FLIP: Both players discard all the cards in their hands, then draw 5 cards.
et: FLIP: Mõlemad mängijad viskavad kõik kaardid oma käest ära, seejärel tõmbavad 5 kaarti.

source: A fairy of the arts that is unbeatable on the harp.
et: Kunstide haldjas, kes on harfil võitmatu.

source: Giant Turtle Who Feeds on Flames
et: Leeke, kes toitub leekidest

source: A crimson-shelled tortoise that feeds on flames.
et: Leekarva, mis toitub leekidest.

source: Rose Spectre of Dunn
et: Dunni Roosispekter

source: "<M4012>Feral Imp<M>" + "<M4626>Snakeyashi<M>"
et: "<M4012>Metsik Imp<M>" + "<M4626>Snakeyashi<M>"

source: Fiend Reflection #1
et: Deemoni peegeldus #1

source: This monster can draw its enemies into a mirror world that renders them helpless.
et: See koletis suudab tõmmata oma vaenlased peegelmaailma, mis muudab nad abituks.

source: Ghoul with an Appetite
et: Söögiisuga ghoul

source: A monster with a heavy appetite that has never been satisfied.
et: Koletis, kellel on raske isu, mida pole kunagi rahuldatud.

source: Pale Beast
et: Kahvatu metsaline

source: With skin tinged a bluish-white, this strange creature is a fearsome sight to behold.
et: Selle kummalise olendi nahk on sinakasvalge, mis teeb ta hirmuäratavaks vaatepildiks.

source: Little Chimera
et: Väike kameeleon

source: As long as this card remains face-up on the field, increase the ATK of all FIRE monsters by 500 points and decrease the ATK of all WATER monsters by 400 points.
et: Niikaua kui see kaart jääb väljale avatud olekus, suurenda kõigi TULEKAHJU koletiste ATK-d 500 punkti võrra ja vähenda kõigi VEE koletiste ATK-d 400 punkti võrra.

source: Violent Rain
et: Vägivaldne Vihm

source: This monster can call forth sudden torrents of battering rain.
et: See koletis suudab esile kutsuda äkilisi paduvihmahooge.

source: Key Mace #2
et: Võtmevasar #2

source: This fiend brings out the worst in everyone.
et: See deemon toob kõigis välja halvimad küljed.

source: Tenderness
et: Õrnus

source: An adorable fairy that celebrates the gift of love.
et: Armas haldjas, kes tähistab armastuse kingitust.

source: Penguin Soldier
et: Pingviinisõdur

source: FLIP: You can return up to 2 Monster Cards from the field to the owner's hand.
et: FLIP: Saad kuni 2 koletiskaarti väljakult omaniku kätte tagasi.

source: Fairy Dragon
et: Haldjas Draakon

source: This beautiful Dragon spirit harbors hidden strength.
et: See kaunis Draakoni vaim peidab endas varjatud jõudu.

source: Obese Marmot of Nefariousness
et: Pahatahtlikkuse Rasvane Marmosett

source: An ill-mannered field varmint that will sink its teeth into anything.
et: Halvasti käituv põllurott, kes hammustab kõike, mis ette jääb.

source: Liquid Beast
et: Vedeliku Koletis

source: A liquid life form that thrives on water.
et: Vedelikuline eluvorm, mis elab vees.

source: Twin Long Rods #2
et: Kaksikpikad Vardad #2

source: An amphibious creature with two whip-like tails.
et: Kahe piitsataolise sabaga kahepaikne olend.

source: Great Bill
et: Suur Arve

source: Nothing escapes from this beast's massive mouth.
et: Mitte miski ei pääse selle metsalise massiivsest suust.

source: Shining Friendship
et: Särav Sõprus

source: The peacemaker among monsters.
et: Rahusobitaja koletiste seas.

source: Bladefly
et: Terakärbes

source: As long as this card remains face-up on the field, increase the ATK of all WIND monsters by 500 points and decrease the ATK of all EARTH monsters by 400 points.
et: Niikaua kui see kaart jääb väljale avatud olekusse, suurenda kõigi TUULE-olendite rünnakupunkte 500 võrra ja vähenda kõigi MAA-olendite rünnakupunkte 400 võrra.

source: Electric Lizard
et: Elektriline Sisalik

source: A non Zombie-Type monster attacking "<M4616>Electric Lizard<M>" cannot attack on its following turn.
et: Mittetundlik zombitüüp, kes ründab "<M4616>Electric Lizard<M>", ei saa rünnata oma järgmisel käigul.

source: Hiro's Shadow Scout
et: Hiro varivaritseja

source: FLIP: Your opponent draws 3 cards. Both players look at the cards. If there are any Spell Cards among them, discard all those Spell Card(s) to the Graveyard.
et: FLIP: Sinu vastane tõmbab 3 kaarti. Mõlemad mängijad vaatavad kaarte. Kui nende seas on mõni Võlukaart, visake kõik need Võlukaardid Hauakambrisse.

source: Lady of Faith
et: Usu Naine

source: Soothes the souls of others by chanting a mysterious spell.
et: Rahustab teiste hingi, lausudes salapärast loitsu.

source: Twin-Headed Thunder Dragon
et: Kaksikpeaga Äikese Draakon

source: 2 × "<M4431>Thunder Dragon<M>"
et: 2 × "<M4431>Äikese Draakon<M>"

source: Hunter Spider
et: Küttämisämblik

source: This monster feeds on whatever it catches in its web.
et: See koletis toitub kõigest, mis ta oma võrku püüab.

source: Armored Starfish
et: Soomusrüügas

source: A bluish starfish with a solid hide capable of fending off attacks.
et: Sinakas meritäht, mille tugev kest suudab rünnakuid tõrjuda.

source: Hourglass of Courage
et: Julge liivakell

source: If this card is Normal or Flip Summoned, its original ATK and DEF are halved until the End Phase of your next turn. After that, the original ATK and DEF are doubled.
et: Kui see kaart on normaal- või ümberpööratud kutsutud, siis selle algne ATK ja DEF vähenevad poole võrra kuni sinu järgmise käigu lõppfaasini. Pärast seda algne ATK ja DEF kahekordistuvad.

source: Marine Beast
et: Merekoletis

source: "<M4436>Water Magician<M>" + "<M4556>Behegon<M>"
et: "<M4436>Vee Maag<M>" + "<M4556>Behegon<M>"

source: Warrior of Tradition
et: Traditsiooni Sõdalane

source: "<M4305>Sonic Maid<M>" + "<M4240>Beautiful Headhuntress<M>"
et: "<M4305>Sonic Neiu<M>" + "<M4240>Kaunis Peajahi<M>"

source: Rock Spirit
et: Kivivaim

source: A fairy of boulders that looks like an earthenware statue. It is quite strong in terms of both attack and defense.
et: Kivihaldjas, kes näeb välja nagu savist kuju. See on üsna tugev nii rünnaku kui ka kaitse poolest.

source: This monster is formed by several serpents that break off to individually attack nearby enemies.
et: See koletis on moodustatud mitmest maost, kes eralduvad, et individuaalselt rünnata lähedalasuvaid vaenlasi.

source: Succubus Knight
et: Sukkubus Rüütel

source: A warrior wizard adept in casting bone-chilling spells.
et: Luukülmi loitse valdav sõjamees-maag.

source: Ill Witch
et: Paha Nõid

source: This monster blasts enemies with unexpected bursts of wind.
et: See koletis paiskab vaenlasi ootamatute tuulepuhangutega.

source: The Thing That Hides in the Mud
et: Asi, mis peidab end mudas

source: This monster melts its way underground to attack enemies from below.
et: See koletis sulab maa alla, et rünnata vaenlasi altpoolt.

source: High Tide Gyojin
et: Kõrge Tõusu Gyojin

source: A very agile half-fish warrior known for its relentless attacks.
et: Väga vilgas poolkala sõdalane, kes on tuntud oma halastamatute rünnakute poolest.

source: Fairy of the Fountain
et: Purskkaevu haldjas

source: This fairy protects a fountain from any who seek to muddy its waters.
et: See haldjas kaitseb purskkaevu kõigi eest, kes püüavad selle vett sogaseks muuta.

source: Amazon of the Seas
et: Mere amazon

source: A mermaid who serves as herald of the Ocean Lord. She protects the sacred domain of Atlantis.
et: Merineitsi, kes teenib Ookeani Isanda kuulutajana. Ta kaitseb Atlantise püha valdust.

source: A fast and lethal creature with very dangerous claws.
et: Kiire ja surmav olend väga ohtlike küünistega.

source: Witch's Apprentice
et: Nõia Õpipoiss

source: As long as this card remains face-up on the field, increase the ATK of all DARK monsters by 500 points and decrease the ATK of all LIGHT monsters]by 400 points.
et: Niikaua kui see kaart jääb väljale avatud olekusse, suurenda kõigi PIMEDUS koletiste ATK-d 500 punkti võrra ja vähenda kõigi VALGUS koletiste ATK-d 400 punkti võrra.

source: Armored Rat
et: Soomustatud Rott

source: The fur on this monster rat is tough enough to repel swords.
et: Selle koletisroti karv on piisavalt tugev, et tõrjuda mõõku.

source: Ancient Lizard Warrior
et: Muistne Sisalikusõdalane

source: Before the dawn of man, this lizard warrior ruled supreme.
et: Enne inimese koidikut valitses see sisalikusõdalane ülimuslikult.

source: Maiden of the Moonlight
et: Kuuvalguse Neiu

source: A sorcerer blessed by lunar light with powers far beyond mortal comprehension.
et: Kuuvalguse poolt õnnistatud nõid, kelle võimed ületavad surelike arusaamise.

source: Stone Ogre Grotto
et: Kivikoletis

source: A behemoth shaped by giant boulders.
et: Hiiglane, mis on kujundatud hiiglaslikest rahnudest.

source: Winged Egg of New Life
et: Uue Elu Tiivuline Muna

source: Legend has it that this creature can foretell the birth of children.
et: Legend räägib, et see olend suudab ennustada laste sündi.

source: Night Lizard
et: Öölisandik

source: A lizard warrior protected by a hide of very tough emerald scales.
et: Smaragdrohelist soomustega kaitstud sisalikusõdalane.

source: Queen's Double
et: Kuninganna Duubel

source: Blue-Winged Crown
et: Sinitiivaline kroon

source: With hair shaped like a crown and a body encased in bluish white flames, this bird is a formidable sight.
et: Kroonikujuliste juustega ja sinakasvalgete leekidega kaetud kehaga on see lind hirmuäratav vaatepilt.

source: A guardian of the woods, this massive tree is believed to be immortal.
et: Metsade kaitsja, seda massiivset puud peetakse surematuks.

source: Queen of Autumn Leaves
et: Sügislehtede Kuninganna

source: Queen of the Emerald Forest and wife of the Spirit King, she lives surrounded by vivid red leaves.
et: Emeraldi metsa kuninganna ja Vaimukuningas naine, ta elab erksate punaste lehtede keskel.

source: Amphibious Bugroth
et: Amfiibne Bugroth

source: "<M4281>Ground Attacker Bugroth<M>" + "<M4451>Sentinel of the Seas<M>"
et: "<M4281>Maapealne Ründaja Bugroth<M>" + "<M4451>Merevalvur<M>"

source: Acid Crawler
et: Happeline roomaja

source: A giant caterpillar that secretes an acid mist that melts anything.
et: Hiiglaslik röövik, mis eritab hapet, mis sulatab kõike.

source: Invader of the Throne
et: Troonile tungija

source: FLIP: Select 1 monster on your opponent's side of the field and switch control of it with this card. This effect cannot be activated during the Battle Phase.
et: FLIP: Vali 1 koletis oma vastase väljaku poolelt ja vaheta selle kaardi kontroll selle koletisega. Seda efekti ei saa aktiveerida Lahingufaasis.

source: Mystical Sheep #1
et: Müstiline Lammas #1

source: Disk Magician
et: Kettamaag

source: This monster hides in a saucer and only appears when executing an attack.
et: See koletis peidab end taldrikus ja ilmub ainult rünnaku sooritamisel.

source: Flame Viper
et: Leekmadu

source: A fire-breathing snake whose speed makes it a difficult target.
et: Tulehinge sülgav madu, kelle kiirus teeb temast raske sihtmärgi.

source: Royal Guard
et: Kuninglik valvur

source: A mechanized soldier created to protect royalty.
et: Mehhaniseeritud sõdur, loodud kuningliku perekonna kaitsmiseks.

source: Gruesome Goo
et: <translatedÕudne Lima

source: A slime boss that is definitely tougher than it looks.
et: Limaboss, kes on kindlasti tugevam, kui ta välja paistab.

source: This amphibian is strong on the attack, but leaves much to be desired when defending.
et: See kahepaikne on rünnakul tugev, kuid kaitsmisel jätab palju soovida.

source: Machine Attacker
et: Masina Ründaja

source: This machine, created to lead charges into enemy territory, mows down enemies by rushing.
et: See masin, mis on loodud vaenlase territooriumile rünnakute juhtimiseks, niidab vaenlasi maha tormates.

source: Confuses enemies with a noise that is harsh to the ears.
et: Segab vaenlasi müraga, mis on kõrvadele karm.

source: Whiptail Crow
et: Piitsaba Vares

source: Attacks from the skies with a whip-like tail.
et: Ründab taevast piitsataolise sabaga.

source: Kunai with Chain
et: Kett koos ketiga

source: Choose 1 or both of these effects:<BR>● Activate only when an opponent's monster attacks. Change the attacking monster to Defense Position.<BR>● Equip this card to a monster you control. It gains 500 ATK.
et: Vali 1 või mõlemad neist efektidest:<BR>● Aktiveeri ainult siis, kui vastase koletis ründab. Muuda ründav koletis kaitsepositsiooni.<BR>● Varusta see kaart koletisega, mida sa kontrollid. See saab 500 ATK juurde.

source: Magical Labyrinth
et: Maagiline labürint

source: Equip "<M4372>Labyrinth Wall<M>" with this card. You can Special Summon "<M4375>Wall Shadow<M>" from your Deck by Tributing "<M4372>Labyrinth Wall<M>" equipped with this card.
et: Varusta "<M4372>Labyrinth Wall<M>" selle kaardiga. Sa saad eriliselt kutsuda "<M4375>Wall Shadow<M>" oma pakist, ohverdades "<M4372>Labyrinth Wall<M>", mis on selle kaardiga varustatud.

source: Warrior Elimination
et: Sõdalase Likvideerimine

source: Destroy all face-up Warrior-Type monsters on the field.
et: Hävita kõik lahinguväljal olevad püstised Sõdalase-tüüpi koletised.

source: Salamandra
et: Salamander

source: A FIRE monster equipped with this card increases its ATK by 700 points.
et: TULE-atribuutiga koletis, kellele see kaart on varustatud, suurendab oma ATK-d 700 punkti võrra.

source: Eternal Rest
et: Igaavene Puhkus
