Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: "<M6653>Elemental Hero Neos<M>" + "<M7171>Rainbow Dragon<M>" or "<M7406>Rainbow Dark Dragon<M>"<BR>Must be Fusion Summoned with the above Fusion Material Monsters and cannot be Special Summoned by other ways. Once per turn: You can activate 1 of these effects.<BR>● Send 1 monster you control to the Graveyard; shuffle all monsters your opponent controls into the Deck.<BR>● Send 1 Spell/Trap Card you control to the Graveyard; shuffle all Spell and Trap Cards your opponent controls into the Deck.<BR>● Send 1 card from the top of your Deck to the Graveyard; shuffle all cards in your opponent's Graveyard into the Deck.
et: "<M6653>Elementaalne Kangelane Neos<M>" + "<M7171>Vikerkaare Draakon<M>" või "<M7406>Vikerkaare Tume Draakon<M>"<BR>Peab olema Fusion Summon'itud ülaltoodud Fusion Material Monster'itega ja ei saa olla Special Summon'itud muul viisil. Kord ühe käigu jooksul: Sa saad aktiveerida ühe neist efektidest.<BR>● Saada 1 sinu kontrollitav monster Hauakambrisse; sega kõik sinu vastase kontrollitavad monster'id tagasi Deck'i.<BR>● Saada 1 sinu kontrollitav Loitsu/Lõksu Kaart Hauakambrisse; sega kõik sinu vastase kontrollitavad Loitsu ja Lõksu Kaardid tagasi Deck'i.<BR>● Saada 1 kaart oma Deck'i pealt Hauakambrisse; sega kõik sinu vastase Hauakambris olevad kaardid tagasi Deck'i.

source: Rainbow Veil
et: Vikerkaareloor

source: If the equipped monster battles an opponent's monster, while that monster is on the field its effect(s) is negated during the Battle Phase only.
et: Kui varustatud koletis võitleb vastase koletisega, siis selle koletise mõju(d) on lahingufaasi ajal tühistatud ainult siis, kui see on väljakul.

source: Super Polymerization
et: Superpolümerisatsioon

source: Discard 1 card; send, from either side of the field to the Graveyard, Fusion Material Monsters that are listed on a Fusion Monster Card, then Special Summon that monster from your Extra Deck. (This Special Summon is treated as a Fusion Summon.) Spells, Traps, and card effects cannot be activated in response to this card's activation.
et: Viska 1 kaart; saada mõlemalt väljaku poolelt Hauakambrisse Fusion Materjal Koletised, mis on loetletud Fusion Koletise Kaardil, seejärel Kutsu see koletis oma Ekstra Paki seast Eriliselt välja. (See Eriline Väljakutse loetakse Fusion Väljakutseks.) Loitsud, Lõksud ja kaardi efektid ei saa aktiveeruda vastusena selle kaardi aktiveerimisele.

source: Vicious Claw
et: Õel Küünis

source: The equipped monster gains 300 ATK. If the equipped monster would be destroyed by battle, return this card to its owner's hand instead. Then, destroy 1 monster, except the one that battled the equipped monster, and inflict 600 damage to your opponent. After that, Special Summon 1 "<M3939>Evil Token<M>" (Fiend-Type/DARK/Level 7/ATK 2500/DEF 2500) on your opponent's side of the field. During the turn this card is returned to your hand, you cannot use1 "<M7446>Vicious Claw<M>" from your hand.
et: Varustatud koletis saab 300 ATK juurde. Kui varustatud koletis hävitatakse lahingus, tagasta see kaart selle omaniku kätte. Seejärel hävita 1 koletis, välja arvatud see, mis võitles varustatud koletisega, ja tekita oma vastasele 600 kahju. Pärast seda kutsu eriliselt esile 1 "<M3939>Evil Token<M>" (Deemon-Tüüp/PIMEDUS/Tase 7/ATK 2500/DEF 2500) oma vastase väljaku poolele. Sellel käigul, kui see kaart tagastatakse sinu kätte, ei saa sa kasutada 1 "<M7446>Vicious Claw<M>" oma käest.

source: Instant Neo Space
et: Hetkeline Neo Kosmos

source: Equip only to a Fusion Monster that lists "<M6653>Elemental Hero Neos<M>" as a Fusion Material Monster. Its does not have to have activate its effect during the End Phase to shuffle itself into the Extra Deck. If the equipped monster leaves the field: You can Special Summon 1 "<M6653>Elemental Hero Neos<M>" from your hand, Deck, or Graveyard.
et: Varusta ainult Fusion Monsterile, mis loetleb "<M6653>Elemental Hero Neos<M>" kui Fusion Material Monster. Sellel ei pea olema oma efekti aktiveerimiseks End Phase'i ajal, et end Extra Decki tagasi segada. Kui varustatud koletis lahkub väljakult: Sa võid Special Summonida 1 "<M6653>Elemental Hero Neos<M>" oma käest, Deckist või Graveyardist.

source: Mirage Tube
et: Mirage'i Toru

source: This card cannot be activated from your hand. Activate only when a face-up monster you control is selected as an attack target. Inflict 1000 damage to your opponent.
et: Seda kaarti ei saa aktiveerida oma käest. Aktiveeri ainult siis, kui sinu kontrollitav avatud koletis valitakse rünnaku sihtmärgiks. Põhjusta oma vastasele 1000 kahju.

source: Spell Chronicle
et: Loitsukroonika

source: Send all cards in your hand to the Graveyard. Select and remove from play 5 Spell or Trap Cards from your Deck. Each time your opponent activates a Spell Card, place 1 Chronicle Counter on this card. You can remove 2 Chronicle Counters from this card to have your opponent select 1 of the cards removed from play with this card's effect, and add it to your hand. When this card is removed from the field, you take 500 damage for each card that is still removed from play due to this card's effect.
et: Saada kõik kaardid oma käest Hauakambrisse. Vali ja eemalda mängust 5 Loitsu- või Lõksukaarti oma Pakist. Iga kord, kui sinu vastane aktiveerib Loitsukaardi, aseta sellele kaardile 1 Kroonika Loendur. Sa saad eemaldada 2 Kroonika Loendurit sellelt kaardilt, et lasta oma vastasel valida 1 kaart, mis on selle kaardi efektiga mängust eemaldatud, ja lisa see oma kätte. Kui see kaart eemaldatakse väljakult, saad sa 500 kahju iga kaardi eest, mis on endiselt mängust eemaldatud selle kaardi efekti tõttu.

source: Dimension Explosion
et: Dimensiooni Plahvatus

source: Return 1 face-up Fusion Monster you control to the Fusion Deck. Both players select up to 2 of their monsters that are removed from play, and Special Summon them.
et: Tagasta 1 avatud Fusion Monster, mida sa kontrollid, Fusion Decki. Mõlemad mängijad valivad kuni 2 oma koletist, mis on mängust eemaldatud, ja Special Summonivad need.

source: Cybernetic Zone
et: Küberneetiline tsoon

source: Select 1 face-up Machine-Type Fusion Monster you control and remove it from play until the End Phase of this turn. When that monster is returned to the field double its ATK. During your next Standby Phase, destroy it.
et: Vali 1 avatud Masina tüüpi Fusion Monster, mida sa kontrollid, ja eemalda see mängust kuni selle käigu lõppfaasini. Kui see koletis naaseb väljakule, kahekordista selle ATK. Järgmise ooteetapi ajal hävita see.

source: The Beginning of the End
et: Lõpu Algus

source: Activate only if there are 7 or more DARK monsters in your Graveyard. Remove from play 5 DARK monsters from your Graveyard to draw 3 cards.
et: Aktiveeri ainult siis, kui sinu kalmistul on 7 või rohkem PIMEDUS koletist. Eemalda mängust 5 PIMEDUS koletist oma kalmistult, et tõmmata 3 kaarti.

source: Dark Eruption
et: Pime Eruptsioon

source: Target 1 DARK monster with 1500 or less ATK in your Graveyard; add that target to your hand.
et: Vali sihtmärgiks 1 PIMEDUS koletis, millel on 1500 või vähem ATK-d sinu Hauas; lisa see sihtmärk oma kätte.

source: Fires of Doomsday
et: Hukatuspäevade Tulekolded

source: If you activate this card, you cannot Summon other monsters this turn. Special Summon 2 "<M3940>Doomsday Token<M>" (Fiend-Type/DARK/Level 1/ATK 0/DEF 0) in Defense Position. These tokens cannot be Tributed for a Tribute Summon, unless it is for a DARK monster.
et: Kui aktiveerid selle kaardi, ei saa sa sellel käigul teisi koletisi kutsuda. Kutsu eriliselt välja 2 "<M3940>Doomsday Token<M>" (Deemonitüüp/PIMEDUS/Tase 1/ATK 0/DEF 0) kaitsepositsioonis. Neid žetoone ei saa kasutada ohverdusena ohverduskutsumiseks, välja arvatud juhul, kui see on PIMEDUS koletis.

source: Unleash Your Power!
et: Vabasta oma jõud!

source: All Gemini monsters that were on your side of the field when this card was activated are treated as Effect Monsters, and gain their effect(s). During the End Phase of this turn, Set all monsters affected by this card's effect.
et: Kõiki Kaksikute koletisi, kes olid selle kaardi aktiveerimise ajal sinu väljaku poolel, käsitletakse Efektikoletistena ja nad saavad oma efekti(d). Selle käigu lõppfaasis aseta kõik selle kaardi efektist mõjutatud koletised tagurpidi.

source: Chain Summoning
et: Ahelakutsumine

source: Activate only as Chain Link 3 or higher. You can Normal Summon or Set up to 3 times this turn. You cannot activate this card if multiple cards/effects with the same name are in that Chain.
et: Aktiveeri ainult kui Ahela Lülitus 3 või kõrgem. Sa võid sellel käigul Normaal-Kutsuda või Seada kuni 3 korda. Sa ei saa seda kaarti aktiveerida, kui selles Ahelas on mitu sama nimega kaarti/efekti.

source: Acidic Downpour
et: Happeline Vihm

source: All EARTH monsters lose 500 ATK and gain 400 DEF.
et: Kõik MAA koletised kaotavad 500 ATK ja saavad 400 DEF juurde.

source: Six Samurai United
et: Kuusamurai Ühendatud

source: Each time a "Six Samurai" monster(s) is Normal Summoned or Special Summoned, place 1 Bushido Counter on this card (max. 2). You can send this card to the Graveyard to draw 1 card for each Bushido Counter on this card.
et: Iga kord, kui "Kuue Samuraid" koletis(ed) kutsutakse tavalisel või erilisel viisil, pane sellele kaardile 1 Bushido loendur (maks. 2). Sa saad saata selle kaardi Hauakambrisse, et tõmmata 1 kaart iga Bushido loenduri kohta sellel kaardil.

source: Gladiator Beast's Battle Archfiend Shield
et: Gladiaatoribeasti Lahingukaardiväe Kilp

source: Equip only to a "Gladiator Beast" monster. If the equipped monster would be destroyed, this card is destroyed instead. When the equipped monster is returned from your side of the field to the Deck, and this card is sent to the Graveyard, return this card to your hand.
et: Varusta ainult "Gladiator Beast" koletisega. Kui varustatud koletis hävitatakse, hävitatakse selle asemel see kaart. Kui varustatud koletis tagastatakse sinu väljalt pakki ja see kaart saadetakse hauakambrisse, tagasta see kaart oma kätte.

source: Gladiator Proving Ground
et: Gladiaatorite Treeningväljak

source: Add 1 Level 4 or lower "Gladiator Beast" monster from your Deck to your hand.
et: Lisa oma pakist 1. taseme 4 või madalama "Gladiator Beast" koletis oma kätte.

source: Dark World Grimoire
et: Tume Maailma Grimoiir

source: During your End Phase, if you discard a Monster Card(s) to the Graveyard because you had more than 6 cards in your hand, you can Special Summon 1 of those monsters.
et: End Phase'i ajal, kui sa viskad Monster Card(i) Hauakambrisse, kuna sul oli käes rohkem kui 6 kaarti, võid sa Special Summon'ida ühe neist koletistest.

source: Rainbow Path
et: Vikerkaartee

source: When an opponent's monster declares an attack: Send 1 "Crystal Beast" card from your Spell & Trap Card Zone to the Graveyard to target the attacking monster; negate the attack, then you can add 1 "<M7171>Rainbow Dragon<M>" or "<M7406>Rainbow Dark Dragon<M>" from your Deck to your hand.
et: Kui vastase koletis kuulutab välja rünnaku: Saada 1 "Crystal Beast" kaart oma Loitsu ja Lõksu Kaarditsoonist Hauakambrisse, et sihtida ründavat koletist; tühista rünnak, seejärel saad lisada 1 "<M7171>Rainbow Dragon<M>" või "<M7406>Rainbow Dark Dragon<M>" oma pakist kätte.

source: Rainbow Life
et: Vikerkaare Elu

source: Discard 1 card. Until the end of this turn, whenever you would take damage you gain that amount of Life Points instead.
et: Viska 1 kaart. Kuni selle käigu lõpuni saad sa iga kord, kui sa peaksid saama kahju, selle asemel sama palju Elupunkte.

source: Sinister Seeds
et: Kurjuse Seemned

source: Activate only when a face-up Attack Position monster you control is destroyed by battle. Special Summon 1 "<M3941>Sinister Seed Token<M>" (Plant-Type/DARK/Level 1/ATK 100/DEF 100) for every 500 points of Battle Damage you took from that battle.
et: Aktiveeri ainult siis, kui sinu kontrollitav ründepositsioonis olev avatud koletis hävitatakse lahingus. Kutsu eriliselt esile 1 "<M3941>Sinister Seed Token<M>" (Taimetüüp/PIMEDUS/Tase 1/RÜN 100/KAITSE 100) iga 500 lahingukahju punkti eest, mida sa sellest lahingust said.

source: Hate Buster
et: Vihkamise Purustaja

source: Activate only when a face-up Fiend-Type monster you control is selected as an attack target. Select the opponent's attacking monster and your attack target monster, destroy them and inflict damage to your opponent equal to the original ATK of the opponent's destroyed attacking monster.
et: Aktiveeri ainult siis, kui sinu kontrollitav ülespoole suunatud Deemon-tüüpi koletis valitakse rünnaku sihtmärgiks. Vali vastase ründav koletis ja sinu rünnaku sihtmärgiks olev koletis, hävita need ja tekita vastasele kahju, mis on võrdne vastase hävitatud ründava koletise algse rünnakujõuga.

source: Chain Material
et: Ahelaine Materjal

source: Any time you Fusion Summon a monster this turn, you can remove from play, from your side of the field, Deck, hand or Graveyard, Fusion Material Monsters that are listed on the Fusion Monster Card, and use them as Fusion Material Monsters. You cannot attack during the turn this card is activated. If you used this effect for a Fusion Summon, the Summoned Fusion Monster is destroyed during the End Phase.
et: Iga kord, kui sa sellel käigul kutsud välja Fusion-koletise, saad eemaldada mängust oma väljakult, pakist, käest või Hauakambrist Fusion Materjal Koletised, mis on loetletud Fusion Koletise Kaardil, ja kasutada neid Fusion Materjal Koletistena. Sa ei saa rünnata sellel käigul, mil see kaart aktiveeritakse. Kui kasutasid seda efekti Fusion-kutsumiseks, hävitatakse kutsutud Fusion Koletis Lõppfaasis.

source: Alchemy Cycle
et: Alkeemia Tsükkel

source: The original ATK of all face-up monsters you control becomes 0, until the End Phase. Each time a monster that had its original ATK reduced to 0 by this effect is destroyed by battle and sent to the Graveyard, draw 1 card.
et: Kõigi sinu kontrolli all olevate avatud koletiste algne ATK muutub 0-ks kuni lõppfaasini. Iga kord, kui koletis, mille algne ATK selle efekti tõttu 0-ks vähendati, hävitatakse lahingus ja saadetakse hauakambrisse, tõmba 1 kaart.

source: Cybernetic Hidden Technology
et: Küberneetiline Varjatud Tehnoloogia

source: When an opponent's monster declares an attack, you can send 1 "<M6390>Cyber Dragon<M>" you control, or a Fusion Monster you control that lists "<M6390>Cyber Dragon<M>" as a Fusion Material Monster to the Graveyard. Destroy the attacking monster.
et: Kui vastase koletis kuulutab välja rünnaku, saad saata 1 "<M6390>Küberdraakon<M>", mida sa kontrollid, või Fusion Koletise, mida sa kontrollid ja mis loetleb "<M6390>Küberdraakon<M>" kui Fusion Materjal Koletis, Hauakambrisse. Hävita ründav koletis.

source: Dark Spirit Art - Greed
et: Pimeduse Vaimukunst - Ahnus

source: Tribute 1 DARK monster. Draw 2 cards. Your opponent can negate this effect by revealing 1 Spell Card in their hand.
et: Lohista 1 PIMEDUS koletis. Tõmba 2 kaarti. Sinu vastane võib selle efekti tühistada, paljastades 1 Loitsukaardi oma käes.

source: Dark Illusion
et: Tume Illusioon

source: Negate the activation of a Spell Card, Trap Card, or Effect Monster's effect that targets a face-up DARK monster, and destroy that card.
et: Negateeri püstise PIMEDA koletise sihtmärgiks oleva Loitsukaardi, Lõksukaardi või Efektikoletise efekti aktiveerimine ja hävita see kaart.

source: Escape from the Dark Dimension
et: Põgenemine Pimedast Dimensioonist

source: Target 1 of your banished DARK monsters; Special Summon that target. When this card leaves the field, destroy and banish that target. When that target is destroyed, destroy this card.
et: Vali 1 oma eemaldatud PIMEDUSE koletistest; Kutsu see sihtmärk eriliselt välja. Kui see kaart lahkub väljakult, hävita ja eemalda see sihtmärk. Kui see sihtmärk hävitatakse, hävita see kaart.

source: Gemini Trap Hole
et: Kaksikute Lõksuauk

source: Activate only when a Gemini Monster that is treated as an Effect Monster is destroyed by battle. Destroy all monsters your opponent controls.
et: Aktiveeri ainult siis, kui lahingus hävitatakse Gemini koletis, mida käsitletakse Efektkoletisena. Hävita kõik koletised, mida sinu vastane kontrollib.

source: Drastic Drop Off
et: Drastiline Langus

source: Activate only when your opponent adds a card(s) from their Deck to their hand, including drawing a card(s). Your opponent discards 1 of those cards.
et: Aktiveeri ainult siis, kui su vastane lisab kaardi(d) oma pakist kätte, sealhulgas tõmbab kaardi(d). Sinu vastane viskab ühe neist kaartidest ära.

source: All-Out Attacks
et: Üldrünnakud

source: All monsters that are Special Summoned are changed to face-up Attack Position and must attack, if able, during the turn they are Special Summoned.
et: Kõik spetsiaalselt kutsutud koletised muudetakse rünnakupositsiooniks ja peavad ründama, kui võimalik, sellel käigul, mil nad spetsiaalselt kutsuti.

source: Double Tag Team
et: Topelt meeskonnatöö

source: Activate only when you successfully Special Summon a "Gladiator Beast" monster. Special Summon 1 Level 4 or lower "Gladiator Beast" monster from your hand or Deck.
et: Aktiveeri ainult siis, kui sa edukalt Kutsud Eriliselt välja "Gladiaatoribeast" koletise. Kutsu Eriliselt välja 1 4. taseme või madalam "Gladiaatoribeast" koletis oma käest või pakist.

source: Offering to the Snake Deity
et: Ohverdamine Maode Jumalale

source: Target 1 face-up Reptile-Type monster you control and 2 cards your opponent controls; destroy all three targets.
et: Vali 1 avatud Reptiil-tüüpi koletis, mida sa kontrollid, ja 2 kaarti, mida su vastane kontrollib; hävita kõik kolm sihtmärki.

source: Cry Havoc!
et: Külva kaost!

source: You can remove from play 1 monster from your Graveyard to Normal Summon or Set 1 Normal Monster from your hand. You can only activate this effect during your Main Phase.
et: Saad oma kalmistult eemaldada 1 koletise, et Normaal-Kutsuda või Asetada 1 Tavaline Koletis oma käest. Seda efekti saad aktiveerida ainult oma Põhifaasis.

source: Transmigration Break
et: Ümberkehastumise Katkestus

source: Any cards that would be returned to the Deck from the Graveyard are removed from play instead.
et: Mis tahes kaardid, mis peaksid Hauakambrist tagasi Paki minema, eemaldatakse mängust.

source: Fine
et: Hea

source: Discard 2 cards.
et: Viska 2 kaarti.

source: Gladiator Beast Octavius
et: Gladiaatorikutsar Octavius

source: When this card is Special Summoned by the effect of a "Gladiator Beast" monster: Target 1 face-down Spell or Trap Card in the Spell & Trap Card Zone; destroy that target. At the end of your Battle Phase, if this card attacked or was attacked: Shuffle this card into the Deck or discard 1 card.
et: Kui see kaart kutsutakse eriliselt välja "Gladiaatoribeast" koletise efekti abil: Sihti 1 allapoole pööratud Loitsu või Lõksukaart Loitsu & Lõksukaardi tsoonis; hävita see sihtmärk. Sinu Lahingufaasi lõpus, kui see kaart ründas või teda rünnati: Sega see kaart tagasi pakki või viska 1 kaart ära.

source: Gladiator Beast Torax
et: Gladiaatorikutsar Torax

source: If this card was Special Summoned by the effect of a "Gladiator Beast" monster, at the end of any Battle Phase that this card attacked or was attacked, you can return it to the Deck to draw 1 card.
et: Kui see kaart kutsuti eriliselt välja "Gladiaatoribeast" koletise efekti abil, siis iga lahingufaasi lõpus, kus see kaart ründas või teda rünnati, võid selle tagasi paki sisse panna, et tõmmata 1 kaart.

source: Test Tiger
et: Testitiiger

source: If you control a face-up "Gladiator Beast" monster, you can Special Summon this card (from your hand). You can Tribute this card to target 1 face-up "Gladiator Beast" monster you control; shuffle that target into the Deck, then Special Summon 1 "Gladiator Beast" from your Deck, and treat it as if it was Special Summoned by the effect of a "Gladiator Beast" monster.
et: Kui sa kontrollid avatud "Gladiator Beast" koletist, saad selle kaardi (oma käest) eriliselt kutsuda. Sa saad selle kaardi ohverdada, et sihtida 1 avatud "Gladiator Beast" koletist, mida sa kontrollid; sega see sihtmärk tagasi pakki, seejärel kutsu eriliselt 1 "Gladiator Beast" oma pakist ja käsitle seda nii, nagu see oleks eriliselt kutsutud "Gladiator Beast" koletise efekti abil.

source: Defensive Tactics
et: Kaitsetaktika

source: If you control a face-up "Gladiator Beast" monster: For the rest of this turn, monsters you control cannot be destroyed by battle, and any Battle Damage you take is reduced to 0. After this card resolves, put it on the bottom of your Deck.
et: Kui sa kontrollid avatud "Gladiator Beast" koletist: Selle käigu lõpuni ei saa sinu kontrollitavad koletised lahingus hävitatud ja kogu lahingukahju, mida sa saad, vähendatakse nullini. Pärast selle kaardi lahendamist pane see oma paki põhja.

source: Dragon Ice
et: Draakon Jää

source: When your opponent Special Summons a monster, you can discard 1 card to Special Summon this card from your hand or Graveyard. There can only be 1 face-up "Dragon Ice" monster on the field.
et: Kui sinu vastane kutsub eriliselt välja koletise, võid sa ühe kaardi ära visata, et see kaart oma käest või hauast eriliselt välja kutsuda. Väljakul võib olla ainult 1 avatud "Dragon Ice" koletis.

source: Tongue Twister
et: Keerutaja

source: If this card was Tribute Summoned, when it is sent from the field to the Graveyard, draw 2 cards and remove this card from play.
et: Kui see kaart kutsuti välja ohverdades, tõmmake 2 kaarti ja eemaldage see kaart mängust, kui see saadetakse väljakult hauakambrisse.

source: When this card is destroyed by battle, select 2 WATER monsters from your Deck and send them to your Graveyard.
et: Kui see kaart hävitatakse lahingus, vali oma pakist 2 VEE koletist ja saada need oma Hauakambrisse.

source: Royal Firestorm Guards
et: Kuninglikud Tulesõdalased

source: When this card is Normal Summoned, select 4 Pyro-Type monsters in your Graveyard. Return those cards to your Deck, then draw 2 cards.
et: Kui see kaart Normaal-Kutsutakse, vali 4 Pyro-Tüüpi koletist oma Hauakambris. Tagasta need kaardid oma Pakki, seejärel tõmba 2 kaarti.

source: Veil of Darkness
et: Pimeduse loor

source: During your Draw Phase, if you draw a DARK monster, you can reveal it and send it to the Graveyard to draw 1 more card.
et: Oma Tõmbamisfaasis, kui tõmbad PIMEDA koletise, võid selle paljastada ja saata Hauakambrisse, et tõmmata 1 kaart juurde.

source: Security Orb
et: Turvaorbi

source: Activate only when your opponent's monster declares an attack. Change the battle position of that monster. When this face-down card is destroyed and sent to the Graveyard by the effect of a Spell or Trap Card your opponent controls, destroy 1 monster on the field.
et: Aktiveeri ainult siis, kui sinu vastase koletis kuulutab välja rünnaku. Muuda selle koletise lahingupositsiooni. Kui see allapoole pööratud kaart hävitatakse ja saadetakse Hauakambrisse sinu vastase kontrollitava Loitsu või Lõksukaardi efekti tõttu, hävita 1 koletis väljal.

source: Fire Trooper
et: Tuleväelane

source: When this card is Summoned, you can send it to the Graveyard to inflict 1000 damage to your opponent.
et: Kui see kaart kutsutakse välja, võid selle saata Hauakambrisse, et tekitada oma vastasele 1000 kahju.

source: Elemental Hero Prisma
et: Elementaalne Kangelane Prisma

source: Once per turn: You can reveal 1 Fusion Monster from your Extra Deck, then send 1 of the Fusion Material Monsters listed on that card from your Main Deck to the Graveyard; this card's name becomes the sent monster's name until the End Phase.
et: Kord korra: Sa võid paljastada 1 Fusion Monsteri oma Extra Deckist, seejärel saata 1 Fusion Material Monsteri, mis on loetletud sellel kaardil, oma Main Deckist Hauakambrisse; selle kaardi nimi muutub saadetud koletise nimeks kuni End Phase'ini.

source: Card Ejector
et: Kaardieemaldaja
