Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: A very small dragon known for its vicious attacks.
et: Väga väike draakon, kes on tuntud oma ägedate rünnakute poolest.

source: Frenzied Panda
et: Raevukas Panda

source: A savage beast that carries a big bamboo stick for beating down its enemies.
et: Metsik metsaline, kes kannab suurt bambuskeppi, et oma vaenlasi maha lüüa.

source: Archfiend Marmot of Nefariousness
et: Kurjuse Kuradikobras

source: An air marmot that has a nefarious horn and wings. It attacks by throwing acorns.
et: Õhumarmot, kellel on kurjakuulutav sarv ja tiivad. See ründab tammetõrusid visates.

source: Phantom Ghost
et: Fantoomkummitus

source: A vengeful spirit made up of many restless souls.
et: Paljudest rahututest hingedest koosnev kättemaksuhimuline vaim.

source: This cannon-like creature fires eyeballs so fast they can't be seen.
et: See kahuritaoline olend tulistab silmamunasid nii kiiresti, et neid ei ole näha.

source: This ugly monster emits a highly poisonous gas.
et: See inetu koletis eritab väga mürgist gaasi.

source: Twin Long Rods #1
et: Kaksikpikad Vardad #1

source: With whip-like arms, this creature can attack enemies from a distance.
et: <translated Piitsataoliste kätega suudab see olend rünnata vaenlasi kaugelt.

source: Droll Bird
et: Naljakas Lind

source: This monster stuns its enemies with a massive beak and ear-piercing wails.
et: See koletis uimastab oma vaenlasi massiivse nokaga ja kõrvulukustavate karjetega.

source: Petit Angel
et: Väike Inglike

source: A quick-moving and tiny fairy that's very difficult to hit.
et: Kiirelt liikuv ja väike haldjas, keda on väga raske tabada.

source: Winged Cleaver
et: Tiivulõikur

source: Few can withstand the scythe-like arms of this dangerous creature.
et: Vähesed suudavad taluda selle ohtliku olendi vikatilaadseid käsi.

source: Hinotama Soul
et: Hinotama Hing

source: An intensely hot flame creature that rams anything standing in its way.
et: <translated Intensiivselt kuum leegiolend, kes rammib kõike, mis tema teele jääb.

source: Thunder Kid
et: Äikese Laps

source: This monster stores electricity within his body, and can unleash it with catastrophic power.
et: See koletis salvestab oma kehas elektrit ja suudab selle vabastada katastroofilise jõuga.

source: A huge monster with a single eye that fires a deadly beam.
et: Hiiglaslik koletis, kellel on üks silm, mis tulistab surmavat kiirt.

source: A wizard of the waters that conjures a liquid wall to crush any enemies that oppose him.
et: Veevõlur, kes kutsub esile vedelseina, et purustada kõik vaenlased, kes talle vastu astuvad.

source: Kagemusha of The Blue Flame
et: Sinise Leegi Kagemusha

source: Serving as a double for the Ruler of the Blue Flame, he's a master swordsman that wields a fine blade.
et: Sinise Leegi Valitseja asendajana on ta meisterlik mõõgamees, kes käsitseb peent tera.

source: Flame Ghost
et: Leegivaim

source: "<M4030>Skull Servent<M>" + "<M4250>Dissolverock<M>"
et: "<M4030>Kolju Teenija<M>" + "<M4250>Lahustajakivi<M>"

source: Dryad
et: Kuiv

source: A spirit of the forest powered by the surrounding trees and wildlife.
et: Metsavaim, keda toidavad ümbritsevad puud ja metsloomad.

source: B. Skull Dragon
et: B. Kolju Draakon

source: "<M4028>Summoned Skull<M>" + "<M4088>Red Eyes B. Dragon<M>"<BR>(This card is always treated as an "Archfiend" card.)
et: "<M4028>Kutsutud Kolju<M>" + "<M4088>Punasilmne Must Draakon<M>"<BR>(Seda kaarti käsitletakse alati kui "Archfiend" kaarti.)

source: Two-Mouth Darkruler
et: Kahesuine Valitseja

source: A dinosaur with two deadly jaws, it stores electricity in its horn and releases high voltage bolts from the mouth on its back.
et: Dinosaur kahe surmava lõuaga, mis salvestab elektrit oma sarves ja vabastab kõrgepinge poldid oma seljal asuvast suust.

source: Solitude
et: Üksildus

source: This beast-warrior swings a massive scythe that feeds on the souls of the slain.
et: See metsaline-sõdalane vehib tohutu vikatiga, mis toitub tapetute hingedest.

source: Masked Sorcerer
et: Maskeeritud Võlur

source: When this card inflicts Battle Damage to your opponent's Life Points, draw 1 card from your Deck.
et: Kui see kaart tekitab lahingukahju sinu vastase elupunktidele, tõmba 1 kaart oma pakist.

source: A massive, intelligent spider that traps enemies with webbing.
et: Massiivne, intelligentne ämblik, mis püüab vaenlasi võrku.

source: Midnight Fiend
et: Kesköö deemon

source: This monster only appears when a midnight tribute is made.
et: See koletis ilmub ainult siis, kui tehakse kesköine ohverdus.

source: Roaring Ocean Snake
et: Mürisev Ookeani Madu

source: "<M4393>Mystic Lamp<M>" + "<M4653>Hyosube<M>"
et: "<M4393>Müstiline Lamp<M>" + "<M4653>Hyosube<M>"

source: Trap Master
et: Lõksumeister

source: Fiend Sword
et: Deemonimõõk

source: Whoever resists the curse of this blade will gain untold power.
et: Kes iganes suudab selle tera needusele vastu seista, saab mõõtmatu jõu.

source: Skull Stalker
et: Koljuluuraja

source: Swift and deadly, this monster grabs victims with its claws and attacks with a poison stinger.
et: Kiire ja surmav, see koletis haarab ohvreid oma küünistega ja ründab mürgise astlaga.

source: A rabid starfish that spits a lethal acid that can melt almost anything.
et: Hullumeelne meritäht, mis sülitab surmavat hapet, mis võib peaaegu kõike sulatada.

source: Wood Remains
et: Puidujäänused

source: A living corpse of wood re-animated by the power of darkness.
et: Pimeduse jõul taaselustatud elav puulaip.

source: Hourglass of Life
et: Elu liivakell

source: This creature grants power instead of shortening life.
et: See olend annab jõudu elu lühendamise asemel.

source: Rare Fish
et: Haruldane Kala

source: "<M4195>Fusionist<M>" + "<M4257>Enchanting Mermaid<M>"
et: "<M4195>Fusionist<M>" + "<M4257>Lummutu merineitsi<M>"

source: Wood Clown
et: Puidust Kloun

source: A creature with a wicked smile and a lethal sickle.
et: Olend, kellel on õel naeratus ja surmav sirp.

source: A living weapon that spits projectiles.
et: Elus relv, mis sülitab mürske.

source: Dark Titan of Terror
et: Terrori Tume Titaan

source: A fiend said to dwell in the world of dreams, it attacks enemies in their sleep.
et: Deemon, kes elab unenäomaailmas, ründab vaenlasi nende unes.

source: Beautiful Headhuntress
et: Kaunis pearahakütt

source: A vicious creature that has decapitated numerous enemy monsters.
et: Julm olend, kes on peatanud arvukalt vaenlase koletisi.

source: Wodan the Resident of The Forest
et: Metsade Elanik Wodan

source: Increase this card's ATK by 100 points for every Plant-Type monster that is face-up on the field.
et: Suurenda selle kaardi ATK-d 100 punkti võrra iga Taimetüüpi koletise eest, mis on väljakul avatud.

source: Guardian of The Labyrinth
et: Labürindi Valvur

source: A monster that guards the entrance to the Netherworld.
et: Koletis, mis valvab Allilma sissepääsu.

source: An earthen figure that protects the tomb of an ancient ruler.
et: Kivist kuju, mis kaitseb iidse valitseja hauda.

source: An intelligent palm tree that drops a hail of rock-hard coconuts on its enemies.
et: Intelligentne palmipuu, mis pillab oma vaenlastele kivikõvu kookospähkleid.

source: This lady warrior with unquenchable bloodlust serves the forces of darkness.
et: See kustutamatu verejanuga naissõdalane teenib pimeduse jõude.

source: The Drdek
et: Drdek

source: A bipedal eyeball that seldom misses an enemy with its lethal talons.
et: Kahesilmaline silmamuna, kes harva jätab oma surmavate küünistega vaenlase tabamata.

source: Dark Assailant
et: Tume Ründaja

source: Armed with the Psycho Sword, this sinister assassin rules the bad land.
et: Relvastatud Psühhomõõgaga, valitseb see sünge palgamõrvar halba maad.

source: Candle of Fate
et: Saatuse Küünal

source: Decides the fate of an opponent when the candle on its fingertip burns out.
et: Otsustab vastase saatuse, kui küünal tema sõrmeotsas kustub.

source: Water Element
et: Vee element

source: A spirit that dwells in the water, this creature generates a mist to cloud the vision of foes.
et: Vaim, kes elab vees, see olend tekitab udu, et vaenlaste nägemist hägustada.

source: Dissolverock
et: Lahustajakivi

source: A monster born in the lava pits, it generates intense heat that can melt away its enemies.
et: Koletis, kes on sündinud laavakaevudes, tekitab intensiivset kuumust, mis võib sulatada tema vaenlasi.

source: Meda Bat
et: Meda Nahkhiir

source: An eyeball fiend created by a servant of the wicked, it uses "dark Blasts" to blow away its enemies.
et: Silmaõudus, mille lõi kurja teenija, kasutab oma vaenlaste hävitamiseks "pimeduse plahvatusi".

source: One Who Hunts Souls
et: Hingede Kütija

source: This dangerous creature brandishes a soul-sucking sword.
et: See ohtlik olend vehib hinge imava mõõgaga.

source: Root Water
et: Juurvesi

source: An amphibian capable of calling up a massive tidal wave from the dark seas to wipe out enemy monsters.
et: Amfiib, kes suudab pimedatest meredest esile kutsuda tohutu tõusulaine, et vaenlase koletised hävitada.

source: Master & Expert
et: Meister & Ekspert

source: A deadly duo consisting of a beast master and its loyal servant.
et: Surmav duo, mis koosneb loomade taltsutajast ja tema ustavast teenrist.

source: Water Omotics
et: Vee Omotics

source: Transforms the water overflowing from a jar into attacking dragons.
et: Muutab purgist üle voolava vee ründavateks draakoniteks.

source: None can survive the cold touch of this sub-zero warrior.
et: Keegi ei suuda ellu jääda selle nullist madalama sõdalase külma puudutuse all.

source: Enchanting Mermaid
et: Lummav Merineitsi

source: A beautiful mermaid that lures voyagers to a watery death.
et: Kaunis merineitsi, kes meelitab rändureid vesisesse surma.

source: A pussy-fairy. Contrary to her lovely beauty, she claws on her enemies.
et: Kassihaldjas. Vaatamata oma armsale ilule kraabib ta oma vaenlasi.

source: Fairywitch
et: Haldjanõid

source: Though destined to be a fairy, this creature chose the way of the witch instead.
et: Kuigi määratud haldjaks, valis see olend hoopis nõia tee.

source: Embryonic Beast
et: Embrüonaalne Koletis

source: An imperfect monster with a belly vortex that sucks in opponents of any size.
et: Ebatäiuslik koletis, kelle kõhu keeris imeb sisse igas suuruses vastaseid.

source: Prevent Rat
et: Ennetusrott

source: This creature is shielded with a tough hide of hair and is excellent at defending itself.
et: See olend on kaetud tugeva karvkattega ja on suurepärane enda kaitsmisel.

source: D.D. Warrior
et: D.D. Sõdalane

source: When this card battles a monster, after damage calculation remove from play that monster and this card.
et: Kui see kaart võitleb koletisega, eemalda pärast kahju arvutamist mängust see koletis ja see kaart.

source: Stone Armadiller
et: Kivi Armadiller

source: With a body armored by rock-hard fur, this monster features excellent defense capabilities.
et: Kivist kõva karvaga kaetud kehaga on sellel koletisel suurepärased kaitsevõimed.

source: Beastking of The Swamps
et: Soodemägede Metsakuningas

source: You can substitute this card for any 1 Fusion-Material Monster. When you do this, the other Fusion-Material Monster(s) must be the correct one(s).
et: Saate selle kaardi asendada ükskõik millise Fusion-Material Monsteriga. Kui te seda teete, peavad teised Fusion-Material Monster(id) olema õiged.

source: Ancient Sorcerer
et: Muinasnõid

source: Armed with an array of magic wands, this creature is capable of multiple attacks.
et: Relvastatud mitmesuguste võlukepikestega, on see olend võimeline mitmeks rünnakuks.

source: Lunar Queen Elzaim
et: Kuu Kuninganna Elzaim

source: A lovely creature guarded by the moon. Her lunar curtain can block just about any attack.
et: Imeilus olend, keda kaitseb kuu. Tema kuuloored võivad blokeerida peaaegu iga rünnaku.

source: Archfiend Mirror
et: Kuradipeegel

source: A wicked mirror that hypnotizes enemies, diverting attacks from their intended targets.
et: Kuri peegel, mis hüpnotiseerib vaenlasi, suunates rünnakud nende kavandatud sihtmärkidest kõrvale.

source: The Little Swordsman of Aile
et: Aile väike mõõgamees

source: Offer 1 monster on your side of the field as a Tribute to increase this monster's ATK by 700 points until the end of the turn.
et: Paku 1 koletis oma väljaku poolelt ohvriks, et suurendada selle koletise ATK-d 700 punkti võrra kuni käigu lõpuni.

source: Rock Ogre Grotto #2
et: Kivikoletis #2

source: A golem formed by boulders, this monster turns its enemies to stone and crushes them to dust.
et: Kivimitest moodustatud golem, see koletis muudab oma vaenlased kiviks ja purustab nad tolmuks.

source: Wing Egg Elf
et: Tiibadega Munahaldjas

source: This fairy in an eggshell uses massive wings to blow back almost any projectile attack.
et: See hald munakoores kasutab massiivseid tiibu, et tagasi puhuda peaaegu iga projektiilirünnak.

source: The Furious Sea King
et: Raevukas Merikuningas

source: Grand King of the Seven Seas, he's able to summon massive tidal waves to drown the enemy.
et: Seitsme mere suur kuningas, kes suudab kutsuda esile tohutuid tõusulaineid, et vaenlane uputada.

source: Princess of Tsurugi
et: Tsurugi printsess

source: FLIP: Inflict 500 damage to your opponent for each Spell and Trap Card your opponent controls.
et: FLIP: Põhjusta oma vastasele 500 kahju iga tema kontrollitava Loitsu ja Lõksukaardi eest.

source: Unknown Warrior of Fiend
et: Tundmatu Deemonisõdalane

source: The speed of this warrior creates an intense vacuum that can slice through a monster's hide.
et: Selle sõdalase kiirus tekitab intensiivse vaakumi, mis suudab lõigata läbi koletise naha.

source: Sectarian of Secrets
et: Saladuste sektant

source: This wizard worships the darkness, and is served by a sinister hand that drags its enemies into oblivion.
et: See võlur kummardab pimedust ja teda teenib sünge käsi, mis veab tema vaenlasi unustusse.

source: Versago the Destroyer
et: Hävitaja Versago

source: A spirit that controls rain and is capable of summoning hurricanes to blow the enemy away.
et: Vaim, kes kontrollib vihma ja on võimeline kutsuma esile orkaane, et vaenlast minema puhuda.

source: Megirus Light
et: Megiruse Valgus

source: The fatal beams from the eyes of this monster result in grim destruction.
et: Selle koletise silmadest lähtuvad surmavad kiired põhjustavad sünget hävingut.

source: "<M4019>Tyhone<M>" + "<M4107>Wings of Wicked Flame<M>"
et: "<M4019>Tyhone<M>" + "<M4107>Paha Leegi Tiivad<M>"

source: Ancient Tree of Enlightenment
et: Valgustuse Iidne Puu

source: This ancient arbor uses its extensive knowledge to avoid the damage of enemy attacks.
et: See iidne puu kasutab oma ulatuslikke teadmisi, et vältida vaenlase rünnakute kahju.

source: Green Phantom King
et: Roheline Fantoomkuningas

source: This youthful king of the Forests lives in a green world, abundant with trees and wildlife.
et: See noor metsade kuningas elab rohelises maailmas, mis on täis puid ja metsloomi.

source: Ground Attacker Bugroth
et: Maapealetungija Bugroth

source: A surface battle robot that was once used for sea warfare.
et: Mereväe lahingutes kasutatud pinnalahingurobot.

source: Ray & Temperature
et: Kiir ja Temperatuur

source: The Sun and the North Wind join hands to deliver a devastating combination of heat and gale-force winds.
et: Päike ja Põhjatuul ühendavad jõud, et tuua kaasa laastava kombinatsiooni kuumusest ja tormituulest.

source: Gorgon Egg
et: Gorgoni Muna

source: The gorgon egg's massive eyes are said to reflect the fate of its enemies.
et: Gorgoni muna hiiglaslikud silmad peegeldavad väidetavalt tema vaenlaste saatust.

source: Petit Moth
et: Väike Koi

source: This small but deadly creature is better off avoided.
et: Seda väikest, kuid surmavat olendit on parem vältida.

source: King Fog
et: Udukuningas

source: A fiend that dwells in a blinding curtain of smoke.
et: Deemon, kes elab pimestavas suitsukardinas.

source: Protector of The Throne
et: Troonikaitsja

source: While the king is away, this queen protects his throne with a mighty defense.
et: Kui kuningas on eemal, kaitseb see kuninganna tema trooni võimsa kaitsega.

source: Mystic Clown
et: Müstiline Kloun

source: Nothing can stop the mad attack of this powerful creature.
et: Mitte miski ei suuda peatada selle võimsa olendi hullumeelset rünnakut.

source: Mystical Sheep #2
et: Müstiline Lammas #2

source: A monstrous sheep with a long tail for hypnotizing enemies.
et: Koleeriv lammas, kellel on pikk saba vaenlaste hüpnotiseerimiseks.

source: This machine generates illusions that leave an enemy wide open to attacks.
et: See masin tekitab illusioone, mis jätavad vaenlase rünnakutele täiesti avatuks.

source: Tao the Chanter
et: Laulik Tao

source: Master of Yin and Yang, this wizard handles a delicate balance of spells and counter spells.
et: Yini ja Yangi meister, see võlur käsitleb loitsude ja vastuloitsude õrna tasakaalu.

source: Serpent Marauder
et: Madu ründaja

source: A snake with a single eye that blows an icy breath to freeze its opponents.
et: Ühe silmaga madu, kes puhub jäist hingeõhku, et oma vastaseid külmutada.

source: Gatekeeper
et: Väravavaht

source: An indestructible mechanoid created for the sole purpose of guarding the gateways.
et: Hävimatu mehanoid, mis on loodud ainult väravate valvamiseks.

source: Ogre of The Black Shadow
et: Musta Varju Ogre

source: An ogre possessed by the powers of the dark. Few can withstand its rapid charge.
et: Pimeduse jõududest vaevatud ogar. Vähesed suudavad taluda selle kiiret rünnakut.

source: Dark Artist
et: Tume Kunstnik

source: If this card is attacked by a LIGHT monster, halve this card's DEF during damage calculation only.
et: Kui sellele kaardile ründab VALGUSE koletis, vähenda selle kaardi DEF poole võrra ainult kahju arvutamise ajal.

source: Change Slime
et: Muudatus Lima

source: A slime that can morph and adopt the shape and size of any monster it chooses.
et: Lima, mis suudab muuta oma kuju ja suurust vastavalt valitud koletisele.

source: Moon Envoy
et: Kuu Saadik

source: Many have fallen victim to this lunar warrior's crescent pike.
et: Paljud on langenud selle kuu sõdalase poolkuu piigi ohvriks.

source: A malevolent creature wrapped in flames that attacks enemies with intense fire.
et: Pahatahtlik olend, kes on mähitud leekidesse ja ründab vaenlasi intensiivse tulega.

source: Psychic Kappa
et: Psüühiline Kappa

source: An amphibian with a myriad of powers to shield it from enemy attacks.
et: Amfiib, kellel on hulgaliselt võimeid, et kaitsta end vaenlase rünnakute eest.

source: Masaki The Legendary Swordsman
et: Legendaarne mõõgamees Masaki

source: Legendary swordmaster Masaki is a veteran of over 100 battles.
et: Legendaarne mõõgameister Masaki on üle 100 lahingu veteran.

source: Dragoness The Wicked Knight
et: Kurjuse Rüütel Dragoness

source: "<M4178>Armaill<M>" + "<M4302>One-Eyed Shield Dragon<M>"
et: "<M4178>Armaill<M>" + "<M4302>Ühesilmne Kilpkonnadraakon<M>"

source: Bio Plant
et: Bio Taim

source: A monster created from a major accident in an underground lab.
et: Koletis, mis loodi suure õnnetuse tagajärjel maa-aluses laboris.

source: One-Eyed Shield Dragon
et: Ühesilmne Kilpkonnadraakon

source: This dragon wears a shield not only for its own protection, but also for ramming its enemies.
et: See draakon kannab kilpi mitte ainult enda kaitsmiseks, vaid ka vaenlaste rammimiseks.

source: Cyber Soldier of Darkworld
et: Pimedusemaailma Küber Sõdur

source: A mechanical soldier that won't stop attacking until all life readings have been extinguished from its sensors.
et: Mehaaniline sõdur, kes ei lõpeta ründamist enne, kui kõik elutunnused on tema anduritelt kustutatud.

source: Wicked Dragon with the Ersatz Head
et: Paha Draakon Asendajapeaga

source: A two-headed dragon with a pair of jaws that can tear an enemy to shreds.
et: Kahene draakon, kellel on lõuad, mis suudavad vaenlase tükkideks rebida.

source: Sonic Maid
et: Sonic Neiu

source: A maiden that uses sound to her advantage, she wields a scythe that's shaped like a musical note.
et: Neiu, kes kasutab heli enda kasuks, hoiab käes muusikamärgi kujulist vikatit.

source: A vicious bird that attacks from the skies with its whip-like tail.
et: Õel lind, kes ründab taevast oma piitsataolise sabaga.

source: Legendary Sword
et: Legendaarne Mõõk

source: Increase the ATK and DEF of a Warrior-Type monster equipped with this card by 300 points.
et: Suurenda selle kaardiga varustatud Sõdalase-tüüpi koletise ATK ja DEF 300 punkti võrra.

source: Sword of Dark Destruction
et: Pimeduse hävitamise mõõk

source: A DARK monster equipped with this card increases its ATK by 400 points and decreases its DEF by 200 points.
et: PIMEDAS koletis, kellele see kaart on varustatud, suurendab oma ATK-d 400 punkti võrra ja vähendab oma DEF-i 200 punkti võrra.

source: Dark Energy
et: Tume Energia

source: Increase the ATK and DEF of a Fiend-Type monster equipped with this card by 300 points.
et: Suurenda selle kaardiga varustatud Deemon-tüüpi koletise ATK ja DEF 300 punkti võrra.

source: Axe of Despair
et: Meeleheide Kirves

source: The equipped monster gains 1000 ATK. When this card is sent from the field to the Graveyard, you can Tribute 1 monster to return this card to the top of the Deck.
et: Varustatud koletis saab 1000 ATK juurde. Kui see kaart saadetakse väljakult Hauakambrisse, võid ohverdada 1 koletise, et see kaart tagasi Paki tippu panna.

source: Laser Cannon Armor
et: Laser Kahurirüü

source: Increase the ATK and DEF of an Insect-Type monster equipped with this card by 300 points.
et: Suurenda selle kaardiga varustatud Putukate tüüpi koletise ATK ja DEF 300 punkti võrra.

source: Insect Armor with Laser Cannon
et: Putukate soomus laserkiivriga

source: An Insect-Type monster equipped with this card gains 700 ATK.
et: <translated)Putukas-tüüpi koletis, kellele see kaart on varustatud, saab 700 ATK juurde.

source: Elf's Light
et: Elfi valgus

source: A LIGHT monster equipped with this card increases its ATK by 400 points and decreases its DEF by 200 points.
et: Valguse koletis, kellele see kaart on varustatud, suurendab oma ATK-d 400 punkti võrra ja vähendab oma DEF-i 200 punkti võrra.

source: Beast Fangs
et: Metshammaste

source: Increase the ATK and DEF of a Beast-Type monster equipped with this card by 300 points.
et: Suurenda selle kaardiga varustatud Metstüüpi koletise ATK ja DEF 300 punkti võrra.

source: Steel Shell
et: Teraskest

source: A WATER monster equipped with this card increases its ATK by 400 points and decreases its DEF by 200 points.
et: VEE koletis, millele see kaart on varustatud, suurendab oma ATK-d 400 punkti võrra ja vähendab oma DEF-i 200 punkti võrra.

source: Vile Germs
et: <translated:Pahaduslikud Idud

source: A Plant-Type monster equipped with this card increases its ATK and DEF by 300 points.
et: Taim-tüüpi koletis, kellele see kaart on varustatud, suurendab oma ATK ja DEF 300 punkti võrra.

source: Black Pendant
et: Must Pendel

source: The equipped monster gains 500 ATK. When this card is sent from the field to the Graveyard, inflict 500 damage to your opponent.
et: Varustatud koletis saab 500 ATK juurde. Kui see kaart saadetakse väljakult Hauakambrisse, tekitage oma vastasele 500 kahju.

source: Silver Bow and Arrow
et: Hõbedane Vibu ja Nool

source: A Fairy-Type monster equipped with this card increases its ATK and DEF by 300 points.
et: Haldjatüüpi koletis, kellele see kaart on varustatud, suurendab oma ATK ja DEF 300 punkti võrra.

source: Horn of Light
et: Valguse Sarv
