Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: You can discard this card and target 1 face-up Psychic-Type monster you control; banish it until your next Standby Phase. This effect can be activated during either player's turn
et: Saad selle kaardi ära visata ja valida 1 avatud Psüühika-tüüpi koletis, mida sa kontrollid; pagenda see kuni sinu järgmise Ootefaasini. Seda efekti saab aktiveerida mõlema mängija käigu ajal

source: Gem-Elephant
et: Gem-Elevant

source: During your Main Phase: You can return this face-up card on the field to the hand. During damage calculation, if this card attacked or was attacked: You can send 1 Normal Monster from your hand to the Graveyard; this card gains 1000 DEF.
et: Oma peafaasia ajal: Sa võid selle avatud kaardi väljakult kätte tagasi tuua. Kahju arvutamise ajal, kui see kaart ründas või teda rünnati: Sa võid saata 1 Tavalise Koletise oma käest Hauakambrisse; see kaart saab 1000 DEF juurde.

source: Laval Magma Cannoneer
et: Laval Magma Kahurimees

source: Up to twice per turn: You can send 1 FIRE monster from your hand to the Graveyard; inflict 500 damage to your opponent.
et: Kuni kaks korda käigu jooksul: Sa võid saata 1 TULEKAHJU koletise oma käest Hauakambrisse; tekitada oma vastasele 500 kahju.

source: Gishki Diviner
et: Gishki Ennustaja

source: Once per turn: You can declare 1 card name; reveal the top card of your Deck, and if it is the declared card, add it to your hand. Otherwise, return it to the top of the Deck.
et: Kord päevas: Sa võid nimetada ühe kaardi nime; paljasta oma paki ülemine kaart ja kui see on nimetatud kaart, lisa see oma kätte. Vastasel juhul pane see tagasi paki peale.

source: Gusto Codor
et: Gusto Kotkas

source: When this card destroys an opponent's monster by battle and sends it to the Graveyard: You can Special Summon 1 WIND Psychic-Type monster with 1500 or less DEF from your Deck.
et: Kui see kaart hävitab lahingus vastase koletise ja saadab selle Hauakambrisse: Sa võid eriliselt kutsuda 1 TUULE Psüühika-tüüpi koletise, mille DEF on 1500 või vähem, oma pakist.

source: Saambell the Summoner
et: Kutsuja Saambell

source: During your Main Phase: You can Special Summon 1 monster from your hand with the same Level as this card. This effect can only be used once while this card is face-up on the field.
et: Oma peafaasia ajal: Sa võid eriliselt kutsuda 1 koletise oma käest, mille tase on sama kui sellel kaardil. Seda efekti saab kasutada ainult üks kord, kui see kaart on lahinguväljal avatud.

source: You can Tribute this card to target 1 Level 4 Machine-Type monster in your Graveyard; Special Summon it from the Graveyard, but its effects on the field are negated.
et: Saad selle kaardi ohverdada, et sihtida oma Hauakambris üht 4. taseme Masinatüüpi koletist; Kutsu see Hauakambrist eriliselt välja, kuid selle mõju väljal on tühistatud.

source: When this card is Normal Summoned: You can add 1 "<M9648>Poki Draco<M>" from your Deck to your hand.
et: Kui see kaart on Normaal-Kutsutud: Sa saad lisada 1 "<M9648>Poki Draco<M>" oma pakist oma kätte.

source: Master of The Flaming Dragonswords
et: Leegitsevate Draakonimõõkade Meister

source: When a monster is Normal Summoned to your side of the field, except "<M9649>Master of The Flaming Dragonswords<M>": You can increase that monster's Level by 1, and this card gains 300 ATK until the End Phase.
et: Kui sinu poolel väljakule kutsutakse normaalne koletis, välja arvatud "<M9649>Master of The Flaming Dragonswords<M>": Sa võid selle koletise taset tõsta 1 võrra ja see kaart saab 300 ATK juurde kuni lõppfaasini.

source: Perditious Puppeteer
et: Hukatuslik Nukumeister

source: Once per turn: You can discard 1 card; gain control of all face-up Level 3 or lower monsters your opponent controls, until the End Phase. These monsters cannot activate their effects, and cannot be Tributed or used as a Synchro Material Monster.
et: Kord korra ühe käigu jooksul: Sa võid ühe kaardi ära visata; võta kontroll kõigi vastase kontrolli all olevate avatud 3. taseme või madalamate koletiste üle kuni lõppfaasini. Need koletised ei saa oma efekte aktiveerida, neid ei saa ohverdada ega kasutada Sünkro Materjal Koletisena.

source: Blue-Blooded Oni
et: Sinivereline Oni

source: When this card is Normal or Flip Summoned: It is changed to Defense Position. Once per turn: You can detach 1 Xyz Material you control to target 1 Level 4 Zombie-Type monster in your Graveyard; Special Summon that target.
et: Kui see kaart on Normaal- või Pöördkutsutud: see muudetakse Kaitsepositsiooni. Kord käigu jooksul: Sa võid eemaldada 1 Xyz Materjali, mida sa kontrollid, et sihtida 1. taseme 4 Zombi-tüüpi koletist oma Hauakambris; Kutsu see sihtmärk Eriliselt välja.

source: Ghost Ship
et: Kummituslaev

source: Cannot be Normal Summoned or Set. Must first be Special Summoned (from your hand) by banishing 1 LIGHT monster from your Graveyard.
et: Ei saa normaalset kutsuda ega asetada. Esmalt tuleb eriliselt kutsuda (oma käest), eemaldades oma kalmistult 1 VALGUSE koletise.

source: Absolute Crusader
et: Absoluutne Ristirüütel

source: When a Level 5 or higher monster is Special Summoned: Tribute this face-up card on the field; destroy that Level 5 or higher monster.
et: Kui eritasandiga 5 või kõrgema tasemega koletis kutsutakse erikutsumisega: ohverda see avatud kaart väljal; hävita see eritasandiga 5 või kõrgema tasemega koletis.

source: The Great Emperor Penguin
et: Suurepärane Keisripinguin

source: You can Tribute this card; Special Summon up to 2 "Penguin" monsters from your Deck, except "<M9654>The Great Emperor Penguin<M>".
et: Saad selle kaardi ohverdada; Kutsu eriliselt välja kuni 2 "Pingviini" koletist oma pakist, välja arvatud "<M9654>Suur Keiser Pingviin<M>".

source: Milla the Temporal Magician
et: Ajamaag Milla

source: When this card is Normal Summoned: Target 1 Set card your opponent controls; look at it. Your opponent cannot activate Spell/Trap Cards in response to this effect's activation.
et: Kui see kaart on Normaal-Kutsutud: Sihtige 1 seatud kaart, mida teie vastane kontrollib; vaadake seda. Teie vastane ei saa aktiveerida Loitsu/Lõksu Kaardid vastuseks selle efekti aktiveerimisele.

source: 2 Level 3 monsters<BR>Once per turn: You can detach 1 Xyz Material from this card; this card gains 500 ATK. If this card has no Xyz Material, it cannot attack your opponent directly.
et: 2. taseme 3 koletist<BR>Kord ühe käigu jooksul: Sa võid eemaldada 1 Xyz Materjali selle kaardi küljest; see kaart saab 500 ATK juurde. Kui sellel kaardil pole Xyz Materjali, ei saa see otse sinu vastast rünnata.

source: Submersible Carrier Aeroshark
et: Sukeldatav Kanderakett Aeroshark

source: 2 Level 3 monsters<BR>Once per turn: You can detach 1 Xyz Material from this card; inflict 100 damage to your opponent for each of your banished monsters.
et: 2. taseme 3 koletist<BR>Korra ühe käigu jooksul: Sa võid eemaldada 1 Xyz Materjali selle kaardi küljest; tee oma vastasele 100 kahju iga sinu eemaldatud koletise eest.

source: 3 Level 3 monsters<BR>Once per turn: You can detach 1 Xyz Material from this card to target 1 Level 4 or lower face-up Attack Position monster your opponent controls; gain control of it until the End Phase.
et: 3. taseme 3 koletist<BR>Kord kord: Sa võid selle kaardi küljest eemaldada 1 Xyz Materjali, et sihtida 1. taseme 4 või madalama avatud Rünnakupositsioonis koletist, mida sinu vastane kontrollib; võta selle üle kontroll kuni Lõppfaasini.

source: Wind-Up Zenmaister
et: Tuulepüüdja Zenmaister

source: 2 Level 4 monsters This card gains 300 ATK for each Xyz Material attached to this card. Once per turn: You can detach 1 Xyz Material from this card to target 1 face-up monster you control; change it to face-down Defense Position, and during the End Phase of this turn, change it to face-up Attack Position.
et: 2. taseme 4 koletist See kaart saab 300 ATK iga selle kaardiga seotud Xyz Materjali eest. Kord ühe käigu jooksul: Sa võid eemaldada 1 Xyz Materjali selle kaardi küljest, et sihtida 1 avatud koletist, mida sa kontrollid; muuda see tagurpidi Kaitsepositsiooni ja selle käigu lõppfaasis muuda see avatud Rünnakupositsiooni.

source: Leviaair the Sea Dragon
et: Meredraakon Leviaair

source: 2 Level 3 monsters<BR>Once per turn: You can detach 1 Xyz Material from this card to target 1 banished Level 4 or lower monster; Special Summon that target to your side of the field.
et: 2. taseme 3 koletist<BR>Korra käigu jooksul: Sa võid eemaldada 1 Xyz Materjali selle kaardi küljest, et sihtida 1 eksiilis olevat 4. taseme või madalama tasemega koletist; Kutsu see sihtmärk eriliselt oma väljale.

source: Tiras, Keeper of Genesis
et: Tiras, Geneesi Hoidja

source: 2 Level 5 monsters<BR>This card's effects can only be applied/resolved while it has Xyz Material. This card cannot be destroyed by card effects. At the end of the Battle Phase, if this card attacked or was attacked: Target 1 card your opponent controls; destroy the target. During each of your End Phases: Detach 1 Xyz Material from this card.
et: 2. taseme 5 koletist<BR>Selle kaardi mõju saab rakendada/lahendada ainult siis, kui sellel on Xyz Materjal. Seda kaarti ei saa hävitada kaardi efektidega. Lahingu faasi lõpus, kui see kaart ründas või seda rünnati: sihi 1 kaarti, mida sinu vastane kontrollib; hävita sihtmärk. Iga oma lõppfaasi ajal: eemalda 1 Xyz Materjal sellelt kaardilt.

source: Wonder Wand
et: Imekepike

source: Equip only to a Spellcaster-Type monster. It gains 500 ATK. If you control the equipped monster and this card: You can send both to the Graveyard; draw 2 cards.
et: Varusta ainult Spellcaster-tüüpi koletisele. See saab 500 ATK juurde. Kui sa kontrollid varustatud koletist ja seda kaarti: Sa võid saata mõlemad Hauakambrisse; tõmba 2 kaarti.

source: Double Up Chance
et: Topeltvõimalus

source: When a monster's attack is negated: Target that monster; during this Battle Phase, it can attack again, and if it does, its ATK is doubled during the Damage Step only.
et: Kui koletise rünnak tühistatakse: Sihtige seda koletist; selle Lahingu Faasi ajal võib see uuesti rünnata ja kui see seda teeb, siis selle ATK kahekordistub ainult Kahjustuse Etapis.

source: Thunder Short
et: Äikeselöök

source: Inflict 400 damage to your opponent for each monster they control.
et: Põhjusta oma vastasele 400 kahju iga koletise eest, mida nad kontrollivad.

source: Aqua Jet
et: Aqua Juga

source: Target 1 face-up Fish, Sea Serpent, or Aqua-Type monster you control; it gains 1000 ATK.
et: Vali 1 avatud näoga Kala, Meremadu või Vee-olendi tüüpi koletis, mida sa kontrollid; see saab 1000 ATK juurde.

source: Surface
et: Pinnale

source: Target 1 Level 3 or lower Fish, Sea Serpent, or Aqua-Type monster in your Graveyard; Special Summon it in face-up Defense Position.
et: Vali sihtmärgiks 1. taseme 3 või madalama tasemega Kala, Meremadu või Aqua-tüüpi koletis oma Hauakambris; Kutsu see eriliselt välja näoga ülespoole Kaitseasendis.

source: Crashbug Road
et: Krahhvea Tee

source: Each player can Special Summon 1 monster from their hand with the same Level as 1 face-up Level 4 or lower monster they control.
et: Iga mängija võib oma käest eriliselt kutsuda 1 koletise, mille tase on sama, mis 1 avatud tasemega 4 või madalama koletise, mida nad kontrollivad.

source: Infected Mail
et: Nakatunud kiri

source: Once per turn: You can target 1 face-up Level 4 or lower monster you control; it can attack your opponent directly this turn. Send it to the Graveyard at the end of the Battle Phase.
et: Kord korra: Saad valida 1 avatud 4. taseme või madalama koletise, mida sa kontrollid; see võib sellel käigul rünnata otse sinu vastast. Saada see Lahingufaasi lõpus Hauakambrisse.

source: Cracking
et: Murdmine

source: Once per turn, when a monster(s) is sent from the field to the Graveyard by a card effect: Inflict 800 damage to the owner of the monster(s).
et: Kord ühe korra käigu jooksul, kui koletis(ed) saadetakse väljalt Hauakambrisse kaardi efekti tõttu: Põhjusta 800 kahju koletise(te) omanikule.

source: Legendary Wind-Up Key
et: Legendaarne Mehaaniline Võti

source: Change all face-up "Wind-Up" monsters you control to face-down Defense Position.
et: Muuda kõik avatud "Wind-Up" koletised, mida sa kontrollid, tagurpidi Kaitsepositsiooni.

source: Wind-Up Factory
et: Mehhaaniline Tehas

source: Once per turn, if an effect of a "Wind-Up" monster is activated: You can add 1 Level 4 or lower "Wind-Up" monster from your Deck to your hand.
et: Kord ühe korra käigu jooksul, kui aktiveeritakse "Wind-Up" koletise efekt: Sa võid lisada oma pakist ühe 4. taseme või madalama "Wind-Up" koletise oma kätte.

source: Fish and Kicks
et: Kalad ja Löögid

source: If you have 3 or more banished Fish, Sea Serpent, or Aqua-Type monsters: Target 1 card on the field; banish it.
et: Kui sul on 3 või rohkem eksiilis olevat Kala, Meremao või Vee-olendi tüüpi koletist: Sihtmärk 1 kaart väljal; eksiili see.

source: Future Glow
et: Tuleviku Kuma

source: Banish 1 Psychic-Type monster from your Graveyard, and note its Level. All face-up Psychic-Type monsters you control gain ATK equal to that Level x 200.
et: Eemalda oma kalmistult 1 psüühika-tüüpi koletis ja pane tähele selle taset. Kõik sinu kontrolli all olevad avatud psüühika-tüüpi koletised saavad ATK-d juurde, mis on võrdne selle taseme x 200-ga.

source: Equip only to a "Vylon" monster. If the equipped monster attacks, your opponent cannot activate any Spell/Trap Cards until the end of the Damage Step. If this face-up card on the field is sent to the Graveyard: You can add 1 "Vylon" Spell Card from your Deck to your hand.
et: Varusta ainult "Vylon" koletisega. Kui varustatud koletis ründab, ei saa sinu vastane aktiveerida ühtegi Loitsu/Lõksu Kaarti kuni Kahjustuse Sammuni. Kui see avatud kaart väljakul saadetakse Hauakambrisse: Sa saad lisada 1 "Vylon" Loitsu Kaardi oma pakist oma kätte.

source: Quill Pen of Gulldos
et: Gulldose sulg

source: Target 2 WIND monsters in your Graveyard and 1 card on the field; shuffle both of those first 2 targets into your Deck and return the other to the hand.
et: Vali sihtmärgiks 2 TUULE koletist oma Hauakambris ja 1 kaardi väljal; sega need esimesed 2 sihtmärki oma pakki tagasi ja tagasta teine käesolevasse kätte.

source: Star Changer
et: Tähe Muutja

source: Target 1 face-up monster on the field and activate 1 of these effects:<BR>● Increase that target's Level by 1.<BR>● Reduce that target's Level by 1.
et: Vali 1 avatud näoga koletis väljal ja aktiveeri 1 nendest efektidest:<BR>● Suurenda selle sihtmärgi taset 1 võrra.<BR>● Vähenda selle sihtmärgi taset 1 võrra.

source: Oni-Gami Combo
et: Oni-Gami Kombo

source: Target 1 face-up Xyz Monster you control and detach all of its Xyz Material; this turn, that target can attack twice during the same Battle Phase.
et: Vali 1 avatud Xyz-koletis, mida sa kontrollid, ja eemalda kõik selle Xyz-materjalid; sellel käigul võib see sihtmärk rünnata kaks korda sama lahingufaasi jooksul.

source: Resonance Device
et: Resonantseseade

source: Target 2 face-up monsters you control with the same Type and Attribute; change one of their Levels to the current Level of the other, until the End Phase.
et: Vali 2 avatud näoga koletist, mida sa kontrollid ja millel on sama Tüüp ja Atribuut; muuda ühe nende Tase teise praeguseks Tasemeks kuni Lõppfaasini.

source: Peeking Goblin
et: Piiluv Goblin

source: Your opponent reveals the top 3 cards of their Deck. Choose one to place on the bottom of the Deck and place the other two on top of the Deck in any order.
et: Sinu vastane paljastab oma paki kolm ülemist kaarti. Vali üks, mille asetad paki alla, ja aseta ülejäänud kaks paki peale suvalises järjekorras.

source: Asleep at the Switch
et: Magama jäänud

source: When your opponent gains Life Points: Target 1 monster your opponent controls; destroy that target.
et: Kui sinu vastane saab Elupunkte: Sihtmärk 1 koletis, mida sinu vastane kontrollib; hävita see sihtmärk.

source: Poseidon Wave
et: Poseidoni laine

source: When an opponent's monster declares an attack: Target the attacking monster; negate that target's attack, and if you control any face-up Fish, Sea Serpent, or Aqua-Type monsters, inflict 800 damage to your opponent for each of those monsters.
et: Kui vastase koletis kuulutab välja rünnaku: Sihtige ründavat koletist; tühistage selle sihtmärgi rünnak ja kui te kontrollite mõnda avatud Kalade, Meremao või Vee tüüpi koletist, tekitage oma vastasele 800 kahju iga sellise koletise eest.

source: Explosive Urchin
et: Plahvatav merisiil

source: Activate only when your opponent activates a Trap Card. During your Standby Phase: Inflict 1000 damage to your opponent. Your opponent must control a face-up Trap Card for you to activate and resolve this effect. During your 3rd End Phase after activation, send this card to the Graveyard.
et: Aktiveeri ainult siis, kui sinu vastane aktiveerib Lõksukaardi. Sinu Ootefaasil: Tekita oma vastasele 1000 kahju. Sinu vastane peab kontrollima avatud Lõksukaarti, et sa saaksid selle efekti aktiveerida ja lahendada. Sinu 3. Lõppfaasil pärast aktiveerimist saada see kaart Hauakambrisse.

source: Damage Vaccine Ω MAX
et: Kahjuvaktsiin Ω MAX

source: When you take damage by battle or by a card effect: Gain Life Points equal to the damage you took.
et: Kui sa saad lahingus või kaardiefekti tõttu kahju: Saad Elupunkte juurde võrdse koguse võrra saadud kahjuga.

source: Overwind
et: Ülekeeramine

source: Target 1 face-up "Wind-Up" monster you control; its ATK and DEF are doubled, and it returns to the hand during the End Phase. You can only activate 1 "<M9684>Overwind<M>" per turn.
et: Vali 1 avatud "Wind-Up" koletis, mida sa kontrollid; selle ATK ja DEF kahekordistuvad ning see naaseb käe juurde lõppfaasis. Sa saad aktiveerida ainult 1 "<M9684>Overwind<M>" kord käigu jooksul.

source: Underworld Egg Clutch
et: Allilma Munakobar

source: When a face-up Fish, Sea Serpent, or Aqua-Type monster you control is banished: Add 1 Level 4 or lower Fish, Sea Serpent, or Aqua-Type monster from your Deck to your hand.
et: Kui sinu kontrolli all olev avatud Kalade, Meremadude või Vee-olendi tüüpi koletis eemaldatakse mängust: Lisa 1. taseme 4 või madalam Kalade, Meremadude või Vee-olendi tüüpi koletis oma pakist oma kätte.

source: Oh F!sh!
et: Oh K!la!

source: When an Effect Monster's effect activates: Shuffle 1 of your banished Fish, Sea Serpent, or Aqua-Type monsters into the Main Deck; negate the activation and destroy it.
et: Kui Efektikoletise efekt aktiveerub: sega 1 oma eemaldatud Kalast, Meremadust või Aqua-tüüpi koletisest tagasi Põhipakki; tühista aktiveerimine ja hävita see.

source: Bright Future
et: Helge tulevik

source: Target 2 of your banished Psychic-Type monsters; return both those targets to the Graveyard and draw 1 card.
et: Vali 2 oma eksiilis olevat Psüühika-tüüpi koletist; tagasta mõlemad need sihtmärgid Hauakambrisse ja tõmba 1 kaart.

source: Past Image
et: Möödunud Kujutis

source: If you control a face-up Psychic-Type monster: Target 1 monster your opponent controls; banish it. During the next Standby Phase, it returns to the opponent's side of the field in the same Battle Position.
et: Kui sa kontrollid avatud Psüühika-tüüpi koletist: Sihti 1 koletis, mida su vastane kontrollib; pagenda see. Järgmise Ootefaas jooksul naaseb see vastase väljaku poolele samas Lahinguasendis.

source: Burgeoning Whirlflame
et: Tärkav Pöörisleek

source: When a Trap Card is activated: Send 1 "Laval" monster from your hand to the Graveyard; negate the activation and destroy it. If this card is in the Graveyard: You can banish 2 FIRE monsters from your Graveyard; add this card to your hand.
et: Kui aktiveeritakse lõksukaart: Saada 1 "Laval" koletis oma käest hauakambrisse; tühista aktiveerimine ja hävita see. Kui see kaart on hauakambris: Sa saad eemaldada 2 TULE koletist oma hauakambrist; lisa see kaart oma kätte.

source: Treaty of Uniform Nomenclature
et: Ühtse Nomenklatuuri Leping

source: If you control 2 or more face-up monsters with the same name, except Tokens: Apply this effect, depending on how many you control.<BR>● Exactly 2: Destroy 1 Spell/Trap Card your opponent controls.<BR>● Exactly 3: Destroy all Spell/Trap Cards your opponent controls.
et: Kui sul on 2 või rohkem sama nimega avatud koletist, välja arvatud Tokenid: Rakenda see efekt, sõltuvalt sellest, kui palju sul neid on.<BR>● Täpselt 2: Hävita 1 loitsu/lõksukaart, mida su vastane kontrollib.<BR>● Täpselt 3: Hävita kõik loitsu/lõksukaardid, mida su vastane kontrollib.

source: Utopian Aura
et: Utoopiline Aura

source: Detach 1 Xyz Material you control; the face-up Xyz Monsters you control cannot be destroyed by card effects until the End Phase.
et: Eemalda 1 Xyz Materjal, mida sa kontrollid; sinu kontrollitavad avatud Xyz Koletised ei saa kaardiefektide tõttu hävitatud kuni Lõppfaasini.

source: United Front
et: Ühtne Rinne

source: When a Trap Card is activated while you control 2 or more face-up monsters with the same Level: Negate the activation and destroy it.
et: Kui lõksukaart aktiveeritakse, kui sul on kontrolli all 2 või rohkem sama tasemega avatud koletist: Tühista aktiveerimine ja hävita see.

source: Curse of the Circle
et: Ringikurjus

source: Target 1 monster your opponent controls; your opponent cannot Tribute it, or use it as a Synchro Material Monster.
et: Vali 1 koletis, mida sinu vastane kontrollib; sinu vastane ei saa seda ohverdada ega kasutada seda Sünkro Materjal Koletisena.

source: Tyrant's Tummyache
et: Türanni Kõhuvalu

source: Activate by Tributing 1 monster. Neither player can Special Summon a Level 6 or higher monster. If you have 3 or more cards in your hand, destroy this card.
et: Aktiveeri, ohverdades 1 koletis. Kumbki mängija ei saa eriliselt kutsuda 6. või kõrgema taseme koletist. Kui sul on käes 3 või rohkem kaarti, hävita see kaart.

source: Attention!
et: Tähelepanu!

source: Target 1 face-up Level 5 or lower monster your opponent controls; destroy all face-up monsters on the field with a different Level than it.
et: Sihtige 1 vastase kontrollitavat avatud taseme 5 või madalama tasemega koletist; hävita kõik avatud koletised väljal, mille tase on sellest erinev.

source: Raigeki Bottle
et: Raigeki Pudel

source: Each time a monster you control declares an attack, place 1 Thunder Counter on this card. You can send this card with 4 or more Thunder Counters to the Graveyard; destroy all monsters your opponent controls.
et: Iga kord, kui sinu kontrollitav koletis kuulutab välja rünnaku, aseta sellele kaardile 1 Äikese Loendur. Sa võid saata selle kaardi, millel on 4 või rohkem Äikese Loendurit, Hauakambrisse; hävita kõik koletised, mida sinu vastane kontrollib.

source: Gravelstorm
et: Kruusatorm

source: Target 1 Spell/Trap Card on each side of the field; return them to the hand.
et: Vali 1 Võlu-/Lõksukaart mõlemal poolel väljal; tagasta need kätte.

source: Temporal Machine God Metaion
et: Ajutine Masinajumal Metaion
