Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: If the DEF of the attacked Defense Position monster on your side of the field is higher than the ATK of the attacking monster on your opponent's side of the field, destroy the attacking monster. Damage calculation is applied normally.
et: Kui sinu väljaku kaitsepositsioonis oleva rünnatava koletise DEF on kõrgem kui vastase väljaku ründava koletise ATK, hävita ründav koletis. Kahju arvutamine toimub tavapäraselt.

source: Exhausting Spell
et: Kurnav loits

source: Remove all Spell Counters on both sides of the field.
et: Eemalda kõik Loitsuloendurid mõlemalt poolelt väljal.

source: Hidden Book of Spell
et: Varjatud loitsuraamat

source: You can only activate this card during your turn. Select 2 Spell Cards from your Graveyard and add them to your Deck. Your Deck is then shuffled.
et: Seda kaarti saad aktiveerida ainult oma käigu ajal. Vali oma Hauakambrist 2 Loitsukaarti ja lisa need oma Paki hulka. Seejärel sega oma Pakk.

source: Miracle Restoring
et: Ime taastamine

source: Remove 2 Spell Counters on your side of the field. Special Summon 1 "<M4041>Dark Magician<M>" or "<M4983>Buster Blader<M>" from your Graveyard in face-up Attack or Defense Position.
et: Eemalda 2 loitsuloendurit oma väljaku poolelt. Kutsu eriliselt välja 1 "<M4041>Pimeduse Maag<M>" või "<M4983>Buster Blader<M>" oma Hauakambrist avatud Rünnaku või Kaitseasendisse.

source: Remove Brainwashing
et: Eemalda Aju Pesemine

source: As long as this card remains face-up on the field, the control of all monsters on the field returns to the original owners.
et: Niikaua kui see kaart jääb väljale avatud olekusse, kõikide väljal olevate koletiste kontroll naaseb algsetele omanikele.

source: Disarmament
et: Desarmeerimine

source: Destroy all Equip Spell Cards on the field.
et: Hävita kõik Väljal olevad Varustuse Võlukaardid.

source: Anti-Spell
et: Võlukeeld

source: Remove 2 Spell Counters on your side of the field to negate the activation of a Spell Card and destroy it.
et: Eemaldage oma väljaku poolelt 2 loitsuloendurit, et tühistada Loitsukaardi aktiveerimine ja hävitada see.

source: The Spell Absorbing Life
et: Loitsu Neelav Elu

source: Flip all face-down Defense Position Monster Cards on the field face-up. Flip Effects are not activated at this time. Increase your Life Points by 400 points for each Effect Monster Card on the field.
et: Pööra kõik kaitseasendis tagurpidi olevad koletiskaardid lahinguväljal näoga ülespoole. Pööramise efektid ei aktiveeru sel ajal. Suurenda oma Elupunkte 400 punkti võrra iga efektikoletise kaardi eest lahinguväljal.

source: Metal Reflect Slime
et: Metallpeegel Lima

source: After activation, Special Summon this card in Defense Position; it is treated as an Effect Monster Card (Aqua-Type/WATER/Level 10/ATK 0/DEF 3000). This card cannot attack. (This card is still treated as a Trap Card.)
et: Pärast aktiveerimist kutsu see kaart eripositsioonis kaitsepositsioonis; seda käsitletakse kui Efektikoletise Kaarti (Aqua-Tüüp/VEEM/Level 10/ATK 0/DEF 3000). See kaart ei saa rünnata. (Seda kaarti käsitletakse endiselt kui Lõksukaarti.)

source: During each of your Standby Phases, inflict 600 damage to your opponent.
et: Iga oma ootejärgu ajal tekitage oma vastasele 600 kahju.

source: Magical Stone Excavation
et: Maagilise Kivi Kaevamine

source: Discard 2 cards to select 1 Spell Card from your Graveyard. Add it to your hand.
et: Viska 2 kaarti, et valida oma Hauakambrist 1 Loitsukaart. Lisa see oma kätte.

source: When this monster is Normal Summoned, Flip Summoned, or Special Summoned, increase your Life Points by 1000 points. When this card is destroyed and sent to the Graveyard, you take 2000 points of damage.
et: Kui see koletis kutsutakse normalkutsumise, ümberpööratud kutsumise või erikutsumise teel, suurenda oma elupunkte 1000 punkti võrra. Kui see kaart hävitatakse ja saadetakse hauakambrisse, saad 2000 punkti kahju.

source: Different Dimension Dragon
et: Teise dimensiooni draakon

source: This card cannot be destroyed by the effect of a Spell or Trap Card that does not target it. This card cannot destroyed by battle with a monster that has 1900 ATK or less.
et: Seda kaarti ei saa hävitada loitsu või lõksukaardi efektiga, mis ei sihi seda. Seda kaarti ei saa hävitada lahingus koletisega, millel on 1900 ATK või vähem.

source: Shinato, King of a Higher Plane
et: Shinato, Kõrgema Tasandi Kuningas

source: This card can only be Ritual Summoned with the Ritual Spell Card, "<M5721>Shinato's Ark<M>". You must also Tribute monsters whose total Level equal 8 or more from the field or your hand. When this card destroys a Defense Position monster and sends it to the Graveyard as a result of battle, inflict damage to your opponent's Life Points equal to the original ATK of the destroyed monster.
et: Seda kaarti saab Rituaali Kutsuda ainult Rituaali Loitsukaardiga, "<M5721>Shinato's Ark<M>". Sa pead ka ohverdama koletisi, kelle kogutase on 8 või rohkem, kas väljakult või oma käest. Kui see kaart hävitab Kaitseasendis koletise ja saadab selle lahingu tulemusena Hauakambrisse, tekitab see kahju sinu vastase Elupunktidele, mis on võrdne hävitatud koletise algse RÜ-ga.

source: Dark Flare Knight
et: Pime Säde Rüütel

source: "<M4041>Dark Magician<M>" + "<M4021>Flame Swordsman<M>"<BR>Any damage to this card's controller caused as a result of battle involving this monster becomes 0. When this card is destroyed and sent to the Graveyard as a result of battle, Special Summon 1 "<M5699>Mirage Knight<M>" from your hand or Deck.
et: "<M4041>Tume Maag<M>" + "<M4021>Leekmees<M>"<BR>Selle kaardi kontrollija lahingukahju, mis on põhjustatud selle koletisega seotud lahingust, muutub 0-ks. Kui see kaart hävitatakse ja saadetakse lahingu tulemusena Hauakambrisse, kutsu eriliselt välja 1 "<M5699>Mirage Rüütel<M>" oma käest või pakist.

source: Mirage Knight
et: Mirage Rüütel

source: This card cannot be Normal Summoned or Set. This card cannot be Special Summoned except by the effect of "<M5698>Dark Flare Knight<M>". When this card battles another monster, during damage calculation increase the ATK of this card by the original ATK of the opponent's monster. During the End Phase after this card was involved in battle, remove this card from play.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti ei saa eriliselt kutsuda, välja arvatud "<M5698>Dark Flare Knight<M>" efekti abil. Kui see kaart võitleb teise koletisega, suurendatakse kahju arvutamise ajal selle kaardi ATK-d vastase koletise algse ATK võrra. Pärast seda, kui see kaart on lahingus osalenud, eemalda see kaart mängust End Phase'i ajal.

source: Berserk Dragon
et: Berserk Draak

source: This card cannot be Normal Summoned or Set. This card cannot be Special Summoned except by the effect of "<M5722>A Deal with Dark Ruler<M>". This card can attack all monsters on your opponent's side of the field once each. Decrease the ATK of this card by 500 points during the End Phase of each of your turns.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti ei saa eriliselt kutsuda, välja arvatud "<M5722>A Deal with Dark Ruler<M>" efekti abil. See kaart võib rünnata kõiki vastase poolel olevaid koletisi üks kord igaüht. Vähenda selle kaardi ATK-d 500 punkti võrra iga oma käigu lõppfaasis.

source: This card cannot be Normal Summoned or Set. This card cannot be Special Summoned except by the effect of "<M5723>Contract with Exodia<M>". This card is not destroyed as result of battle or by the effects of Spell or Trap Cards, and during each of your Standby Phases, increase the ATK of this card by 500 points. This card is destroyed when any of "<M4027>Exodia the Forbidden One<M>", "<M4025>Right Arm of the Forbidden One<M>", "<M4026>Left Arm of the Forbidden One<M>", "<M4023>Right Leg of the Forbidden One<M>", or "<M4024>Left Leg of the Forbidden One<M>" is not in your Graveyard.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti ei saa eriliselt kutsuda, välja arvatud "<M5723>Contract with Exodia<M>" efekti abil. Seda kaarti ei hävitata lahingu tulemusena ega loitsu- või lõksukaartide efektide tõttu ning iga sinu ootejärgu faasi ajal suurenda selle kaardi ATK-d 500 punkti võrra. See kaart hävitatakse, kui ükski järgmistest ei ole sinu hauas: "<M4027>Exodia the Forbidden One<M>", "<M4025>Right Arm of the Forbidden One<M>", "<M4026>Left Arm of the Forbidden One<M>", "<M4023>Right Leg of the Forbidden One<M>" või "<M4024>Left Leg of the Forbidden One<M>".

source: Battle Footballer
et: Lahingujalgpallur

source: A cyborg with high defense power. Originally it was invented for a football machine.
et: Küberneetiline organism, millel on kõrge kaitsejõud. Algselt leiutati see jalgpallimasina jaoks.

source: Arsenal Summoner
et: Arsenali Kutsuja

source: FLIP: Add 1 card that includes "Guardian" in its card name from your Deck to your hand. You cannot add "<M4047>Celtic Guardian<M>", "<M4013>Winged Dragon, Guardian of the Fortress #1<M>", "<M4558>Winged Dragon, Guardian of the Fortress #2<M>", "<M4242>Guardian of The Labyrinth<M>", or "<M4906>The Reliable Guardian<M>".
et: FLIP: Lisa oma pakist 1 kaart, mille nimes sisaldub "Guardian", oma kätte. Sa ei saa lisada "<M4047>Celtic Guardian<M>", "<M4013>Winged Dragon, Guardian of the Fortress #1<M>", "<M4558>Winged Dragon, Guardian of the Fortress #2<M>", "<M4242>Guardian of The Labyrinth<M>" või "<M4906>The Reliable Guardian<M>".

source: Nin-Ken Dog
et: Nin-Ken Koer

source: A Ninja dog who has mastered extreme Ninjutsu. Through hard training, it learned the technique to metamorphose into a human being.
et: Äärmuslikku ninjutsut valdav ninja-koer. Raskete treeningute kaudu õppis ta inimolendiks muutumise tehnika.

source: Acrobat Monkey
et: Akrobaat Ahv

source: An autonomous monkey type robot which was developed with cutting-edge technology. It moves very acrobatically.
et: Autonoomne ahvitüüpi robot, mis on välja töötatud tipptasemel tehnoloogiaga. See liigub väga akrobaatiliselt.

source: Guardian Elma
et: Valvur Elma

source: This card can only be Normal Summoned, Flip Summoned, or Special Summoned when there is a "<M5724>Butterfly Dagger - Elma<M>" on your side of the field. When this card is Normal Summoned or Special Summoned successfully, you can equip 1 appropriate Equip Spell Card in your Graveyard to this card.
et: Seda kaarti saab Normaal-Kutsuda, Pöörata või Eriliselt Kutsuda ainult siis, kui sinu väljakul on "<M5724>Butterfly Dagger - Elma<M>". Kui see kaart on edukalt Normaal-Kutsutud või Eriliselt Kutsutud, saad sellele kaardile oma Hauakambris oleva sobiva Varustuse Loitsu Kaardi külge panna.

source: Guardian Ceal
et: Valvur Ceal

source: This card can only be Normal Summoned, Flip Summoned, or Special Summoned when there is a "<M5725>Shooting Star Bow - Ceal<M>" on your side of the field. Send an Equip Spell Card on your side of field equipped to this card to the Graveyard to destroy 1 monster on your opponent's side of the field.
et: Seda kaarti saab Normaal-Kutsuda, Pöörata või Eriliselt Kutsuda ainult siis, kui sinu väljaku poolel on "<M5725>Shooting Star Bow - Ceal<M>". Saada selle kaardiga varustatud Varustuse Võlukaart oma väljaku poolelt Hauakambrisse, et hävitada 1 koletis vastase väljaku poolelt.

source: Guardian Grarl
et: Valvur Grarl

source: This card can only be Normal Summoned, Flip Summoned, or Special Summoned when there is a "<M5726>Gravity Axe - Grarl<M>" on your side of the field. If this is the only card in your hand, you can Special Summon it.
et: Seda kaarti saab Normaal-Kutsuda, Pöörata-Kutsuda või Eriliselt Kutsuda ainult siis, kui sinu väljaku poolel on "<M5726>Gravitatsioonikirves - Grarl<M>". Kui see on ainus kaart sinu käes, saad selle Eriliselt Kutsuda.

source: Guardian Baou
et: Valvur Baou

source: This card can only be Normal Summoned, Flip Summoned, or Special Summoned when there is a "<M5727>Wicked-Breaking Flamberge - Baou<M>" on your side of the field. Each time this card destroys 1 of your opponent's monsters and sends it to the Graveyard as a result of battle, increase the ATK of this card by 1000 points. Also, the effects of an Effect Monster that this card destroys as a result of battle are negated.
et: Seda kaarti saab Normaal-Kutsuda, Pöörata-Kutsuda või Eriliselt Kutsuda ainult siis, kui sinu poolel väljal on "<M5727>Wicked-Breaking Flamberge - Baou<M>". Iga kord, kui see kaart hävitab ühe sinu vastase koletise ja saadab selle lahingu tulemusena Hauakambrisse, suurenda selle kaardi ATK-d 1000 punkti võrra. Samuti, selle kaardi poolt lahingu tulemusena hävitatud Efekt-Koletise efektid tühistatakse.

source: Guardian Kay'est
et: Valvur Kay'est

source: This card can only be Normal Summoned, Flip Summoned, or Special Summoned when there is a "<M5728>Rod of Silence - Kay'est<M>" on your side of the field. This card is unaffected by any Spell Cards. Also, this card cannot be an attack target of your opponent's monsters.
et: Seda kaarti saab Normaal-Kutsuda, Pöörata või Eriliselt Kutsuda ainult siis, kui sinu väljaku poolel on "<M5728>Vaikuse Sau - Kay'est<M>". See kaart ei ole mõjutatud ühegi Loitsukaardi poolt. Samuti ei saa see kaart olla sinu vastase koletiste rünnaku sihtmärk.

source: Guardian Tryce
et: Valvur Tryce

source: This card can only be Normal Summoned, Flip Summoned, or Special Summoned when there is a "<M5729>Twin Swords of Flashing Light - Tryce<M>" on your side of the field. When this card is destroyed and sent to the Graveyard, Special Summon to your side of the field the monster in the Graveyard that was used for the Tribute Summon of this card.
et: Seda kaarti saab Normaal-Kutsuda, Pöörata-Kutsuda või Eriliselt-Kutsuda ainult siis, kui sinu väljakul on "<M5729>Välguvalguse Kaksikmõõgad - Tryce<M>". Kui see kaart hävitatakse ja saadetakse Hauakambrisse, Kutsu Eriliselt oma väljakule Hauakambris olev koletis, mida kasutati selle kaardi Ohverdamise Kutsumiseks.

source: Increase the ATK of this card by 500 points for each monster on your opponent's side of the field. When this card attacks with an ATK that is higher than the DEF of your opponent's Defense Position monster, inflict the difference as Battle Damage to your opponent's Life Points.
et: Suurenda selle kaardi ATK-d 500 punkti võrra iga koletise eest, mis on sinu vastase väljaku poolel. Kui see kaart ründab ATK-ga, mis on kõrgem kui sinu vastase kaitsepositsioonis oleva koletise DEF, põhjusta vahe lahingukahjuna oma vastase elupunktidele.

source: Blindly Loyal Goblin
et: Pimesi lojaalne goblin

source: As long as this card remains face-up on the field, control of this card cannot switch.
et: Niikaua kui see kaart jääb väljale avatud olekus, ei saa selle kaardi kontrolli vahetada.

source: Despair from the Dark
et: Pimeduse meeleheide

source: When this card is sent from your hand or Deck to your Graveyard by your opponent's card effect, Special Summon this card to the field.
et: Kui see kaart saadetakse sinu käest või pakist sinu hauakambrisse vastase kaardi efekti tõttu, kutsu see kaart eriliselt välja väljakule.

source: The ATK of this card becomes equal to the combined original ATK of the 2 monsters you Tributed for the Tribute Summon of this card.
et: Selle kaardi ATK muutub võrdseks nende 2 koletise algse ATK summaga, kelle sa ohverdasid selle kaardi ohverdussummoniks.

source: Fear from the Dark
et: Hirm pimeduse ees

source: When this card is sent from your hand or Deck to the Graveyard by your opponent's card effect, Special Summon this card to the field.
et: Kui see kaart saadetakse sinu käest või pakist hauakambrisse sinu vastase kaardi efekti tõttu, kutsu see kaart eriliselt välja väljakule.

source: Dark Scorpion - Chick the Yellow
et: Tume Skorpion - Kollane Tibuke

source: When this card inflicts Battle Damage to your opponent's Life Points, you can select and activate 1 of the following effects:<BR>● Return 1 card on the field to its owner's hand.<BR>● Pick up 1 card on the top of your opponent's Deck (Your opponent does not look at the card). Select the top or the bottom of the Deck and return the card there.
et: Kui see kaart tekitab lahingukahju sinu vastase Elupunktidele, saad valida ja aktiveerida ühe järgmistest efektidest:<BR>● Tagasta 1 kaart väljakult selle omaniku kätte.<BR>● Võta 1 kaart oma vastase paki pealt (Sinu vastane ei vaata kaarti). Vali paki ülemine või alumine osa ja tagasta kaart sinna.

source: D.D. Warrior Lady
et: D.D. Sõdalanna

source: When this card battles your opponent's monster, after damage calculation you can remove from play the opponent's monster and this card.
et: Kui see kaart võitleb sinu vastase koletisega, siis pärast kahju arvutamist saad eemaldada mängust vastase koletise ja selle kaardi.

source: Thousand Needles
et: Tuhat Nõela

source: When this Defense Position card is attacked and if the DEF of this card is higher than the ATK of the attacking monster, destroy the attacking monster at the end of the Damage Step.
et: Kui sellele kaitseasendis kaardile rünnatakse ja kui selle kaardi DEF on kõrgem kui ründava koletise ATK, hävita ründav koletis Kahjustuse etapi lõpus.

source: Shinato's Ark
et: Shinato laev

source: This card is used to Ritual Summon "<M5697>Shinato, King of a Higher Plane<M>". You must also Tribute monsters whose total Level Stars equal 8 or more from the field or your hand.
et: Seda kaarti kasutatakse "<M5697>Shinato, King of a Higher Plane<M>" rituaalsummonimiseks. Sa pead ka ohverdama koletisi, kelle kogutaseme tähed on 8 või rohkem, kas väljakult või oma käest.

source: A Deal with Dark Ruler
et: Tehing Pimeduse Valitsejaga

source: (This card is always treated as an "Archfiend" card.)<BR>You can only activate this card during a turn in which a Level 8 or higher monster on your side of the field was sent to the Graveyard. Special Summon 1 "<M5700>Berserk Dragon<M>" from your hand or Deck.
et: (Seda kaarti käsitletakse alati kui "Archfiend" kaarti.)<BR>Seda kaarti saab aktiveerida ainult käigul, mil sinu poolel väljakul olev 8. või kõrgema tasemega koletis saadeti Hauakambrisse. Kutsu eriliselt esile 1 "<M5700>Berserk Dragon<M>" oma käest või pakist.

source: Contract with Exodia
et: Leping Exodiaga

source: You can only activate this card when you have "<M4027>Exodia the Forbidden One<M>", "<M4025>Right Arm of the Forbidden One<M>", "<M4026>Left Arm of the Forbidden One<M>", "<M4023>Right Leg of the Forbidden One<M>", and "<M4024>Left Leg of the Forbidden One<M>" in your Graveyard. Special Summon 1 "<M5701>Exodia Necross<M>" from your hand.
et: Seda kaarti saad aktiveerida ainult siis, kui sul on oma Hauakambris "<M4027>Keelatud Exodia<M>", "<M4025>Keelatud Üksuse Parem Käsi<M>", "<M4026>Keelatud Üksuse Vasak Käsi<M>", "<M4023>Keelatud Üksuse Parem Jalg<M>" ja "<M4024>Keelatud Üksuse Vasak Jalg<M>". Kutsu eriliselt välja 1 "<M5701>Exodia Necross<M>" oma käest.

source: Butterfly Dagger - Elma
et: Liblikatikk - Elma

source: Increase the ATK of a monster equipped with this card by 300 points. When this card is equipped to a monster, and is destroyed and sent to the Graveyard, this card can be returned to the owner's hand.
et: Suurenda selle kaardiga varustatud koletise ATK-d 300 punkti võrra. Kui see kaart on varustatud koletisele ja hävitatakse ning saadetakse Hauakambrisse, saab selle kaardi omaniku kätte tagasi tuua.

source: Shooting Star Bow - Ceal
et: Laskva Tähe Vibunöör - Ceal

source: Decrease the ATK of a monster equipped with this card by 1000 points. A monster equipped with this card can attack your opponent's Life Points directly.
et: Vähenda selle kaardiga varustatud koletise ATK-d 1000 punkti võrra. Selle kaardiga varustatud koletis võib rünnata otse sinu vastase Elupunkte.

source: Gravity Axe - Grarl
et: Gravitatsioonikirves - Grarl

source: Increase the ATK of a monster equipped with this card by 500 points. As long as this card remains face-up on the field, monsters on your opponent's side of the field cannot change their battle position.
et: Suurenda selle kaardiga varustatud koletise ATK-d 500 punkti võrra. Kuni see kaart jääb väljale avatud olekusse, ei saa sinu vastase poolel olevad koletised oma lahingupositsiooni muuta.

source: Wicked-Breaking Flamberge - Baou
et: Kurjusemurdja Flamberge - Baou

source: Send 1 card from your hand to the Graveyard to equip this card. Increase the ATK of the equipped monster by 500 points. If a monster equipped with this card destroys a monster as a result of battle, the effect of that monster is negated.
et: Saada 1 kaart oma käest Hauakambrisse, et see kaart varustada. Suurenda varustatud koletise ATK-d 500 punkti võrra. Kui selle kaardiga varustatud koletis hävitab lahingu tulemusena koletise, siis selle koletise efekt tühistatakse.

source: Rod of Silence - Kay'est
et: Vaikuse Sau - Kay'est

source: Increase the DEF of a monster equipped with this card by 500 points. Negate the effect of a Spell Card (excluding this card) that targets the monster equipped with this card and destroy the Spell Card.
et: Suurenda selle kaardiga varustatud koletise DEF-i 500 punkti võrra. Tühista selle kaardiga varustatud koletist sihtiva Loitsukaardi (välja arvatud see kaart) efekt ja hävita Loitsukaart.

source: Twin Swords of Flashing Light - Tryce
et: Välgu Kaksikmõõgad - Tryce

source: Send 1 card from your hand to your Graveyard to equip this card. Decrease the ATK of a monster equipped with this card by 500 points. A monster equipped with this card can attack twice during the same Battle Phase.
et: Saada 1 kaart oma käest oma Hauakambrisse, et see kaart varustada. Vähenda selle kaardiga varustatud koletise ATK-d 500 punkti võrra. Selle kaardiga varustatud koletis võib rünnata kaks korda sama Lahingu Faasi jooksul.

source: Precious Cards from Beyond
et: Kallid kaardid teispoolsusest

source: When you successfully Tribute Summon or Set a monster that required 2 or more Tributes, draw 2 cards from your Deck.
et: Kui sa edukalt ohverdad või asetad koletise, mis nõudis 2 või rohkem ohverdust, tõmba oma pakist 2 kaarti.

source: Rod of the Mind's Eye
et: Meelesilma Sau

source: If a monster equipped with this card inflicts Battle Damage to your opponent, the damage becomes 1000 points.
et: Kui selle kaardiga varustatud koletis tekitab lahingukahju sinu vastasele, muutub kahju 1000 punktiks.

source: Fairy of the Spring
et: Kevade haldjas

source: Add 1 Equip Spell Card from your Graveyard to your hand. You cannot activate that Equip Spell Card this turn.
et: Lisa oma käest 1 Varustuse Võlusõna oma Hauakambrist. Sa ei saa seda Varustuse Võlusõna sellel käigul aktiveerida.

source: Token Thanksgiving
et: Tokenite tänupüha

source: Destroy all tokens on the field. Increase your Life Points by the number of tokens destroyed x 800 points.
et: Hävita kõik tokenid väljal. Suurenda oma Elupunkte hävitatud tokenite arvu x 800 punkti võrra.

source: Morale Boost
et: Moraalitõus

source: Each time a player equips an Equip Spell Card, increase the Life Points of the controller of that Equip Spell Card by 1000 points. Each time an Equip Spell Card is removed from the field, the controller of that Equip Spell Card takes 1000 points of damage.
et: Iga kord, kui mängija varustab Varustuse Võlusõna Kaardi, suurendatakse selle Varustuse Võlusõna Kaardi kontrollija Elupunkte 1000 punkti võrra. Iga kord, kui Varustuse Võlusõna Kaart eemaldatakse väljakult, saab selle Varustuse Võlusõna Kaardi kontrollija 1000 punkti kahju.

source: Non-Spellcasting Area
et: Mittemaagiline Ala

source: All face-up Monster Cards, except for Effect Monsters, are unaffected by the effects of Spell Cards (other than this card).
et: Kõik avatud koletiskaardid, välja arvatud efektikoletised, ei ole mõjutatud loitsukaartide (välja arvatud see kaart) mõjudest.

source: Different Dimension Gate
et: Erineva Dimensiooni Värav
