Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: When this card is Normal or Special Summoned, you can select 1 face-up Winged Beast-Type "Dragunity" monster you control. Equip it with 1 Level 3 or lower Dragon-Type "Dragunity" monster from your Deck.
et: Kui see kaart on Normaal- või Erikutsutud, saad valida 1 avatud Winged Beast-tüüpi "Dragunity" koletise, mida sa kontrollid. Varusta see oma pakist 1. taseme 3 või madalama Dragon-tüüpi "Dragunity" koletisega.

source: While this card is equipped to a monster, that monster can attack twice during each Battle Phase.
et: Kui see kaart on koletisele varustatud, võib see koletis rünnata kaks korda iga Lahingu Faasi jooksul.

source: Dragunity Javelin
et: Dragunity Odav

source: If this face-up card is destroyed while in the Monster Card Zone, you can equip it to 1 face-up Winged Beast-Type "Dragunity" monster you control, instead of sending it to the Graveyard.
et: Kui see avatud kaart hävitatakse, kui see on Monster Card Zone'is, võid selle varustada 1 avatud Winged Beast-tüüpi "Dragunity" koletisega, mida sa kontrollid, selle asemel et saata see Hauakambrisse.

source: Once during each player's End Phase, if this card destroyed an opponent's monster by battle this turn, you can Tribute 1 "Jurrac" monster to draw 2 cards.
et: Kord mängija lõppfaasis, kui see kaart hävitas sellel käigul lahingus vastase koletise, võid ohverdada 1 "Jurrac" koletise, et tõmmata 2 kaarti.

source: When this card is destroyed by battle and sent to the Graveyard, destroy the monster that destroyed this card. Your opponent can discard 1 card to negate this card's effect.
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse, hävita koletis, mis selle kaardi hävitas. Sinu vastane võib selle kaardi efekti tühistamiseks ühe kaardi ära visata.

source: You can Tribute this card to select 1 Level 4 or lower "Jurrac" monster in your Graveyard, except "<M8565>Jurrac Aeolo<M>". Special Summon that monster from the Graveyard.
et: Saad selle kaardi ohverdada, et valida oma kalmistult 1 tase 4 või madalam "Jurrac" koletis, välja arvatud "<M8565>Jurrac Aeolo<M>". Kutsu see koletis eriliselt kalmistult välja.

source: When a Defense Position "Jurrac" monster you control, except "<M8566>Jurrac Herra<M>", is destroyed by battle and sent to the Graveyard, you can Special Summon this card from your hand or Graveyard.
et: Kui kaitseasendis olev sinu kontrollitav "Jurrac" koletis, välja arvatud "<M8566>Jurrac Herra<M>", hävitatakse lahingus ja saadetakse Hauakambrisse, saad selle kaardi oma käest või Hauakambrist eriliselt välja kutsuda.

source: Naturia Butterfly
et: Naturia Liblikas

source: Once per turn, when your opponent's monster declares an attack, you can send the top card of your Deck to the Graveyard and negate that attack.
et: Korra ühe korra käigu jooksul, kui sinu vastase koletis kuulutab välja rünnaku, saad sa saata oma paki ülemise kaardi Hauakambrisse ja tühistada selle rünnaku.

source: Naturia Ladybug
et: Naturia Leedikas

source: When you Synchro Summon a "Naturia" Synchro Monster, you can Special Summon this card from your Graveyard. During your Main Phase, you can Tribute this card to select 1 face-up "Naturia" monster you control. It gains 1000 ATK until the End Phase.
et: Kui sa kutsud sünkrokutsumisega välja "Naturia" sünkromonstri, saad selle kaardi oma hauast eriliselt välja kutsuda. Oma peafaasis saad sa ohverdada selle kaardi, et valida 1 avatud "Naturia" koletis, mida sa kontrollid. See saab 1000 ATK juurde kuni lõppfaasini.

source: Naturia Strawberry
et: Naturia Maasikas

source: Once per turn, when your opponent Normal or Special Summons a monster, select that monster. This card gains 100 ATK x the Level of that monster, until the End Phase.
et: Korra ühe korra käigu jooksul, kui sinu vastane kutsub normaalselt või eriliselt välja koletise, vali see koletis. See kaart saab 100 ATK x selle koletise taseme võrra juurde kuni lõppfaasini.

source: Defender of the Ice Barrier
et: Jääbarjääri Kaitsja

source: While you control another face-up "Ice Barrier" monster, monsters your opponent controls cannot declare an attack if their ATK is greater than or equal to this card's DEF.
et: Kui sa kontrollid teist avatud "Jääbarjääri" koletist, ei saa sinu vastase koletised rünnakut kuulutada, kui nende ATK on suurem või võrdne selle kaardi DEF-iga.

source: Warlock of the Ice Barrier
et: Jääbarjääri nõid

source: While you control another face-up "Ice Barrier" monster, both players must Set Spell Cards before activating them, and cannot activate them until their next turn.
et: Kui sa kontrollid teist avatud "Ice Barrier" koletist, peavad mõlemad mängijad enne aktiveerimist Maagilised Kaardid asetama ja ei saa neid enne järgmist käiku aktiveerida.

source: Sacred Spirit of the Ice Barrier
et: Jääbarjääri Püha Vaim

source: This card cannot be Special Summoned. This card returns to the hand during the End Phase of the turn it is Normal Summoned or flipped face-up, unless you control another face-up "Ice Barrier" monster. In that case, this card's effect changes to select 1 monster your opponent controls and return it to the hand, instead.
et: Seda kaarti ei saa eriliselt kutsuda. See kaart naaseb käe juurde selle käigu lõppfaasis, mil see on tavakutsutud või ümber pööratud, välja arvatud juhul, kui sa kontrollid teist ülespööratud "Jääbarjääri" koletist. Sel juhul muutub selle kaardi efekt selliseks, et vali 1 koletis, mida sinu vastane kontrollib, ja tagasta see käe juurde.

source: General Raiho of the Ice Barrier
et: Jääbarjääri kindral Raiho

source: When an effect resolves that was activated by your opponent's Effect Monster on the field, they can discard 1 card. If they do not, that effect is negated.
et: Kui lahendatakse efekt, mille aktiveeris sinu vastase Efektikoletis väljal, võivad nad ühe kaardi ära visata. Kui nad seda ei tee, tühistatakse see efekt.

source: Genex Ally Triarm
et: Genexi liitlane Triarm

source: "<M7807>Genex Controller<M>" + 1 or more non-Tuner monsters<BR>This card's effects depend on the Attribute(s) of its non-Tuner Synchro Material Monsters. Once per turn, you can discard 1 card to activate one of its effects:<BR>● WIND: Send 1 random card from your opponent's hand to the Graveyard.<BR>● WATER: Select 1 Spell/Trap Card on the field, and destroy it.<BR>● DARK: Select 1 face-up LIGHT monster on the field, destroy it and draw 1 card.
et: "<M7807>Genex Kontroller<M>" + 1 või rohkem mittehäälestaja koletist<BR>Selle kaardi efektid sõltuvad selle mittehäälestaja Sünkro Materjal Koletiste atribuudi(te)st. Kord ühe käigu jooksul võid sa ühe kaardi ära visata, et aktiveerida üks selle efektidest:<BR>● TUUL: Saada 1 juhuslik kaart oma vastase käest Hauakambrisse.<BR>● VESI: Vali 1 Võlu-/Lõksukaart väljal ja hävita see.<BR>● PIMEDUS: Vali 1 avatud VALGUSE koletis väljal, hävita see ja tõmba 1 kaart.

source: The Fabled Unicore
et: Müüdiline Ükssarvik

source: 1 "Fabled" Tuner + 1 or more non-Tuner monsters<BR>While you and your opponent have the same number of cards in hand, negate all Spell, Trap and Effect Monster effects activated by your opponent, and destroy that Spell/Trap/Monster.
et: 1 "Fabled" Tuner + 1 või rohkem mitte-Tuner koletist<BR>Kui sinul ja sinu vastasel on käes sama arv kaarte, tühista kõik sinu vastase aktiveeritud Loitsu, Lõksu ja Efektikoletise efektid ning hävita see Loits/Lõks/Koletis.

source: Dragunity Knight - Trident
et: Dragunity Rüütel - Trident

source: 1 Dragon-Type Tuner + 1 or more non-Tuner Winged Beast-Type monsters<BR>Once per turn, you can send up to 3 cards you control to the Graveyard to look at your opponent's Extra Deck and send an equal number of cards to the Graveyard.
et: 1 Draakoni-tüüpi Tuner + 1 või rohkem mitte-Tuner Tiivulise Olendi-tüüpi koletist<BR>Korra käigu jooksul võid saata kuni 3 kaarti, mida sa kontrollid, Hauakambrisse, et vaadata oma vastase Lisapakki ja saata sama arv kaarte Hauakambrisse.

source: Jurrac Meteor
et: Jurrac Meteoor

source: 1 "Jurrac" Tuner + 2 or more non-Tuner Dinosaur monsters<BR>When this card is Synchro Summoned, destroy all cards on the field. Then, you can Special Summon 1 Tuner Monster from your Graveyard.
et: 1 "Jurrac" Tuner + 2 või rohkem mitte-Tuner Dinosauruse koletist<BR>Kui see kaart on Sünkro Kutsutud, hävita kõik kaardid väljal. Seejärel saad Sa eriliselt kutsuda 1 Tuner Koletise oma Hauakambrist.

source: 1 EARTH Tuner + 1 or more non-Tuner EARTH monsters<BR>While this card is face-up on the field, you can send 1 Spell Card from your hand to the Graveyard to negate the activation of an Effect Monster's effect, and destroy that Effect Monster.
et: 1 MAA Tüürihäälestaja + 1 või rohkem mitte-Tüürihäälestaja MAA koletist<BR>Kui see kaart on lahinguväljal avatud, saad sa saata 1 Loitsukaardi oma käest Hauakambrisse, et tühistada Efektikoletise efekti aktiveerimine ja hävitada see Efektikoletis.

source: Gauntlet Warrior
et: Kindavõitleja

source: You can Tribute this card to have all face-up Warrior-Type monsters you control gain 500 ATK and DEF until the end of the next Damage Step they battle. This effect can be activated during either player's turn.
et: Saad selle kaardi ohverdada, et kõik sinu kontrolli all olevad avatud Sõdalase-tüüpi koletised saaksid 500 ATK ja DEF juurde kuni järgmise Kahjustuse Etapi lõpuni, mil nad võitlevad. Seda efekti saab aktiveerida mõlema mängija käigu ajal.

source: Eccentric Boy
et: Ekstsentriline Poiss

source: When using this card as a Synchro Material Monster, the other Synchro Material Monster is 1 monster in your hand. The Synchro Monster that used this card as a Synchro Material Monster cannot activate its effects, its effect(s) is negated, and is removed from play when removed from the field.
et: Seda kaarti Sünkromaterjalina kasutades on teine Sünkromaterjal sinu käes olev koletis. Sünkrokoletis, mis kasutas seda kaarti Sünkromaterjalina, ei saa oma efekte aktiveerida, selle efekt(id) on tühistatud ja see eemaldatakse mängust, kui see eemaldatakse väljakult.

source: Junk Archer
et: Rämpsu Ambur

source: "<M7687>Junk Synchron<M>" + 1 or more non-Tuner monsters<BR>Once per turn you can select 1 monster your opponent controls. Remove that monster from play. During the End Phase of this turn, it returns to your opponent's side of the field, in the same Battle Position.
et: "<M7687>Junk Synchron<M>" + 1 või rohkem mittehäälestuskoletist<BR>Korra käigu jooksul saad valida 1 koletise, mida sinu vastane kontrollib. Eemalda see koletis mängust. Selle käigu lõppfaasis naaseb see sinu vastase väljale samas lahingupositsioonis.

source: Scrubbed Raid
et: Puhastatud Rünnak

source: During the Battle Phase, you can send 1 card you control to the Graveyard, to end the Battle Phase.
et: Lahingufaasi ajal saad saata 1 kaardi, mida sa kontrollid, Hauakambrisse, et lõpetada Lahingufaas.

source: Tuner's Barrier
et: Häälestaja Barjäär

source: Select 1 face-up Tuner monster you control. That monster cannot be destroyed by battle or by card effects, until the End Phase of the next turn.
et: Vali 1 avatud Tuner koletis, mida sa kontrollid. Seda koletist ei saa hävitada lahingus ega kaardiefektide poolt kuni järgmise käigu lõppfaasini.

source: Ape Fighter
et: Ahvivõitleja

source: Each time this card destroys an opponent's monster by battle, this card gains 300 ATK. If this card does not attack during your turn, the ATK gained from this effect returns to 0 during the End Phase of that turn.
et: Iga kord, kui see kaart hävitab lahingus vastase koletise, saab see kaart 300 ATK juurde. Kui see kaart ei ründa sinu käigu ajal, siis selle efekti kaudu saadud ATK muutub selle käigu lõppfaasis tagasi 0-ks.

source: Closed Forest
et: Suletud Mets

source: All face-up Beast-Type monsters you control gain 100 ATK for each monster in your Graveyard. Field Spell Cards cannot be activated while this card is face-up on the field. Field Spell Cards cannot be activated the turn this card is destroyed.
et: Kõik ülespööratud Loomatüüpi koletised, mida sa kontrollid, saavad 100 ATK iga sinu Hauakambris oleva koletise kohta. Väljaloitsu Kaardid ei saa aktiveerida, kui see kaart on väljal ülespööratud. Väljaloitsu Kaardid ei saa aktiveerida sellel käigul, mil see kaart hävitatakse.

source: Roaring Earth
et: Mürisev Maa

source: During battle between an attacking Beast-Type monster you control and a Defense Position monster whose DEF is lower than the ATK of the attacking monster, inflict the difference as Battle Damage to your opponent. When your opponent takes Battle Damage from this effect, select 1 face-up monster they control. It loses 500 ATK and DEF.
et: Kui sinu kontrolli all olev ründav Loomatüüpi koletis võitleb kaitsepositsioonis oleva koletisega, mille DEF on madalam kui ründava koletise ATK, põhjusta vahe oma vastasele Lahingukahjuna. Kui sinu vastane saab selle efekti tõttu Lahingukahju, vali 1 avatud koletis, mida ta kontrollib. See kaotab 500 ATK ja DEF.

source: Ape Magician
et: Ahvimaag

source: This card cannot be Special Summoned. Once per turn, if this card is in face-up Attack Position, you can send 1 monster from your hand to the Graveyard and select 1 face-up Defense Position monster your opponent controls. Take control of the selected monster until the End Phase of this turn. It cannot change its Battle Position this turn.
et: Seda kaarti ei saa eriliselt kutsuda. Kord käigu jooksul, kui see kaart on avatud rünnakupositsioonis, võid saata 1 koletise oma käest Hauakambrisse ja valida 1 avatud kaitsepositsioonis oleva koletise, mida sinu vastane kontrollib. Võta valitud koletise kontroll kuni selle käigu lõppfaasini. See ei saa sellel käigul oma lahingupositsiooni muuta.

source: Elemental Hero Great Tornado
et: Elementaalne Kangelane Suur Tornado

source: 11 "Elemental HERO" monster + 1 WIND monster<BR>Must be Fusion Summoned and cannot be Special Summoned by other ways. When this card is Fusion Summoned: Halve the ATK and DEF of all face-up monsters your opponent controls.
et: 11 "Elemental HERO" koletist + 1 TUULE koletis<BR>Peab olema Fusion Summoned ja ei saa olla Special Summoned muul viisil. Kui see kaart on Fusion Summoned: Vähenda poole võrra kõigi vastase kontrollitavate avatud koletiste ATK ja DEF.

source: Koa'ki Meiru Beetle
et: Koa'ki Meiru Põrnikas

source: During each of your End Phases, destroy this card unless you send 1 "<M8207>Iron Core of Koa'ki Meiru<M>" from your hand to the Graveyard or reveal 1 Insect-Type Monster in your hand. When a LIGHT or DARK monster is Special Summoned in face-up Attack Position, change the Summoned monster to Defense Position.
et: Iga lõppfaasis hävita see kaart, kui sa ei saada 1 "<M8207>Koa'ki Meiru Raudtuum<M>" oma käest Hauakambrisse või ei näita oma käes olevat ühte Putukaliiki koletist. Kui valguse või pimeduse koletis kutsutakse eriliselt esile rünnakupositsioonis, muuda kutsutud koletis kaitsepositsiooni.

source: This card cannot be Normal Summoned or Set. This card can only be Special Summoned by removing from play 1 "<M8207>Iron Core of Koa'ki Meiru<M>" from your hand. During each of your End Phases, destroy this card unless you send 1 "<M8207>Iron Core of Koa'ki Meiru<M>" or 1 "Koa'ki Meiru" monster from your hand to the Graveyard. Once per turn, during your Main Phase, you can select and destroy 1 card your opponent controls.
et: Seda kaarti ei saa tavaliselt kutsuda ega asetada. Seda kaarti saab eriliselt kutsuda ainult eemaldades mängust 1 "<M8207>Koa'ki Meiru Raudtuum<M>" oma käest. Iga oma lõppfaasi ajal hävita see kaart, kui sa ei saada 1 "<M8207>Koa'ki Meiru Raudtuum<M>" või 1 "Koa'ki Meiru" koletist oma käest hauakambrisse. Kord ühe käigu jooksul, oma põhifaasi ajal, saad valida ja hävitada 1 kaardi, mida sinu vastane kontrollib.

source: Shire, Lightsworn Spirit
et: Shire, Valgusevande Vaim

source: This card gains 300 ATK for each "Lightsworn" monster with a different name in your Graveyard. During each of your End Phases, send the top 2 cards of your Deck to the Graveyard.
et: See kaart saab 300 ATK iga sinu kalmistul oleva erineva nimega "Lightsworn" koletise eest. Iga sinu lõppfaasi ajal saada oma pakist kaks ülemist kaarti kalmistule.

source: Rinyan, Lightsworn Rogue
et: Rinyan, Valgusevande Põgenik

source: FLIP: Return 1 "Lightsworn" monster from your Graveyard to your Deck and draw 1 card.
et: FLIP: Tagasta 1 "Lightsworn" koletis oma Hauakambrist oma Pakki ja tõmba 1 kaart.

source: Yellow Baboon, Archer of the Forest
et: Kollane Paavian, Metsa Vibukütt

source: When a Beast-Type monster you control is destroyed by battle and sent to the Graveyard, you can remove from play 2 Beast-Type monsters from your Graveyard to Special Summon this card from your hand.
et: Kui lahingus hävitatakse ja Hauakambrisse saadetakse sinu kontrolli all olev Loomatüüpi koletis, võid eemaldada oma Hauakambrist mängust 2 Loomatüüpi koletist, et Kutsuda see kaart oma käest Eriliselt välja.

source: Gemini Scorpion
et: Kaksikute Skorpion

source: When this card is Normal or Special Summoned, you can Special Summon 1 Level 4 or lower Gemini Monster from your hand.
et: Kui see kaart on Normaal- või Erikutsutud, saad oma käest Erikutsuda 1 4. taseme või madalama Kaksikkoletise.

source: Metabo-Shark
et: Metabo-Hai

source: When this card is Normal Summoned, you can select and return 2 Fish-Type monsters from your Graveyard to your Deck.
et: Kui see kaart on Normaal-Kutsutud, saad valida ja tagastada 2 Kalatüüpi koletist oma Hauakambrist oma Pakki.

source: Earthbound Revival
et: Maa-seotud taaselustamine

source: Discard 1 card. Select 1 "Earthbound Immortal" monster and 1 Field Spell Card in your Graveyard, and add them to your hand.
et: Viska 1 kaart. Vali 1 "Earthbound Immortal" koletis ja 1 Väljaloitsu Kaart oma Hauakambris ning lisa need oma kätte.

source: Reptilianne Poison
et: Reptilianne Mürk

source: Activate only if you control a face-up "Reptilianne" monster. Change 1 Defense Position monster your opponent controls to face-up Attack Position and reduce its ATK to 0.
et: Aktiveeri ainult siis, kui sa kontrollid avatud "Reptilianne" koletist. Muuda 1 kaitseasendis olev vastase koletis avatud rünnakuasendisse ja vähenda selle rünnakupunktid 0-ni.

source: Gateway of the Six
et: Kuue Värav

source: Each time a "Six Samurai" monster(s) is Normal or Special Summoned, place 2 Bushido Counters on this card. You can remove Bushido Counters from your side of the field to activate these effects.<BR>● 2 Counters: Target 1 face-up "Six Samurai" or "Shien" Effect Monster; that target gains 500 ATK until the End Phase.<BR>● 4 Counters: Add 1 "Six Samurai" monster from your Deck or Graveyard to your hand.<BR>● 6 Counters: Target 1 "Shien" Effect Monster in your Graveyard; Special Summon that target.
et: Iga kord, kui "Kuue Samuraid" koletis(ed) kutsutakse tavaliselt või eriliselt, pane sellele kaardile 2 Bushido loendurit. Sa saad eemaldada Bushido loendureid oma väljaku poolelt, et aktiveerida neid efekte.<BR>● 2 loendurit: Sihtmärk 1 avatud "Kuue Samuraid" või "Shien" Efektikoletis; see sihtmärk saab 500 ATK kuni lõppfaasini.<BR>● 4 loendurit: Lisa 1 "Kuue Samuraid" koletis oma pakist või hauast oma kätte.<BR>● 6 loendurit: Sihtmärk 1 "Shien" Efektikoletis sinu hauas; kutsu see sihtmärk eriliselt.

source: 1 DARK Tuner + 1 non-Tuner Insect-Type monster<BR>If this card attacks, your opponent cannot activate any Spell or Trap Card until the end of the Damage Step. Once per turn, you can select 1 face-up monster your opponent controls, and equip it to this card. If this card would be destroyed by battle, you can destroy the monster equipped to this card by its effect instead. (You can only equip 1 monster at a time to this card.)
et: 1 Pimeduse Tüüri + 1 mitte-Tüüri Putukate tüüpi koletis<BR>Kui see kaart ründab, ei saa sinu vastane aktiveerida ühtegi Loitsu ega Lõksukaarti kuni Kahjustuse Sammuni. Kord käigu jooksul saad valida 1 avatud koletise, mida sinu vastane kontrollib, ja kinnitada see kaart sellele. Kui see kaart hävitatakse lahingus, saad selle kaardi külge kinnitatud koletise hävitada selle efekti abil. (Sa saad kinnitada sellele kaardile korraga ainult 1 koletise.)

source: Hundred Eyes Dragon
et: Saja Silmade Draakon

source: 1 DARK Tuner + 1 or more non-Tuner Fiend-Type monsters<BR>Once per turn, you can activate this card's effect by removing from play 1 Level 6 or lower DARK Effect Monster from your Graveyard. Until the End Phase, treat this card's name as that monster's name and this card gains the same effects as that monster while face-up on the field. When this card is destroyed and sent to the Graveyard, add 1 "Earthbound Immortal" monster from your Deck to your hand.
et: 1 Pimeduse Häälestaja + 1 või rohkem mitte-Häälestaja Deemon-tüüpi koletist<BR>Korra käigu jooksul saad aktiveerida selle kaardi efekti, eemaldades mängust ühe 6. või madalama taseme Pimeduse Efektikoletise oma Hauakambrist. Kuni lõppfaasini käsitle seda kaarti kui selle koletise nime ja see kaart saab samad efektid, mis sellel koletisel, kui see on näoga ülespoole väljakul. Kui see kaart hävitatakse ja saadetakse Hauakambrisse, lisa üks "Maa-alune Surematu" koletis oma pakist kätte.

source: 1 DARK Tuner + 1 non-Tuner Beast-Type monster<BR>If this card attacks, your opponent cannot activate any Spell or Trap Cards until the end of the Damage Step. When an opponent's monster declares an attack, you can select that monster and send 1 monster from your hand or your side of the field to the Graveyard to negate the attack.
et: 1 Pimeduse Tüürihäälestaja + 1 mitte-Tüürihäälestaja Loom-Tüüpi koletis<BR>Kui see kaart ründab, ei saa sinu vastane aktiveerida ühtegi Loitsu ega Lõksukaarti kuni Kahjustusetapi lõpuni. Kui vastase koletis kuulutab välja rünnaku, saad valida selle koletise ja saata 1 koletise oma käest või oma väljaku poolelt Hauakambrisse, et rünnak tühistada.

source: Junk Collector
et: Rämpsukoguja

source: During either player's turn, you can remove from play this face-up card you control and 1 Normal Trap Card from your Graveyard to activate the effect of the removed Trap Card as this card's effect.
et: Oma või vastase käigu ajal saad eemaldada mängust selle avatud kaardi, mida sa kontrollid, ja 1 Tavalise Lõksukaardi oma Hauakambrist, et aktiveerida eemaldatud Lõksukaardi efekt selle kaardi efektina.

source: Backup Warrior
et: Varusõdalane

source: This card cannot be Normal Summoned or Set. This card can only be Special Summoned from your hand if the only monsters you control are 2 Defense Position monsters. You cannot Synchro Summon during the turn that this card is Special Summoned.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti saab eriliselt kutsuda ainult oma käest, kui ainsad koletised, mida sa kontrollid, on 2 kaitsepositsioonis koletist. Sa ei saa sünkrokutsuda sellel käigul, mil see kaart eriliselt kutsutakse.

source: Miracle's Wake
et: Imeilus ärkamine

source: Select 1 monster that was destroyed by battle and sent to your Graveyard during this turn. Special Summon it.
et: Vali 1 koletis, mis hävitati lahingus ja saadeti sel käigul sinu Hauakambrisse. Kutsu see eriliselt välja.

source: Starlight Road
et: Tähetule Tee

source: Activate only when an effect is activated that would destroy 2 or more cards you control. Negate the effect and destroy that card. Then, you can Special Summon 1 "<M7734>Stardust Dragon<M>" from your Extra Deck.
et: Aktiveeri ainult siis, kui aktiveeritakse efekt, mis hävitaks 2 või rohkem sinu kontrolli all olevat kaarti. Tühista efekt ja hävita see kaart. Seejärel saad oma Ekstra Pakist eriliselt kutsuda 1 "<M7734>Stardust Dragon<M>".

source: Aggiba, the Malevolent Sh'nn S'yo
et: Aggiba, pahatahtlik Sh'nn S'yo
