Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: Once per turn, this card can move to an adjacent unoccupied Monster Card Zone. If this card attacks the monster in its same column, this card gains 500 ATK during the Damage Step.
et: Üks kord käigu jooksul võib see kaart liikuda kõrvalolevasse vaba Monster Card Zone'i. Kui see kaart ründab sama veeru koletist, saab see kaart Damage Step'i ajal 500 ATK juurde.

source: Storm Shooter
et: Tormituul

source: Once per turn, you can select and activate 1 of these effects:<BR>● Move this card to an adjacent unoccupied Monster Card Zone.<BR>● Return 1 Spell, Trap or Monster Card on your opponent's side of the field in the same column as this card to its owner's hand.
et: Korra ühe korra käigu jooksul saad valida ja aktiveerida ühe nendest efektidest:<BR>● Liiguta see kaart kõrvalolevasse tühja Monster Card Zone'i.<BR>● Tagasta 1 Loits, Lõks või Monster Card oma vastase väljaku samas veerus, kus see kaart asub, selle omaniku kätte.

source: Alien Infiltrator
et: Välismaalane Infiltrator

source: Once per turn, this card can move to an adjacent unoccupied Monster Card Zone. If no Spell, Trap or Monster Card on your opponent's side of the field is in the same column as this card, it can attack your opponent directly.
et: Kord ühe korra käigu jooksul võib see kaart liikuda külgnevale vaba Koletise Kaardi Tsooni. Kui sinu vastase väljaku samas veerus ei ole ühtegi Loitsu, Lõksu ega Koletise Kaarti, võib see kaart rünnata sinu vastast otse.

source: Corruption Cell "A"
et: Korruptsiooni Rakk "A"

source: Place 1 A-Counter on 1 face-up monster on your opponent's side of the field.
et: Aseta 1 A-loendur ühele vastase väljaku avatud poolel olevale koletisele.

source: Flash of the Forbidden Spell
et: Keelatud loitsu sähvatus

source: Activate only when all of your opponent's Monster Card Zones are occupied by monsters. Destroy all monsters on your opponent's side of the field.
et: Aktiveeri ainult siis, kui kõik sinu vastase Monster Card Zones on koletistega hõivatud. Hävita kõik koletised sinu vastase väljaku poolel.

source: Ritual Foregone
et: Rituaali ohverdamine

source: Pay 1000 Life Points. Special Summon 1 Ritual Monster from your hand. The Ritual Monster Special Summoned by this effect cannot attack, and is destroyed during the End Phase. Only 1 "<M6900>Ritual Foregone<M>" can be activated per turn.
et: Maksa 1000 Elupunkti. Kutsu eriliselt välja 1 Rituaalikoletis oma käest. Selle efekti abil eriliselt välja kutsutud Rituaalikoletis ei saa rünnata ja hävitatakse lõppfaasis. Ainult 1 "<M6900>Rituaal Eelnevalt<M>" saab aktiveerida ühe käigu jooksul.

source: Instant Fusion
et: Kiirfusioon

source: Pay 1000 Life Points; Special Summon 1 Level 5 or lower Fusion Monster from your Extra Deck. (This Special Summon is treated as a Fusion Summon). The Fusion Monster Special Summoned by this effect cannot attack, and is destroyed during the End Phase. Only 1 "<M6901>Instant Fusion<M>" can be activated per turn.
et: Maksa 1000 Elupunkti; Kutsu eriliselt välja 1 tase 5 või madalam Fusion Monster oma Extra Deckist. (See eriline väljakutse käsitletakse kui Fusion Summon). Selle efekti abil eriliselt välja kutsutud Fusion Monster ei saa rünnata ja hävitatakse End Phase ajal. Ainult 1 "<M6901>Instant Fusion<M>" saab aktiveerida ühe käigu jooksul.

source: Counter Cleaner
et: Loenduripuhasti

source: Pay 500 Life Points. Remove all counters from the field.
et: Makske 500 elupunkti. Eemalda kõik loendurid väljakult.

source: Linear Accelerator Cannon
et: Lineaarne kiirendi kahur

source: Tribute 1 monster and inflict damage to your opponent equal to half that monster's original ATK. If you activate this card, you cannot activate any other Spell Cards this turn.
et: Ohverda 1 koletis ja tekita oma vastasele kahju, mis on võrdne poolega selle koletise algsest rünnakust. Kui aktiveerid selle kaardi, ei saa sa sel käigul ühtegi teist loitsukaarti aktiveerida.

source: Chain Strike
et: Ahelöök

source: Activate only as Chain Link 2 or higher; inflict 400 damage to your opponent times the Chain Link number of this card. You cannot activate this card if multiple cards/effects with the same name are in that Chain.
et: Aktiveeri ainult kui Ahela Lüliga 2 või kõrgem; tee oma vastasele kahju 400 korda selle kaardi Ahela Lüli numbriga. Sa ei saa seda kaarti aktiveerida, kui selles Ahelas on mitu sama nimega kaarti/efekti.

source: Miraculous Rebirth
et: Imeväärne taassünd

source: Activate only as Chain Link 4 or higher. Select 1 monster from either player's Graveyard and Special Summon it. You cannot activate this card if multiple cards/effects with the same name are in that Chain.
et: Aktiveeri ainult kui Ahela Lüliga 4 või kõrgem. Vali 1 koletis kas enda või vastase Hauakambrist ja Kutsu see Eriliselt välja. Sa ei saa seda kaarti aktiveerida, kui selles Ahelas on mitu sama nimega kaarti/efekti.

source: Mystical Wind Typhoon
et: Müstiline Tuule Torm

source: Activate only as Chain Link 3 or higher. Destroy 1 Spell or Trap Card on the field. You cannot activate this card if multiple cards/effects with the same name are in the Chain.
et: Aktiveeri ainult kui Ahel on 3 või kõrgem. Hävita 1 Väljal olev Võlu- või Lõksukaart. Sa ei saa seda kaarti aktiveerida, kui Ahelas on mitu sama nimega kaarti/efekti.

source: Level Down!?
et: Taseme langetamine!?

source: Select 1 face-up "LV" monster on the field to activate this card. Return the selected card to its owner's Deck and Special Summon 1 monster from the owner's Graveyard to their side of the field with the same name but lower "LV" (ignoring the Summoning conditions).
et: Vali 1 avatud "LV" koletis väljal, et aktiveerida see kaart. Tagasta valitud kaart selle omaniku pakki ja Kutsu Eriliselt esile 1 koletis omaniku Hauakambrist nende väljale sama nimega, kuid madalama "LV"-ga (eirates Kutsumise tingimusi).

source: Degenerate Circuit
et: Degeneratiivne Ringkond

source: The controller of this card pays 500 Life Points during each of their Standby Phases (this is not optional). Monster Cards that would be returned from the field to the hand are removed from play instead.
et: Selle kaardi kontrollija maksab iga oma ootejärgu faasi ajal 500 elupunkti (see ei ole valikuline). Koletisekaardid, mis tagastatakse väljakult kätte, eemaldatakse mängust.

source: Senet Switch
et: Seneti Lüliti

source: Once per turn, during your Main Phase, you can move 1 monster on your side of the field to an adjacent unoccupied Monster Card Zone.
et: Korra ühe korra oma peafaasil saad sa liigutada ühe koletise oma väljaku poolel külgnevale hõivamata Koletise Kaardi Tsooni.

source: Blasting Fuse
et: Plahvatav Süütenöör

source: Activate only when all (4) zones of this card's column are occupied. Destroy all cards in this column.
et: Aktiveeri ainult siis, kui kõik selle kaardi veeru (4) tsoonid on hõivatud. Hävita kõik kaardid selles veerus.

source: Straight Flush
et: Sirge mast

source: Activate only when all of your opponent's Spell & Trap Card Zones are occupied. Destroy all cards in your opponent's Spell & Trap Card Zones.
et: Aktiveeri ainult siis, kui kõik sinu vastase Võlu- ja Lõksukaarditsoonid on hõivatud. Hävita kõik kaardid sinu vastase Võlu- ja Lõksukaarditsoonides.

source: Justi-Break
et: Õiglusmurd

source: Activate only when your opponent declares an attack against a face-up Normal Monster you control. Destroy all monsters on the field, except face-up Attack Position Normal Monsters.
et: Aktiveeri ainult siis, kui sinu vastane kuulutab rünnaku sinu kontrolli all oleva avatud tavalise koletise vastu. Hävita kõik koletised väljal, välja arvatud avatud rünnakupositsioonis tavalised koletised.

source: Dimensional Inversion
et: Dimensioonide Inversioon

source: Activate only when a monster(s) you own is removed from play by an opponent's effect. Special Summon 1 of those monsters.
et: Aktiveeri ainult siis, kui vastase efekti tõttu eemaldatakse mängust sinu koletis(ed). Kutsu eriliselt esile üks neist koletistest.

source: Chain Healing
et: Ahelahel

source: Gain 500 Life Points. If this card was activated as Chain Link 2 or 3, add this card to the Deck and shuffle it. If this card was activated as Chain Link 4 or higher, return this card to the hand.
et: Saad 500 Elupunkti. Kui see kaart aktiveeriti kui Ahela Lülide 2 või 3, lisa see kaart Paki ja sega see. Kui see kaart aktiveeriti kui Ahela Lülide 4 või kõrgem, tagasta see kaart kätte.

source: Chain Detonation
et: Ahelplahvatus

source: Inflict 500 damage to your opponent. If this card was activated as Chain Link 2 or 3, add this card to the Deck and shuffle it. If this card was activated as Chain Link 4 or higher, return this card to the hand.
et: Tehke oma vastasele 500 kahju. Kui see kaart aktiveeriti kui Ahel Lüliti 2 või 3, lisa see kaart Paki ja sega see. Kui see kaart aktiveeriti kui Ahel Lüliti 4 või kõrgem, tagasta see kaart kätte.

source: Accumulated Fortune
et: Kogunenud Õnn

source: Activate only as Chain Link 4 or higher. Draw 2 cards. You cannot activate this card if multiple cards/effects with the same name are in that chain.
et: Aktiveeri ainult siis, kui see on ahelas 4. või kõrgem lüli. Tõmba 2 kaarti. Sa ei saa seda kaarti aktiveerida, kui selles ahelas on mitu sama nimega kaarti/efekti.

source: Vanity's Call
et: Edvistuse Kutsung

source: Activate only as Chain Link 4 or higher. Pay half your Life Points. Negate the activation and effects of all other cards in the same Chain and destroy them.
et: Aktiveeri ainult kui Ahela Lülituse 4 või kõrgem. Maksa pool oma Elupunktidest. Tühista kõigi teiste kaartide aktiveerimine ja efektid samas Ahelas ning hävita need.

source: Black Horn of Heaven
et: Musta Taevasarv

source: Negate the Special Summon of 1 of your opponent's monsters and destroy it.
et: Negateeri oma vastase ühe koletise erikutsumise ja hävita see.

source: Goka, the Pyre of Malice
et: Goka, Pahatahtede Lõke

source: You can Special Summon this card from your hand if you control a FIRE monster. When this card is Special Summoned this way, destroy 1 FIRE monster you control. During your Standby Phase, Special Summon 1 "<M3931>Fireball Token<M>" (Pyro-Type/FIRE/Level 1/ATK 100/DEF 100) in Defense Position. You can Tribute 1 other FIRE monster to have this card gain 500 ATK, until the End Phase.
et: Saad selle kaardi oma käest eriliselt välja kutsuda, kui sa kontrollid TULEKAHJU koletist. Kui see kaart kutsutakse sel viisil eriliselt välja, hävita 1 TULEKAHJU koletis, mida sa kontrollid. Sinu Ootefaasil kutsu eriliselt välja 1 "<M3931>Fireball Token<M>" (Püro-Tüüp/TULEKAHJU/Tase 1/ATK 100/DEF 100) kaitsepositsioonis. Sa saad ohverdada 1 teise TULEKAHJU koletise, et see kaart saaks 500 ATK juurde kuni Lõppfaasini.

source: Terra Firma Gravity
et: Terra Firma Gravitatsioon

source: During your opponent's Battle Phase, if you control "<M6731>Elemental Hero Terra Firma<M>": This turn, all Level 4 or lower monsters your opponent controls that can attack a face-up "<M6731>Elemental Hero Terra Firma<M>" you control must attack it, and cannot otherwise attack.
et: Oma vastase lahingufaasis, kui sa kontrollid "<M6731>Elemental Hero Terra Firma<M>": Sel käigul peavad kõik sinu vastase kontrollitavad 4. taseme või madalamad koletised, mis saavad rünnata sinu kontrollitavat "<M6731>Elemental Hero Terra Firma<M>", seda ründama ja ei saa rünnata muul viisil.

source: Elemental Hero Heat
et: Elementaalne Kangelane Kuumus

source: This card gains 200 ATK for each face-up1 "Elemental HERO" monster you control.
et: See kaart saab 200 ATK iga avatud "Elemental HERO" koletise eest, mida sa kontrollid.

source: Cold Enchanter
et: Külm Võlur

source: You can discard 1 card to target 1 face-up monster on the field; place an Ice Counter on that target. This card gains 300 ATK for each Ice Counter on the field.
et: Saad ühe kaardi ära visata, et sihtida ühte avatud koletist väljal; aseta sellele sihtmärgile üks Jääloendur. See kaart saab 300 ATK iga väljal oleva Jääloenduri kohta.

source: Ancient Gear Gadjiltron Dragon
et: Muinasvarustuse Gadjiltron Draakon

source: If this card attacks, your opponent cannot activate any Spell/Trap Cards until the end of the Damage Step. This card gets extra effects if you Tribute Summon it by Tributing<BR>● "<M6151>Green Gadget<M>": During battle between this attacking card and a Defense Position monster whose DEF is lower than the ATK of this card, inflict the difference as Battle Damage to your opponent.<BR>● "<M6155>Red Gedget<M>": When this card inflicts Battle Damage to your opponent, inflict 400 damage to your opponent.<BR>● "<M6156>Yellow Gadget<M>": If this card destroys your opponent's monster by battle, inflict 600 damage to your opponent.
et: Kui see kaart ründab, ei saa sinu vastane aktiveerida ühtegi Loitsu/Lõksu Kaarti kuni Kahjustuse Etapi lõpuni. See kaart saab lisamõjusid, kui sa ohverdad selle Ohverdus Kutsumisega, ohverdades<BR>● "<M6151>Roheline Vidin<M>": Lahingu ajal selle ründava kaardi ja Kaitseasendis oleva koletise vahel, mille DEF on madalam kui selle kaardi ATK, põhjusta vahe Kahjustusena oma vastasele.<BR>● "<M6155>Punane Vidin<M>": Kui see kaart põhjustab Kahjustust sinu vastasele, põhjusta 400 kahju oma vastasele.<BR>● "<M6156>Kollane Vidin<M>": Kui see kaart hävitab sinu vastase koletise lahingus, põhjusta 600 kahju oma vastasele.

source: Ancient Gear Gadjiltron Chimera
et: Muinasvarustuse Gadjiltron Chimera

source: If you Tribute Summon this card by Tributing 1 of the following monster(s), this card gets the appropriate effect:<BR>● "<M6151>Green Gadget<M>": Increase this card's ATK by 300.<BR>● "<M6155>Red Gedget<M>": When this card successfully attacks your opponent directly, inflict 500 points of damage to your opponent's Life Points.<BR>● "<M6156>Yellow Gadget<M>": When this card destroys an opponent's monster in battle, inflict 700 points damage to your opponent's Life Points.
et: Kui sa kutsud selle kaardi välja ohverdades ühe järgmistest koletistest, saab see kaart vastava efekti:<BR>● "<M6151>Roheline Vidin<M>": Suurenda selle kaardi ATK-d 300 võrra.<BR>● "<M6155>Punane Vidin<M>": Kui see kaart ründab edukalt sinu vastast otse, põhjusta oma vastase Elupunktidele 500 punkti kahju.<BR>● "<M6156>Kollane Vidin<M>": Kui see kaart hävitab lahingus vastase koletise, põhjusta oma vastase Elupunktidele 700 punkti kahju.

source: Boot-Up Soldier - Dread Dynamo
et: Käivitussõdur - Hirmu Dünamo

source: While you have a face-up "Gadget" monster on your side of the field, this card gains 2000 ATK.
et: Kui sul on oma väljaku poolel avatud "Gadget" koletis, saab see kaart 2000 ATK juurde.

source: Ancient Gear Workshop
et: Muinasvarustuse Töökoda

source: Add 1 "Ancient Gear" monster from your Graveyard to your hand.
et: Lisa oma käest 1 "Ancient Gear" koletis oma Hauakambrist.

source: Stray Asmodian
et: <translated:Hulkuv Asmodian

source: When this card is destroyed and sent to the Graveyard by battle, both players gain 800 Life Points.
et: Kui see kaart hävitatakse ja saadetakse lahingus Hauakambrisse, saavad mõlemad mängijad 800 Elupunkti juurde.

source: When this card is destroyed and sent to the Graveyard by battle, both players take 500 damage.
et: Kui see kaart hävitatakse ja saadetakse lahingus Hauakambrisse, saavad mõlemad mängijad 500 kahju.

source: Flame Ogre
et: Leegi Ogre

source: This card cannot be Special Summoned. When this card is Normal Summoned, draw 1 card.
et: Seda kaarti ei saa eriliselt kutsuda. Kui see kaart on tavaliselt kutsutud, tõmba 1 kaart.

source: Card Trooper
et: Kaardisõdur

source: Once per turn: You can choose a number from 1 to 3, then send that many cards from the top of your Deck to the Graveyard; this card gains 500 ATK for each card sent to the Graveyard this way, until the End Phase. When this card you control is destroyed and sent to your Graveyard: Draw 1 card.
et: Kord ühe korra käigu jooksul: Sa võid valida numbri 1 kuni 3, seejärel saata sama palju kaarte oma paki pealt hauakambrisse; see kaart saab 500 ATK iga hauakambrisse saadetud kaardi eest, kuni lõppfaasini. Kui see kaart, mida sa kontrollid, hävitatakse ja saadetakse sinu hauakambrisse: Tõmba 1 kaart.

source: Light Laser
et: Valguslaser

source: Equip only to a LIGHT Warrior-Type monster. Remove from play any monsters that battle with it at the end of Damage Step.
et: Varusta ainult VALGUS Sõdalase-tüüpi koletisele. Eemalda mängust kõik koletised, mis sellega võitlevad, Kahjustuse Arvu lõpus.

source: Burial from a Different Dimension
et: Matmine teisest dimensioonist

source: Select up to 3 removed from play monsters, and return them to their owners' Graveyards.
et: Vali kuni 3 mängust eemaldatud koletist ja tagasta need nende omanike Hauakambrisse.

source: Edge Hammer
et: Serva haamer

source: Tribute 1 "<M6477>Elemental Hero Bladedge<M>" to target 1 monster your opponent controls; destroy that target and inflict damage to your opponent equal to that target's original ATK.
et: Lohista 1 "<M6477>Elemental Hero Bladedge<M>", et sihi 1 koletis, mida sinu vastane kontrollib; hävita see sihtmärk ja tekita oma vastasele kahju, mis on võrdne selle sihtmärgi algse rünnakuga.

source: Kid Guard
et: Lapsekaitse

source: When an opponent's monster declares an attack: Tribute 1 "<M6567>Hero Kid<M>"; negate the attack, then add 11 "Elemental HERO" monster from your Deck to your hand.
et: Kui vastase koletis kuulutab välja rünnaku: ohverda 1 "<M6567>Kangelase Laps<M>"; tühista rünnak ja lisa siis oma pakist 1 "Elementaalkangelase" koletis oma kätte.

source: Infernal Dragon
et: Põrguliku Draakon

source: If this card attacks, it is destroyed and sent to the Graveyard during the End Phase. When this card is destroyed and sent to the Graveyard from the field, you can Special Summon this card by Tributing 1 monster.
et: Kui see kaart ründab, hävitatakse see ja saadetakse lõppfaasis kalmistule. Kui see kaart hävitatakse ja saadetakse väljakult kalmistule, saad selle kaardi spetsiaalselt kutsuda, ohverdades 1 koletise.

source: Ruthless Denial
et: Halastamatu Eitamine

source: Select 1 monster you control and send it to the Graveyard, and send 1 random card in your opponent's hand to the Graveyard.
et: Vali 1 koletis, mida sa kontrollid, ja saada see Hauakambrisse ning saada 1 juhuslik kaart oma vastase käest Hauakambrisse.

source: Return Soul
et: Hinge Hing

source: Activate only during the End Phase. You can return up to 3 monsters destroyed this turn from the Graveyard to their owners' Decks.
et: Aktiveeri ainult lõppfaasis. Sa saad tagastada kuni 3 sellel käigul hävitatud koletist Hauakambrist nende omanike pakkidesse.

source: Damage Polarizer
et: Kahju polariseerija

source: Activate only when an effect that inflicts damage is activated. Negate its activation and effect, and each player draws 1 card.
et: Aktiveeri ainult siis, kui aktiveeritakse efekt, mis tekitab kahju. Tühista selle aktiveerimine ja efekt ning iga mängija tõmbab 1 kaardi.

source: Fusion Guard
et: Fusioni Kaitse

source: Activate only when an effect that inflicts damage is activated. Negate its activation and effect, and randomly send 1 Fusion Monster from your Fusion Deck to the Graveyard.
et: Aktiveeri ainult siis, kui aktiveeritakse efekt, mis tekitab kahju. Tühista selle aktiveerimine ja efekt ning saada juhuslikult 1 Fusion Monster oma Fusion Deckist Hauakambrisse.

source: Destiny Hero - Malicious
et: Saatuskangelane - Malicious

source: You can banish this card from your Graveyard; Special Summon 1 "<M6949>Destiny Hero - Malicious<M>" from your Deck.
et: Saad selle kaardi oma Hauakambrist eemaldada; Kutsu eriliselt välja 1 "<M6949>Destiny Hero - Malicious<M>" oma pakist.

source: Destiny Draw
et: Saatusetõmme

source: Discard 1 "Destiny HERO" card; draw 2 cards.
et: Viska 1 "Destiny HERO" kaart; tõmba 2 kaarti.

source: Over Destiny
et: Saatusest Üle

source: Target 1 "Destiny HERO" monster in your Graveyard; Special Summon 1 "Destiny HERO" monster from your Deck whose Level is less than or equal to half of that target's Level. The Special Summoned monster is destroyed during the End Phase of this turn.
et: Vali 1 "Destiny HERO" koletis oma kalmistul; Kutsu eriliselt välja 1 "Destiny HERO" koletis oma pakist, mille tase on väiksem või võrdne poolega selle sihtmärgi tasemest. Eriliselt välja kutsutud koletis hävitatakse selle käigu lõppfaasis.

source: D - Counter
et: D - Vastulöök

source: When a "Destiny Hero" monster you control is targeted for an attack: Destroy the attacking monster.
et: Kui sinu kontrollitav "Destiny Hero" koletis on rünnaku sihtmärk: Hävita ründav koletis.

source: Eternal Dread
et: Igavene Hirm

source: Put 2 Clock Counters on "<M6668>Clock Tower Prison<M>".
et: Pane 2 kella loendurit "<M6668>Clock Tower Prison<M>" peale.

source: Phantom Beast Cross-Wing
et: Fantoomloom Ristitiib

source: While this card is in the Graveyard, "<M4753>Gazelle the King of Mythical Beasts<M>" and all "Phantom Beast" monsters on the field gain 300 ATK.
et: Kui see kaart on Hauakambris, saavad "<M4753>Gazelle, Müütiliste Metssigade Kuningas<M>" ja kõik "Fantoomloomade" koletised väljakul 300 ATK juurde.

source: Phantom Beast Wild-Horn
et: Fantoomloom Metsasarv

source: Phantom Beast Thunder-Pegasus
et: Fantoomelukas Äike-Pegasus

source: When your opponent's monster declares an attack, you can remove from play this card from your Graveyard to make the Battle Damage taken by 1 "<M4753>Gazelle the King of Mythical Beasts<M>" or "Phantom Beast" monster 0. When this happens, that monster is not destroyed by battle.
et: Kui sinu vastase koletis kuulutab välja rünnaku, saad selle kaardi oma Hauakambrist mängust eemaldada, et muuta ühe "<M4753>Gazelle the King of Mythical Beasts<M>" või "Phantom Beast" koletise lahingukahju 0-ks. Kui see juhtub, ei hävitata seda koletist lahingus.

source: Phantom Beast Rock-Lizard
et: Fantoomelukas Kaljukaar

source: If you are Tributing a "Phantom Beast" monster or "<M4753>Gazelle the King of Mythical Beasts<M>", this card can be Normal Summoned with 1 Tribute. When this card destroys a monster by battle, inflict 500 damage to your opponent. When this card is destroyed and sent to the Graveyard by your opponent's card effect, inflict 2000 damage to your opponent.
et: Kui sa ohverdad "Phantom Beast" koletise või "<M4753>Gazelle the King of Mythical Beasts<M>", saab selle kaardi Normaal-Kutsuda ühe ohverdusega. Kui see kaart hävitab lahingus koletise, tekitab see vastasele 500 kahju. Kui see kaart hävitatakse ja saadetakse Hauakambrisse vastase kaardi efekti tõttu, tekitab see vastasele 2000 kahju.

source: Testament of the Arcane Lords
et: Arkaanide isandate testament

source: This card cannot be Special Summoned. This card must be Tribute Summoned by Tributing 3 Spellcaster-Type monsters on your side of the field. If this card attacks your opponent's Life Points directly and makes them 0, the controller of this card wins the Match.
et: Seda kaarti ei saa eriliselt kutsuda. See kaart tuleb kutsuda ohverdades 3 loitsija-tüüpi koletist oma väljaku poolelt. Kui see kaart ründab otse sinu vastase Elupunkte ja viib need nulli, võidab selle kaardi kontrollija matši.

source: Armament of the Lethal Lords
et: Surmavate isandate relvastus

source: This card cannot be Special Summoned. This card must be Tribute Summoned by Tributing 3 Warrior-Type monsters on your side of the field. If this card attacks your opponent's Life Points directly and makes them 0, the controller of this card wins the Match.
et: Seda kaarti ei saa eriliselt kutsuda. See kaart tuleb kutsuda ohverdades 3 Sõdalase-tüüpi koletist oma väljaku poolelt. Kui see kaart ründab otse sinu vastase Elupunkte ja viib need nulli, siis selle kaardi kontrollija võidab matši.

source: Gene-Warped Warwolf
et: Geenimoonutatud Sõjasusi
