Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: "<M8631>Fire Ant Ascator<M>" + 1 or more non-Tuner monsters<BR>When this card is destroyed by battle and sent to the Graveyard, destroy the monster that destroyed this card, and inflict damage to your opponent equal to half that monster's ATK. If this card on the field is destroyed, during the Standby Phase of the next turn, you can Special Summon 1 "<M8654>Moon Dragon Quilla<M>" from your Graveyard.
et: "<M8631>Tulemure Ascator<M>" + 1 või rohkem mittehäälestaja koletist<BR>Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse, hävita koletis, mis selle kaardi hävitas, ja tekita oma vastasele kahju, mis on võrdne poolega selle koletise rünnakust. Kui see kaart väljal hävitatakse, saad järgmise käigu Ootefaasil eriliselt kutsuda 1 "<M8654>Kuu Draakon Quilla<M>" oma Hauakambrist.

source: "<M8634>Supay<M>" + 1 or more non-Tuner monsters<BR>When this card is selected as an attack target, gain Life Points equal to half the attacking monster's ATK. If this card on the field is destroyed, you can Special Summon 1 "<M8653>Sun Dragon Inti<M>" from your Graveyard.
et: "<M8634>Supay<M>" + 1 või rohkem mittehäälestuskoletisi<BR>Kui see kaart valitakse rünnaku sihtmärgiks, saad Elupunkte, mis on võrdne poolega ründava koletise RÜN väärtusest. Kui see kaart väljal hävitatakse, saad Sa eriliselt kutsuda 1 "<M8653>Päikeselohe Inti<M>" oma Hauakambrist.

source: 1 Tuner + 1 or more non-Tuner "X-Saber" monsters.<BR>When this card is Synchro Summoned, you can select and destroy up to 3 Spell or Trap Cards on the field.
et: 1 Tuner + 1 või rohkem mitte-Tuner "X-Saber" koletist.<BR>Kui see kaart on Sünkro Kutsutud, saad valida ja hävitada kuni 3 Väljal olevat Loitsu või Lõksukaarti.

source: Cards of Consonance
et: Kooskõla Kaardid

source: Discard 1 Dragon-Type Tuner monster with 1000 or less ATK to draw 2 cards.
et: Viska 1 Draakoni-tüüpi Tuner koletis, mille ATK on 1000 või vähem, et tõmmata 2 kaarti.

source: Variety Comes Out
et: Mitmekesisus tuleb välja

source: Return 1 face-up Synchro Monster you control to the Extra Deck to select and Special Summon a Tuner monster(s) from your Graveyard, whose total Levels equal the Level of that Synchro Monster. You cannot Synchro Summon the turn you activate this card.
et: Tagasta 1 avatud Sünkrokoletis, mida sa kontrollid, Ekstratekki, et valida ja Erikutsuda oma Hauakambrist Tuner-koletis(t), kelle kogutasemed on võrdne selle Sünkrokoletise tasemega. Sa ei saa Sünkrokutsuda sellel käigul, kui aktiveerid selle kaardi.

source: Reptilianne Rage
et: Reptilianne Raev

source: The equipped monster is treated as Reptile-Type. It gains 800 ATK. When this card is destroyed and sent to the Graveyard, select 1 face-up monster your opponent controls. It loses 800 ATK.
et: Varustatud koletis loetakse Reptiil-Tüüpi koletiseks. See saab 800 ATK juurde. Kui see kaart hävitatakse ja saadetakse Hauakambrisse, vali 1 vastase kontrollitav avatud koletis. See kaotab 800 ATK.

source: Advance Force
et: Eelväe Jõud

source: While this card is face-up on the field, when you Tribute Summon a Level 7 or higher monster, by using 1 Level 5 or higher monster you control as a Tribute, you can decrease the needed Tributes for the Tribute Summon by 1.
et: Kui see kaart on lahinguväljal avatud, siis kui sa kutsud ohverdades välja 7. või kõrgema taseme koletise, kasutades ohvrina 1 taseme 5 või kõrgemat koletist, mida sa kontrollid, saad vähendada vajalike ohverduste arvu ohverduskutsumise jaoks 1 võrra.

source: Viper's Rebirth
et: Madude taassünd

source: Activate only if all monsters in your Graveyard are Reptile-Type. Select 1 non-Tuner monster in your Graveyard. Special Summon it. Destroy it during the End Phase.
et: Aktiveeri ainult siis, kui kõik sinu Hauakambris olevad koletised on Reptiili-tüüpi. Vali 1 mitte-häälestaja koletis oma Hauakambrist. Kutsu see eriliselt välja. Hävita see lõppfaasis.

source: Temple of the Sun
et: Päikese tempel

source: Face-up monsters you control that were Special Summoned from the Graveyard gain 300 ATK.
et: Ülespööratud koletised, mida sa kontrollid ja mis on eriliselt kutsutud Hauakambrist, saavad 300 ATK juurde.

source: Rocket Pilder
et: Raketi Pilder

source: While the equipped monster is attacking, it cannot be destroyed by battle. (Damage calculation is applied normally.) At the end of the Damage Step when the equipped monster attacks, the attack target monster loses ATK equal to the ATK of the equipped monster, until the End Phase.
et: Kui varustatud koletis ründab, ei saa seda lahingus hävitada. (Kahju arvutamine toimub tavapäraselt.) Kahjustuse sammu lõpus, kui varustatud koletis ründab, kaotab rünnaku sihtmärgiks olev koletis ATK, mis on võrdne varustatud koletise ATK-ga, kuni lõppfaasini.

source: Break! Draw!
et: Murdmine! Tõmba!

source: Equip only to a Machine-Type monster. When the equipped monster destroys an opponent's monster by battle and sends it to the Graveyard, draw 1 card. Destroy this card during your 3rd End Phase after activation.
et: Varusta ainult Masinatüüpi koletisele. Kui varustatud koletis hävitab lahingus vastase koletise ja saadab selle Hauakambrisse, tõmba 1 kaart. Hävita see kaart oma 3. lõppfaasis pärast aktiveerimist.

source: Power Pickaxe
et: Võimu Kirkas

source: Once per turn, you can select and remove from play 1 monster in your opponent's Graveyard whose Level is less than or equal to the equipped monster's, and have the equipped monster gain 500 ATK until the End Phase.
et: Korra ühe korra käigu jooksul saad valida ja eemaldada mängust ühe koletise oma vastase kalmistul, mille tase on väiksem või võrdne varustatud koletise tasemega, ning varustatud koletis saab 500 ATK juurde kuni lõppfaasini.

source: Spiders' Lair
et: Ämblikute Lõks

source: Once per turn, you can select 1 face-up Insect-Type monster you control. While this card remains on the field, any opponent's monster that battles with one of those monsters is changed to Defense Position at the end of the Battle Phase, and cannot change its battle position while this card is on the field.
et: Korra ühe korra käigu jooksul saad valida ühe ülespööratud Putukaliigi koletise, mida sa kontrollid. Kuni see kaart jääb väljakule, muutub iga vastase koletis, mis võitleb ühega neist koletistest, Lahingu Faasi lõpus Kaitsepositsiooniks ja ei saa oma lahingupositsiooni muuta, kuni see kaart on väljakul.

source: Iron Core Specimen Lab
et: Raudse Tuuma Näidislabor

source: During each of your End Phases, destroy this card unless you reveal 1 "<M8207>Iron Core of Koa'ki Meiru<M>" in your hand. Each time a "Koa'ki Meiru" monster on the field is destroyed during the End Phase, its owner can add 1 "Koa'ki Meiru" monster from their deck to their hand.
et: Iga lõppfaasi ajal hävita see kaart, kui sa ei näita oma käes ühte "<M8207>Koa'ki Meiru Raudtuuma<M>". Iga kord, kui "Koa'ki Meiru" koletis väljakul hävitatakse lõppfaasi ajal, võib selle omanik lisada oma pakist ühe "Koa'ki Meiru" koletise oma kätte.

source: Gravekeeper's Stele
et: Hauakaevurite Stele

source: Select 2 "Gravekeeper's" monsters in your Graveyard and add them to your hand. This effect cannot be negated by the effect of "<M5533>Necrovalley<M>".
et: Vali oma kalmistult 2 "Hauavalvuri" koletist ja lisa need oma kätte. Seda efekti ei saa "<M5533>Necrovalley<M>" efekti abil tühistada.

source: Machine Assembly Line
et: Masinate Montaažiliin

source: All face-up Machine-Type monsters on the field gain 200 ATK. Each time a Machine-Type monster(s) on the field is destroyed, place 2 Junk Counters on this card. You can send this card to the Graveyard to select and Special Summon 1 Machine-Type monster from your Graveyard, whose Level is less than or equal to the number of Junk Counters on this card.
et: Kõik näoga ülespoole olevad Masinatüüpi koletised väljakul saavad 200 ATK juurde. Iga kord, kui väljakul hävitatakse Masinatüüpi koletis(ed), pane sellele kaardile 2 Rämpsuloendurit. Sa saad saata selle kaardi Hauakambrisse, et valida ja Eriliselt Kutsuda 1 Masinatüüpi koletis oma Hauakambrist, mille tase on väiksem või võrdne sellel kaardil olevate Rämpsuloendurite arvuga.

source: Ritual of Destruction
et: Hävitamise rituaal

source: This card is used to Ritual Summon "<M8650>Garlandolf, King of Destruction<M>". You must also Tribute monsters whose total Levels equal 7 or more from the field or your hand. During your Main Phase, you can remove from play this card from your Graveyard. If you do, during this turn, any monster destroyed by battle with a Ritual Monster you control will be returned to the top of the Deck instead of being sent to the Graveyard.
et: Seda kaarti kasutatakse rituaalsummonimiseks "<M8650>Garlandolf, King of Destruction<M>". Sa pead ka ohverdama koletisi, kelle kogutasemed on 7 või rohkem, kas väljakult või oma käest. Oma peafaasis saad selle kaardi oma hauakambrist mängust eemaldada. Kui sa seda teed, siis sellel käigul tagastatakse iga koletis, mille rituaalkoletis, mida sa kontrollid, lahingus hävitab, paki tippu, selle asemel et saata hauakambrisse.

source: Ascending Soul
et: Tõusev Hing

source: Once per turn, when a Ritual Monster is Ritual Summoned, you can select and add to your hand 1 monster in your Graveyard that was Tributed for the Ritual Summon.
et: Kord ühe korra käigu jooksul, kui Rituaalikoletis on rituaalsummonitud, saad valida ja lisada oma kätte 1 koletise oma Hauakambrist, mis ohverdati rituaalsummoni jaoks.

source: Ritual Cage
et: Rituaalne Puuri

source: You take no Battle Damage from battles involving a face-up Ritual Monster you control. Also, face-up Ritual Monsters you control cannot be targeted or destroyed by the effects of Effect Monsters.
et: Sa ei saa lahingukahju lahingutest, mis hõlmavad sinu kontrollitavat avatud Rituaalikoletist. Samuti ei saa sinu kontrollitavaid avatud Rituaalikoletisi sihtida ega hävitada Efektikoletiste efektide poolt.

source: Pot of Benevolence
et: Heatahtlikkuse Pott

source: Select 2 cards from the Graveyard(s), and shuffle them into their owner's Deck(s). After activation, remove this card from play instead of sending it to the Graveyard. You can only activate 1 "<M8672>Pot of Benevolence<M>" per turn.
et: Vali 2 kaarti Hauakambrist ja sega need nende omaniku pakki tagasi. Pärast aktiveerimist eemalda see kaart mängust, selle asemel et saata see Hauakambrisse. Sa saad aktiveerida ainult 1 "<M8672>Heatahtlikkuse Pott<M>" kord käigu kohta.

source: Synchro Control
et: Sünkrooni Kontroll

source: Activate only if you have no Synchro Monsters on your side of the field or in your Graveyard. Pay 1000 Life Points and select 1 face-up Synchro Monster your opponent controls. Take control of the selected monster until the End Phase of your turn.
et: Aktiveeri ainult siis, kui sul pole oma väljakul ega hauas Sünkro Koletisi. Maksa 1000 Elupunkti ja vali 1 vastase kontrollitav avatud Sünkro Koletis. Võta valitud koletise üle kontroll kuni oma käigu lõppfaasini.

source: Changing Destiny
et: Muudetud saatus

source: Activate only when an opponent's monster declares an attack. Negate the attack and change it to Defense Position. It cannot change its battle position while it is face-up on the field. Then, your opponent selects and applies 1 of these effects:<BR>● Gain Life Points equal to half the ATK of the monster whose attack was negated.<BR>● Inflict damage to your opponent equal to half the ATK of the monster whose attack was negated.
et: Aktiveeri ainult siis, kui vastase koletis kuulutab välja rünnaku. Tühista rünnak ja muuda see kaitsepositsiooniks. See ei saa muuta oma lahingupositsiooni, kui see on väljakul näoga ülespoole. Seejärel valib ja rakendab sinu vastane ühe nendest efektidest:<BR>● Saa Elupunkte, mis on võrdne poolega koletise ATK-st, kelle rünnak tühistati.<BR>● Tekita oma vastasele kahju, mis on võrdne poolega koletise ATK-st, kelle rünnak tühistati.

source: Fiendish Chain
et: Kuradikett

source: Select 1 face-up Effect Monster on the field. Its effect(s) is negated and it cannot attack. If it is destroyed, destroy this card.
et: Vali 1 avatud Efektikoletis väljal. Selle efekt(id) on tühistatud ja see ei saa rünnata. Kui see hävitatakse, hävita see kaart.

source: Nature's Reflection
et: Looduse Peegeldus

source: During this turn, any effect activated by your opponent that would inflict damage becomes an effect that inflicts damage to their Life Points.
et: Selle käigu jooksul muutub iga sinu vastase aktiveeritud efekt, mis tekitaks kahju, efektiks, mis tekitab kahju nende Elupunktidele.

source: Serpent Suppression
et: Maosurve

source: Face-up Attack Position monsters your opponent controls with 0 ATK cannot be destroyed by battle by "Reptilianne" monsters.
et: Ründepositsioonis avatud vastase koletisi, millel on 0 ATK, ei saa "Reptilianne" koletised lahingus hävitada.

source: Meteor Flare
et: Meteooripuhang

source: Activate by sending 2 cards from your hand to the Graveyard while your opponent has more than 3000 Life Points. Inflict 2000 damage to your opponent. If this card is in the Graveyard, you can add it to your hand instead of conducting your normal draw during your Draw Phase.
et: Aktiveeri, saates 2 kaarti oma käest Hauakambrisse, kui sinu vastasel on rohkem kui 3000 Elupunkti. Tekita vastasele 2000 kahju. Kui see kaart on Hauakambris, võid selle lisada oma kätte tavalise tõmbamise asemel oma Tõmbamisfaasis.

source: Offering to the Immortals
et: Ohverdamine Surematutele

source: Activate only when your opponent's monster declares a direct attack while you have 3000 or less Life Points. Negate the attack and Special Summon 2 "<M3965>Ceremonial Token<M>"s (Rock-Type/EARTH/Level 1/ATK 0/DEF 0) and add 1 "Earthbound Immortal" card, "<M8600>Earthbound Revival<M>" or "<M8506>Roar of the Earthbound<M>" from your Deck to your hand. "<M3965>Ceremonial Token<M>"s cannot be Tributed, except for a Tribute Summon of an "Earthbound Immortal" monster and cannot be used as Synchro Material monsters.
et: Aktiveeri ainult siis, kui sinu vastase koletis kuulutab välja otsese rünnaku, kui sul on 3000 või vähem Elupunkte. Tühista rünnak ja Kutsu Eriliselt välja 2 "<M3965>Ceremonial Token<M>"i (Kiviliik/MAA/Tase 1/RÜN 0/KAI 0) ja lisa 1 "Earthbound Immortal" kaart, "<M8600>Earthbound Revival<M>" või "<M8506>Roar of the Earthbound<M>" oma Pakist oma kätte. "<M3965>Ceremonial Token<M>"e ei saa ohverdada, välja arvatud "Earthbound Immortal" koletise Ohverdussummoniks ja neid ei saa kasutada Sünkromaterjalide koletistena.

source: Destruct Potion
et: Hävitusjook

source: Select 1 monster you control. Destroy it, and gain Life Points equal to its ATK.
et: Vali 1 koletis, mida sa kontrollid. Hävita see ja saa Elupunkte, mis on võrdsed selle RÜN-iga.

source: Call of the Reaper
et: Surma kutse

source: Activate only when a monster(s) is Special Summoned from your Graveyard. Select and Special Summon 1 "Supay" or 1 "<M8631>Fire Ant Ascator<M>" from your Graveyard.
et: Aktiveeri ainult siis, kui sinu kalmistult kutsutakse eriliselt välja koletis(ed). Vali ja kutsu eriliselt välja 1 "Supay" või 1 "<M8631>Fire Ant Ascator<M>" oma kalmistult.

source: Lair Wire
et: Pesalõks

source: Remove from play 1 Insect-Type monster from your Graveyard and select 1 monster your opponent controls and destroy the selected monster.
et: Eemalda oma kalmistult mängust 1 putukaliiki koletis ja vali 1 koletis, mida sinu vastane kontrollib, ning hävita valitud koletis.

source: Core Blast
et: Tuuma Plahvatus

source: You can only activate this card's effect while you control a face-up "Koa'ki Meiru" monster. Once per turn, during your Standby Phase, if your opponent controls more monsters than you do, you can destroy a number of cards your opponent controls so that your opponent will control the same number of cards as you control monsters.
et: Seda kaardi efekti saad aktiveerida ainult siis, kui kontrollid avatud "Koa'ki Meiru" koletist. Kord käigu jooksul, oma Ootefaasil, kui sinu vastasel on rohkem koletisi kui sinul, saad hävitada vastase kontrollitavaid kaarte nii, et vastane kontrolliks sama palju kaarte kui sina kontrollid koletisi.

source: Saber Hole
et: Mõõga Auk

source: Activate only while you control a face-up "X-Saber" monster. Negate the Summon of a monster and destroy it.
et: Aktiveeri ainult siis, kui sa kontrollid avatud "X-Saber" koletist. Tühista koletise kutsumine ja hävita see.

source: Machine King - 3000 B.C.
et: Masinakuningas - 3000 eKr.

source: After activation, Special Summon this card; it is treated as an Effect Monster Card (Machine-Type/EARTH/Level 4/ATK 1000/DEF 1000). You cannot Normal or Special Summon another monster the turn you activate this card. Once per turn, you can Tribute 1 Machine-Type monster to have this card gain ATK equal to the Tributed monster's ATK, until the End Phase. (This card is still treated as a Trap Card.)
et: Pärast aktiveerimist, Kutsu see kaart erilisele väljakutsele; seda käsitletakse kui Efektikoletise Kaarti (Masina-Tüüp/MAA/Tase 4/RÜN 1000/KAIT 1000). Sa ei saa sellel käigul, mil sa selle kaardi aktiveerid, normaal- või eriliselt kutsuda teist koletist. Kord käigu jooksul, võid ohverdada 1 Masina-Tüüpi koletise, et see kaart saaks RÜN-i, mis on võrdne ohverdatud koletise RÜN-iga, kuni Käigu Lõpuni. (Seda kaarti käsitletakse endiselt kui Lõksukaarti.)

source: Alien Brain
et: Tulnukaju Aju

source: Activate only when a Reptile-Type monster you control is destroyed by battle with an opponent's attacking monster and sent to the Graveyard. Take control of the attacking monster, and treat it as a Reptile-Type monster.
et: Aktiveeri ainult siis, kui sinu kontrollitav Reptiil-tüüpi koletis hävitatakse lahingus vastase ründava koletisega ja saadetakse Hauakambrisse. Võta ründava koletise üle kontroll ja käsitle seda kui Reptiil-tüüpi koletist.

source: Forgotten Temple of the Deep
et: Unustatud Sügaviku Tempel

source: While this card is on the field, this card's name is treated as "<M4340>Umi<M>". Once per turn, you can select and remove from play 1 face-up Level 4 or lower Fish-Type, Sea Serpent-Type or Aqua-Type monster you control. (This effect can be activated during either player's turn.) Special Summon it during your End Phase.
et: Kui see kaart on väljakul, käsitletakse selle kaardi nime kui "<M4340>Umi<M>". Kord ühe käigu jooksul saad valida ja mängust eemaldada ühe ülespoole suunatud 4. või madalama taseme Kala-tüüpi, Meremadu-tüüpi või Vee-tüüpi koletise, mida sa kontrollid. (Seda efekti saab aktiveerida mõlema mängija käigu ajal.) Kutsu see eriliselt välja oma lõppfaasis.

source: Tuner's Scheme
et: Häälestaja skeem

source: Activate only when a Synchro Monster is Special Summoned to your opponent's side of the field. Take control of that Synchro Monster. Remove it from play when it is destroyed. Destroy this card when that monster is removed from the field.
et: Aktiveeri ainult siis, kui Sünkrokoletis kutsutakse eriliselt välja sinu vastase väljale. Võta selle Sünkrokoletise üle kontroll. Eemalda see mängust, kui see hävitatakse. Hävita see kaart, kui see koletis eemaldatakse väljast.

source: Psi-Curse
et: Psi-needus

source: Activate only when a face-up Psychic-Type monster you control is destroyed by battle with an opponent's attacking monster and sent to the Graveyard. Destroy the attacking monster, and inflict damage to your opponent equal to the Level of your destroyed Psychic-Type monster x 300.
et: Aktiveeri ainult siis, kui sinu kontrollitav avatud Psüühika-tüüpi koletis hävitatakse lahingus vastase ründava koletisega ja saadetakse Hauakambrisse. Hävita ründav koletis ja tekita vastasele kahju, mis on võrdne sinu hävitatud Psüühika-tüüpi koletise tasemega x 300.

source: Widespread Dud
et: Laialdane Pahandus

source: Select 2 face-up Attack Position monsters on the field. When any of the selected monsters are removed from the field, destroy this card. When this card is destroyed, destroy the selected monster(s).
et: Vali 2 avatud ründeasendis olevat koletist väljakul. Kui mõni valitud koletistest eemaldatakse väljakult, hävita see kaart. Kui see kaart hävitatakse, hävita valitud koletis(ed).

source: Inverse Universe
et: Pööratud Universum

source: Switch the ATK and DEF of all face-up Effect Monsters on the field.
et: Vaheta kõigi lahinguväljal olevate avatud Efektikoletiste ATK ja DEF väärtused.

source: Machina Fortress
et: Machina Kindlus

source: You can discard Machine-Type monster(s) whose total Levels equal 8 or more to Special Summon this card from your hand or Graveyard. When this card is destroyed by battle and sent to the Graveyard, select and destroy 1 card your opponent controls. When this face-up card you control is targeted by an opponent's Effect Monster's effect, look at your opponent's hand and discard 1 card from their hand.
et: Saad masinatüüpi koletisi, mille kogutasemed on 8 või rohkem, et eriliselt kutsuda see kaart oma käest või hauast. Kui see kaart hävitatakse lahingus ja saadetakse hauale, vali ja hävita 1 kaart, mida sinu vastane kontrollib. Kui see ülespoole suunatud kaart, mida sa kontrollid, on sihitud vastase Efektikoletise efekti poolt, vaata oma vastase kätte ja viska 1 kaart nende käest ära.

source: Machina Gearframe
et: Machina Raam

source: When this card is Normal Summoned, you can add 1 "Machina" monster, except "<M8693>Machina Gearframe<M>", from your Deck to your hand. Once per turn, during your Main Phase, you can equip this card to a Machine-Type monster you control as an Equip Card, OR unequip it to Special Summon this card in face-up Attack Position. (A monster can only be equipped with 11 Union Monster at a time. If the equipped monster would be destroyed, destroy this card instead.)
et: Kui see kaart on Normaal-Kutsutud, saad lisada 1 "Machina" koletise, välja arvatud "<M8693>Machina Gearframe<M>", oma pakist oma kätte. Kord kord käigu jooksul, oma Põhifaasis, saad selle kaardi varustada Masina-tüüpi koletisele, mida sa kontrollid, kui Varustuskaart, VÕI varustuse eemaldada, et Kutsuda see kaart Eri-Kutsumisega näoga ülespoole Rünnakupositsioonis. (Koletis saab olla varustatud ainult 1 Liidu Koletisega korraga. Kui varustatud koletis hävitatakse, hävita selle asemel see kaart.)

source: Machina Peacekeeper
et: Machina Rahuvalvur

source: When this card on the field is destroyed and sent to the Graveyard, you can add 11 Union Monster from your Deck to your hand. Once per turn, during your Main Phase, you can equip this card to a Machine-Type monster you control as an Equip Card, OR unequip it to Special Summon this card in face-up Attack Position. (A monster can only be equipped with 11 Union Monster at a time. If the equipped monster would be destroyed, destroy this card instead.)
et: Kui see kaart väljal hävitatakse ja saadetakse Hauakambrisse, saad lisada 11 Liidu Koletise oma pakist oma kätte. Kord käigu jooksul, oma peafaasis, saad selle kaardi kinnitada oma kontrollitavale Masinatüüpi koletisele Varustuskaardina VÕI eemaldada selle kinnituse, et Kutsuda see kaart eriliselt esile rünnakupositsioonis. (Koletis saab korraga olla varustatud ainult 11 Liidu Koletisega. Kui varustatud koletis hävitatakse, hävita selle asemel see kaart.)

source: Scrap Recycler
et: Vanametalli Ringlussevõtja

source: When this card is Normal or Special Summoned, you can select and send 1 Machine-Type monster from your Deck to the Graveyard. Once per turn, you can return 2 Level 4 Machine-Type EARTH monsters from your Graveyard to the Deck to draw 1 card.
et: Kui see kaart on Normaal- või Erikutsutud, saad valida ja saata 1 Masinatüüpi koletise oma pakist Hauakambrisse. Kord käigu jooksul saad saata 2 4. taseme Masinatüüpi MAA koletist oma Hauakambrist tagasi pakki, et tõmmata 1 kaart.

source: Machina Armored Unit
et: Masina Soomustatud Üksus
