Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: When this card inflicts Battle Damage to your opponent, send the top card of their Deck to the Graveyard. When this card is sent from the field to the Graveyard, add 1 Zombie-Type monster with 1200 or less DEF from your Deck to your hand.
et: Kui see kaart tekitab lahingukahju sinu vastasele, saada nende teki pealmine kaart hauakambrisse. Kui see kaart saadetakse väljakult hauakambrisse, lisa oma tekist oma kätte 1 zombitüüpi koletis, mille DEF on 1200 või vähem.

source: If the only cards your opponent controls are face-up monsters with 1600 or more ATK, this monster can attack your opponent directly.
et: Kui ainsad kaardid, mida sinu vastane kontrollib, on avatud koletised, millel on 1600 või rohkem ATK, võib see koletis rünnata sinu vastast otse.

source: Remove 2 WATER monsters in your Graveyard from play to Special Summon 1 "<M3910>Lekunga Token<M>" (Plant-Type/WATER/Level 2/ATK 700/DEF 700) in Attack Position on your side of the field.
et: Eemalda oma kalmistult mängust 2 VEE koletist, et Kutsuda Eriliselt välja 1 "<M3910>Lekunga Token<M>" (Taim-Tüüp/VEE/Tase 2/ATK 700/DEF 700) Rünnakupositsioonis oma väljaku poolele.

source: Cloning
et: Kloonimine

source: Activate only when your opponent Normal Summons or Flip Summons a monster. Special Summon 1 "<M3911>Clone Token<M>", with the same original Level, Type, Attribute, ATK, and DEF as the Summoned monster. When that monster is destroyed and sent to the Graveyard, destroy this Token.
et: Aktiveeri ainult siis, kui su vastane kutsub koletise Normaal- või Pöördkutsumisega. Kutsu eriliselt välja 1 "<M3911>Kloonimärk<M>", millel on sama algne Tase, Tüüp, Atribuut, RÜN ja KAIT kui kutsutud koletisel. Kui see koletis hävitatakse ja saadetakse Hauakambrisse, hävita see Märk.

source: Cost Down
et: Kulude vähendamine

source: Discard 1 card from your hand. Reduce all Monster Cards in your hand by 2 Levels until the End Phase of the turn this card is activated.
et: Viska 1 kaart oma käest. Vähenda kõigi oma käes olevate Koletiskaartide taset 2 võrra kuni selle käigu lõppfaasini, mil see kaart aktiveeritakse.

source: People Running About
et: Ringijooksjad

source: Although they always suffer in silence, they swear an oath to inevitably revolt.
et: Kuigi nad kannatavad alati vaikselt, vannuvad nad vältimatult mässu tõusma.

source: Oppressed People
et: Rõhutatud Inimesed

source: They are oppressed, but believe they will have their freedom someday.
et: Nad on rõhutud, kuid usuvad, et saavad kunagi oma vabaduse.

source: United Resistance
et: Ühendatud Vastupanu

source: The people that gather to swear to fight their oppressors. A revolution is coming.
et: Inimesed, kes kogunevad, et vanduda võidelda oma rõhujate vastu. Revolutsioon on tulekul.

source: Dark Blade
et: Tume Tera

source: They say he is a dragon-manipulating warrior from the dark world. His attack is tremendous, using his great swords with vicious power.
et: Nad öeldakse, et ta on pimedast maailmast pärit draakonitega manipuleeriv sõdalane. Tema rünnak on tohutu, kasutades oma suuri mõõku metsiku jõuga.

source: Pitch-Dark Dragon
et: Süsimust Draakon

source: Once per turn, during your Main Phase, if you control this card on the field, you can equip it to your "<M5581>Dark Blade<M>" as an Equip Spell Card, OR unequip the Union equipment and Special Summon this card in face-up Attack Position. While equipped to a monster by this card's effect, increase the ATK/DEF of the equipped monster by 400 points. When it attacks with an ATK that is higher than the DEF of a Defense Position monster, inflict the difference as Battle Damage to your oponent's Life Points. (1 monster]can only be equipped with 11 Union Monster at a time. If the equipped monster is destroyed as a result of battle, destroy this card instead.)
et: Kord üks kord oma peafaaside ajal, kui sa kontrollid seda kaarti väljakul, võid selle varustada oma "<M5581>Dark Blade<M>"-le kui Varustuse Loitsukaart, VÕI eemaldada Uniooni varustuse ja Kutsuda see kaart eriliselt esile rünnakupositsioonis. Kui see kaart on varustatud koletisele selle kaardi efekti tõttu, suurenda varustatud koletise ATK/DEF-i 400 punkti võrra. Kui see ründab ATK-ga, mis on kõrgem kui kaitsepositsioonis oleva koletise DEF, põhjusta erinevus lahingukahjuna oma vastase Elupunktidele. (1 koletis] saab korraga varustatud olla ainult 1 Uniooni Koletisega. Kui varustatud koletis hävitatakse lahingu tulemusena, hävita selle asemel see kaart.)

source: Once per turn, during your Main Phase, if you control this card on the field, you can equip it to your "<M5581>Dark Blade<M>" as an Equip Spell Card, OR unequip the Union equipment and Special Summon this card in face-up Attack Position. While equipped to a monster by this card's effect, increase the ATK/DEF of the equipped monster by 900 points, and you can Tribute this card to allow the equipped monster to attack your opponent's Life Points directly this turn. (1 monster can only be equipped with 11 Union Monster at a time. If the monster that this card is equipped to is destroyed as a result of battle, destroy this card instead.)
et: Kord üks kord oma peafaaside ajal, kui sa kontrollid seda kaarti väljakul, saad selle varustada oma "<M5581>Dark Blade<M>"-le kui Varustuse Loitsukaart, VÕI eemaldada Uniooni varustuse ja Kutsuda see kaart eriliselt esile rünnakupositsioonis. Kui see kaart on varustatud koletisele selle kaardi efekti tõttu, suurenda varustatud koletise ATK/DEF-i 900 punkti võrra, ja sa saad ohverdada selle kaardi, et lubada varustatud koletisel rünnata vastase Elupunkte otse sellel käigul. (1 koletis saab korraga olla varustatud ainult 1 Uniooni Koletisega. Kui koletis, millele see kaart on varustatud, hävitatakse lahingu tulemusena, hävita selle asemel see kaart.)

source: Decayed Commander
et: Lagunenud Komandör

source: When this card is Normal Summoned successfully, you can Special Summon 1 "<M5585>Zombie Tiger<M>" from your hand. If this card successfully attacks your opponent's Life Points directly, your opponent discards 1 card randomly from his/her hand.
et: Kui see kaart on edukalt Normaal-Kutsutud, võid oma käest Eriliselt Kutsuda 1 "<M5585>Zombie Tiger<M>". Kui see kaart ründab edukalt sinu vastase Elupunkte otse, viskab sinu vastane juhuslikult 1 kaardi oma käest ära.

source: Zombie Tiger
et: Zombitiiger

source: Once per turn, during your Main Phase, if you control this card on the field, you can equip it to your "<M5584>Decayed Commander<M>" as an Equip Spell Card, OR unequip the Union equipment and Special Summon this card in face-up Attack Position. While equipped to a monster by this card's effect, increase the ATK/DEF of the equipped monster by 500 points, and each time it destroys 1 of your opponent's monsters, your opponent discards 1 card randomly from his/her hand. (1 monster can only be equipped with 11 Union Monster at a time. If the equipped monster is destroyed as a result of battle, destroy this card instead.)
et: Kord ühe korra oma peafaasil, kui sa kontrollid seda kaarti väljakul, saad selle varustada oma "<M5584>Lagunenud Komandör<M>" külge kui Varustusloitsu Kaart, VÕI eemaldada Uniooni varustuse ja Kutsuda see kaart eriliselt välja rünnakupositsioonis. Kui see kaart on varustatud koletisele selle kaardi efekti tõttu, suurenda varustatud koletise ATK/DEF 500 punkti võrra ja iga kord, kui see hävitab ühe sinu vastase koletise, viskab sinu vastane juhuslikult ühe kaardi oma käest ära. (1 koletis saab korraga varustatud olla ainult 1 Uniooni Koletisega. Kui varustatud koletis hävitatakse lahingu tulemusena, hävita selle asemel see kaart.)

source: Giant Orc
et: Hiiglane Ork

source: If this card attacks, it is changed to Defense Position at the end of the Battle Phase. You cannot change this battle position until the end of your next turn.
et: Kui see kaart ründab, muudetakse see Lahingufaasi lõpus Kaitsepositsiooniks. Sa ei saa seda lahingupositsiooni muuta enne oma järgmise käigu lõppu.

source: Second Goblin
et: Teine Goblin

source: Once per turn, during your Main Phase, if you control this card on the field, you can equip it to your "<M5586>Giant Orc<M>" as an Equip Spell Card, OR unequip the Union equipment and Special Summon this card in face-up Attack Position. When equipped to a monster by this card's effect, you can change the equipped monster's battle position once per turn. (1 monster can only be equipped with 11 Union Monster at a time. If the equipped monster is destroyed as a result of battle, destroy this card instead.)
et: Korra ühe korra oma peafaasil, kui sa kontrollid seda kaarti väljal, saad selle varustada oma "<M5586>Giant Orc<M>"-le kui Varustusloitsu Kaart, VÕI eemaldada Uniooni varustuse ja Kutsuda see kaart eriliselt esile rünnakupositsioonis. Kui see kaart on varustatud koletisele selle kaardi efekti abil, saad muuta varustatud koletise lahingupositsiooni ühe korra käigu jooksul. (1 koletis saab korraga varustatud olla ainult 1 Uniooni Koletisega. Kui varustatud koletis hävitatakse lahingu tulemusena, hävita selle asemel see kaart.)

source: Vampire Orchis
et: Vampiir-Orhidee

source: When this monster is Normal Summoned successfully, you can Special Summon 1 "<M5589>Des Dendle<M>" from your hand.
et: Kui see koletis on edukalt normaal-summonitud, saad oma käest spetsiaalselt summonida 1 "<M5589>Des Dendle<M>".

source: Once per turn, during your Main Phase, if you control this monster on the field, you can equip it to your "<M5588>Vampire Orchis<M>" as an Equip Spell Card OR unequip the1 Union equipment and Special Summon this card in face-up Attack Position. While equipped to a monster by this card's effect, each time the equipped monster destroys 1 of your opponent's monsters, Special Summon 1 "<M3912>Wicked Plant Token<M>" (Plant-Type/EARTH/1 Star/ATK 800/DEF 800) to your side of the field. (1 monster can only be equipped with 11 Union Monster at a time. If the equipped monster is destroyed as a result of battle, destroy this card instead.)
et: Kord päevas, oma peafaasi ajal, kui sa kontrollid seda koletist väljakul, saad selle varustada oma "<M5588>Vampire Orchis<M>"-le kui Varustuse Loitsukaart VÕI eemaldada Ühenduse varustuse ja Kutsuda see kaart eriliselt välja näoga ülespoole Rünnakupositsioonis. Kui see kaart on varustatud koletisele selle kaardi efekti tõttu, siis iga kord, kui varustatud koletis hävitab ühe sinu vastase koletise, Kutsu eriliselt välja 1 "<M3912>Wicked Plant Token<M>" (Taim-Tüüp/MAA/1 Täht/ATK 800/DEF 800) oma väljaku poolele. (1 koletis saab korraga olla varustatud ainult 1 Ühenduse Koletisega. Kui varustatud koletis hävitatakse lahingu tulemusena, hävita selle asemel see kaart.)

source: Burning Beast
et: Põlev Koletis

source: Once per turn, during your Main Phase, if you control this monster on the field, you can equip it to your "<M5591>Freezing Beast<M>" as an Equip Spell Card OR unequip the1 Union equipment and Special Summon this card in face-up Attack Position. While equipped to a monster by this card's effect, each time the equipped monster inflicts Battle Damage to your opponent, destroy 1 face-up Spell or Trap Card on the field. (1 monster can only be equipped with 11 Union Monster at a time. If the equipped monster is destroyed as a result of battle, destroy this card instead.)
et: Kord päevas, oma peafaasi ajal, kui sa kontrollid seda koletist väljal, saad selle kinnitada oma "<M5591>Freezing Beast<M>" külge kui Varustuse Loitsukaart VÕI eemaldada Üksuse varustuse ja Kutsuda see kaart erilisesse rünnakupositsiooni. Kui see kaart on kinnitatud koletise külge selle kaardi efekti tõttu, hävita iga kord, kui kinnitatud koletis tekitab lahingukahju sinu vastasele, 1 avatud loitsu- või lõksukaart väljal. (1 koletis saab korraga olla varustatud ainult 1 Üksuse Koletisega. Kui kinnitatud koletis hävitatakse lahingu tulemusena, hävita selle asemel see kaart.)

source: Freezing Beast
et: Külmavärinade Metsaline

source: Once per turn, during your Main Phase, if you control this monster on the field, you can equip it to your "<M5590>Burning Beast<M>" as an Equip Spell Card OR unequip the1 Union equipment and Special Summon this card in face-up Attack Position. While equipped to a monster by this card's effect, each time the equipped monster inflicts Battle Damage to your opponent, destroy 1 face-down Spell or Trap Card on the field. (1 monster can only be equipped with 11 Union Monster at a time. If the equipped monster is destroyed as a result of battle, destroy this card instead.)
et: Kord üks kord käigu jooksul, oma peafaasis, kui sa kontrollid seda koletist väljakul, saad selle varustada oma "<M5590>Põlev Koletis<M>"-le kui Varustuse Loitsukaart VÕI eemaldada Ühenduse varustus ja Kutsuda see kaart eriliselt esile rünnakupositsioonis. Kui see kaart on varustatud koletisele selle kaardi efekti abil, hävita iga kord, kui varustatud koletis tekitab lahingukahju sinu vastasele, 1 peidetud Loitsu- või Lõksukaart väljakul. (1 koletist saab korraga varustada ainult 1 Ühenduse Koletisega. Kui varustatud koletis hävitatakse lahingu tulemusena, hävita selle asemel see kaart.)

source: Union Rider
et: Liidu Ratsanik

source: You can take control of up to 11 Union Monster that is currently a monster on your opponent's side of the field, and equip it to this card. The1 Union Monster that is equipped to this card cannot be changed back to a monster using its own effect.
et: Sa saad võtta kontrolli kuni 11 Liidu Koletise üle, mis on praegu sinu vastase väljaku poolel koletisena, ja kinnitada see sellele kaardile. Liidu Koletist, mis on sellele kaardile kinnitatud, ei saa oma efekti abil tagasi koletiseks muuta.

source: D.D. Crazy Beast
et: D.D. Hullumeelne Metsaline

source: A monster that this card destroys as a result of battle is banished.
et: Koletis, mille see kaart lahingu tulemusena hävitab, pagendatakse.

source: Spell Canceller
et: Loitsutühistaja

source: As long as this card remains face-up on the field, all Spell Cards cannot be activated. The effects of all face-up Spell Cards are also negated.
et: Niikaua kui see kaart jääb väljale avatud olekusse, ei saa ühtegi Võlukaarti aktiveerida. Kõigi avatud Võlukaartide efektid on samuti tühistatud.

source: Neko Mane King
et: Neko Mane Kuningas

source: During your opponent's turn, when this card is sent to the Graveyard by the effect of your opponent's Spell, Trap or Monster Card, your opponent's turn ends.
et: Kui see kaart saadetakse sinu vastase käigu ajal sinu vastase Loitsu, Lõksu või Koletise Kaardi efekti tõttu Hauakambrisse, lõpeb sinu vastase käik.

source: Helping Robo for Combat
et: Abistav Robo lahinguks

source: Each time this monster destroys your opponent's monsters as a result of battle, draw 1 card, then select and return 1 card from your hand to the bottom of your Deck.
et: Iga kord, kui see koletis hävitab lahingu tulemusena sinu vastase koletisi, tõmba 1 kaart, seejärel vali ja pane 1 kaart oma käest oma paki põhja.

source: Dimension Jar
et: Dimensioonipurk

source: FLIP: Both players can remove from play up to 3 monsters from their opponent's Graveyard.
et: FLIP: Mõlemad mängijad võivad eemaldada kuni 3 koletist oma vastase kalmistult mängust.

source: Great Phantom Thief
et: Suur Fantoomvaras

source: Each time this card inflicts Battle Damage to your opponent's Life Points, declare the name of 1 card. Then see your opponent's hand and discard all copies of the declared card in his/her hand to the Graveyard.
et: Iga kord, kui see kaart tekitab lahingukahju sinu vastase elupunktidele, kuuluta välja 1 kaardi nimi. Seejärel vaata oma vastase kätt ja viska kõik tema käes olevad nimetatud kaardi koopiad hauakambrisse.

source: Roulette Barrel
et: Rouletti Tünn

source: Once per turn, during your Main Phase, you can roll a six-sided die twice. Select one result and destroy 1 face-up monster on the field whose Level is equal to the result.
et: Kord ühe korra oma peafaasis võid sa veeretada kuuepoolset täringut kaks korda. Vali üks tulemus ja hävita 1 avatud koletis väljal, mille tase on võrdne tulemusega.

source: Paladin of White Dragon
et: Valge Draakoni Paladiin

source: This card can only be Ritual Summoned with the Ritual Spell Card, "<M5601>White Dragon Ritual<M>". If this card attacks a face-down Defense Position monster, destroy the monster immediately with this card's effect without flipping it face-up or applying damage calculation. You can Tribute this card to Special Summon 1 "<M4007>Blue-Eyes White Dragon<M>" from your hand or your Deck. ("<M4007>Blue-Eyes White Dragon<M>" cannot attack during that turn.)
et: Seda kaarti saab Rituaali Kutsuda ainult Rituaali Loitsukaardiga, "<M5601>Valge Draakoni Rituaal<M>". Kui see kaart ründab tagurpidi Kaitseasendis olevat koletist, hävita koletis kohe selle kaardi efektiga ilma seda püstiasendisse pööramata või kahjustuse arvutamist rakendamata. Sa saad ohverdada selle kaardi, et Eriliselt Kutsuda 1 "<M4007>Sinisilmne Valge Draakon<M>" oma käest või oma Pakist. ("<M4007>Sinisilmne Valge Draakon<M>" ei saa sellel käigul rünnata.)

source: White Dragon Ritual
et: Valge Draakoni Rituaal

source: This card is used to Ritual Summon "<M5600>Paladin of White Dragon<M>". You must also Tribute monsters whose total Levels equal 4 or more from the field or your hand.
et: Seda kaarti kasutatakse "<M5600>Valge Draakoni Paladiin<M>" rituaalsummonimiseks. Sa pead ka ohverdama koletisi, kelle kogutasemed on 4 või rohkem, kas väljakult või oma käest.

source: Frontline Base
et: Esiüksuse baas

source: Once per turn, during your Main Phase, you can Special Summon 1 Level 4 or lower1 Union Monster from your hand.
et: Korra ühe korra oma peafaasil võid sa eriliselt kutsuda 1 taseme 4 või madalama 1 Liidu Koletise oma käest.

source: Demotion
et: Alandamine

source: Downgrade the monster equipped with this card by 2 Levels.
et: Alanda selle kaardiga varustatud koletise taset 2 võrra.

source: Combination Attack
et: Kombinatsioonirünnak

source: During a Battle Phase, you can use this effect on 1 monster that has attacked this turn and is equipped with a1 Union Monster. Change the1 Union Monster back to a monster in face-up Attack or Defense Position. Also, the monster that was equipped with the1 Union Monster may attack again this turn.
et: Lahingu faasis saad kasutada seda efekti 1 koletise peal, kes on sel käigul rünnanud ja kellel on varustatud 1 Liidu Koletis. Muuda 1 Liidu Koletis tagasi koletiseks avatud Rünnaku või Kaitse asendis. Samuti võib koletis, kellel oli varustatud 1 Liidu Koletis, sel käigul uuesti rünnata.

source: Kaiser Colosseum
et: Kaiseri Kolosseum

source: If there is 1 or more monster(s) on the field of the controller of this card, his/her opponent cannot place a monster on the field if his/her number of monsters would exceed the number of monsters that are on the field of this card's controller. The cards that are already on the field before this card's activation are unaffected by this effect.
et: Kui selle kaardi kontrollija väljal on 1 või rohkem koletist, ei saa tema vastane asetada koletist väljakule, kui tema koletiste arv ületaks selle kaardi kontrollija väljal olevate koletiste arvu. Kaardid, mis on väljal enne selle kaardi aktiveerimist, ei ole selle efekti poolt mõjutatud.

source: Autonomous Action Unit
et: Autonoomne Tegevusüksus

source: Pay 1500 Life Points. Select 1 Monster Card from your opponent's Graveyard. Special Summon it on your side of the field in face-up Attack Position, and equip it with this card. When this card is destroyed or removed from the field, the equipped monster is destroyed.
et: Makske 1500 Elupunkti. Vali 1 Koletise Kaart oma vastase Hauakambrist. Kutsu see eriliselt välja oma väljaku poolele avatud Rünnakupositsioonis ja varusta see selle kaardiga. Kui see kaart hävitatakse või eemaldatakse väljalt, hävitatakse varustatud koletis.

source: Poison of the Old Man
et: Vana mehe mürk

source: Activate 1 of these effects;<BR>● Gain 1200 Life Points. <BR>● Inflict 800 damage to your opponent.
et: Aktiveeri 1 neist efektidest;<BR>● Saa 1200 Elupunkti. <BR>● Tekita oma vastasele 800 kahju.

source: Each Player selects 1 card from his/her hand, then looks at the Level of the selected cards. The card with more Levels returns to the hand of the player who selected it. The player who selected the card with fewer Levels takes 1000 Life Points damage and sends the card to the Graveyard. If a non-Monster Card is selected, it is treated as Level 0. If they are the same Level, each player returns his/her card to his/her hand.
et: Iga mängija valib ühe kaardi oma käest, seejärel vaatab valitud kaartide taset. Kaart, millel on rohkem tasemeid, naaseb selle mängija kätte, kes selle valis. Mängija, kes valis kaardi, millel on vähem tasemeid, kaotab 1000 Elupunkti ja saadab kaardi Hauakambrisse. Kui valitakse mitte-koletis kaart, käsitletakse seda kui taseme 0 kaarti. Kui need on sama tasemega, tagastab iga mängija oma kaardi oma kätte.

source: Dark Core
et: Tume Tuum

source: Discard 1 card. Banish 1 face-up monster.
et: Viska 1 kaart. Eemalda mängust 1 avatud koletis.

source: Raregold Armor
et: Haruldane Raudrüü

source: As long as you control the monster equipped with this card, your opponent cannot attack other monsters other than the equipped monster.
et: Niikaua kui sa kontrollid selle kaardiga varustatud koletist, ei saa sinu vastane rünnata teisi koletisi peale varustatud koletise.

source: Metalsilver Armor
et: Metallhõbe Rüü

source: As long as you control the monster equipped with this card, your opponent cannot use the effect of a Spell, Trap or Monster Card that targets 1 monster, except the equipped monster.
et: Niikaua kui sa kontrollid selle kaardiga varustatud koletist, ei saa sinu vastane kasutada ühegi loitsu, lõksu või koletise kaardi efekti, mis sihib ühte koletist, välja arvatud varustatud koletist.

source: Kishido Spirit
et: Kishido Vaim

source: Monsters on your side of the field cannot be destroyed in a battle if the monsters' ATK are equal.
et: Koletisi sinu väljaku poolel ei saa lahingus hävitatud, kui koletiste ATK on võrdsed.

source: Tribute Doll
et: Ohverdusnukk

source: Tribute 1 monster on your side of the field to activate this card. Special Summon 1 Level 7 monster that can be Normal Summoned from your hand. That monster cannot attack this turn.
et: Ohverda 1 koletis oma väljaku poolelt, et aktiveerida see kaart. Kutsu eriliselt välja 1 tase 7 koletis, mida saab tavaliselt kutsuda sinu käest. See koletis ei saa sellel käigul rünnata.

source: Wave-Motion Cannon
et: Laine-liikumise kahur

source: During your Main Phase, you can send this card to the Graveyard to inflict 1000 points of damage to your opponent for each of your Standby Phases that have passed since this card was activated.
et: Oma peafaasis saad saata selle kaardi Hauakambrisse, et tekitada oma vastasele 1000 punkti kahju iga sinu Ootefaasi eest, mis on möödunud alates selle kaardi aktiveerimisest.

source: Huge Revolution
et: Suurejooneline revolutsioon

source: This card can only be activated during your Main Phase when "<M5578>People Running About<M>", "<M5579>Oppressed People<M>", and "<M5580>United Resistance<M>" are face-up on your side of the field. Send all cards in your opponent's hand to the Graveyard and destroy all cards your opponent controls on the field.
et: Seda kaarti saab aktiveerida ainult oma peafaasis, kui "<M5578>Ringijooksjad<M>", "<M5579>Allasurutud inimesed<M>" ja "<M5580>Ühinenud vastupanu<M>" on sinu väljaku poolel avatud. Saada kõik kaardid vastase käest Hauakambrisse ja hävita kõik kaardid, mida vastane väljakul kontrollib.

source: Thunder of Ruler
et: Valitseja äike
