Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: This card can only be equipped to a monster you control. Once per turn, during your Main Phase 1, you can gain Life Points equal to half the ATK of that monster by reducing its ATK to 0 until the End Phase.
et: Seda kaarti saab varustada ainult sinu kontrolli all oleva koletisega. Kord ühe käigu jooksul, oma peafaasi 1 ajal, saad sa elupunkte juurde võrdse koguse selle koletise rünnakupunktide poolega, vähendades selle rünnakupunktid 0-ni kuni lõppfaasini.

source: Central Shield
et: Keskkilp

source: If a monster you control is attacked, except the equipped monster, you take no Battle Damage from that battle.
et: Kui sinu kontrollitavat koletist rünnatakse, välja arvatud varustatud koletis, siis sa ei saa sellest lahingust lahingukahju.

source: Pain to Power
et: Valu jõuks

source: When a monster you control other the equipped monster attacks and you take Battle Damage, the equipped monster gains ATK equal to that damage until the End Phase.
et: Kui sinu kontrollitav koletis peale varustatud koletise ründab ja sa saad lahingukahju, saab varustatud koletis ATK-d, mis on võrdne selle kahjuga kuni lõppfaasini.

source: Altar of the Bound Deity
et: Seotud Jumaluse Altar

source: During each of your Standby Phases, place 1 Earthbound Immortal Counter on this card for each face-up Defense Position monster on the field. If there are 4 or more Earthbound Immortal Counters on this card, you can send it to the Graveyard to Special Summon 1 "Earthbound Immortal" monster from your Deck.
et: Iga oma ootejärgu ajal aseta sellele kaardile 1 Earthbound Immortal Counter iga lahinguväljal oleva avatud kaitseasendis oleva koletise eest. Kui sellel kaardil on 4 või rohkem Earthbound Immortal Counterit, saad selle Hauakambrisse saata, et eriliselt kutsuda 1 "Earthbound Immortal" koletis oma pakist.

source: Assault Dog
et: Ründekoer

source: When this card is destroyed by battle and sent to the Graveyard, you can Special Summon 1 "<M3642>Assault Dog<M>" from your Deck.
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse, saad oma pakist eriliselt kutsuda 1 "<M3642>Rünnakoer<M>".

source: Wiretap
et: Pealtkuulamine

source: Negate the activation of an opponent's Trap Card. Return that card face-up to your opponent's Deck and the Deck is then shuffled. Until they draw that card, your opponent cannot activate the effect of another card with the same name.
et: Vastase lõksukaardi aktiveerimine tühistatakse. Tagasta see kaart vastase paki peale avatud kujul ja seejärel sega pakk. Kuni nad selle kaardi tõmbavad, ei saa vastane aktiveerida teise sama nimega kaardi efekti.

source: Discord Counter
et: Discordi loendur

source: Activate only when your opponent Synchro Summons a monster. Return that monster to the Extra Deck. Then Special Summon all of the monsters that were used for the Synchro Summon from your opponent's Graveyard to their side of the field. Your opponent cannot Summon a monster until the End Phase of their next turn.
et: Aktiveeri ainult siis, kui sinu vastane kutsub Sünkrokoletise. Tagasta see koletis Ekstratekki. Seejärel kutsu eriliselt esile kõik koletised, mida kasutati Sünkrokutsumiseks, sinu vastase Hauakambrist nende väljale. Sinu vastane ei saa kutsuda koletist kuni nende järgmise käigu Lõppfaasini.

source: Terminal Countdown
et: Terminali Lõpparv

source: While this card is face-up on the field, you cannot activate any Spell or Trap Cards. Once during your opponent's End Phase, you can select 1 Spell or Trap Card from your Deck and, after revealing the card, Set it in your Spell & Trap Card Zone. During your Main Phase, send this card and all Spell and Trap Cards Set by its effect from your side of the field to the Graveyard. Then, based on the number of cards sent to the Graveyard, inflict the following amount of damage to your opponent's Life Points:<BR>●2 cards: 500 points<BR>●3 cards: 1500 points<BR>●4 cards: 3000 points<BR>●5 cards: 6000 points
et: Kui see kaart on lahinguväljal avatud, ei saa sa aktiveerida ühtegi Loitsu ega Lõksukaarti. Kord oma vastase lõppfaasis saad valida ühe Loitsu või Lõksukaardi oma pakist ja pärast kaardi näitamist aseta see oma Loitsu ja Lõksukaartide tsooni. Oma peafaasis saada see kaart ja kõik selle efekti abil asetatud Loitsu ja Lõksukaardid oma lahinguvälja poolelt hauakambrisse. Seejärel, sõltuvalt hauakambrisse saadetud kaartide arvust, põhjusta oma vastase elupunktidele järgmist kahju:<BR>●2 kaarti: 500 punkti<BR>●3 kaarti: 1500 punkti<BR>●4 kaarti: 3000 punkti<BR>●5 kaarti: 6000 punkti

source: Dark Tuner Doom Submarine
et: Pimehäälestaja Hukkumise Allveelaev

source: If this card is in your Graveyard and you control no monsters, you can Special Summon it. Each player can only use the effect of "<M3646>Dark Tuner Doom Submarine<M>" once per Duel. This card cannot be used as a Synchro Material Monster, except for the Synchro Summon of a Dark Synchro Monster.
et: Kui see kaart on sinu Hauakambris ja sul pole ühtegi koletist, saad selle Eriliselt Kutsuda. Iga mängija saab kasutada "<M3646>Dark Tuner Doom Submarine<M>" efekti ainult üks kord Duelli jooksul. Seda kaarti ei saa kasutada Sünkro Materjal Koletisena, välja arvatud Pimeduse Sünkro Koletise Sünkro Kutsumiseks.

source: Dark Tuner Dark Goddess Witaka
et: Pimehäälestaja Pimejumalanna Witaka

source: You can pay 1000 Life Points and Special Summon this card (from your hand). When this card is Summoned: You can target 1 face-up monster on the field; this card becomes the target's Level.
et: Sa võid maksta 1000 Elupunkti ja Kutsuda see kaart Eri Kutsumisega (oma käest). Kui see kaart on Kutsutud: Sa võid valida 1 avatud koletise väljal; see kaart saab valitud koletise taseme.

source: Dark Flattop
et: Tume Lamepealne

source: 1 non-Tuner Monster - 1 Dark Tuner Monster<BR>You can only Synchro Summon this card if the Level of the non-Tuner Synchro Material Monster minus the Level of the Dark Tuner monster is equal to -8. Once per turn, you can select 1 Level 8 Machine-Type monster in your Graveyard and Special Summon it, ignoring the Summoning conditions.
et: 1 mittehäälestaja koletis - 1 pimehäälestaja koletis<BR>Seda kaarti saab sünkrokutsuda ainult siis, kui mittehäälestaja sünkromaterjali koletise tase miinus pimehäälestaja koletise tase on võrdne -8-ga. Kord ühe käigu jooksul saad valida 1. taseme 8 masinatüüpi koletise oma hauakambris ja eriliselt kutsuda selle, ignoreerides kutsumise tingimusi.

source: Moon Dragon Quilla
et: Kuu Draakon Quilla

source: 1 non-Tuner Monster - 1 Dark Tuner Monster<BR>You can only Synchro Summon this card if the Level of the non-Tuner Synchro Material Monster minus the Level of the Dark Tuner monster is equal to -6. Destroy this card at the End phase of your turn. When this card is destroyed and sent to the Graveyard, Special Summon 1 "<M8653>Sun Dragon Inti<M>" from your Graveyard.
et: 1 mittehäälestaja koletis - 1 pimehäälestaja koletis<BR>Seda kaarti saab sünkroonvälja kutsuda ainult siis, kui mittehäälestaja sünkroonmaterjali koletise tase miinus pimehäälestaja koletise tase on võrdne -6. Hävita see kaart oma käigu lõppfaasis. Kui see kaart hävitatakse ja saadetakse hauakambrisse, kutsu erivälja 1 "<M8653>Päikeselohe Inti<M>" oma hauakambrist.

source: Cursed Prison
et: Neetud Vangla

source: Special Summon 1 Synchro Monster from your Extra Deck in face-up Defense Position. That monster cannot activate its effect, its effects are negated and it cannot change its battle position. If this card is removed from the field, destroy that monster. If that monster is removed from the field, destroy this card.
et: Erikutsuge oma lisapakist 1 Sünkrokoletis avatud kaitseasendisse. See koletis ei saa oma efekti aktiveerida, selle efektid on tühistatud ja see ei saa oma lahinguasendit muuta. Kui see kaart eemaldatakse väljakult, hävita see koletis. Kui see koletis eemaldatakse väljakult, hävita see kaart.

source: Dark Matter
et: Tumeaine

source: When a DARK Synchro Monster is destroyed: Special Summon 2 "<M3652>Dark Matter Token<M>" (Fiend-Type/DARK/Level 1/ATK 0/DEF 0) in Defense Position. These tokens cannot be destroyed by battle. Destroy the tokens in the End Phase of the next turn.
et: Kui PIMEDUS Sünkrokoletis hävitatakse: Kutsu välja 2 "<M3652>Dark Matter Token<M>" (Deemonitüüp/PIMEDUS/Tase 1/ATK 0/DEF 0) kaitsepositsioonis. Neid märke ei saa lahingus hävitada. Hävita märgid järgmise käigu lõppfaasis.

source: Dark Matter Token
et: Tumeaine žetoon

source: This Token was special summoned by the effect of "<M3651>Dark Matter<M>". This tokens cannot be destroyed by battle. Destroy this token in the End Phase of the next turn.
et: See žetoon kutsuti eriliselt esile "<M3651>Dark Matter<M>" efekti abil. Seda žetooni ei saa lahingus hävitada. Hävita see žetoon järgmise käigu lõppfaasis.

source: Loan Token
et: Laenu Maatriks

source: Summoned with "<M3655>Endless Loan<M>". This Token cannot be Tributed or used as a Synchro Material Monster.
et: Kutsutud koos "<M3655>Endless Loan<M>". Seda Tokenit ei saa ohverdada ega kasutada Sünkro Materjal Koletisena.

source: Toichi the Nefarious Debt Collector
et: Toichi, kurikuulus võlakoguja

source: You can only control 1 face-up "<M3654>Toichi the Nefarious Debt Collector<M>". If there is a "<M3653>Loan Token<M>" on the field, this card cannot be destroyed by battle. Once per turn, you can inflict 1000 damage to your opponent for each "<M3653>Loan Token<M>" they control.
et: Saad kontrollida ainult ühte avatud "<M3654>Toichi the Nefarious Debt Collector<M>". Kui väljakul on "<M3653>Loan Token<M>", ei saa seda kaarti lahingus hävitada. Kord ühe käigu jooksul võid tekitada oma vastasele 1000 kahju iga "<M3653>Loan Token<M>" eest, mida nad kontrollivad.

source: Endless Loan
et: Lõputu Laen

source: When your opponent Normal or Special Summons a monster other than a "<M3653>Loan Token<M>", Special Summon 1 "<M3653>Loan Token<M>" (Rock-Type/LIGHT/Level 1/ATK 0/DEF 0) on your opponent's side of the field in Defense Position. This Token cannot be Tributed or used as a Synchro Material Monster. During your opponent's Main Phase, your opponent can send 1 card from their hand to the Graveyard to select 1 "<M3653>Loan Token<M>" on the field and destroy it.
et: Kui sinu vastane kutsub tavaliselt või eriliselt välja koletise, mis ei ole "<M3653>Laenu Token<M>", kutsu eriliselt välja 1 "<M3653>Laenu Token<M>" (Kiviliik/TULI/Tase 1/ATK 0/DEF 0) sinu vastase väljaku poolele kaitsepositsioonis. Seda Tokenit ei saa ohverdada ega kasutada Sünkro Materjal Koletisena. Sinu vastase peafaasi ajal võib sinu vastane saata 1 kaardi oma käest hauakambrisse, et valida 1 "<M3653>Laenu Token<M>" väljakul ja hävitada see.

source: Powerful Rebirth
et: Võimas taassünd

source: Select and Special Summon 1 Level 4 or lower monster from your Graveyard. That monster's Level is increased by 1, and its effect(s) is negated. When this card leaves the field, destroy that monster. When that monster leaves the field, destroy this card. During each of your Standby Phases, you take 1000 damage.
et: Vali ja Kutsu Eriliselt Välja 1 Tase 4 või madalama tasemega koletis oma Hauakambrist. Selle koletise Tase suureneb 1 võrra ja selle mõju(d) on tühistatud. Kui see kaart lahkub väljakult, hävita see koletis. Kui see koletis lahkub väljakult, hävita see kaart. Iga oma Ootefaaside ajal saad 1000 kahju.

source: Wise Core
et: Tark Südamik

source: Once per turn, if this card would be destroyed by battle, it is not destroyed. When this card is destroyed by a card effect, destroy all monsters you control, then Special Summon 1 each of "<M3660>Machine Emperor Wisel ∞<M>", "<M3661>Wisel Top<M>", "<M3662>Wisel Attack<M>", "<M3663>Wisel Guard<M>", and "<M3664>Wisel Carrier<M>" from your hand, Deck or Graveyard.
et: Korra ühe korra käigu jooksul, kui see kaart peaks lahingus hävima, siis seda ei hävitata. Kui see kaart hävitatakse kaardi efekti tõttu, hävita kõik koletised, mida sa kontrollid, seejärel kutsu eriliselt välja 1 iga "<M3660>Masina Keiser Wisel ∞<M>", "<M3661>Wisel Top<M>", "<M3662>Wisel Attack<M>", "<M3663>Wisel Guard<M>" ja "<M3664>Wisel Carrier<M>" oma käest, pakist või hauast.

source: Sky Core
et: Taevatuum

source: Once per turn, if this card would be destroyed by battle, it is not destroyed. When this card is destroyed by a card effect, destroy all monsters you control, then Special Summon 1 each of "<M3665>Machine Emperor Skiel ∞<M>", "<M3666>Skiel Top<M>", "<M3667>Skiel Attack<M>", "<M3668>Skiel Guard<M>", and "<M3669>Skiel Carrier<M>" from your hand, Deck or Graveyard.
et: Korra ühe korra käigu jooksul, kui see kaart hävitatakse lahingus, siis seda ei hävitata. Kui see kaart hävitatakse kaardi efekti tõttu, hävita kõik koletised, mida sa kontrollid, seejärel kutsu eriliselt välja 1 iga "<M3665>Masina Keiser Skiel ∞<M>", "<M3666>Skiel Ülemine<M>", "<M3667>Skiel Rünnak<M>", "<M3668>Skiel Kaitsja<M>" ja "<M3669>Skiel Kandja<M>" oma käest, pakist või hauast.

source: Once per turn, if this card would be destroyed by battle, it is not destroyed. When this card is destroyed by a card effect, destroy all monsters you control and Special Summon 1 "<M3670>Machine Emperor Granel ∞<M>", "<M3671>Grannel Top<M>", "<M3672>Grannel Attack<M>", "<M3673>Grannel Guard<M>", and "<M3674>Grannel Carrier<M>" from your hand, Deck or Graveyard.
et: Korra ühe korra käigu jooksul, kui see kaart peaks lahingus hävima, siis seda ei hävitata. Kui see kaart hävitatakse kaardi efekti tõttu, hävita kõik koletised, mida sa kontrollid, ja Kutsu Eriliselt 1 "<M3670>Masina Keiser Granel ∞<M>", "<M3671>Granneli Ülemine<M>", "<M3672>Granneli Rünnak<M>", "<M3673>Granneli Kaitsja<M>" ja "<M3674>Granneli Kandja<M>" oma käest, pakist või hauast.

source: Machine Emperor Wisel ∞
et: Masinaimperaator Wisel ∞

source: This card gains ATK and DEF equal to the total ATK of all other face-up "Wisel", "Granel", and "Skiel" monsters you control. This card cannot be targeted by the effects of your opponent's cards. Once per turn, you can only equip 1 face-up Synchro Monster your opponent controls at a time to this card as an Equip Card. This card gains ATK equal to the equipped card's ATK. You can only control 1 face-up "∞" monster.
et: See kaart saab ATK ja DEF võrdseks kõigi teiste avatud "Wisel", "Granel" ja "Skiel" koletiste kogusummaga, mida sa kontrollid. Seda kaarti ei saa sihtida sinu vastase kaartide efektidega. Kord käigu jooksul saad sa varustada selle kaardiga ainult ühe avatud Sünkro Koletise, mida sinu vastane kontrollib, kui Varustuskaart. See kaart saab ATK võrdseks varustatud kaardi ATK-ga. Sa saad kontrollida ainult ühte avatud "∞" koletist.

source: If you do not control a face-up "Machine Emperor" monster, destroy this card.
et: Kui sa ei kontrolli avatud "Masina Keisri" koletist, hävita see kaart.

source: Wisel Attack
et: Wiseli rünnak

source: If you do not control a face-up "Machine Emperor" monster, destroy this card. When another monster you control is selected as an attack target, you can switch the target to this card instead.
et: Kui sul ei ole kontrolli all avatud "Masina Keisri" koletist, hävita see kaart. Kui teine koletis, mida sa kontrollid, valitakse rünnaku sihtmärgiks, saad sihtmärgi selle kaardi peale ümber suunata.

source: Destroy this card if you do not control a "Machine Emperor" monster. This card cannot be destroyed by your opponent's card effects.
et: Hävita see kaart, kui sa ei kontrolli "Masina Keisri" koletist. Seda kaarti ei saa hävitada sinu vastase kaardi efektidega.

source: Machine Emperor Skiel ∞
et: Masinaimperaator Skiel ∞

source: This card gains ATK and DEF equal to the total ATK of all other face-up "Wisel", "Grannel", and "Skiel" monsters you control. This card cannot be targeted by the effects of your opponent's cards. Once per turn, you can only equip 1 face-up Synchro Monster your opponent controls at a time to this card as an Equip Card. This card gains ATK equal to the equipped card's ATK. You can only control 1 face-up "∞" monster.
et: See kaart saab ATK ja DEF võrdseks kõigi teiste avatud "Wisel", "Grannel" ja "Skiel" koletiste kogutud ATK-ga, mida sa kontrollid. Seda kaarti ei saa sihtida sinu vastase kaartide efektidega. Kord käigu jooksul saad sa varustada selle kaardiga ainult ühe avatud Sünkro Koletise, mida sinu vastane kontrollib, kui Varustuskaart. See kaart saab ATK võrdseks varustatud kaardi ATK-ga. Sa saad kontrollida ainult ühte avatud "∞" koletist.

source: Skiel Top
et: Skieli Ülemine Osa

source: Skiel Attack
et: Skieli rünnak

source: Skiel Guard
et: Skieli Kaitsja

source: f you do not control a face-up "Machine Emperor" monster, destroy this card. Once per turn, when a monster you control is selected as an attack target, you can negate the attack.
et: Kui sa ei kontrolli avatud "Masina Keisri" koletist, hävita see kaart. Kord ühe käigu jooksul, kui sinu koletis valitakse rünnaku sihtmärgiks, saad rünnaku tühistada.

source: Skiel Carrier
et: Skieli Kandja

source: Machine Emperor Granel ∞
et: Masinaimperaator Granel ∞

source: If this card was Special Summoned by the effect of "<M3659>Grand Core<M>", this card gains ATK and DEF equal to half of your Life Points. This card cannot be targeted by the effects of your opponent's cards. Once per turn, you can only equip 1 face-up Synchro Monster your opponent controls at a time to this card as an Equip Card. This card gains ATK equal to the equipped card's ATK. You can only control 1 face-up "∞" monster.
et: Kui see kaart kutsuti eriliselt välja "<M3659>Grand Core<M>" efekti abil, saab see kaart ATK ja DEF, mis on võrdsed poolega sinu Elupunktidest. Seda kaarti ei saa sihtida sinu vastase kaartide efektidega. Kord käigu jooksul saad varustada selle kaardiga ainult ühe vastase kontrollitava avatud Sünkroonkoletise kui Varustuskaardi. See kaart saab ATK, mis on võrdne varustatud kaardi ATK-ga. Sa saad kontrollida ainult ühte avatud "∞" koletist.

source: Grannel Top
et: Granneli Ülemine

source: If there is no face-up "Machine Emperor" monster on the field, destroy this card. Once per turn, select 1 face-up monster your opponent controls and its effect(s) is negated until the End Phase.
et: Kui väljal ei ole ühtegi avatud "Masina Keisri" koletist, hävita see kaart. Kord ühe käigu jooksul vali 1 avatud koletis, mida sinu vastane kontrollib, ja selle mõju(d) tühistatakse kuni Lõppfaasini.

source: Grannel Attack
et: Granneli rünnak

source: If there is no face-up "Machine Emperor" monster on the field, destroy this card. If "Machine Emperor" monster you control attacks a Defense Position monster, it can attack once again in a row.
et: Kui väljakul ei ole ühtegi avatud "Masina Keisri" koletist, hävita see kaart. Kui sinu kontrollitav "Masina Keisri" koletis ründab Kaitseasendis koletist, võib see rünnata veel kord järjest.

source: Grannel Guard
et: Granneli Kaitsja

source: If there is no face-up "Machine Emperor" monster on the field, destroy this card. When a monster you control is selected as an attack target, you can change the attack target to this card instead.
et: Kui väljal ei ole ühtegi avatud "Masina Keisri" koletist, hävita see kaart. Kui sinu kontrollitav koletis valitakse rünnaku sihtmärgiks, saad rünnaku sihtmärgi muuta selle kaardi peale.

source: Grannel Carrier
et: Granneli Kandja

source: If you do not control a face-up "Machine Emperor" monster, destroy this card. Once per turn, if a monster you control would be destroyed by battle, it is not destroyed.
et: Kui sul ei ole kontrolli all avatud "Masina Keisri" koletist, hävita see kaart. Kord käigu jooksul, kui koletis, mida sa kontrollid, hävitatakse lahingus, siis seda ei hävitata.

source: You can Special Summon this card from your hand by Tributing 1 "<M3661>Wisel Top<M>" you control. If there is no face-up "Machine Emperor" monster on the field, destroy this card. Once per turn, you can negate the activation of an opponent's Spell or Trap Card and destroy it.
et: Saad selle kaardi oma käest eriliselt välja kutsuda, ohverdades 1 "<M3661>Wisel Top<M>", mida sa kontrollid. Kui väljal ei ole ühtegi avatud "Machine Emperor" koletist, hävita see kaart. Kord käigu jooksul saad tühistada vastase Loitsu- või Lõksukaardi aktiveerimise ja hävitada selle.

source: Wisel Attack 3
et: Wisel Rünnak 3

source: You can Tribute 1 "<M3662>Wisel Attack<M>" to Special Summon this card from your hand. If you do not control a face-up "Machine Emperor" monster, destroy this card. During battle between an attacking "Machine Emperor" monster you control and a Defense Position monster whose DEF is lower than the ATK of the attacking monster, inflict piercing damage to your opponent.
et: Saad 1 "<M3662>Wisel Attack<M>", et eriliselt kutsuda see kaart oma käest. Kui sul ei ole lahinguväljal ülespoole suunatud "Masina Keisri" koletist, hävita see kaart. Kui sinu kontrolli all olev ründav "Masina Keisri" koletis võitleb kaitseasendis koletisega, mille DEF on madalam kui ründava koletise ATK, põhjusta vastasele läbistavat kahju.

source: You can Special Summon this card from your hand by Tributing 1 "<M3663>Wisel Guard<M>" you control. If there is no face-up "Machine Emperor" monster on the field, destroy this card. When a monster you control is selected as an attack target, you can change the target to this card instead. Once per turn, this card cannot be destroyed by battle
et: Saad selle kaardi oma käest eriliselt välja kutsuda, ohverdades 1 "<M3663>Wisel Guard<M>", mida sa kontrollid. Kui väljal ei ole ühtegi avatud "Machine Emperor" koletist, hävita see kaart. Kui sinu kontrollitav koletis valitakse rünnaku sihtmärgiks, saad sihtmärgi muuta selleks kaardiks. Kord käigu jooksul ei saa seda kaarti lahingus hävitada

source: Skiel Attack 3
et: Skieli rünnak 3

source: Skiel Carrier 3
et: Skieli kandur 3

source: You can Special Summon this card from your hand by Tributing 1 "<M3669>Skiel Carrier<M>" you control. If there is no face-up "Machine Emperor" monster on the field, destroy this card. Once per turn, when a monster you control is selected as an attack target, you can negate the attack.
et: Saad selle kaardi oma käest eriliselt välja kutsuda, ohverdades 1 "<M3669>Skiel Carrier<M>", mida sa kontrollid. Kui väljakul ei ole ühtegi avatud "Machine Emperor" koletist, hävita see kaart. Kord ühe käigu jooksul, kui sinu kontrollitav koletis valitakse rünnaku sihtmärgiks, saad rünnaku tühistada.

source: Skiel Attack 5
et: Skieli rünnak 5

source: This card cannot be Normal Summoned or Set. This card can only be Special Summoned by Tributing 1 "<M3680>Skiel Attack 5<M>" you control. If there is no face-up "Machine Emperor" monster on the field, destroy this card. All monsters you control can attack your opponent directly.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti saab eriliselt kutsuda ainult ohverdades 1 "<M3680>Skiel Attack 5<M>", mida sa kontrollid. Kui väljakul ei ole ühtegi avatud "Machine Emperor" koletist, hävita see kaart. Kõik koletised, mida sa kontrollid, võivad rünnata otse sinu vastast.

source: Skiel Carrier 5
et: Skieli kandur 5
