Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: This card cannot be Special Summoned. Negate the effects of Effect Monsters destroyed by battle with this card. If this card destroys an opponent's monster by battle, it can attack once again in a row.
et: Seda kaarti ei saa eriliselt kutsuda. Tühista selle kaardiga lahingus hävitatud Efektikoletiste efektid. Kui see kaart hävitab lahingus vastase koletise, võib see rünnata veel kord järjest.

source: Worm Xex
et: Uss Xex

source: When this card is Normal Summoned, you can send 1 Reptile-Type "Worm" monster from your Deck to the Graveyard. If you control a face-up "<M8412>Worm Yagan<M>", this card cannot be destroyed by battle.
et: Kui see kaart on Normaal-Kutsutud, võid saata 1 Reptiili-tüüpi "Worm" koletise oma pakist Hauakambrisse. Kui sa kontrollid avatud "<M8412>Worm Yagan<M>", ei saa seda kaarti lahingus hävitada.

source: Worm Yagan
et: Uss Yagan

source: If the only monster you control is "<M8411>Worm Xex<M>", you can Special Summon this card from your Graveyard in face-down Defense Position. If you do, remove it from play when it is removed from the field. When this card is flipped face-up, select 1 face-up monster your opponent controls, and return it to it's owner's hand.
et: Kui ainus koletis, mida sa kontrollid, on "<M8411>Worm Xex<M>", saad selle kaardi oma Hauakambrist eriliselt kutsuda näoga allapoole Kaitseasendisse. Kui sa seda teed, eemalda see mängust, kui see väljakult eemaldatakse. Kui see kaart pööratakse näoga ülespoole, vali 1 näoga ülespoole koletis, mida su vastane kontrollib, ja tagasta see omaniku kätte.

source: Worm Zero
et: Uss Null

source: 2 or more Reptile-Type "Worm" monsters.<BR>For each Fusion Material Monster with a different name used to Fusion Summon this card, it gains 500 ATK, and also gains these effects:<BR>● 2+: Once per turn, you can select 1 Reptile-Type monster in your Graveyard, and Special Summon it in face-down Defense Position.<BR>● 4+: You can remove from play 1 Reptile-Type monster from your Graveyard to send 1 monster on the field to the Graveyard.<BR>● 6+: Once per turn, you can draw 1 card.
et: 2 või rohkem Reptiil-tüüpi "Worm" koletist.<BR>Iga erineva nimega Fusion Material Monsteri eest, mida kasutatakse selle kaardi Fusion Summonimiseks, saab see 500 ATK-d ja lisaks need efektid:<BR>● 2+: Kord ühe käigu jooksul saad valida 1 Reptiil-tüüpi koletise oma Hauas ja Special Summonida selle näoga allapoole Kaitsepositsioonis.<BR>● 4+: Sa saad eemaldada mängust 1 Reptiil-tüüpi koletise oma Hauast, et saata 1 koletis väljakul Hauale.<BR>● 6+: Kord ühe käigu jooksul saad tõmmata 1 kaardi.

source: Dragunity Knight - Gae Bulg
et: Dragunity Rüütel - Gae Bulg

source: 1 Dragon-Type Tuner + 1 or more non-Tuner Winged Beast-Type monsters<BR>If this card attacks or is attacked, during the Damage Step you can banish 1 (only) Winged Beast-Type monster from your Graveyard, to have this card gain the ATK of that monster until the End Phase.
et: 1 Draakoni-tüüpi Tuner + 1 või rohkem mitte-Tuner Tiivulise Olendi-tüüpi koletist<BR>Kui see kaart ründab või teda rünnatakse, võid Kahjustuse Sammuni ajal oma Hauakambrist pagendada 1 (ainult) Tiivulise Olendi-tüüpi koletise, et see kaart saaks selle koletise ATK End Faasini.

source: Fabled Ragin
et: Muinasjutt Ragin

source: 1 "Fabled" Tuner Monster + 1 or more non-Tuner Monsters<BR>When this card is Synchro Summoned, if you have 1 or less cards in your hand, you can draw until you have 2 cards in your hand.
et: 1 "Fabled" Tuner-koletis + 1 või rohkem mitte-Tuner-koletist<BR>Kui see kaart on Sünkrosummonitud ja sul on käes 1 või vähem kaarte, võid tõmmata kaarte, kuni sul on käes 2 kaarti.

source: 1 "Genex" Tuner + 1 or more non-Tuner WIND monsters<BR>Your opponent cannot select this card as an attack target. If this card destroys an opponent's monster by battle, you can add 1 "Genex" monster from your Deck to your hand.
et: 1 "Genex" Tuner + 1 või rohkem mitte-Tuner TUULE koletisi<BR>Sinu vastane ei saa valida seda kaarti rünnaku sihtmärgiks. Kui see kaart hävitab lahingus vastase koletise, saad lisada 1 "Genex" koletise oma pakist oma kätte.

source: Ally of Justice Decisive Armor
et: Õigluse Liitlane Otsustav Rüü

source: 1 Tuner + 2 or more non-Tuner monsters.<BR>Once per turn, if your opponent controls a face-up LIGHT monster(s), you can activate 1 of these effects:<BR>● Select 1 Set card your opponent controls and destroy it.<BR>● Send 1 card from your hand to the Graveyard to destroy all Spell/Trap Cards your opponent controls.<BR>● Send all cards in your hand to the Graveyard to look at your opponent's hand and send all LIGHT monsters in their hand to the Graveyard. Then, inflict damage to your opponent equal to the total ATK of the opponent's monsters sent to the Graveyard.
et: 1 Tuner + 2 või rohkem mitte-Tuner koletist.<BR>Korra käigu jooksul, kui sinu vastane kontrollib avatud LIGHT koletist(e), saad aktiveerida ühe neist efektidest:<BR>● Vali 1 seatud kaart, mida sinu vastane kontrollib, ja hävita see.<BR>● Saada 1 kaart oma käest Hauakambrisse, et hävitada kõik Võlu/Trap kaardid, mida sinu vastane kontrollib.<BR>● Saada kõik kaardid oma käest Hauakambrisse, et vaadata oma vastase kätt ja saata kõik LIGHT koletised nende käest Hauakambrisse. Seejärel tekita oma vastasele kahju, mis on võrdne vastase Hauakambrisse saadetud koletiste kogurünnakuga.

source: Lancer Lindwurm
et: Lanssõdalane Lindwurm

source: Golem Dragon
et: Golemi Draakon

source: Your opponent cannot target face-up Dragon-Type monsters for attacks, expect this one.
et: Sinu vastane ei saa valida rünnakuteks näoga ülespoole olevaid Draakoni-tüüpi koletisi, välja arvatud seda.

source: Cyber Larva
et: Küberlarv

source: If this face-up card is targeted for an attack: You take no Battle Damage for the rest of this turn. When this card is destroyed by battle and sent to the Graveyard: You can Special Summon 1 "<M8421>Cyber Larva<M>" from your Deck.
et: Kui see avatud kaart on rünnaku sihtmärk: Sa ei saa selle käigu jooksul lahingukahju. Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse: Sa võid eriliselt kutsuda 1 "<M8421>Cyber Larva<M>" oma pakist.

source: Dragonic Tactics
et: Draakoni Taktika

source: Tribute 2 Dragon-Type monsters; Special Summon 1 Level 8 Dragon-Type monster from your Deck.
et: Lohverda 2 Draakoni-tüüpi koletist; Kutsu eriliselt välja 1. taseme 8 Draakoni-tüüpi koletis oma pakist.

source: Dragunity Knight - Gae Dearg
et: Dragunity Rüütel - Gae Dearg

source: 1 Dragon-Type Tuner + 1 or more non-Tuner Winged Beast-Type monsters<BR>Once per turn, during your Main Phase, you can add 1 Level 4 or lower Dragon-Type or Winged Beast-Type monster from your Deck to your hand. Then discard 1 Dragon-Type or Winged Beast-Type monster.
et: 1 Draakoni-tüüpi Tuner + 1 või rohkem mitte-Tuner Tiivulise Olendi-tüüpi koletisi<BR>Kord käigu jooksul, oma Põhifaasis, saad lisada 1 4. taseme või madalama Draakoni-tüüpi või Tiivulise Olendi-tüüpi koletise oma pakist oma kätte. Seejärel viska ära 1 Draakoni-tüüpi või Tiivulise Olendi-tüüpi koletis.

source: Cyber Eltanin
et: Küber Eltanin

source: This card cannot be Normal Summoned or Set. This card cannot be Special Summoned except by removing from play all face-up LIGHT Machine-Type monsters from your side of the field and your Graveyard. This card's ATK and DEF are equal to the number of monsters removed from play for its Special Summon x 500. When this card is Special Summoned, send all other face-up monsters on the field to the Graveyard.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti ei saa eriliselt kutsuda, välja arvatud juhul, kui eemaldate mängust kõik oma väljaku ja haua valgusmasina tüüpi koletised. Selle kaardi ATK ja DEF on võrdne mängust eemaldatud koletiste arvuga, mis on korrutatud 500-ga. Kui see kaart kutsutakse eriliselt, saatke kõik teised väljaku avatud koletised hauale.

source: This card is treated as a Normal Monster while face-up on the field or in the Graveyard. While this card is face-up on the field, you can Normal Summon it to have it be treated as an Effect Monster with this effect:<BR>● When your opponent activates a Spell Card, you can select 1 Gemini Monster from your Graveyard and Special Summon it. Also, you can send 1 face-up Equip Card you control to the Graveyard to negate the activation of a Spell or Trap Card that targets a monster on the field and destroy it.
et: Seda kaarti käsitletakse Tavalise Koletisena, kui see on lahinguväljal või Hauas. Kui see kaart on lahinguväljal, võid selle Tavalisena Kutsuda, et seda käsitletaks Efektikoletisena järgmise efektiga:<BR>● Kui sinu vastane aktiveerib Loitsukaardi, võid valida 1 Gemini Koletise oma Hauast ja Kutsuda selle Eriliselt. Samuti võid saata 1 lahinguväljal oleva Nähtava Varustusekaardi Hauale, et tühistada Loitsu- või Lõksukaardi aktiveerimine, mis sihib lahinguväljal olevat koletist, ja hävitada see.

source: Evocator Chevalier
et: Evokaator Rüütel

source: This card is treated as a Normal Monster while face-up on the field or in the Graveyard. While this card is face-up on the field, you can Normal Summon it to have it be treated as an Effect Monster with this effect:<BR>● You can send 1 face-up Equip Card you control to the Graveyard to destroy 1 card your opponent controls.
et: Seda kaarti käsitletakse Tavalise Koletisena, kui see on lahinguväljal või Hauakambris. Kui see kaart on lahinguväljal, võid selle Normaal-Summonida, et seda käsitletaks Efekt-Koletisena järgmise efektiga:<BR>● Sa võid saata ühe ülespoole suunatud Varustuskaardi, mida sa kontrollid, Hauakambrisse, et hävitada üks kaart, mida su vastane kontrollib.

source: Featherizer
et: Sulestaja

source: When this card is destroyed by battle and sent to the Graveyard, you can send 1 Gemini Monster from your Deck to the Graveyard and draw 1 card.
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse, võid saata 1 Gemini Koletis oma pakist Hauakambrisse ja tõmmata 1 kaardi.

source: Gemini Soldier
et: Kaksikute Sõdur

source: This card is treated as a Normal Monster while face-up on the field or in the Graveyard. While this card is face-up on the field, you can Normal Summon it again to have it be treated as an Effect Monster with this effect.<BR>● Once per turn, if this card would be destroyed by battle, it is not destroyed. If this card battles, after Damage calculation, you can Special Summon 1 Level 4 or lower Gemini Monster from your Deck, except "<M8434>Gemini Soldier<M>".
et: Seda kaarti käsitletakse Tavalise Koletisena, kui see on lahinguväljal või Hauakambris. Kui see kaart on lahinguväljal, võid selle uuesti Tavalisena Kutsuda, et seda käsitletaks Efektikoletisena järgmise efektiga.<BR>● Kord käigu jooksul, kui see kaart hävitatakse lahingus, siis seda ei hävitata. Kui see kaart võitleb, siis pärast Kahju arvutamist võid Eriliselt Kutsuda ühe 4. taseme või madalama Kaksikkoletise oma Pakkist, välja arvatud "<M8434>Gemini Soldier<M>".

source: Supervise
et: Järelevalve

source: Equip only to a Gemini Monster. It is treated as an Effect Monster, and gains its effect(s). When this face-up card on the field is sent to the Graveyard, select and Special Summon 1 Normal Monster from your Graveyard.
et: Varusta ainult Gemini koletisega. Seda käsitletakse kui Efektkoletist ja see saab oma efekti(d). Kui see avatud kaart väljakul saadetakse Hauakambrisse, vali ja Kutsu Eriliselt välja 1 Tavaline Koletis oma Hauakambrist.

source: Savior Dragon
et: Päästja Draakon

source: This card cannot be used as a Synchro Material Monster, except for the Synchro Summon of a "Majestic" monster.
et: Seda kaarti ei saa kasutada Sünkromaterjalina, välja arvatud "Majestic" koletise Sünkrokutsumiseks.

source: Stardust Xiaolong
et: Tähetolmu Xiaolong

source: When you Synchro Summon1 "<M7734>Stardust Dragon<M>", you can Special Summon this card from your Graveyard in face-up Attack Position. Once per turn, if this card would be destroyed by battle, it is not destroyed.
et: Kui sa Sünkro Kutsud1 "<M7734>Tähetolmu Draakon<M>", saad selle kaardi oma Hauakambrist eriliselt kutsuda näoga ülespoole Rünnakupositsioonis. Kord käigu jooksul, kui see kaart peaks lahingus hävima, siis seda ei hävitata.

source: Max Warrior
et: Max Sõdalane

source: If this card attacks an opponent's monster, this card gains 400 ATK during the Damage Step only. If this card destroys an opponent's monster by battle, until your next Standby Phase, this card becomes Level 2 and its original ATK and DEF are halved.
et: Kui see kaart ründab vastase koletist, saab see kaart ainult Kahjuastme ajal 400 ATK juurde. Kui see kaart hävitab lahingus vastase koletise, muutub see kaart kuni sinu järgmise Ootefaasini 2. tasemeks ja selle algne ATK ja DEF vähenevad poole võrra.

source: Quickdraw Synchron
et: Kiirviske Sünkron

source: You can send 1 monster from your hand to the Graveyard and Special Summon this card (from your hand). For a Synchro Summon, you can substitute this card for any 1 "Synchron" Tuner monster. This card cannot be used as a Synchro Material Monster, except for the Synchro Summon of a monster that lists a "Synchron" monster as a Tuner.
et: Saadad ühe koletise oma käest Hauakambrisse ja Kutsu see kaart (oma käest) Eriliselt välja. Sünkro Kutsumise jaoks võid asendada selle kaardi ükskõik millise "Synchron" Tuner koletisega. Seda kaarti ei saa kasutada Sünkro Materjal Koletisena, välja arvatud Sünkro Kutsumiseks koletisele, mis loetleb "Synchron" koletise Tunerina.

source: Level Eater
et: Tasemesööja

source: If this card is in the Graveyard, you can activate its effect by selecting 1 face-up Level 5 or higher monster you control. Reduce that monster's Level by 1. Special Summon this card from the Graveyard. This card cannot be Tributed except for a Tribute Summon.
et: Kui see kaart on Hauakambris, saad selle efekti aktiveerida, valides 1 avatud 5. või kõrgema taseme koletise, mida sa kontrollid. Vähenda selle koletise taset 1 võrra. Kutsu see kaart Hauakambrist eriliselt välja. Seda kaarti ei saa ohverdada, välja arvatud ohverdussummoni jaoks.

source: Zero Gardna
et: Null Gardna

source: You can tribute this card to activate its effect. If you do, monsters you control cannot be destroyed by battle and you take no Battle Damage, during this turn. This effect can be activated during either player's turn.
et: Saad selle kaardi ohverdada, et aktiveerida selle mõju. Kui teed seda, ei saa sinu kontrollitavad koletised sellel käigul lahingus hävida ja sa ei saa lahingukahju. Seda mõju saab aktiveerida mõlema mängija käigu ajal.

source: Once per turn, you can select 1 Field Spell Card in your Graveyard. Return it to the Deck.
et: Korra ühe korra käigu jooksul saad valida ühe Väljaloitsu Kaardi oma Hauakambris. Tagasta see Paki sisse.

source: Infernity Necromancer
et: Infernity Nekromant

source: When this card is Normal Summoned, it is changed to Defense Position. While you have no cards in your hand, this card gains the following effect: Once per turn, you can Special Summon 1 "Infernity" monster from your Graveyard, except "<M8443>Infernity Necromancer<M>".
et: Kui see kaart on Normaal-Summonitud, muudetakse see Kaitsepositsiooni. Kui sul pole kaarte käes, saab see kaart järgmise efekti: Kord ühe käigu jooksul saad Sa eriliselt kutsuda 1 "Infernity" koletise oma Hauakambrist, välja arvatud "<M8443>Infernity Necromancer<M>".

source: Fortune Lady Wind
et: Õnne Daam Tuul

source: This card's ATK and DEF are equal to its Level x 300. During each of your Standby Phases, increase the Level of this card by 1 (max 12). When this card is Normal Summoned, you can destroy a number of Spell or Trap Cards your opponent controls equal to the number of face-up "Fortune Lady" monsters you control.
et: Selle kaardi ATK ja DEF on võrdne selle tasemega x 300. Iga oma ootejärgu faasi ajal suurenda selle kaardi taset 1 võrra (maksimaalselt 12). Kui see kaart on normaalseti kutsutud, saad hävitada vastase kontrollitavate loitsu- või lõksukaartide arvu, mis on võrdne sinu kontrollitavate avatud "Fortune Lady" koletiste arvuga.

source: Fortune Lady Water
et: Õnnenaise Vesi

source: This card's ATK and DEF are equal to its Level x 300. During each of your Standby Phases, increase the Level of this card by 1 (max 12). When this card is Special Summoned while you control a face-up "Fortune Lady" monster except "<M8445>Fortune Lady Water<M>", draw 2 cards.
et: Selle kaardi ATK ja DEF on võrdne selle tasemega x 300. Iga sinu Standby Phase'i ajal suurenda selle kaardi taset 1 võrra (maksimaalselt 12). Kui see kaart kutsutakse eriliselt välja, kui sa kontrollid avatud "Fortune Lady" koletist, välja arvatud "<M8445>Fortune Lady Water<M>", tõmba 2 kaarti.

source: Fortune Lady Dark
et: Õnne Daam Tume

source: This card's ATK and DEF are equal to its Level x 400. During each of your Standby Phases, increase the Level of this card by 1 (max 12). When a face-up "Fortune Lady" monster you control destroys an opponent's monster by battle and sends it to the Graveyard, you can select and Special Summon 1 "Fortune Lady" monster from your Graveyard.
et: Selle kaardi ATK ja DEF on võrdsed selle tasemega x 400. Iga sinu Standby Phase'i ajal suurenda selle kaardi taset 1 võrra (maksimaalselt 12). Kui sinu kontrollitav avatud "Fortune Lady" koletis hävitab lahingus vastase koletise ja saadab selle Hauakambrisse, saad valida ja eriliselt kutsuda 1 "Fortune Lady" koletise oma Hauakambrist.

source: Fortune Lady Earth
et: Õnne Daam Maa

source: This card's ATK and DEF are equal to its Level x 400. During each of your Standby Phases, increase the Level of this card by 1 (max 12). When the Level of this card increases, inflict 400 damage to your opponent.
et: Selle kaardi ATK ja DEF on võrdne selle tasemega x 400. Iga oma Standby Phase'i ajal suurenda selle kaardi taset 1 võrra (maksimaalselt 12). Kui selle kaardi tase tõuseb, põhjusta oma vastasele 400 kahju.

source: Solitaire Magician
et: Solitaarmaag

source: Once per turn, you can select 1 face-up "Fortune Lady" monster you control and 1 other face-up monster on the field. Reduce the Level of the selected "Fortune Lady" monster by 3, and destroy the other selected monster.
et: Korra ühe korra käigu jooksul saad valida 1 avatud "Fortune Lady" koletise, mida sa kontrollid, ja 1 teise avatud koletise väljakul. Vähenda valitud "Fortune Lady" koletise taset 3 võrra ja hävita teine valitud koletis.

source: Catoblepas and the Witch of Fate
et: Catoblepas ja Saatuse Nõid

source: When your opponent Special Summons a monster(s), you can remove from play 1 monster with ? ATK from your Graveyard to destroy that Special Summoned monster(s).
et: Kui sinu vastane kutsub eriliselt välja koletise(d), saad sa eemaldada mängust ühe koletise, millel on ? ATK sinu Hauakambrist, et hävitada see eriliselt välja kutsutud koletis(ed).

source: Dark Spider
et: Tume Ämblik

source: Once per turn, you can increase the Level of 1 face-up Insect-Type monster you control by 2, until the End Phase.
et: Korra ühe korra käigu jooksul saad suurendada ühe sinu kontrolli all oleva avatud Putukaliigi koletise taset 2 võrra kuni lõppfaasini.

source: Ground Spider
et: Maaspind ämblik

source: Once per turn, if you control this face-up Defense Position monster when your opponent Normal or Special Summons a monster(s), you can change that monster(s) to Defense Position.
et: Kord ühe korra käigu jooksul, kui sa kontrollid seda avatud Kaitseasendis koletist, kui sinu vastane Normaal- või Erikutsumisega kutsub välja koletise(d), saad sa muuta selle koletise(d) Kaitseasendisse.

source: Relinquished Spider
et: Loovutatud Ämblik

source: If you have 4 or more Insect-Type monsters in your Graveyard, you can Tribute this card to destroy all face-up Defense Position monsters your opponent controls.
et: Kui sul on surnuaias 4 või rohkem putukaliiki koletist, võid selle kaardi ohverdada, et hävitada kõik vastase kontrollitavad avatud kaitseasendis koletised.

source: Spyder Spider
et: Spyder Ämblik

source: When this card destroys an opponent's Defense Position monster by battle, you can select and Special Summon 1 Level 4 or lower Insect-Type monster from your Graveyard.
et: Kui see kaart hävitab lahingus vastase kaitseasendis oleva koletise, saad valida ja eriliselt kutsuda 1. taseme või madalama putukaliigi koletise oma hauakambrist.

source: Mother Spider
et: Emaspidur

source: If you have only Insect-Type monsters in your Graveyard, you can send 2 face-up Defense Position monsters your opponent controls to the Graveyard and Special Summon this card from your hand.
et: Kui sul on surnuaias ainult putuk-tüüpi koletised, saad saata 2 vastase kontrolli all olevat avatud kaitseasendis koletist surnuaeda ja kutsuda see kaart oma käest eriliselt välja.

source: If this card attacks an opponent's monster, after damage calculation the ATK of the attack target becomes 0, and it cannot change its battle position.
et: Kui see kaart ründab vastase koletist, muutub ründesihtmärgi ATK pärast kahjukalkulatsiooni 0-ks ja see ei saa oma lahingupositsiooni muuta.

source: Send 1 card from your hand to the Graveyard and select 1 face-up monster your opponent controls. The ATK of the selected monster becomes 0, and it cannot change its battle position.
et: Saada 1 kaart oma käest Hauakambrisse ja vali 1 avatud koletis, mida sinu vastane kontrollib. Valitud koletise ATK muutub 0-ks ja see ei saa oma lahingupositsiooni muuta.

source: If this card destroys a monster with 0 ATK by battle, you can Special Summon that monster from the Graveyard to your side of the field in face-up Defense Position. The effect(s) of that monster is negated.
et: Kui see kaart hävitab lahingus koletise, mille ATK on 0, saad selle koletise Hauakambrist oma väljaku poolele eriliselt kutsuda näoga ülespoole kaitseasendisse. Selle koletise efekt(id) on tühistatud.

source: When this card is Normal Summoned, you can select and take control of 1 face-up monster with 0 ATK your opponent controls.
et: Kui see kaart on normaalvälja kutsutud, saad valida ja võtta kontrolli alla ühe vastase kontrollitava avatud koletise, mille rünnakupunktid on 0.

source: Earthbound Immortal Ccarayhua
et: Maa-alune surematu Ccarayhua

source: There can only be 1 face-up "Earthbound Immortal" monster on the field. If there is no face-up Field Spell Card on the field, destroy this card. Your opponent cannot select this card as an attack target. This card can attack your opponent directly. When this card is destroyed by a card effect, except by its own effect, destroy all cards on the field.
et: Väljal võib olla ainult 1 avatud "Earthbound Immortal" koletis. Kui väljal ei ole avatud Väliloitsu Kaarti, hävita see kaart. Sinu vastane ei saa valida seda kaarti rünnaku sihtmärgiks. See kaart võib rünnata sinu vastast otse. Kui see kaart hävitatakse kaardi efekti tõttu, välja arvatud oma efekti tõttu, hävita kõik kaardid väljal.

source: Earthbound Immortal Uru
et: Maa-alune Surematu Uru

source: There can only be 1 face-up "Earthbound Immortal" monster on the field. If there is no face-up Field Spell Card on the field, destroy this card. Your opponent cannot select this card as an attack target. This card can attack your opponent directly. Once per turn, you can Tribute 1 monster, except this card, to select and take control of 1 face-up monster your opponent controls, until the End Phase.
et: Väljal saab olla ainult 1 avatud "Earthbound Immortal" koletis. Kui väljal ei ole avatud Väliloitsu Kaarti, hävita see kaart. Sinu vastane ei saa valida seda kaarti rünnaku sihtmärgiks. See kaart võib rünnata sinu vastast otse. Kord ühe käigu jooksul võid ohverdada 1 koletise, välja arvatud see kaart, et valida ja võtta kontrolli alla 1 avatud koletis, mida sinu vastane kontrollib, kuni lõppfaasini.

source: Earthbound Immortal Wiraqocha Rasca
et: Maa-alune Surematu Wiraqocha Rasca
