Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: V-Tiger Jet
et: V-Tiigri Jet

source: This ace fighter is unbeatable in a dogfight. It combines with other monsters to launch an array of encircling attacks.
et: See äss-võitleja on õhulahingus võitmatu. See ühendub teiste koletistega, et käivitada ümbritsevate rünnakute seeria.

source: Blade Skater
et: Teraskuulutaja

source: An image of beauty on the ice, this gorgeous warrior rips her opponents into pieces with her stylish Accel Slicer attack.
et: Jää ilu kehastus, see kaunis sõdalane rebib oma vastased tükkideks oma stiilse Accel Slicer rünnakuga.

source: Reborn Zombie
et: Ülestõusnud Zombi

source: While you have no cards in your hand and this card is in Attack Position, it cannot be destroyed by battle. (Damage calculation is applied normally.)
et: Kui sul pole kaarte käes ja see kaart on Rünnakupositsioonis, ei saa seda lahingus hävitada. (Kahju arvutamine toimub tavapäraselt.)

source: Chthonian Soldier
et: Chthonian Sõdur

source: When this card is destroyed by your opponent's attacking monster and sent to the Graveyard, inflict the Battle Damage you took from this battle to your opponent's Life Points as well.
et: Kui see kaart hävitatakse sinu vastase ründava koletise poolt ja saadetakse Hauakambrisse, põhjusta oma vastase Elupunktidele sama Lahingukahju, mida sa sellest lahingust said.

source: W-Wing Catapult
et: W-Tiiva Katapult

source: Once per turn, during your Main Phase, if you control this card on the field, you can equip it to your "<M6471>V-Tiger Jet<M>" as an Equip Card, OR unequip the Union equipment and Special Summon this card in face-up Attack Position. While equipped to a monster by this card's effect, increase the ATK and DEF of the equipped monster by 400 points. (1 monster can only be equipped with 11 Union Monster at a time. If the equipped monster is destroyed as a result of battle, destroy this card instead.)
et: Korra ühe korra oma peafaasil, kui sa kontrollid seda kaarti väljakul, saad selle kinnitada oma "<M6471>V-Tiger Jet<M>" külge kui Varustuskaart, VÕI eemaldada Uniooni varustus ja Kutsuda see kaart eriliselt esile rünnakupositsioonis. Kui see kaart on kinnitatud koletise külge selle kaardi efekti tõttu, suurenda kinnitatud koletise ATK ja DEF 400 punkti võrra. (1 koletis saab korraga olla kinnitatud ainult 1 Uniooni koletisega. Kui kinnitatud koletis hävitatakse lahingu tulemusena, hävita selle asemel see kaart.)

source: Infernal Incinerator
et: Põrgulik Põletaja

source: This card can only be Normal Summoned or Set by discarding all cards in your hand to the Graveyard except this card, and by Tributing 1 monster with 2000 or more ATK you control. This card gains 200 ATK for each monster your opponent controls. This card loses 500 ATK for each other monster you control.
et: Seda kaarti saab Normaal-Kutsuda või Paigutada ainult siis, kui sa saadad kõik kaardid oma käest Hauakambrisse, välja arvatud selle kaardi, ja ohverdad 1 koletise, mille ATK on 2000 või rohkem ja mida sa kontrollid. See kaart saab 200 ATK iga koletise eest, mida sinu vastane kontrollib. See kaart kaotab 500 ATK iga teise koletise eest, mida sa kontrollid.

source: Elemental Hero Bladedge
et: Elementaalne Kangelane Teraserv

source: If this card attacks a Defense Position monster, inflict piercing Battle Damage to your opponent.
et: Kui see kaart ründab kaitseasendis koletist, tekitab see vastasele läbistavat lahingukahju.

source: Elemental Hero Wildheart
et: Elementaalne Kangelane Metsasüda

source: This card is unaffected by the effects of Trap Cards.
et: See kaart ei ole lõksukaartide efektidest mõjutatud.

source: Hydrogeddon
et: Hüdrogeddon

source: When this card destroys a monster your oppoent controls by battle and sends it to the Graveyard: You can Special Summon 1 "Hydrogeddon" from your Deck.
et: Kui see kaart hävitab lahingus vastase kontrollitava koletise ja saadab selle Hauakambrisse: Sa võid eriliselt kutsuda 1 "Hydrogeddon" oma pakist.

source: Oxygeddon
et: Oksügeddon

source: When this card is destroyed by battle with a Pyro-Type monster and sent to the Graveyard, inflict 800 damage to both players.
et: Kui see kaart hävitatakse lahingus Pyro-tüüpi koletisega ja saadetakse Hauakambrisse, tekitab see mõlemale mängijale 800 kahju.

source: Water Dragon
et: Vee Draakon

source: This card cannot be Normal Summoned or Set. This card cannot be Special Summoned except by the effect of "<M6492>Bonding - H2O<M>". While this card is face-up on the field, the ATK of FIRE monsters and Pyro-Type monsters become 0. When this card is destroyed and sent to the Graveyard, you can Special Summon 22 "Hydrogeddons" and 1 "Oxygeddon" from your Graveyard.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti ei saa eriliselt kutsuda, välja arvatud "<M6492>Bonding - H2O<M>" efekti abil. Kui see kaart on väljaku peal avatud, muutub TULEKAHJU koletiste ja Püro-tüüpi koletiste ATK 0-ks. Kui see kaart hävitatakse ja saadetakse Hauakambrisse, võid eriliselt kutsuda 22 "Hydrogeddons" ja 1 "Oxygeddon" oma Hauakambrist.

source: If this card attacks your opponent directly, it gains 500 ATK during the Damage Step only.
et: Kui see kaart ründab otse sinu vastast, saab see ainult Kahjustuse Etapi ajal 500 ATK juurde.

source: VW-Tiger Catapult
et: VW-Tiiger Katapult

source: "<M6471>V-Tiger Jet<M>" + "<M6475>W-Wing Catapult<M>"<BR>This card can only be Special Summoned from your Extra Deck by removing from play the above cards on your side of the field. (You do not use "<M4837>Polymerization<M>"). By discarding 1 card from your hand, change the battle position of 1 monster on your opponent's side of the field. (Flip Effects are not activated at this time.)
et: "<M6471>V-Tiigri Jett<M>" + "<M6475>W-Tiiva Katapult<M>"<BR>Seda kaarti saab eriliselt kutsuda oma lisapakist, eemaldades mängust ülaltoodud kaardid oma väljalt. (Sa ei kasuta "<M4837>Polümerisatsioon<M>"). Kaarte oma käest ära visates, muuda ühe vastase väljaku koletise lahinguasendit. (Pöördefektid ei aktiveeru sel ajal.)

source: VWXYZ-Dragon Catapult Cannon
et: VWXYZ-Draakoni Katapuldikahur

source: "<M6483>VW-Tiger Catapult<M>" + "<M5556>XYZ-Dragon Cannon<M>"<BR>This card can only be Special Summoned from your Extra Deck by removing from play the above cards you control (You do not use "<M4837>Polymerization<M>"). Once per turn, remove from play 1 card your opponent controls. When this card attacks, you can change the battle position of the attack target. (Flip Effects are not activated at this time.)
et: "<M6483>VW-Tiiger Katapult<M>" + "<M5556>XYZ-Draakoni Kahur<M>"<BR>Seda kaarti saab eriliselt kutsuda oma lisapakist, eemaldades mängust ülaltoodud kaardid, mida sa kontrollid (Sa ei kasuta "<M4837>Polümerisatsioon<M>"). Kord ühe käigu jooksul eemalda mängust 1 kaart, mida sinu vastane kontrollib. Kui see kaart ründab, saad muuta rünnaku sihtmärgi lahingupositsiooni. (Pöördefektid ei aktiveeru sel ajal.)

source: Cyber Blader
et: Küberteritaja

source: "<M6482>Etoile Cyber<M>" + "<M6472>Blade Skater<M>"<BR>A Fusion Summon of this card can only be conducted with the above Fusion Material Monsters. While your opponent controls only 1 monster, this card is not destroyed as a result of battle. While your opponent controls only 2 monsters, double the ATK of this card. While your opponent controls only 3 monsters, this card negates the effects of your opponent's Spell, Trap and Effect Monster Cards.
et: "<M6482>Etoile Cyber<M>" + "<M6472>Blade Skater<M>"<BR>Selle kaardi sulandumise saab läbi viia ainult ülaltoodud sulandumismaterjalidega. Kui sinu vastasel on ainult 1 koletis, siis see kaart ei hävine lahingu tulemusena. Kui sinu vastasel on ainult 2 koletist, siis selle kaardi ATK kahekordistub. Kui sinu vastasel on ainult 3 koletist, siis see kaart tühistab sinu vastase Loitsu, Lõksu ja Efektikoletise kaartide mõjud.

source: Elemental Hero Rampart Blaster
et: Elementaalne Kangelane Rampart Blaster

source: "<M6312>Elemental HERO Clayman<M>" + "<M6311>Elemental HERO Burstinatrix<M>"<BR>Must be Fusion Summoned and cannot be Special Summoned by other ways. This card can attack while in face-up Defense Position, but only if your opponent controls no monsters, and if it does, this card's ATK is halved during damage calculation only.
et: "<M6312>Elemental HERO Clayman<M>" + "<M6311>Elemental HERO Burstinatrix<M>"<BR>Peab olema Fusion Summoned ja ei saa olla Special Summoned muul viisil. See kaart võib rünnata, kui see on näoga ülespoole Defense Position'is, kuid ainult siis, kui sinu vastasel pole koletisi, ja kui see ründab, siis selle kaardi ATK on ainult damage calculation'i ajal poole väiksem.

source: Elemental Hero Tempest
et: Elementaalne Kangelane Tempest

source: "<M6310>Elemental HERO Avian<M>" + "<M6313>Elemental HERO Sparkman<M>" + "<M6393>Elemental HERO Bubbleman<M>"<BR>Must be Fusion Summoned and cannot be Special Summoned by other ways. You can send 1 other card you control to the Graveyard to target 1 monster you control; while this card is face-up on the field, that monster cannot be destroyed by battle.
et: "<M6310>Elemental HERO Avian<M>" + "<M6313>Elemental HERO Sparkman<M>" + "<M6393>Elemental HERO Bubbleman<M>"<BR>Peab sulanduma ja teda ei saa eriliselt kutsuda muul viisil. Sa võid saata 1 teise kaardi, mida sa kontrollid, Hauakambrisse, et sihtida 1 koletist, mida sa kontrollid; seni, kuni see kaart on lahinguväljal ülespoole suunatud, ei saa seda koletist lahingus hävitada.

source: Elemental Hero Wildedge
et: Elementaalne Kangelane Metsaserv

source: "<M6478>Elemental Hero Wildheart<M>" + "<M6477>Elemental Hero Bladedge<M>"<BR>Must be Fusion Summoned and cannot be Special Summoned by other ways. This card can attack every monster your opponent controls (one attack on each monster per Battle Phase).
et: "<M6478>Elementaalne Kangelane Metsasüda<M>" + "<M6477>Elementaalne Kangelane Teraserv<M>"<BR>Peab olema Fusion Summoned ja ei saa olla Special Summoned muul viisil. See kaart võib rünnata iga vastase kontrollitavat koletist (üks rünnak iga koletise kohta ühe Battle Phase'i jooksul).

source: Increase the ATK of the equipped monster by 800 points for each other face-up monster on the field with the same name as the equipped monster.
et: Suurenda varustatud koletise ATK-d 800 punkti võrra iga teise lahinguväljal oleva sama nimega avatud koletise kohta kui varustatud koletis.

source: Feather Shot
et: Sulelask

source: Target 1 face-up "<M6310>Elemental HERO Avian<M>" you control; during this turn, that target can attack a number of times equal to the number of monsters you control when this card resolves, but cannot attack directly, and other monsters you control cannot attack this turn.
et: Vali 1 avatud "<M6310>Elemental HERO Avian<M>", mida sa kontrollid; sellel käigul võib see sihtmärk rünnata nii mitu korda, kui palju koletisi sa kontrollid, kui see kaart lahendatakse, kuid ei saa rünnata otse ning teised koletised, mida sa kontrollid, ei saa sellel käigul rünnata.

source: Bonding - H2O
et: Sidumine - H2O

source: Tribute 2 "Hydrogeddon"s and 1 "<M6480>Oxygeddon<M>". Special Summon 1 "<M6481>Water Dragon<M>" from your hand, Deck or Graveyard.
et: Ohverda 2 "Hydrogeddon" ja 1 "<M6480>Oxygeddon<M>". Kutsu eriliselt välja 1 "<M6481>Water Dragon<M>" oma käest, pakist või hauast.

source: Chthonian Polymer
et: Chthonian Polümeer

source: You can only activate this card when your opponent Fusion Summons a Fusion Monster. Tribute 1 monster on your side of the field to take control of that Fusion Monster.
et: Seda kaarti saad aktiveerida ainult siis, kui sinu vastane kutsub välja Fusion Koletise. Ohverda 1 koletis oma väljaku poolelt, et võtta kontroll selle Fusion Koletise üle.

source: Chthonian Blast
et: Chthonian Plahvatus

source: Activate only when a face-up monster you control is destroyed and sent to the Graveyard. Destroy 1 face-up monster with the lowest ATK and inflict damage to both players equal to half of its ATK.
et: Aktiveeri ainult siis, kui sinu kontrolli all olev avatud koletis hävitatakse ja saadetakse Hauakambrisse. Hävita 1 avatud koletis, millel on madalaim rünnakupunktide arv, ja põhjusta mõlemale mängijale kahju, mis on võrdne poolega selle rünnakupunktidest.

source: Hero Barrier
et: Kangelase Barjäär

source: Negate 1 attack from an opponent's monster. You must control a face-up1 "Elemental HERO" monster to resolve this effect.
et: Negateeri 1 vastase koletise rünnak. Selle efekti lahendamiseks pead kontrollima avatud "Elemental HERO" koletist.

source: Feather Wind
et: Sulede tuul

source: When a Spell/Trap Card is activated while you control a face-up "<M6310>Elemental HERO Avian<M>": Negate the activation and destroy it.
et: Kui aktiveeritakse Võlu-/Lõksukaart, kui sa kontrollid avatud "<M6310>Elemental HERO Avian<M>": Tühista aktiveerimine ja hävita see.

source: Zure, Knight of Dark World
et: Zure, Tume Maailma Rüütel

source: The name of this illustrious knight is known by all residents of Dark World. He never oppresses the commoners.
et: Selle kuulsa rüütli nime teavad kõik Pimeduse Maailma elanikud. Ta ei rõhu kunagi lihtrahvast.

source: When this card is Normal Summoned, put 3 counters on it. This card cannot be destroyed by battle. If this card attacks or is attacked, remove 1 counter from this card at the end of the Damage Step. If you cannot, destroy it. Once per turn, you can remove 1 counter on this card to destroy 1 Spell or Trap Card on the field.
et: Kui see kaart on normaalvälja kutsutud, pane sellele 3 loendurit. Seda kaarti ei saa lahingus hävitada. Kui see kaart ründab või teda rünnatakse, eemalda sellelt kaardilt 1 loendur Kahjustuse etapi lõpus. Kui sa ei saa, hävita see. Kord käigu jooksul saad eemaldada sellelt kaardilt 1 loenduri, et hävitada 1 Võlu- või Lõksukaart väljal.

source: Nanobreaker
et: Nanomurdja

source: If this card attacks a face-up Level 3 or lower monster, destroy the monster with this card's effect without applying damage calculation.
et: Kui see kaart ründab avatud 3. taseme või madalama taseme koletist, hävita koletis selle kaardi efektiga ilma kahju arvutust rakendamata.

source: Rapid-Fire Magician
et: Kiirlaskur Maag

source: Inflict 400 damage to your opponent each time you activate a Normal Spell Card.
et: Iga kord, kui aktiveerid Tavalise Loitsukaardi, tekitad oma vastasele 400 kahju.

source: Beiige, Vanguard of Dark World
et: Beiige, Pimeduse Maailma Eesliin

source: If this card is discarded to the Graveyard by a card effect: Special Summon it from the Graveyard.
et: Kui see kaart saadetakse kaardiefekti tõttu Hauakambrisse: Kutsu see Hauakambrist eriliselt välja.

source: Broww, Huntsman of Dark World
et: Broww, Tume Maailma Kütt

source: If this card is discarded to the Graveyard by a card effect: Draw 1 card, plus another card if this card is discarded from your hand to your Graveyard by an opponent's card effect.
et: Kui see kaart saadetakse kaardiefekti tõttu Hauakambrisse: Tõmba 1 kaart, pluss veel üks kaart, kui see kaart saadetakse sinu käest Hauakambrisse vastase kaardiefekti tõttu.

source: Brron, Mad King of Dark World
et: Brron, Pime Maailma Hull Kuningas

source: When this card inflicts Battle Damage to your opponent: You can discard 1 card.
et: Kui see kaart tekitab lahingukahju sinu vastasele: Sa võid ühe kaardi ära visata.

source: Sillva, Warlord of Dark World
et: Sillva, Tume Maailma Sõjapealik

source: If this card is discarded to the Graveyard by a card effect: Special Summon it from the Graveyard, then, if this card was discarded from your hand to your Graveyard by your opponent's card effect, your opponent returns exactly 2 cards from their hand to the bottom of their Deck, in any order.
et: Kui see kaart saadetakse kaardiefekti tõttu Hauakambrisse: Kutsu see Hauakambrist eriliselt välja, siis, kui see kaart saadeti sinu käest Hauakambrisse sinu vastase kaardiefekti tõttu, tagastab sinu vastane täpselt 2 kaarti oma käest oma paki põhja, suvalises järjekorras.

source: Goldd, Wu-Lord of Dark World
et: Goldd, Pimeduse Maailma Wu-Isand

source: If this card is discarded to the Graveyard by a card effect: If it was discarded from your hand to your Graveyard by an opponent's card effect, you can target up to 2 cards your opponent controls; Special Summon this card from the Graveyard, then destroy those cards (if any).
et: Kui see kaart saadetakse kaardiefekti tõttu Hauakambrisse: Kui see saadeti sinu käest Hauakambrisse vastase kaardiefekti tõttu, saad valida kuni 2 kaarti, mida vastane kontrollib; Kutsu see kaart Hauakambrist eriliselt välja, seejärel hävita need kaardid (kui neid on).

source: Scarr, Scout of Dark World
et: Scarr, Tume Maailma Skaut

source: When this card is destroyed by battle and sent to the Graveyard: Add 1 Level 4 or lower "Dark World" monster from your Deck to your hand.
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse: Lisa 1. taseme 4 või madalama "Dark World" koletis oma pakist oma kätte.

source: Familiar-Possessed - Aussa
et: Tuttavlikult omatud - Aussa

source: By sending 1 "Aussa the Earth Charmer" and 1 EARTH monster from your side of the field to the Graveyard, you can Special Summon this card from your hand or Deck. If you Special Summon this card in this way, this card gets the following effect: During battle between this attacking card and a Defense Position monster whose DEF is lower than the ATK of this card, inflict the difference as Battle Damage to your opponent's Life Points.
et: Saates selle kaardi oma käest või pakist eriliselt välja kutsuda, saates oma väljalt kalmistule 1 "Aussa the Earth Charmer" ja 1 MAA koletise. Kui kutsute selle kaardi sel viisil välja, saab see kaart järgmise efekti: Lahingu ajal selle ründava kaardi ja kaitseasendis koletise vahel, mille DEF on madalam kui selle kaardi ATK, tekitage vahe vastase Elupunktidele Lahingukahjuna.

source: Familiar-Possessed - Eria
et: Tuttavlik - Eria

source: You can send 1 Eria the Water Charmer and 1 WATER monster you control to the Graveyard to Special Summon this card from your hand or Deck. If you do, this card gets the following effect:<BR>● During battle between this attacking card and a Defense Position monster whose DEF is lower than the ATK of this card, inflict the difference as Battle Damage to your opponent.
et: Saadad 1 Eria the Water Charmer ja 1 VEE koletis, mida sa kontrollid, Hauakambrisse, et Kutsuda see kaart oma käest või Paki seest. Kui sa seda teed, saab see kaart järgmise efekti:<BR>● Lahingu ajal selle ründava kaardi ja Kaitseasendis koletise vahel, mille DEF on madalam kui selle kaardi ATK, põhjusta vahe oma vastasele Lahingukahjuna.

source: Familiar-Possessed - Hiita
et: Tuttavlikult Vallatud - Hiita

source: By sending 1 "Hiita the Fire Charmer" and 1 FIRE monster from your side of the field to the Graveyard, you can Special Summon this card from your hand or Deck. If you Special Summon this card in this way, this card gets the following effect: During battle between this attacking card and a Defense Position monster whose DEF is lower than the ATK of this card, inflict the difference as Battle Damage to your opponent's Life Points.
et: Saates selle kaardi oma käest või pakist eriliselt välja kutsuda, saates 1 "Hiita the Fire Charmer" ja 1 TULEKAHJU koletis oma väljalt hauakambrisse. Kui kutsute selle kaardi sel viisil välja, saab see kaart järgmise efekti: Lahingu ajal selle ründava kaardi ja kaitsepositsioonis oleva koletise vahel, mille DEF on madalam kui selle kaardi ATK, tekitage vahe vastase elupunktidele lahingukahjuna.

source: Familiar-Possessed - Wynn
et: Tuttavlik - Wynn

source: By sending 1 "Wynn the Wind Charmer" and 1 WIND monster from your side of the field to the Graveyard, you can Special Summon this card from your hand or Deck. If you Special Summon this card in this way, this card gets the following effect: During battle between this attacking card and a Defense Position monster whose DEF is lower than the ATK of this card, inflict the difference as Battle Damage to your opponent's Life Points.
et: Saates selle kaardi oma käest või pakist eriliselt välja kutsuda, saates 1 "Wynn the Wind Charmer" ja 1 TUULE koletise oma väljaku poolelt kalmistule. Kui kutsute selle kaardi sel viisil välja, saab see kaart järgmise efekti: Lahingu ajal selle ründava kaardi ja kaitseasendis koletise vahel, mille DEF on madalam kui selle kaardi ATK, tekitage vahe vastase Elupunktidele Lahingukahjuna.

source: Pot of Avarice
et: Ahnitse Pott

source: Select 5 Monster Cards in your Graveyard. Shuffle those cards into the Deck, then draw 2 cards.
et: Vali oma Hauakambris 5 Koletise Kaarti. Sega need kaardid tagasi Pakki, seejärel tõmba 2 kaarti.

source: Dark World Lightning
et: Pimeduse Maailma Välk

source: Target 1 face-down card on the field; destroy that target, then discard 1 card.
et: Vali 1 tagurpidi kaart väljal; hävita see sihtmärk, seejärel viska 1 kaart ära.

source: Branch!
et: Oks!

source: When a Fusion Monster on the field is destroyed and sent to the Graveyard, you can Special Summon from your Graveyard 1 of the Fusion Material Monsters that you used for the Fusion Summon of that Fusion Monster.
et: Kui Fusion Monster väljal hävitatakse ja saadetakse Hauakambrisse, saad sa oma Hauakambrist Special Summon'ida ühe Fusion Material Monster'i, mida kasutasid selle Fusion Monster'i Fusion Summon'iks.

source: Boss Rush
et: Ülemuse Rünnak

source: You cannot Normal Summon or Set. During the End Phase of the turn that a "B.E.S." monster or a "<M6199>Big Core<M>" is destroyed and sent to the Graveyard, you can Special Summon 1 "B.E.S." monster or 1 "<M6199>Big Core<M>" from your Deck.
et: Sa ei saa normaalset kutsuda ega asetada. Selle käigu lõppfaasis, mil "B.E.S." koletis või "<M6199>Big Core<M>" hävitatakse ja saadetakse hauakambrisse, saad sa eriliselt kutsuda 1 "B.E.S." koletise või 1 "<M6199>Big Core<M>" oma pakist.

source: Gateway to Dark World
et: Värav Pimedasse Maailma

source: Target 1 "Dark World" monster in your Graveyard; Special Summon that target. You cannot Summon other monsters the turn that you activate this card.
et: Vali 1 "Dark World" koletis oma Hauakambris; Kutsu see sihtmärk eriliselt välja. Sa ei saa sellel käigul, mil sa selle kaardi aktiveerid, kutsuda välja teisi koletisi.

source: The Forces of Darkness
et: Pimeduse Jõud

source: Target 2 "Dark World" monsters in your Graveyard; add those targets to your hand.
et: Vali 2 "Dark World" koletist oma kalmistul; lisa need sihtmärgid oma kätte.

source: Dark Deal
et: Tume Tehing

source: When your opponent activates a Normal Spell Card: Pay 1000 Life Points; the effect of that Normal Spell Card becomes "Your opponent discards 1 random card".
et: Kui sinu vastane aktiveerib tavalise loitsukaardi: Maksa 1000 elupunkti; selle tavalise loitsukaardi efekt muutub "Sinu vastane viskab juhuslikult 1 kaardi ära".

source: Simultaneous Loss
et: Samaaegne Kaotus

source: Each player sends the top card from their Deck to the Graveyard.
et: Iga mängija saadab oma pakist ülemise kaardi hauakambrisse.

source: Weed Out
et: Umbrohut

source: Pay 500 Life Points. Destroy all Level 3 monsters in face-up Attack Position on the field.
et: Makske 500 Elupunkti. Hävita kõik 3. taseme koletised, mis on väljale avatud Rünnakupositsioonis.

source: The League of Uniform Nomenclature
et: Ühtse Nomenklatuuri Liiga

source: Select 1 face-up Level 2 or lower Normal Monster on your side of the field to activate this card. Special Summon from your Deck to your side of the field as many cards as possible with the same name as the selected monster.
et: Vali 1 avatud näoga 2. taseme või madalama tavaline koletis oma väljaku poolelt, et aktiveerida see kaart. Kutsu oma pakist oma väljaku poolele eriliselt välja nii palju kaarte kui võimalik, millel on sama nimi kui valitud koletisel.

source: Roll Out!
et: Rünnak!
