Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: Change the battle positions of all face-up monsters on the field.
et: Muuda kõigi lahinguväljal olevate avatud koletiste lahingupositsioone.

source: Dark Mirror Force
et: Tume Peegeljõud

source: You can only activate this card when your opponent's monster declares an attack. Remove all monsters in Defense Position on your opponent's side of the field from play.
et: Seda kaarti saad aktiveerida ainult siis, kui sinu vastase koletis kuulutab välja rünnaku. Eemalda kõik kaitseasendis olevad koletised oma vastase väljaku poolelt mängust.

source: Energy Drain
et: Energiajõud

source: Select 1 face-up monster on your side of the field. Increase the ATK and DEF of the monster by an amount equal to the number of cards in your opponents hand x 200 points until the End Phase.
et: Vali 1 avatud poolusega koletis oma väljaku poolelt. Suurenda koletise ATK ja DEF väärtust vastase käes olevate kaartide arvu x 200 punkti võrra kuni lõppfaasini.

source: Chaos Emperor Dragon - Envoy of the End
et: Kaosemperor Draakon - Lõpu Käskjalg

source: This card cannot be Normal Summoned or Set. This card can only be Special Summoned by removing from play 1 LIGHT and 1 DARK monster in your Graveyard. You can pay 1000 Life Points to send all cards in both players' hands and on the field to the Graveyard. Inflict 300 damage to your opponent for each card that is sent to the Graveyard by this effect.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti saab eriliselt kutsuda ainult eemaldades mängust 1 VALGUSE ja 1 PIMEDUSE koletise oma hauakambris. Sa võid maksta 1000 Elupunkti, et saata kõik kaardid mõlema mängija käest ja väljakult hauakambrisse. Tekita oma vastasele 300 kahju iga kaardi eest, mis selle efekti tõttu hauakambrisse saadetakse.

source: Victory Dragon
et: Võidudraakon

source: This card cannot be Special Summoned. To Tribute Summon this card, you must Tribute 3 Dragon-Type monsters. If this card attacks your opponent directly and reduces their Life Points to 0, you win the Match.
et: Seda kaarti ei saa eriliselt kutsuda. Selle kaardi ohverdamiseks pead ohverdama 3 Draakoni-tüüpi koletist. Kui see kaart ründab sinu vastast otse ja vähendab nende Elupunkte 0-ni, võidad matši.

source: Magician's Valkyria
et: Maagiku Valküüria

source: Your opponent cannot select another Spellcaster-Type monster you control as an attack target.
et: Sinu vastane ei saa valida teist sinu kontrolli all olevat Spellcaster-tüüpi koletist rünnaku sihtmärgiks.

source: In order to fight tremendous evil, he gained formidable power through body reconstruction, but lost his heart and his redemption.
et: Selleks, et võidelda tohutu kurjusega, sai ta keharekonstrueerimise kaudu tohutu jõu, kuid kaotas oma südame ja lunastuse.

source: Mad Dog of Darkness
et: Pimeduse Hull Koer

source: He used to be a normal dog who played around in a park, but was corrupted by the powers of darkness.
et: Ta oli kunagi tavaline koer, kes mängis pargis, kuid pimeduse jõud rikkusid ta ära.

source: Neo Bug
et: Neo Putukas

source: A huge bug-like monster said to come from another planet. It gathers in swarms.
et: Hiiglaslik putukalaadne koletis, kes väidetavalt pärineb teiselt planeedilt. See koguneb parvedesse.

source: Sea Serpent Warrior of Darkness
et: Pimeduse Meremadu Sõdalane

source: A warrior who defends the world of the Sea of Darkness. He prides himself on his fighting prowess both on the ground and, of course, in the water.
et: Sõdalane, kes kaitseb Pimeduse Mere maailma. Ta on uhke oma võitlusoskuste üle nii maapinnal kui ka, loomulikult, vees.

source: Terrorking Salmon
et: Hirmukuningas Lõhe

source: A feared salmon, master of the Sea of Darkness. Its roe is the best delicacy in the World of Darkness.
et: Kartetud lõhe, Pimeduse Mere meister. Selle mari on Pimeduse Maailma parim delikatess.

source: Blazing Inpachi
et: Põlev Inpachi

source: A wicked wooden spirit now burning in flames. Its fire attack is powerful, but it will soon be nothing but ashes.
et: Paha puuvaim, mis nüüd põleb leekides. Selle tulerünnak on võimas, kuid varsti jääb sellest järele vaid tuhk.

source: Burning Algae
et: Põlevad vetikad

source: When this card is sent to the Graveyard, increase your opponent's Life Points by 1000 points.
et: Kui see kaart saadetakse Hauakambrisse, suurenda oma vastase Elupunkte 1000 punkti võrra.

source: The Thing in the Crater
et: Asi Krateris

source: When this card is destroyed and sent from the field to the Graveyard, you can Special Summon 1 Pyro-Type Monster from your hand.
et: Kui see kaart hävitatakse ja saadetakse väljakult hauakambrisse, saad sa eriliselt kutsuda 1 Pyro-tüüpi koletise oma käest.

source: Molten Zombie
et: Sulav Zombie

source: When this card is Special Summoned from the Graveyard, the controller of this card draws 1 card.
et: Kui see kaart on eriliselt välja kutsutud hauast, tõmbab selle kaardi kontrollija 1 kaardi.

source: Dark Magician of Chaos
et: Kaose Tumevõlur

source: When this card is Normal or Special Summoned, you can select and add 1 Spell Card from your Graveyard to your hand. Monsters this card destroys by battle are removed from play instead of going to the Graveyard. If this face-up card is destroyed or removed from the field, it is removed from play.
et: Kui see kaart on Normaal- või Erikutsutud, saad valida ja lisada 1 Loitsukaardi oma Hauakambrist oma kätte. Koletised, mille see kaart lahingus hävitab, eemaldatakse mängust, mitte ei lähe Hauakambrisse. Kui see avatud kaart hävitatakse või eemaldatakse väljakult, eemaldatakse see mängust.

source: Manticore of Darkness
et: Pimeduse Manticore

source: During the End Phase of any turn this card is sent to the Graveyard, you can send 1 Beast, Beast-Warrior or Winged Beast-Type Monster Card from your hand or your side of the field to the Graveyard to Special Summon this card from the Graveyard.
et: End Phase'i ajal, mil see kaart saadetakse Hauakambrisse, võid saata 1 Põhjuse, Põhjus-Sõdalase või Tiivulise Põhjuse-Tüüpi Koletise Kaardi oma käest või oma väljaku poolelt Hauakambrisse, et see kaart Hauakambrist Eriliselt Kutsuda.

source: Stealth Bird
et: Varitsuslind

source: Once per turn, you can flip this card into face-down Defense Position. When this card is Flip Summoned, inflict 1000 damage to your opponent.
et: Korra ühe korra käigu jooksul saad selle kaardi pöörata näoga allapoole kaitsepositsiooni. Kui see kaart on pööratud, põhjusta oma vastasele 1000 kahju.

source: Sacred Crane
et: Püha Kraana

source: When this card is Special Summoned, the controller of this card draws 1 card.
et: Kui see kaart on eriliselt kutsutud, tõmbab selle kaardi kontrollija 1 kaardi.

source: Enraged Battle Ox
et: Raevunud Võitlushärg

source: During battle between an attacking Beast, Beast-Warrior or Winged Beast-Type monsters you control and a Defense Position monster whose DEF is lower than the ATK of the attacking monster, inflict the difference as Battle Damage to your opponent.
et: Lahingu ajal sinu kontrolli all oleva ründava Metstüüpi, Metssõdalase või Tiivulise metsalise tüüpi koletise ja Kaitseasendis oleva koletise vahel, mille DEF on madalam kui ründava koletise ATK, põhjusta vahe oma vastasele Lahingukahjuna.

source: When this card is Normal Summoned or Flip Summoned, you can Special Summon any number of "<M5885>Don Turtle<M>"(s) from your hand.
et: Kui see kaart on Normaal- või Pöördkutsutud, saad oma käest Eriliselt Kutsuda ükskõik kui palju "<M5885>Don Turtle<M>"(e).

source: Balloon Lizard
et: Õhupalli Sisalik

source: Put 1 counter on this card during each of your Standby Phases. When this card is destroyed, inflict damage to the controller of the card that destroyed it equal to the number of counters X 400 points.
et: Pane selle kaardile 1 loendur iga oma Ootefaaside ajal. Kui see kaart hävitatakse, tekita kahju kaardi hävitaja kontrollijale, mis on võrdne loendurite arvuga X 400 punkti.

source: Dark Driceratops
et: Tume Driceratops

source: Hyper Hammerhead
et: Hüper Haamerpea

source: When this monster battles an opponent's monster, unless the opponent's monster is destroyed by battle, it is returned to the owner's hand at the end of the Damage Step.
et: Kui see koletis võitleb vastase koletisega, siis kui vastase koletist ei hävitata lahingus, tagastatakse see omaniku kätte Kahjustuse Etapi lõpus.

source: Black Tyranno
et: Must Tyranno

source: If your opponent controls no cards except Defense Position Monster Cards, this card can attack your opponent directly.
et: Kui sinu vastasel ei ole ühtegi kaarti peale kaitseasendis koletiskaartide, võib see kaart rünnata sinu vastast otse.

source: Anti-Aircraft Flower
et: Õhutõrje Lill

source: By Tributing 1 Insect-Type monster on your side of the field inflict 800 points of damage to your opponent's Life Points.
et: Ohverdades 1 putukaliigi koletise oma väljaku poolelt, tekitage oma vastase Elupunktidele 800 punkti kahju.

source: Prickle Fairy
et: Okasroos

source: While this card is face-up on your side of the field, your opponent cannot attack Insect-Type monsters. The battle position of a monster that battles with this card is changed to Defense Position at the end of the Damage Step.
et: Kui see kaart on sinu väljaku avatud poolel, ei saa sinu vastane rünnata Putukate tüüpi koletisi. Selle kaardiga võitleva koletise lahingupositsioon muudetakse Kahjustuse etapi lõpus Kaitsepositsiooniks.

source: Insect Princess
et: Putukate Printsess

source: While this card is face-up on the field, battle positions of all face-up Insect-Type monsters on your opponent's side of the field are changed into Attack Position. Each time this card destroys an Insect-Type monster as a result of battle, increase the ATK of this card by 500 points.
et: Kui see kaart on lahinguväljal avatud, muudetakse kõik vastase poolel olevad avatud Putukate tüüpi koletised Rünnakupositsiooniks. Iga kord, kui see kaart hävitab lahingu tulemusena Putukate tüüpi koletise, suurendatakse selle kaardi ATK-d 500 punkti võrra.

source: Amphibious Bugroth MK-3
et: Amfiibne Bugroth MK-3

source: As long as "<M4340>Umi<M>" remains face-up on the field, this card can attack your opponent's Life Points directly.
et: Niikaua kui "<M4340>Umi<M>" jääb väljale avatud olekusse, võib see kaart rünnata otse sinu vastase Elupunkte.

source: Torpedo Fish
et: Torpedo Kala

source: While "<M4340>Umi<M>" is face-up on the field, this card is unaffected by any Spell Cards.
et: Kui "<M4340>Umi<M>" on väljakul avatud, ei mõjuta seda kaarti ükski loitsukaart.

source: Levia-Dragon - Daedalus
et: Levia-Draakon - Daedalus

source: Send "<M4340>Umi<M>" on your side of the field to the Graveyard to destroy all cards on the field except this card.
et: Saada "<M4340>Umi<M>" oma väljaku poolelt kalmistule, et hävitada kõik kaardid väljakul, välja arvatud see kaart.

source: Orca Mega-Fortress of Darkness
et: Pimeduse Mega-Kindlus Orka

source: By Tributing 1 "<M5894>Torpedo Fish<M>" on your side of the field, destroy 1 monster on the field. By Tributing 1 "<M5897>Cannonball Spear Shellfish<M>" on your side of the field, destroy 1 Spell or Trap Card on the field.
et: Ohverdades 1 "<M5894>Torpedo Fish<M>" oma väljaku poolel, hävita 1 koletis väljakul. Ohverdades 1 "<M5897>Cannonball Spear Shellfish<M>" oma väljaku poolel, hävita 1 Võlu- või Lõksukaart väljakul.

source: Cannonball Spear Shellfish
et: Kahurikuul Odakarp

source: Mataza the Zapper
et: Mataza, sähvija

source: This monster can attack twice during the same Battle Phase. Control of this card cannot switch.
et: See koletis võib rünnata kaks korda sama Lahingu Faasi jooksul. Selle kaardi kontrolli ei saa vahetada.

source: Guardian Angel Joan
et: Kaitseingel Joan

source: When this card destroys a monster by battle and sends it to the Graveyard, gain Life Points equal to the original ATK of the destroyed monster.
et: Kui see kaart hävitab lahingus koletise ja saadab selle Hauakambrisse, saad Elupunkte, mis on võrdne hävitatud koletise algse rünnakuga.

source: Manju of the Ten Thousand Hands
et: Kümne Tuhande Käe Manju

source: When this card is Normal Summoned or Flip Summoned, you can add 1 Ritual Monster Card or 1 Ritual Spell Card from your Deck to your hand.
et: Kui see kaart on Normaal- või Pöördkutsutud, saad lisada 1 Rituaalikoletise Kaardi või 1 Rituaaliloitsu Kaardi oma pakist oma kätte.

source: If this card battles a Fiend or Zombie-Type monster, destroy that monster at the end of the Damage Step.
et: Kui see kaart võitleb deemoni või zombitüüpi koletisega, hävita see koletis Kahjustuse Etapi lõpus.

source: If this card battles a Warrior or Spellcaster-Type monster, destroy that monster at the end of the Damage Step.
et: Kui see kaart võitleb Sõdalase või Loitsija-tüüpi koletisega, hävita see koletis Kahjustuse sammu lõpus.

source: Gryphon's Feather Duster
et: Grifiini Sulghari

source: Destroy all Spell and Trap Cards on your side of the field. Increase your Life Points by the number of destroyed cards x 500 points.
et: Hävita kõik sinu poolel väljakul olevad Võlu- ja Lõksukaardid. Suurenda oma Elupunkte hävitatud kaartide arvu x 500 punkti võrra.

source: Stray Lambs
et: Eksinud Lambad

source: If you activate this card, you cannot Normal Summon, Flip Summon or Special Summon during this turn. Special Summon 2 "<M3918>Lamb Token<M>"(s) (Beast-Type/EARTH/Level 1/ATK 0/DEF 0) in Defense Position.
et: Kui aktiveerid selle kaardi, ei saa sa sellel käigul teha normaalset kutsumist, ümberpööratud kutsumist ega erilist kutsumist. Kutsu kaitsepositsioonis välja 2 "<M3918>Lamb Token<M>"(it) (Loom-Tüüp/MAA/Tase 1/RÜN 0/KAIT 0).

source: Smashing Ground
et: Purustav Pinnas

source: Destroy the face-up monster your opponent controls with the highest DEF. (If it's a tie, you get to choose.)
et: Hävita vastase kontrolli all olev avatud koletis, mille DEF on kõige suurem. (Kui on viik, saad valida.)

source: Dimension Fusion
et: Dimensioonide Ühendamine

source: Pay 2000 Life Points. Both players Special Summon as many of their removed from play monsters as possible.
et: Makske 2000 Elupunkti. Mõlemad mängijad Kutsuvad Eriliselt välja nii palju oma mängust eemaldatud koletisi kui võimalik.

source: Dedication through Light and Darkness
et: Pühendumine läbi valguse ja pimeduse

source: You can only activate this card Tributing 1 "<M4041>Dark Magician<M>" on your side of the field. Select 1 "<M5880>Dark Magician of Chaos<M>" from your hand, your Graveyard or your Deck and Special Summon it.
et: Seda kaarti saad aktiveerida ainult ohverdades 1 "<M4041>Tume Maag<M>" oma väljaku poolel. Vali 1 "<M5880>Kaose Tume Maag<M>" oma käest, hauast või pakist ja kutsu see eriliselt välja.

source: Salvage
et: Päästmine

source: Add 2 WATER monsters with an ATK of 1500 or less each in your Graveyard to your hand.
et: Lisa oma käest 2 VEE koletist, mille ATK on kumbki 1500 või vähem, oma kalmistule.

source: Ultra Evolution Pill
et: Ultra Evolutsioonipill

source: Tribute 1 Reptile-Type monster on your side of the field. Special Summon 1 Dinosaur-Type monster from your hand.
et: Lohverda oma väljaku peal olev 1 Reptiil-tüüpi koletis. Kutsu eriliselt välja 1 Dinosaurus-tüüpi koletis oma käest.

source: Earth Chant
et: Maa Laul

source: This card is used to Ritual Summon any EARTH Ritual Monster. You must also Tribute monsters from the field or your hand whose total Level equal the Level of the Ritual Monster you are attempting to Ritual Summon.
et: Seda kaarti kasutatakse mis tahes MAA rituaalikoletise rituaalsummonimiseks. Sa pead ka ohverdama koletisi väljakult või oma käest, kelle kogutase on võrdne rituaalikoletise tasemega, mida sa üritad rituaalsummonida.

source: Jade Insect Whistle
et: Jade Putuka Vile

source: Your opponent selects 1 Insect-Type Monster from his/her Deck. After shuffling the Deck, place the card on top of the Deck.
et: Sinu vastane valib oma pakist 1 putukaliigi koletise. Pärast paki segamist aseta kaart paki peale.

source: Destruction Ring
et: Hävitusrõngas

source: Destroy 1 face-up monster on your side of the field to inflict 1000 points of damage to both player's Life Points.
et: Hävita 1 avatud koletis oma väljaku poolel, et tekitada mõlemale mängijale 1000 punkti kahju Elupunktidesse.

source: Fiend's Hand Mirror
et: Deemoni Käe Peegel

source: Switch the opponent's Spell Card effect that specifically designates 1 Spell or Trap Card as a target to another correct target.
et: Suuna vastase Võlukaarte efekti, mis määrab sihtmärgiks ühe konkreetse Võlu- või Lõksukaardi, teisele sobivale sihtmärgile.

source: Compulsory Evacuation Device
et: Kohustuslik evakueerimisseade

source: Return 1 monster on the field to its owner's hand.
et: Tagasta 1 koletis väljakult selle omaniku kätte.

source: A Hero Emerges
et: Kangelane tõuseb

source: You can only activate this card when your opponent declares an attack. Your opponent selects 1 random card from your hand. If it is a Monster Card, Special Summon it on your side of the field. If not, send it to the Graveyard.
et: Seda kaarti saad aktiveerida ainult siis, kui sinu vastane kuulutab välja rünnaku. Sinu vastane valib sinu käest juhuslikult ühe kaardi. Kui see on Koletisekaart, kutsu see eriliselt välja oma väljaku poolele. Kui ei, saada see Hauakambrisse.

source: Self-Destruct Button
et: Enesehävitusnupp

source: You can only activate this card when your Life Points are lower than your opponent's Life Points and the difference is 7000 points or more. Both player's Life Points become 0.
et: Seda kaarti saab aktiveerida ainult siis, kui sinu Elupunktid on madalamad kui sinu vastase Elupunktid ja vahe on 7000 punkti või rohkem. Mõlema mängija Elupunktid muutuvad 0-ks.

source: Curse of Darkness
et: Pimeduse needus

source: Each time a Spell Card is activated, the controller of that Spell Card takes 1000 points of damage.
et: Iga kord, kui aktiveeritakse Võlukaar, saab selle Võlukaardi kontrollija 1000 punkti kahju.

source: Begone, Knave!
et: Kao, lurjus!

source: When a monster inflicts Battle Damage to a player, return the monster to its owner's hand.
et: Kui koletis tekitab mängijale lahingukahju, tagasta koletis selle omaniku kätte.

source: DNA Transplant
et: DNA Siirdamine

source: Declare 1 Attribute when you activate this card. As long as this card remains face-up on the field, the Attribute of all face-up monsters on the field become the one you declared.
et: Kui aktiveerid selle kaardi, nimeta 1 omadus. Kuni see kaart jääb väljale avatud olekusse, muutub kõigi väljale avatud koletiste omadus sinu nimetatuks.

source: Robbin' Zombie
et: Röövlik Zombi

source: Each time 1 monster on your side of the field inflicts Battle Damage to your opponent's Life Points, your opponent sends 1 card from the top of their Deck to the Graveyard.
et: Iga kord, kui üks sinu poolel olev koletis tekitab lahingukahju sinu vastase Elupunktidele, saadab sinu vastane ühe kaardi oma paki pealt Hauakambrisse.

source: Trap Jammer
et: Lõksu Summutaja

source: Activate only when your opponent activates a Trap Card during the Battle Phase. Negate the activation of the Trap Card and destroy it.
et: Aktiveeri ainult siis, kui sinu vastane aktiveerib lõksukaardi lahingufaasi ajal. Tühista lõksukaardi aktiveerimine ja hävita see.

source: Invader of Darkness
et: Pimeduse Sissetungija

source: While this card is face-up on the field, your opponent cannot activate Quick-Play Spell Cards.
et: Kui see kaart on lahinguväljal avatud, ei saa sinu vastane aktiveerida Kiirmängu Võlukaarte.

source: Twinheaded Beast
et: Kaksipealine metsaline

source: Winged Rhynos
et: Tiivuline Rhynos

source: When a Trap Card is activated, you can return this face-up card from the field to its owner's hand.
et: Kui aktiveeritakse lõksukaart, saad selle avatud kaardi väljakult omaniku kätte tagasi saata.

source: This card cannot be Special Summoned. This card must be Tribute Summoned by offering 3 Winged Beast-Type monsters on your side of the field as Tributes. If this card attacks your opponent's Life Points directly and makes them 0, the controller of this card wins the Match.
et: Seda kaarti ei saa eriliselt kutsuda. See kaart tuleb ohverdada, pakkudes 3 tiivulist metsalist tüüpi koletist oma väljaku poolelt ohvritena. Kui see kaart ründab otse sinu vastase elupunkte ja viib need nulli, võidab selle kaardi kontrollija matši.

source: Brain Crusher
et: Ajupurustaja

source: Once per turn, if this card destroyed an opponent's monster by battle and sent it to the Graveyard, you can Special Summon 1 of those destroyed monsters from the Graveyard during the End Phase.
et: Kord üks kord käigu jooksul, kui see kaart hävitas lahingus vastase koletise ja saatis selle Hauakambrisse, saad End Phase'i ajal eriliselt kutsuda ühe neist hävitatud koletistest Hauakambrist.

source: Abyss Soldier
et: Kuristiku Sõdur

source: Once per turn, by discarding 1 WATER monster to the Graveyard, return 1 card on the field to its owner's hand.
et: Kord korra käigu jooksul, saates 1 VEE koletise Hauakambrisse, tagasta 1 kaart väljakult selle omaniku kätte.

source: Meteo the Matchless
et: Meteo Võitmatu

source: This card cannot be Special Summoned. This card must be Tribute Summoned by offering 3 Beast-Warrior-Type monsters on your side of the field as Tributes. If this card attacks your opponent's Life Points directly and makes them 0, the controller of this card wins the Match.
et: Seda kaarti ei saa eriliselt kutsuda. See kaart tuleb ohverdada, pakkudes 3 Beast-Warrior-tüüpi koletist oma väljaku poolelt ohvritena. Kui see kaart ründab otse sinu vastase Elupunkte ja viib need nulli, võidab selle kaardi kontrollija matši.

source: Inferno Hammer
et: Põrgukivihaamer

source: When this card destroys your opponent's monster and sends it to the Graveyard as a result of battle, you can select 1 face-up monster on your opponent's side of the field, and flip it into face-down Defense Position.
et: Kui see kaart hävitab sinu vastase koletise ja saadab selle lahingu tulemusena Hauakambrisse, saad valida 1 avatud koletise oma vastase väljaku poolel ja pöörata selle tagurpidi Kaitseasendisse.

source: Emes the Infinity
et: Lõpmatus Emes

source: Each time this card destroys an opponent's monster and sends it to the Graveyard as a result of battle, increase the ATK of this card by 700 points.
et: Iga kord, kui see kaart hävitab vastase koletise ja saadab selle lahingu tulemusena Hauakambrisse, suurenda selle kaardi ATK-d 700 punkti võrra.

source: D.D. Assailant
et: D.D. Ründaja

source: When this card is destroyed by battle with an opponent's monster, remove from play that monster and this card.
et: Kui see kaart hävitatakse lahingus vastase koletisega, eemalda mängust see koletis ja see kaart.

source: When this card is Tribute Summoned successfully, your opponent cannot declare an attack during his/her next turn.
et: Kui see kaart on edukalt ohverdatud, ei saa sinu vastane oma järgmisel käigul rünnakut kuulutada.

source: Gora Turtle of Illusion
et: Illusioonikilpkonn Gora

source: Negate the effect of Spell and Trap Cards controlled by your opponent that specifically designate this face-up card on the field as a target.
et: Negateeri oma vastase kontrollitavate Võlu- ja Lõksukaartide mõju, mis määravad selle avatud kaardi väljal sihtmärgiks.

source: Zoma the Spirit
et: Vaim Zoma
