Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: Once per turn: You can target 1 card in your opponent's Graveyard; banish that target.
et: Korra ühe korra käigu jooksul: Sa võid valida ühe kaardi oma vastase Hauakambris; eemalda see sihtmärk mängust.

source: Hidden Armory
et: Peidetud Relvastus

source: Send 1 card from the top of your Deck to the Graveyard. Add 1 Equip Spell Card from your Deck or Graveyard to your hand. You cannot Normal Summon or Set the turn you activate this effect.
et: Saada 1 kaart oma pakist hauakambrisse. Lisa 1 Varustuse Võlusõna kaart oma pakist või hauakambrist oma kätte. Sa ei saa tavaliselt kutsuda ega asetada kaarti sellel käigul, mil sa selle efekti aktiveerid.

source: Assault Armor
et: Rünnakrüü

source: Equip only to a Warrior-Type monster that is the only monster you control. It gains 300 ATK. During your Main Phase 1, you can send this equipped card to the Graveyard to allow the equipped monster to attack twice during each Battle Phase this turn.
et: Varusta ainult Sõdalase-tüüpi koletisele, mis on ainus koletis, mida sa kontrollid. See saab 300 ATK juurde. Oma peafaas 1 ajal saad saata selle varustatud kaardi Hauakambrisse, et lubada varustatud koletisel rünnata kaks korda iga lahingufaasi jooksul sel käigul.

source: Evil Blast
et: Kuri löök

source: Activate only when a monster is Special Summoned to your opponent's side of the field. Equip this card to that monster. It gains 500 ATK. During each of your opponent's Standby Phases, inflict 500 damage to your opponent.
et: Aktiveeri ainult siis, kui koletis kutsutakse eriliselt sinu vastase väljaku poolele. Varusta see kaart sellele koletisele. See saab 500 ATK juurde. Iga sinu vastase ooteetapi ajal põhjusta oma vastasele 500 kahju.

source: Ice Queen
et: Jääkuninganna

source: Cannot be Special Summoned from the Graveyard. When this face-up card you control is destroyed and sent to your Graveyard: You can target 1 Spell Card in your Graveyard; add that target to your hand. You must have 3 or more Spellcaster-Type monsters in your Graveyard to activate and to resolve this effect.
et: Ei saa eriliselt kutsuda Hauakambrist. Kui see avatud kaart, mida sa kontrollid, hävitatakse ja saadetakse sinu Hauakambrisse: Sa võid valida 1 Loitsukaardi oma Hauakambris; lisa see valitud kaart oma kätte. Selle efekti aktiveerimiseks ja lahendamiseks peab sul olema 3 või rohkem Loitsija-tüüpi koletist oma Hauakambris.

source: Gaap the Divine Soldier
et: Gaap, Jumalik Sõdur

source: All monsters are changed to face-up Attack Position and their battle positions cannot be changed (Flip Effects are not activated at this time). Once per turn, you can reveal any number of Fiend-Type monsters in your hand to give this card 300 ATK for each revealed card, until the End Phase.
et: Kõik koletised muudetakse avatud rünnakupositsiooni ja nende lahingupositsioone ei saa muuta (Flip-efekte ei aktiveerita sel ajal). Kord käigu jooksul võid paljastada oma käes oleva suvalise arvu deemonitüüpi koletisi, et anda sellele kaardile 300 ATK iga paljastatud kaardi kohta kuni lõppfaasini.

source: Caius the Shadow Monarch
et: Varjude monarh Caius

source: When this card is Tribute Summoned, remove from play 1 card on the field. If it was a DARK Monster Card, inflict 1000 damage to your opponent.
et: Kui see kaart on ohverdatud kutsumiseks, eemalda mängust 1 kaart väljakul. Kui see oli PIMEDUS Koletise Kaart, tekita oma vastasele 1000 kahju.

source: Dimensional Alchemist
et: Dimensioonide Alkeemik

source: Once per turn, you can activate this effect to remove from play the top card of your Deck and give this card 500 ATK until the End Phase. When this card is destroyed and sent from your side of the field to your Graveyard, you can select 1 of your removed from play monsters and return it to your hand.
et: Korra ühe käigu jooksul saad aktiveerida selle efekti, et eemaldada oma pakist ülemine kaart mängust ja anda sellele kaardile 500 ATK kuni lõppfaasini. Kui see kaart hävitatakse ja saadetakse sinu väljaku poolelt hauakambrisse, saad valida ühe oma mängust eemaldatud koletise ja tagastada selle oma kätte.

source: When you Tribute Summon a monster by Tributing this card, return this card to your hand.
et: Kui sa kutsud koletise välja ohverdades selle kaardi, siis tagasta see kaart oma kätte.

source: D.D.R. - Different Dimension Reincarnation
et: D.D.R. - Teise dimensiooni reinkarnatsioon

source: Discard 1 card. Select 1 of your removed from play monsters, Special Summon it in Attack Position, and equip it with this card. When this card is removed from the field, destroy the equipped monster.
et: Viska 1 kaart. Vali 1 sinu mängust eemaldatud koletis, Kutsu see erilisel viisil välja Rünnakupositsioonis ja varusta see selle kaardiga. Kui see kaart eemaldatakse väljakult, hävita varustatud koletis.

source: By Order of the Emperor
et: Keisri käsul

source: You can choose to negate the activation of an Effect Monster's effect that activates when a monster is Normal Summoned (including itself). If you do, that Effect Monster's controller draws 1 card.
et: Saate valida, kas tühistada Efektkoletise efekti aktiveerimine, mis aktiveerub, kui koletis on Normaalkutsutud (kaasa arvatud see ise). Kui te seda teete, tõmbab selle Efektkoletise kontrollija 1 kaardi.

source: Evil Dragon Ananta
et: Kuri Draakon Ananta

source: This card cannot be Normal Summoned or Set. This card cannot be Special Summoned except by removing from play all Reptile-Type monsters from your side of the field and Graveyard. This card's ATK and DEF are each equal to the number of Reptile-Type monsters you removed x 600. During each of your End Phases, destroy 1 card on the field.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti ei saa eriliselt kutsuda, välja arvatud juhul, kui eemaldate mängust kõik Reptiil-tüüpi koletised oma väljakult ja hauakambrist. Selle kaardi ATK ja DEF on võrdsed eemaldatud Reptiil-tüüpi koletiste arvuga x 600. Iga oma lõppfaasi ajal hävitage 1 kaart väljakul.

source: Winged Kuriboh LV9
et: Tiivuline Kuriboh LV9

source: During either player's turn, as Chain Link 3 or higher: You can Special Summon this card from your hand. Spell Cards that have been activated are banished instead of being sent to the Graveyard. The ATK and DEF of this card are each equal to the number of Spell Cards in your opponent's Graveyard x 500. You can only control 1 face-up1 "<M7526>Winged Kuriboh LV9<M>".
et: Kas kummagi mängija käigu ajal, kui on Chain Link 3 või kõrgem: Sa võid selle kaardi oma käest eriliselt kutsuda. Aktiveeritud Loitsukaardid saadetakse Haua asemel eksiili. Selle kaardi ATK ja DEF on võrdsed sinu vastase Hauas olevate Loitsukaartide arvuga x 500. Sa saad kontrollida ainult 1 avatud "<M7526>Winged Kuriboh LV9<M>".

source: Blizzed, Defender of the Ice Barrier
et: Blizzed, Jääbarjääri Kaitsja

source: When this card is destroyed by battle and sent to the Graveyard, draw 1 card.
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse, tõmba 1 kaart.

source: Blizzard Warrior
et: Lumetormisõdalane

source: If this card destroys an opponent's monster by battle, look at the top card of their Deck, then return it to either the top or bottom of their Deck.
et: Kui see kaart hävitab lahingus vastase koletise, vaata nende paki ülemist kaarti, seejärel pane see tagasi kas paki ülemisele või alumisele kaardile.

source: Cryomancer of the Ice Barrier
et: Jääbarjääri Külmamant

source: While you control another "Ice Barrier" monster, Level 4 or higher monsters cannot declare an attack.
et: Kui sa kontrollid teist "Jääbarjääri" koletist, ei saa 4. või kõrgema taseme koletised rünnakut kuulutada.

source: Mist Valley Thunderbird
et: Uduorgu Tormilind

source: When this face-up card on the field returns to the hand, Special Summon it. This card cannot attack during the turn it was Special Summoned by this effect.
et: Kui see avatud kaart väljakul naaseb kätte, kutsu see eriliselt välja. See kaart ei saa rünnata sellel käigul, mil see kutsuti eriliselt välja selle efekti abil.

source: Mist Valley Shaman
et: Uduorgu Šamaan

source: Once per turn, you can return 1 other monster you control to the hand, to have this card gain 500 ATK until the End Phase.
et: Korra ühe korra käigu jooksul saad sa tagastada ühe teise koletise, mida sa kontrollid, käesolevasse kätte, et see kaart saaks 500 ATK juurde kuni lõppfaasini.

source: Mist Valley Soldier
et: Uduorgu sõdur

source: While you control this face-up card, any opponent's monster that battles this card, but is not destroyed by battle, returns to its owner's hand at the end of the Damage Step.
et: Kui sa kontrollid seda avatud kaarti, siis iga vastase koletis, mis võitleb selle kaardiga, kuid ei hävine lahingus, naaseb oma omaniku kätte Kahjustuse Etapi lõpus.

source: When this card is destroyed by battle and sent to the Graveyard, inflict 500 damage to your opponent. You can remove from play this card in your Graveyard, along with 1 face-up FIRE monster you control, to add 1 "<M7533>Flamvell Dragnov<M>" from your Deck to your hand.
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse, tekitage oma vastasele 500 kahju. Saate eemaldada mängust selle kaardi oma Hauakambris koos ühe ülespööratud TULEKAHJU koletisega, mida te kontrollite, et lisada 1 "<M7533>Flamvell Dragnov<M>" oma pakist oma kätte.

source: Flamvell Magician
et: Flamvell'i Maag

source: While you control an "Ally of Justice" monster(s), this card gains 400 ATK.
et: Kui sa kontrollid "Õigluse Liitlane" koletist(e), saab see kaart 400 ATK juurde.

source: A Flamvell guardian who commands fire with his will. His magma-hot barrier protects his troops from intruders.
et: Flamvelli valvur, kes juhib tuld oma tahtega. Tema magma-kuum barjäär kaitseb tema vägesid sissetungijate eest.

source: While you control this face-up card, when a face-up "Saber" monster you control is destroyed by battle and sent to the Graveyard, draw 1 card.
et: Kui sa kontrollid seda avatud kaarti, tõmba 1 kaart, kui sinu kontrolli all olev avatud "Saber" koletis hävitatakse lahingus ja saadetakse Hauakambrisse.

source: When this card inflicts Battle Damage to your opponent by a direct attack, discard 1 random card from your opponent's hand.
et: Kui see kaart tekitab sinu vastasele otsese rünnakuga lahingukahju, viska vastase käest juhuslikult ära 1 kaart.

source: When this card destroys an opponent's monster by battle and sends it to the Graveyard, you can Tribute this card to return the destroyed card to the top of its owner's Deck.
et: Kui see kaart hävitab lahingus vastase koletise ja saadab selle Hauakambrisse, võid sa ohverdada selle kaardi, et tagastada hävitatud kaart selle omaniku paki tippu.

source: Commander Gottoms, Swordmaster
et: Komandör Gottoms, Mõõgameister

source: All face-up "Saber" monsters you control gain 400 ATK.
et: Kõik avatud "Saber" koletised, mida sa kontrollid, saavad 400 ATK juurde.

source: Ally of Justice Clausolas
et: Õigluse liitlane Clausolas

source: A mighty monster in Mist Valley, and the ultimate weapon designed from Claiomh Solais. Its surprise attacks from above baffle invaders.
et: Võimas koletis Uduorus, ja Claiomh Solais'ist loodud ülim relv. Selle üllatusrünnakud ülalt ajavad sissetungijad segadusse.

source: Ally of Justice Garadholg
et: Õigluse liitlane Garadholg

source: If this card battles a LIGHT monster, it gains 200 ATK during the Damage Step only.
et: Kui see kaart võitleb VALGUSE koletisega, saab see ainult Kahjustuse Etapi ajal 200 ATK juurde.

source: Ally of Justice Rudra
et: Õigluse Liitlane Rudra

source: If this card battles a LIGHT monster, it gains 700 ATK during the Damage Step only.
et: Kui see kaart võitleb VALGUSE koletisega, saab see ainult Kahjustuse Etapi ajal 700 ATK juurde.

source: Worm Apocalypse
et: Uss Apokalüpsis

source: FLIP: Select and destroy 1 Spell or Trap Card.
et: FLIP: Vali ja hävita 1 Võlu- või Lõksukaart.

source: Worm Barses
et: Uss Barses

source: When this card is Normal Summoned, change 1 Defense Position monster to face-up Attack Position.
et: Kui see kaart on Normaal-Kutsutud, muuda 1 Kaitseasendis olev koletis näoga ülespoole Rünnakuasendisse.

source: Worm Cartaros
et: Uss Cartaros

source: FLIP: Add 1 Level 4 or lower Reptile-Type "Worm" monster from your Deck to your hand.
et: FLIP: Lisa oma pakist 1. taseme 4 või madalama Reptiil-Tüüpi "Worm" koletis oma kätte.

source: Worm Dimikles
et: Uss Dimikles

source: FLIP: This card gains 300 ATK and DEF.
et: FLIP: See kaart saab 300 ATK ja DEF juurde.

source: Worm Erokin
et: Uss Erokin

source: This card cannot be Special Summoned. Once per turn, select 1 face-up Reptile-Type "Worm" monster on the field and change it into face-down Defense Position.
et: Seda kaarti ei saa eriliselt kutsuda. Kord käigu jooksul vali 1 avatud Reptiil-tüüpi "Worm" koletis väljakul ja muuda see tagurpidi kaitsepositsiooniks.

source: Brionac, Dragon of the Ice Barrier
et: Brionac, Jääbarjääri Draakon

source: 1 Tuner + 1 or more non-Tuner monsters<BR>You can discard any number of cards to the Graveyard, to return the same number of cards from the field to the hand.
et: 1 Tuner + 1 või rohkem mitte-Tuner koletist<BR>Sa võid saata suvalise arvu kaarte Hauakambrisse, et sama arv kaarte väljakult kätte tagasi tuua.

source: Mist Wurm
et: Uduuss

source: 1 Tuner + 2 or more non-Tuner monsters<BR>When this card is Synchro Summoned, return up to 3 cards your opponent controls to the hand.
et: 1 Tuner + 2 või rohkem mitte-Tuner koletist<BR>Kui see kaart on Sünkrosummonitud, tagasta kuni 3 kaarti, mida sinu vastane kontrollib, kätte.

source: 1 Tuner + 1 or more non-Tuner monsters<BR>During battle between this attacking card and a Defense Position monster whose DEF is lower than the ATK of this card, inflict the difference as Battle Damage to your opponent. This card gains 300 ATK each time it inflicts Battle Damage to your opponent.
et: 1 Tuner + 1 või rohkem mitte-Tuner koletist<BR>Kui see kaart ründab ja vastase kaitsepositsioonis oleva koletise DEF on madalam kui selle kaardi ATK, tekitab see vahe vastasele lahingukahjuna. See kaart saab 300 ATK iga kord, kui see tekitab vastasele lahingukahju.

source: 1 Tuner + 1 or more non-Tuner monsters<BR>When this card inflicts Battle Damage to your opponent while they have 4 or more cards in their hand, place 1 random card from their hand on top of their Deck.
et: 1 Tuner + 1 või rohkem mitte-Tuner koletist<BR>Kui see kaart tekitab lahingukahju sinu vastasele, kui tal on käes 4 või rohkem kaarti, aseta 1 juhuslik kaart tema käest tema paki peale.

source: Ally of Justice Catastor
et: Õigluse Liitlane Catastor

source: 1 Tuner + 1 or more non-Tuner monsters<BR>If this card battles a non-DARK monster, destroy that monster without applying damage calculation.
et: 1 Tuner + 1 või rohkem mitte-Tuner koletist<BR>Kui see kaart võitleb mitte-PIMEDA koletisega, hävita see koletis ilma kahju arvutust rakendamata.

source: Wrath of Neos
et: Neose viha

source: Select 1 face-up "<M6653>Elemental Hero Neos<M>" you control. Return it to the Deck and destroy all cards on the field.
et: Vali 1 avatud "<M6653>Elemental Hero Neos<M>", mida sa kontrollid. Tagasta see pakki ja hävita kõik kaardid väljal.

source: Detonate
et: Detoneeri

source: Destroy all face-up "<M4064>Kuriboh<M>" and "<M3901>Kuriboh Token<M>" you control, along with a number of cards your opponent controls, up to the number of "<M4064>Kuriboh<M>" and "<M3901>Kuriboh Token<M>" destroyed by this effect.
et: Hävita kõik avatud "<M4064>Kuriboh<M>" ja "<M3901>Kuriboh Token<M>", mida sa kontrollid, koos vastase kontrollitavate kaartidega, kuni hävitatud "<M4064>Kuriboh<M>" ja "<M3901>Kuriboh Token<M>" arvuni selle efekti tõttu.

source: Berserker Crush
et: Berserkeri Purustus

source: Remove from play 1 monster from your Graveyard. The ATK and DEF of 1 face-up "<M6314>Winged Kuriboh<M>" you control becomes equal to the ATK and DEF of that monster, until the End Phase of this turn.
et: Eemalda oma kalmistult mängust 1 koletis. Ühe sinu kontrollitava avatud "<M6314>Tiivuline Kuriboh<M>" rünnak ja kaitse muutuvad selle koletise rünnaku ja kaitsega võrdseks kuni selle käigu lõppfaasini.

source: Evolution Burst
et: Evolutsioonipuhang

source: Activate only while you control a face-up "<M6390>Cyber Dragon<M>"(s). Destroy 1 card your opponent controls. "<M6390>Cyber Dragon<M>" cannot attack the turn you activate this card.
et: Aktiveeri ainult siis, kui sa kontrollid avatud "<M6390>Cyber Dragon<M>"(e). Hävita 1 kaart, mida sinu vastane kontrollib. "<M6390>Cyber Dragon<M>" ei saa rünnata sellel käigul, kui sa aktiveerid selle kaardi.

source: Red-Eyes Darkness Metal Dragon
et: Punasilmne Pimeduse Metallist Draakon

source: You can Special Summon this card by removing from play 1 face-up Dragon-Type monster you control. Once per turn, during your Main Phase, you can Special Summon 1 Dragon-Type monster except "<M6292>Red-Eyes Darkness Dragon<M>" from your hand or Graveyard.
et: Saad selle kaardi eriliselt välja kutsuda, eemaldades mängust 1 ülespoole pööratud Draakoni-tüüpi koletise, mida sa kontrollid. Kord ühe käigu jooksul, oma põhifaasi ajal, saad sa eriliselt välja kutsuda 1 Draakoni-tüüpi koletise, välja arvatud "<M6292>Red-Eyes Darkness Dragon<M>", oma käest või hauast.

source: Gaia Plate the Earth Giant
et: Gaia Plaat Maa Hiiglane

source: You can Special Summon this card by removing from play any 2 Rock-Type monsters in your Graveyard. During your Standby Phase, remove from play 1 Rock-Type monster in your Graveyard, or send this card to the Graveyard. Halve the ATK and DEF of any monster that battles with this card.
et: Sa saad selle kaardi eriliselt välja kutsuda, eemaldades oma kalmistult mängust 2 Kalju-tüüpi koletist. Oma ootejärgus eemalda mängust 1 Kalju-tüüpi koletis oma kalmistult või saada see kaart kalmistule. Poolita selle kaardiga võitleva koletise ATK ja DEF.

source: Sauropod Brachion
et: Sauropood Brachion

source: You cannot Special Summon this card from your Deck. You can Tribute Summon this card by Tributing 1 Dinosaur-Type monster. Once per turn, you can change this card to face-down Defense Position. When this card is Flip Summoned, change all other monsters to face-down Defense Position. If your opponent attacks this card, any Battle Damage they take is doubled.
et: Sa ei saa seda kaarti oma pakist eriliselt kutsuda. Sa saad selle kaardi kutsuda ohverdades 1 Dinosaurus-tüüpi koletise. Kord käigu jooksul saad selle kaardi muuta näoga allapoole kaitsepositsiooni. Kui see kaart on ümber pööratud, muuda kõik teised koletised näoga allapoole kaitsepositsiooni. Kui sinu vastane ründab seda kaarti, siis kõik lahingukahjud, mida nad saavad, on kahekordsed.

source: Tethys, Goddess of Light
et: Tethys, Valguse Jumalanna

source: While this card is face-up on the field, when you draw a Fairy-Type monster(s), you can reveal 1 of those monsters to draw 1 more card.
et: Kui see kaart on lahinguväljal avatud, siis kui sa tõmbad haldjatüüpi koletise(id), võid sa paljastada ühe neist koletistest, et tõmmata veel üks kaart.

source: Dark Grepher
et: Tume Grepher

source: You can discard 1 Level 5 or higher DARK monster to Special Summon this card from your hand. Once per turn, you can discard 1 DARK monster to send 1 DARK monster from your Deck to the Graveyard.
et: Sa saad käest ära visata 1. taseme 5 või kõrgema PIMEDA koletise, et kutsuda see kaart oma käest eriliselt välja. Kord ühe käigu jooksul saad sa käest ära visata 1 PIMEDA koletise, et saata 1 PIMEDA koletis oma pakist hauakambrisse.

source: Darklord Zerato
et: Pimeduseisand Zerato

source: If there are 4 or more DARK monsters with different names in your Graveyard, you can Tribute Summon this monster by Tributing 1 DARK monster. You can send 1 DARK monster from your hand to the Graveyard to destroy all monsters your opponent controls. If you activate this effect, destroy this card during the End Phase of this turn.
et: Kui sinu kalmistul on 4 või rohkem erineva nimega PIMEDUSE koletist, saad selle koletise kutsuda ohverdades 1 PIMEDUSE koletise. Sa saad saata 1 PIMEDUSE koletise oma käest kalmistule, et hävitada kõik koletised, mida sinu vastane kontrollib. Kui aktiveerid selle efekti, hävita see kaart selle käigu lõppfaasis.

source: Darknight Parshath
et: Pimeduse Parshath

source: When this card destroys an opponent's monster, you can remove from play 1 DARK monster from your Graveyard to draw 1 card. This card gains 100 ATK for each DARK monster in your Graveyard.
et: Kui see kaart hävitab vastase koletise, võid eemaldada oma Hauakambrist mängust 1 PIMEDA koletise, et tõmmata 1 kaart. See kaart saab 100 ATK iga PIMEDA koletise eest sinu Hauakambris.

source: Deepsea Macrotrema
et: Sügavmere Makrotrema

source: When this card is sent from the field to the Graveyard, all face-up WATER monsters you control gain 500 ATK until the end of this turn.
et: Kui see kaart saadetakse väljakult hauakambrisse, saavad kõik sinu kontrolli all olevad avatud VEE koletised selle käigu lõpuni 500 ATK juurde.

source: When you Tribute this card for the Tribute Summon of a DARK monster, Special Summon 3 "<M3943>Metabo Token<M>" (Fiend-Type/DARK/Level 1/ATK 0/DEF 0) in Defense Position. These Tokens cannot be Tributed for a Tribute Summon.
et: Kui sa ohverdad selle kaardi PIMEDA koletise ohverdussummoniks, kutsu eriliselt välja 3 "<M3943>Metabo Token<M>" (Deemonitüüp/PIME/Tase 1/ATK 0/DEF 0) kaitseasendis. Neid žetoone ei saa kasutada ohverdussummoniks.

source: Golden Flying Fish
et: Kuldne lendav kala

source: You can Tribute 1 other Fish-Type monster to destroy 1 card on the field.
et: Saad ühe teise Kalatüüpi koletise ohverdada, et hävitada üks kaart väljal.

source: Prime Material Dragon
et: Esimaterjali Draakon

source: Any effect that would inflict damage to a player instead increases their Life Points by the same amount. When a card's effect to destroy a monster(s) on the field is activated, you can send 1 card from your hand to the Graveyard to negate its activation and destroy the card.
et: Mis tahes efekt, mis tekitaks mängijale kahju, suurendab selle asemel tema Elupunkte sama palju. Kui aktiveeritakse kaardi efekt, mis hävitab koletise(d) väljal, võid saata 1 kaardi oma käest Hauakambrisse, et selle aktiveerimine tühistada ja kaart hävitada.

source: Lonefire Blossom
et: Üksikõie Õis

source: Once per turn, you can Tribute 1 face-up Plant-Type monster to Special Summon 1 Plant-Type monster from your Deck.
et: Korra ühe korra käigu jooksul saad sa ohverdada 1 avatud Taim-tüüpi koletise, et Kutsuda Eriliselt välja 1 Taim-tüüpi koletis oma pakist.

source: Aztekipede, the Worm Warrior
et: Aztekipede, Ussõdalane

source: This card cannot be Normal Summoned or Set. This card cannot be Special Summoned except by removing from play 1 Insect-Type monster from your Graveyard. When this card inflicts Battle Damage to your opponent, send the top card of their Deck to the Graveyard.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti ei saa eriliselt kutsuda, välja arvatud eemaldades mängust 1 putukaliigi koletis oma hauakambrist. Kui see kaart tekitab lahingukahju sinu vastasele, saada nende paki ülemine kaart hauakambrisse.

source: Allure of Darkness
et: Pimeduse Võlu

source: Draw 2 cards, then banish 1 DARK monster from your hand, or, if you don't have any in your hand, send all cards in your hand to the Graveyard.
et: Tõmba 2 kaarti, seejärel eemalda oma käest mängust 1 PIMEDUS koletis või, kui sul pole ühtegi käes, saada kõik kaardid oma käest Hauakambrisse.
