Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: Activate only when your opponent Normal Summons a monster. During this turn, Level 4 or lower monsters cannot attack. During the End Phase, inflict 500 damage to your opponent for each Level 4 or lower monster they control.
et: Aktiveeri ainult siis, kui sinu vastane kutsub normaalselt välja koletise. Selle käigu ajal ei saa 4. taseme või madalamad koletised rünnata. Lõppfaasis põhjusta oma vastasele 500 kahju iga 4. taseme või madalama koletise eest, mida nad kontrollivad.

source: Clear Wall
et: Läbipaistev sein

source: If "<M8539>Clear World<M>" is not face-up on the field, destroy this card. Attack Position "Clear" monsters you control cannot be destroyed by battle. All Battle Damage less than 1000 you would take from a battle involving a "Clear" monster you control becomes 0. If you would take 1000 or more damage from a battle involving a "Clear" monster you control, you can destroy this card instead.
et: Kui "<M8539>Clear World<M>" ei ole lahinguväljal avatud, hävita see kaart. Rünnakupositsioonis olevad "Clear" koletised, mida sa kontrollid, ei saa lahingus hävitatud. Kogu lahingukahju, mis on väiksem kui 1000 ja mida sa saaksid lahingus, kus osaleb sinu kontrollitav "Clear" koletis, muutub 0-ks. Kui sa saaksid lahingus, kus osaleb sinu kontrollitav "Clear" koletis, 1000 või rohkem kahju, võid selle kaardi hävitada selle asemel.

source: Attribute Mastery
et: Omaduste Valdamine

source: Declare 1 Attribute. If the equipped monster battles with a monster of the declared Attribute, destroy that monster before damage calculation.
et: Vali 1 omadus. Kui varustatud koletis võitleb valitud omadusega koletisega, hävita see koletis enne kahju arvutamist.

source: Attribute Bomb
et: Atribuudi Pomm

source: Declare an Attribute. When the equipped monster is destroyed by battle by a monster of that Attribute, inflict 1000 damage to your opponent.
et: Kuuluta atribuut. Kui varustatud koletis hävitatakse lahingus selle atribuudi koletise poolt, tekitage oma vastasele 1000 kahju.

source: Attribute Gravity
et: Atribuudi Gravitatsioon

source: If there are face-up monsters of the same Attribute on both player's fields, any monsters able to attack must attack monsters of the same Attribute.
et: Kui mõlemal mängijal on väljal sama atribuudi avatud koletised, peavad kõik rünnata suudavad koletised ründama sama atribuudi koletisi.

source: Attribute Chameleon
et: Atribuudi Kameeleon

source: Once during your opponent's turn, you can select 1 face-up monster your opponent controls and declare 1 Attribute. That monster's Attribute becomes the declared Attribute until the End Phase.
et: Korra oma vastase käigu ajal saad valida 1 avatud koletise, mida su vastane kontrollib, ja kuulutada 1 atribuudi. Selle koletise atribuut muutub kuulutatud atribuudiks kuni lõppfaasini.

source: Amphibian Angel - Frog-Hael
et: Amfiibne ingel - Konn-Hael

source: You can Special Summon this card from your hand by Tributing 2 monsters you control. When you Special Summon it in this way, you can Special Summon as many "Frog" monsters as possible from your Graveyard. While you control other cards, your opponent cannot attack this card.
et: Sa saad selle kaardi oma käest eriliselt välja kutsuda, ohverdades 2 koletist, mida sa kontrollid. Kui sa kutsud selle sel viisil eriliselt välja, saad sa eriliselt välja kutsuda nii palju "Konna" koletisi kui võimalik oma Hauakambrist. Kui sa kontrollid teisi kaarte, ei saa sinu vastane seda kaarti rünnata.

source: Satellite Laser X-06S, Balsam
et: Satelliitlaser X-06S, Balsam

source: 3 × "<M4780>Satellite Cannon<M>"<BR>This monster cannot be Special Summoned except by Fusion Summon. This card cannot be destroyed by battle with a Level 10 or lower monster. During each of your End Phases, this card gains 3000 ATK. If this card attacks, its ATK is reduced to 0, after damage calculation. If this card attacks a Defense Position monster, inflict piercing Battle Damage to your opponent.
et: 3 × "<M4780>Satelliitkahur<M>"<BR>Seda koletist ei saa eriliselt kutsuda, välja arvatud fusion summon'i teel. Seda kaarti ei saa hävitada lahingus 10. või madalama tasemega koletisega. Iga sinu lõppfaasi ajal saab see kaart 3000 ATK juurde. Kui see kaart ründab, väheneb selle ATK pärast kahju arvutamist 0-ks. Kui see kaart ründab kaitseasendis koletist, tekitab see vastasele läbistavat lahingukahju.

source: Power Zone
et: Võimuala

source: If a monster is destroyed by battle, its controller takes damage equal to its original ATK.
et: Kui koletis hävitatakse lahingus, saab selle juht kahju, mis on võrdne selle algse rünnakuga.

source: Toon Kingdom
et: Multikate Kuningriik

source: When you activate this card, remove from play the top 5 cards of your Deck. This face-up card's name is treated as "<M4798>Toon World<M>". If a "Toon" monster you control would be destroyed by battle, you can remove from play the top card of your Deck instead.
et: Kui aktiveerid selle kaardi, eemalda mängust oma paki 5 ülemist kaarti. Selle avatud kaardi nimeks loetakse "<M4798>Toon World<M>". Kui sinu kontrollitav "Toon" koletis hävitatakse lahingus, võid selle asemel eemaldada mängust oma paki ülemise kaardi.

source: Berserker Soul
et: Berserkeri Hing

source: Activate by selecting 1 monster you control with ATK of 1500 or less that declared a direct attack during your Battle Phase and discarding your entire hand. Draw 1 card and show it to your opponent. If it is a Monster Card, send it to the Graveyard and inflict damage to your opponent equal to the ATK of the monster you selected. This effect repeats until you draw a non-Monster Card.
et: Aktiveeri, valides 1 koletise, mida sa kontrollid ja mille ATK on 1500 või vähem ning mis kuulutas välja otsese rünnaku sinu Lahingu Faasis, ja visates kogu oma käe ära. Tõmba 1 kaart ja näita seda oma vastasele. Kui see on Koletise Kaart, saada see Hauakambrisse ja tekita oma vastasele kahju, mis on võrdne valitud koletise ATK-ga. See efekt kordub, kuni tõmbad mitte-Koletise Kaardi.

source: Diving Exploder
et: Sukeldumispurustaja

source: You can send this card from your hand to the Graveyard to switch the ATK and DEF of all face-up monsters on the field, until the End Phase. You can activate this Effect during either player's turn.
et: Saad selle kaardi oma käest Hauakambrisse, et vahetada kõigi lahinguväljal olevate avatud koletiste ATK ja DEF kuni Lõppfaasini. Sa saad selle Efekti aktiveerida mõlema mängija käigu ajal.

source: Once per turn, you can Tribute 1 non-Token monster to destroy 1 monster on the field whose Level is higher than the Tributed monster's, and inflict 800 damage to its controller.
et: Korra ühe korra käigu jooksul saad sa ohverdada ühe mitte-tokeni koletise, et hävitada üks koletis väljakul, mille tase on kõrgem kui ohverdatud koletisel, ja tekitada selle valdajale 800 kahju.

source: Contaminated Earth
et: Saastunud Maa

source: Activate only when 1 Level 5 or higher monster you control is destroyed and sent to the Graveyard. Special Summon 1 "Earthbound Immortal" monster from your hand, Deck, or Graveyard. This turn, that monster cannot attack or activate its Effects.
et: Aktiveeri ainult siis, kui üks sinu kontrollitav 5. või kõrgema taseme koletis hävitatakse ja saadetakse Hauakambrisse. Kutsu eriliselt välja 1 "Earthbound Immortal" koletis oma käest, pakist või Hauakambrist. Sellel käigul ei saa see koletis rünnata ega aktiveerida oma Efekte.

source: Red Nova
et: Punane Nova

source: If you control a face-up1 "<M7735>Red Demon's Dragon<M>", you can Special Summon this card from your hand.
et: Kui sa kontrollid avatud1 "<M7735>Red Demon's Dragon<M>", saad selle kaardi oma käest eriliselt kutsuda.

source: Mirror Resonator
et: Peegli Resonaator

source: If your opponent controls a face-up Synchro Monster, you can Special Summon this card from your hand. When this Card is successfully Special Summoned this way, this card's Level becomes equal to the Level of 1 of your opponent's Synchro Monsters.
et: Kui sinu vastane kontrollib avatud Sünkro Koletist, saad selle kaardi oma käest eriliselt kutsuda. Kui see kaart on sel viisil edukalt eriliselt kutsutud, muutub selle kaardi tase võrdseks ühe sinu vastase Sünkro Koletise tasemega.

source: Chain Resonator
et: Ahela resonaator

source: When this Card is Normal Summoned, If there is a face-up Synchro Monster on the field, you can Special Summon 1 "Resonator" monster from your Deck.
et: Kui see kaart on normaal-summonitud ja väljal on ülespoole suunatud sünkromonster, saad oma pakist spetsiaalselt summonida 1 "Resonaator" monstert.

source: Mach Synchron
et: Mach Sünkron

source: During the End Phase of the turn where this card is used as a Synchro Material Monster, you can return 1 of the other Synchro Material Monsters from the Graveyard to your hand.
et: End Phase'i ajal, mil see kaart on kasutatud Sünkro Materjal Koletisena, võid sa ühe teise Sünkro Materjal Koletise Hauakambrist oma kätte tagasi tuua.

source: High and Low
et: Kõrge ja Madal

source: Activate only when a monster you control is selected as an attack target. Send the top card of your Deck to the Graveyard. If that card is a Monster Card, the attack target gains ATK equal to the sent monster's ATK. This effect can be used up to 3 times. If the attack target's ATK becomes higher than that of the attacking monster by this card's effect, destroy it.
et: Aktiveeri ainult siis, kui sinu kontrollitav koletis valitakse rünnaku sihtmärgiks. Saada oma paki pealmine kaart Hauakambrisse. Kui see kaart on Koletise Kaart, saab rünnaku sihtmärk ATK-d, mis on võrdne saadetud koletise ATK-ga. Seda efekti saab kasutada kuni 3 korda. Kui rünnaku sihtmärgi ATK muutub selle kaardi efekti tõttu kõrgemaks kui ründava koletise ATK, hävita see.

source: Gathering Wishes
et: Soovide Kogumine

source: If you have 5 or more Dragon-Type Synchro Monsters in your Graveyard: Special Summon 1 "<M7734>Stardust Dragon<M>" from your Extra Deck, and equip it with this card; it gains ATK equal to the combined ATK of all Dragon-Type Synchro Monsters in your Graveyard. When it destroys your opponent's monster by battle, you can return 1 Dragon-Type Synchro Monster in your Graveyard to your Extra Deck to have it attack again. During this turn's End Phase, banish the1 "<M7734>Stardust Dragon<M>" Special Summoned this way.
et: Kui sul on oma Hauakambris 5 või rohkem Sünkro Draakonitüüpi Koletist: Kutsu välja 1 "<M7734>Stardust Dragon<M>" oma Lisapakist ja varusta see selle kaardiga; see saab ATK, mis on võrdne kõigi sinu Hauakambris olevate Sünkro Draakonitüüpi Koletiste kombineeritud ATK-ga. Kui see hävitab lahingus sinu vastase koletise, võid sa oma Hauakambrist ühe Sünkro Draakonitüüpi Koletise oma Lisapakki tagasi panna, et see saaks uuesti rünnata. Selle käigu lõppfaasis, pagenda see "<M7734>Stardust Dragon<M>", mis kutsuti välja sel viisil.

source: Insect Monster Token
et: Putuka Koletise Märk

source: Special Summon with the effect of "<M4768>Insect Queen<M>".
et: Erikutsuge "<M4768>Putukakuninganna<M>" efektiga.

source: Special Summon with the effect of "<M4805>Multiply<M>". This Token cannot be used as Tribute for a Tribute Summon.
et: Eriefekti "<M4805>Multiply<M>" abil. Seda žetooni ei saa kasutada ohverdusena ohverdussummoniks.

source: Sheep Token
et: Lamba žetoon

source: Special Summon with the effect of "<M4818>Scapegoat<M>". This Token cannot be used as Tribute for a Tribute Summon.
et: Eriliselt kutsutud "<M4818>Scapegoat<M>" efekti abil. Seda žetooni ei saa kasutada ohverdusena ohverdussummoni jaoks.

source: Army Ant Token
et: Armee Sipelga Maatükk

source: Special Summon with the effect of "<M5116>Multiplication of Ants<M>". This Token cannot be used as Tribute for a Tribute Summon.
et: Erikutsuge "<M5116> Sipelgate paljunemine <M>" efektiga. Seda žetooni ei saa kasutada ohverdusena ohverdussummoniks.

source: Slime Token
et: Limatoken

source: Special Summon with the effect of "<M5119>Jam Breeding Machine<M>".
et: Erikutsuge "<M5119>Jam Breeding Machine<M>" efektiga.

source: Wicked Token
et: Paha Maatükk

source: Special Summon with the effect of "<M5443>Statue of the Wicked<M>".
et: Erikutsuge "<M5443>Kurja kuju<M>" efektiga.

source: Poisonous Snake Token
et: Mürgine Madu Token

source: Special Summon with the effect of "<M5525>Cobra Jar<M>". When this Token is destroyed as a result of battle, inflict 500 points of damage to your opponent's Life Points.
et: Erikutsuge "<M5525>Cobra Jar<M>" efekti abil. Kui see Token hävitatakse lahingu tulemusena, põhjusta oma vastase Elupunktidele 500 punkti kahju.

source: Special Summon with the effect of "<M5564>Lekunga<M>".
et: Erikutsuge "<M5564>Lekunga<M>" efekti abil.

source: Clone Token
et: Klooni Maatriks

source: Special Summon with the effect of "<M5574>Cloning<M>". If the monster is destroyed and sent to the Graveyard, destroy this Token.
et: Erikutsuge "<M5574>Cloning<M>" efektiga. Kui koletis hävitatakse ja saadetakse Hauakambrisse, hävita see Token.

source: Wicked Plant Token
et: Kuri taime token

source: Special Summon with the effect of "<M5589>Des Dendle<M>".
et: Erikutsuge "<M5589>Des Dendle<M>" efektiga.

source: Special Summon with the effect of "<M5621>Physical Double<M>". Destroy this Token at the end of the turn.
et: Erikutsuge "<M5621>Physical Double<M>" efektiga. Hävita see Token käigu lõpus.

source: Metal Fiend Token
et: Metallikuradi Mängunupp

source: Special Summon with the effect of “<M5632>Fiend's Sanctuary<M>”. This Token cannot attack. Your opponent takes any battle damage you would have taken from battles involving This Monster. During each of your Standby Phases, pay 1000 Life Points or destroy this Token.
et: Erikutsuge “<M5632>Deemonite Pühamu<M>” efektiga. See Token ei saa rünnata. Sinu vastane saab kogu lahingukahju, mida sa oleksid saanud selle koletisega seotud lahingutest. Iga oma ootejärgu faasi ajal maksa 1000 elupunkti või hävita see Token.

source: Ojama Token
et: Ojama Maatriks

source: Special Summon with the effect of “<M5738>Ojama Trio<M>”. When This Card is destroyed, the controller of this token takes 300 points of damage.
et: Erikutsuge “<M5738>Ojama Trio<M>” efektiga. Kui see kaart hävitatakse, saab selle žetooni kontrollija 300 punkti kahju.

source: Lamb Token
et: Talleke Token

source: Special Summon with the effect of “<M5904>Stray Lambs<M>”.
et: Erikutsuge “<M5904>Eksinud Lambad<M>” efektiga.

source: Tricky Token
et: Trikikaart

source: Special Summon with the effect of "<M6158>Tricky Spell 4<M>". This Token cannot declare an attack.
et: Erikutsuge "<M6158>Tricky Spell 4<M>" efektiga. See Token ei saa rünnakut kuulutada.

source: Block Token
et: Blokeeringu Määr

source: Special Summon with the effect of "<M6160>Blockman<M>". This Token cannot declare an attack.
et: Eriliselt kutsutud "<M6160>Blockman<M>" efekti abil. See Token ei saa rünnakut kuulutada.

source: Emissary of Darkness Token
et: Pimeduse Emissari Token

source: Special Summon with the effect of “<M6558>Gorz the Emissary of Darkness<M>”. This Token's ATK and DEF are each equal to the amount of Battle Damage you took.
et: Erikutsummon “<M6558>Pimeduse Emissar Gorz<M>” efekti abil. Selle Tokeni ATK ja DEF on võrdsed saadud lahingukahju suurusega.

source: Phantasm Token
et: Fantaasiatoken

source: Special Summon with the effect of “<M6565>Raviel, Lord of Phantasms<M>”. This Token cannot declare an attack.
et: Eriefekti „<M6565>Raviel, Fantoomide Isand<M>“ abil eri kutsutud. See Token ei saa rünnakut kuulutada.

source: Phantasmal Martyr Token
et: Fantoomohvri märteritoken

source: Special Summon with the effect of "<M6575>Phantasmal Martyrs<M>".
et: Erikutsuge "<M6575>Fantasmilised Märtrid<M>" efektiga.

source: Fluff Token
et: Kohev Token

source: Special Summon with the effect of “<M6654>Dandylion<M>”. This Token cannot be Tributed for a Tribute Summon during the turn it is Special Summoned.
et: Erikutsuge “<M6654>Dandylion<M>” efektiga. Seda Tokenit ei saa pakkuda ohvriks Tribuutkutsumise jaoks sellel käigul, mil see on Erikutsutud.

source: Option Token
et: Valiku Maatriks

source: Special Summon with the effect of "<M6684>Victory Viper XX03<M>" or "<M6706>Power Capsule<M>". This token always has the same Type, Attribute, Level, ATK and DEF as "<M6684>Victory Viper XX03<M>".
et: Eriliselt kutsutud "<M6684>Victory Viper XX03<M>" või "<M6706>Power Capsule<M>" efektiga. Sellel tokenil on alati sama tüüp, omadus, tase, ATK ja DEF nagu "<M6684>Victory Viper XX03<M>".

source: Synthetic Seraphim Token
et: Sünteetiline Serafiimi Mängunupp

source: Special Summon with the effect of "<M6711>Synthetic Seraphim<M>".
et: Erikutsuge "<M6711>Sünteetiline Serafiim<M>" efekti abil.

source: Double Dude Token
et: Topeltkutt Mängunupp

source: Special Summon with the Effect of "<M6754>Destiny Hero - Double Dude<M>”.
et: Erikutsuge "<M6754>Saatuskangelane - Topeltkutt<M>” efekti abil.

source: Eva Token
et: Eva Mängunupp

source: Special Summon with the effect of "<M6794>Zeta Reticulant<M>".
et: Erikutsuge "<M6794>Zeta Reticulant<M>" efekti abil.

source: Fireball Token
et: Tulepalli Mängunupp

source: Special Summon with the effect of "<M6920>Goka, the Pyre of Malice<M>".
et: Erikutsummon "<M6920>Goka, the Pyre of Malice<M>" efekti abil.

source: Wild Fire Token
et: Metsiku Tule Token

source: Special Summon with the effect of "<M7089>Wild Fire<M>".
et: Erikutsuge "<M7089>Wild Fire<M>" efektiga.

source: Cloudian Token
et: Pilveke Token

source: Special Summon with the effect of "<M7267>Cloudian - Sheep Cloud<M>". This Token cannot be Tributed for a Tribute Summon unless for a "Cloudian" monster.
et: Erikutsuge "<M7267>Cloudian - Sheep Cloud<M>" efektiga. Seda žetooni ei saa kasutada ohverdusväljakutse jaoks, välja arvatud "Cloudian" koletise jaoks.

source: Engine Token
et: Mootori Maatriks

source: Special Summon with the effect of "<M7331>Fiendish Engine Ω<M>".
et: Erikutsummon "<M7331>Fiendish Engine Ω<M>" efekti abil.

source: Skyblaster Token
et: Taevaplahvatuse Mängunupp

source: Special Summon with the effect of “<M7384>Phantom Skyblaster<M>”.
et: Erikutsuge “<M7384>Phantom Skyblaster<M>” efekti abil.

source: Grinder Token
et: Grinderi Maatriks

source: Special Summon with the effect of “<M7386>Grinder Golem<M>”.
et: Erikutsummon “<M7386>Grinder Golem<M>” efekti abil.

source: Regenerating Rose Token
et: Taastuv Roosi Token

source: Special Summon with the effect of “<M7408>Regenerating Rose<M>”.
et: Erikutsuge “<M7408>Regenerating Rose<M>” efektiga.

source: Special Summon with the effect of "<M7438>Blue Thunder T-45<M>". This Token cannot be Tributed for a Tribute Summon.
et: Erikutsuge "<M7438>Blue Thunder T-45<M>" efektiga. Seda žetooni ei saa kasutada ohverdusmonstrumi kutsumiseks.

source: Evil Token
et: Kuri Token

source: Special Summon with the effect of “<M7446>Vicious Claw<M>”.
et: Erikutsummon “<M7446>Vicious Claw<M>” efekti abil.

source: Doomsday Token
et: Hukatusetähis

source: Special Summon with the effect of “<M7454>Fires of Doomsday<M>”. This Token cannot be Tributed for a Tribute Summon, unless it is for a DARK monster.
et: Erikutsuge “<M7454>Hukatusetulede<M>” efektiga. Seda žetooni ei saa kasutada ohverdussummoniks, välja arvatud juhul, kui see on PIMEDA koletise jaoks.

source: Sinister Seed Token
et: Kurjuse Seemne Mängunupp

source: Special Summon with the effect of “<M7464>Sinister Seeds<M>”.
et: Erikutsuge “<M7464>Sinister Seeds<M>” efektiga.

source: Moon Token
et: Kuu Maatriks

source: Special Summon with the effect of “<M7588>Arcana Force XVIII - The Moon<M>”.
et: Erikutsuge “<M7588>Arcana Force XVIII - The Moon<M>” efekti abil.

source: Special Summon with the effect of "<M7565>Metabo Globster<M>". This Token cannot be used as a Tribute for a Tribute Summon.
et: Erikutsuge "<M7565>Metabo Globster<M>" efektiga. Seda Tokenit ei saa kasutada ohverdusena Ohverdus Summoni jaoks.

source: Oyster Token
et: Austeri žetoon

source: Special Summon with the effect of "<M7663>Oyster Meister<M>".
et: Erikutsuge "<M7663>Oyster Meister<M>" efektiga.

source: Ice Coffin Token
et: Jääkirstu Maatriks

source: Special Summon with the effect of "<M7813>Royal Knight of the Ice Barrier<M>". This Token cannot be used as a Tribute for a Tribute Summon.
et: Erikutsuge "<M7813>Jääbarjääri Kuninglik Rüütel<M>" efektiga. Seda Tokenit ei saa kasutada ohverdusena Ohverdus Summoniks.

source: Ivy Token
et: Ivy Maatriks

source: Special Summon with the effect of "<M7872>Wall of Ivy<M>". When it is destroyed, the controller will take 300 point of damage to their Life Points.
et: Erikutsuge "<M7872>Luuderohi sein<M>" efektiga. Kui see hävitatakse, saab selle kontrollija 300 punkti kahju oma Elupunktidele.

source: Horseytail Token
et: Hobusesaba Mängunupp

source: Special Summon with the effect of "<M7669>Horseytail<M>". When this Token is destroyed by battle with a Plant-Type monster, its controller sends 1 card from their hand to the Graveyard.
et: Erikutsuge "<M7669>Horseytail<M>" efektiga. Kui see Token hävitatakse lahingus Taimetüüpi koletisega, saadab selle kontrollija ühe kaardi oma käest Hauakambrisse.

source: Rose Token
et: Roosi Maatriks

source: Special Summon with the effect of "<M7904>Black Garden<M>".
et: Erikutsuge "<M7904>Must Aed<M>" efektiga.

source: Gift Fiend Token
et: Kingitusdeemon Token

source: Special Summon with the effect of "<M7923>Revival Gift<M>".
et: Erikutsumiskutse "<M7923>Revival Gift<M>" efektiga.

source: Plant Token
et: Taimemärgis

source: Special Summon with the effect of"<M7930>Bamboo Scrap<M>".
et: Erikutsuge "<M7930>Bambuse jäägid<M>" efektiga.

source: Seed Token
et: Seemne Token

source: Special Summon with the effect of "<M8078>Seed of Flame<M>". This Token cannot be used as a Tribute for a Tribute Summon
et: Erikutsugeerige "<M8078>Leegiseeme<M>" efektiga. Seda žetooni ei saa kasutada ohverdusena ohverdussummoniks

source: Needle Token
et: Nõela Maatriks

source: Special Summon with the effect of "<M8079>Cactus Fighter<M>".
et: Erikutsuge "<M8079>Kaktuse Võitleja<M>" efektiga.

source: Nightmare Archfiend Token
et: Õudusunenäo Arhidemoni Mängunupp

source: Special Summon with the effect of "<M8063>Nightmare Archfiends<M>". When it is destroyed, the controller will take 800 points of damage to their Life Points.
et: Eriefektiga "<M8063>Nightmare Archfiends<M>" erikutsumine. Kui see hävitatakse, saab selle kontrollija 800 punkti kahju oma Elupunktidele.

source: Spinos Token
et: Spinosi žetoon

source: Special Summon with the effect of "<M8241>Jurrac Spinos<M>".
et: Erikutsuge "<M8241>Jurrac Spinos<M>" efektiga.

source: Special Summoned with "<M8154>Rockstone Warrior<M>". This card cannot Tributed for a Tribute Summon.
et: Eriliselt välja kutsutud kaardiga "<M8154>Rockstone Warrior<M>". Seda kaarti ei saa kasutada ohverdusena ohverdussummoniks.

source: Special Summon with the effect of "<M8287>Darklord Asmodeus<M>". This Token cannot be destroyed by a card effect.
et: Erikutsuge "<M8287>Darklord Asmodeus<M>" efektiga. Seda tokenit ei saa kaardi efektiga hävitada.

source: Special Summon with the effect of "<M8287>Darklord Asmodeus<M>". This Token cannot be destroyed by battle.
et: Erikutsuge "<M8287>Darklord Asmodeus<M>" efektiga. Seda Tokenit ei saa lahingus hävitada.

source: Ghost Token
et: Kummituse Maatükk

source: Summoned with "<M8361>Damage Translation<M>".
et: Kutsutud "<M8361>Damage Translation<M>" abil.

source: Jurrac Token
et: Jurraci Maatriks

source: Special Summon by the effect of "<M8398>Jurrac Stauriko<M>". This Token cannot be Tributed for a Tribute Summon unless for a "Jurrac" monster.
et: Eriefekti "<M8398>Jurrac Stauriko<M>" abil eriliselt välja kutsutud. Seda Tokenit ei saa kasutada ohverdusväljakutse jaoks, välja arvatud "Jurrac" koletise jaoks.

source: Worm Token
et: Ussitoken

source: Special Summon with the effect of "<M8518>Worm Bait<M>".
et: Erikutsuge "<M8518>Worm Bait<M>" efektiga.
