Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: You can only activate this card during your opponent's Standby Phase. Your opponent cannot conduct his/her Battle Phase this turn.
et: Seda kaarti saad aktiveerida ainult oma vastase Ootefaasil. Sinu vastane ei saa sellel käigul oma Lahingufaasi läbi viia.

source: Spell Shield Type-8
et: Loitsukilp Tüüp-8

source: Select and activate 1 of these effects:<BR>● Negate the activation and the effect of a Spell Card that targets 1 monster on the field and destroy the Spell Card.<BR>● Send 1 Spell Card from your hand to the Graveyard to negate the activation and the effect of a Spell Card and destroy it.
et: Vali ja aktiveeri üks nendest efektidest:<BR>● Tühista ühe Väljal oleva koletise sihtmärgiks oleva Loitsukaardi aktiveerimine ja efekt ning hävita Loitsukaart.<BR>● Saada üks Loitsukaart oma käest Hauakambrisse, et tühistada Loitsukaardi aktiveerimine ja efekt ning hävitada see.

source: During this turn, when your monsters attack with an ATK that is higher than the DEF of your opponent's Defense Position monster, inflict the difference as Battle Damage to your opponent's Life Points.
et: Selle käigu jooksul, kui sinu koletised ründavad ATK-ga, mis on kõrgem kui sinu vastase kaitsepositsioonis oleva koletise DEF, tekitatakse vahe lahingukahjuna sinu vastase elupunktidele.

source: Pineapple Blast
et: Ananassi Plahvatus

source: You can only activate this card when you Normal Summon a monster successfully. If there are more monsters on your opponent's side of the field than your side, destroy your opponent's monsters, so that your opponent controls the same number of monsters as you. Your opponent selects which monsters are destroyed.
et: Seda kaarti saab aktiveerida ainult siis, kui sa kutsud edukalt välja koletise. Kui sinu vastase väljakul on rohkem koletisi kui sinu väljakul, hävita oma vastase koletised nii, et sinu vastasel oleks sama palju koletisi kui sinul. Sinu vastane valib, millised koletised hävitatakse.

source: Secret Barrel
et: Salajane Tünn

source: Inflict damage to your opponent equal to the total number of cards on your opponent's side of the field and in your opponent's hand x 200.
et: Tekita oma vastasele kahju, mis on võrdne sinu vastase väljaku poolel ja vastase käes olevate kaartide koguarvuga x 200.

source: Physical Double
et: Füüsiline Kaksik

source: You can only activate this card during your opponent's turn. Select 1 monster on your opponent's side of the field, and Special Summon 1 "<M3913>Mirage Token<M>" in face-up Attack or Defense Position on your side of the field. The "<M3913>Mirage Token<M>" has the same Level, Type, Attribute, ATK, and DEF as the selected monster. Destroy the "<M3913>Mirage Token<M>" at the end of the turn.
et: Seda kaarti saad aktiveerida ainult oma vastase käigu ajal. Vali 1 koletis oma vastase väljaku poolelt ja Kutsu Eriliselt esile 1 "<M3913>Mirage Token<M>" oma väljaku poolele avatud Rünnaku või Kaitseasendis. "<M3913>Mirage Token<M>" omab sama Tase, Tüüp, Atribuut, RÜN ja KAIT kui valitud koletis. Hävita "<M3913>Mirage Token<M>" käigu lõpus.

source: Rivalry of Warlords
et: Sõjapealike rivaalitsemine

source: Each player sends monsters they control to the Graveyard so that they only control 1 Type of monster. Each player can only control 1 Type of monster.
et: Iga mängija saadab oma kontrollitavad koletised Hauakambrisse nii, et nad kontrolliksid ainult ühte tüüpi koletist. Iga mängija saab kontrollida ainult ühte tüüpi koletist.

source: Formation Union
et: Liidu Formatsioon

source: Select and activate 1 of the following effects:<BR>● Equip 11 Union Monster on your side of the field to an appropriate monster on your side of the field as an Equip Spell Card.<BR>● Unequip 1 of your equipped1 Union Monster and Special Summon it to your side of the field in face-up Attack Position.
et: Vali ja aktiveeri üks järgmistest efektidest:<BR>● Varusta 1 Union Monster oma väljaku poolel sobivale koletisele oma väljaku poolel kui Varustusloitsu Kaart.<BR>● Eemalda varustuselt 1 oma varustatud Union Monster ja Kutsu see oma väljaku poolele eriliselt Nähtavas Rünnakupositsioonis.

source: Adhesion Trap Hole
et: Adhesiooni lõksuauk

source: Activate only when your opponent Summons a monster(s). While that monster(s) is face-up on the field, its original ATK is halved.
et: Aktiveeri ainult siis, kui su vastane kutsub välja koletise(d). Kuni see koletis(ed) on lahinguväljal avatud, on selle algne rünnakupunktide arv poole väiksem.

source: XZ-Tank Cannon
et: XZ-Tank Kahur

source: "<M5504>X-Head Cannon<M>" + "<M5555>Z-Metal Tank<M>"<BR>This card cannot be Special Summoned except by removing from play the above monsters on your side of the field; then you can Special Summon this card from your Extra Deck. (You do not use "<M4837>Polymerization<M>"). Discard 1 card from your hand to destroy 1 face-down Spell or Trap Card on your opponent's side of the field.
et: "<M5504>X-Head Cannon<M>" + "<M5555>Z-Metal Tank<M>"<BR>Seda kaarti ei saa eriliselt kutsuda, välja arvatud, kui eemaldate mängust ülaltoodud koletised oma väljalt; seejärel saate selle kaardi oma lisapakist eriliselt kutsuda. (Te ei kasuta "<M4837>Polymerization<M>"). Visake 1 kaart oma käest, et hävitada 1 vastase väljaku allapoole suunatud loitsu- või lõksukaart.

source: "<M5552>Y-Dragon Head<M>" + "<M5555>Z-Metal Tank<M>"<BR>This card cannot be Special Summoned except by removing from play the above monsters on your side of the field; then you can Special Summon this card from your Extra Deck (You do not use "<M4837>Polymerization<M>"). Discard 1 card from your hand to destroy 1 face-down Monster Card on your opponent's side of the field.
et: "<M5552>Y-Dragon Head<M>" + "<M5555>Z-Metal Tank<M>"<BR>Seda kaarti ei saa eriliselt kutsuda, välja arvatud, kui eemaldate mängust ülaltoodud koletised oma väljalt; seejärel saate selle kaardi oma lisapakist eriliselt kutsuda (Te ei kasuta "<M4837>Polymerization<M>"). Visake 1 kaart oma käest, et hävitada 1 vastase väljapoole suunatud koletisekaart.

source: Final Attack Orders
et: Lõplik Rünnakukäsk

source: All face-up monsters on the field are changed to Attack Position and their battle positions cannot be changed.
et: Kõik avatud positsioonis olevad koletised väljakul muudetakse rünnakupositsiooni ja nende lahingupositsioone ei saa muuta.

source: Dark Paladin
et: Tume Paladiin

source: "<M4041>Dark Magician<M>" + "<M4983>Buster Blader<M>"<BR>This card cannot be Special Summoned except by Fusion Summon. While this card is face-up on the field, you can discard 1 card to negate the activation of a Spell Card and destroy it. This card gains 500 ATK for each Dragon-Type monster on the field and in either player's Graveyard.
et: "<M4041>Tume Maag<M>" + "<M4983>Buster Blader<M>"<BR>Seda kaarti ei saa eriliselt kutsuda, välja arvatud Fusion Summoniga. Kui see kaart on väljakul avatud, võid sa ühe kaardi ära visata, et tühistada loitsukaardi aktiveerimine ja see hävitada. See kaart saab 500 ATK iga draakonitüüpi koletise eest, mis on väljakul ja mõlema mängija hauakambris.

source: Double Spell
et: Kahekordne Loits

source: Discard 1 Spell Card from your hand. Select 1 Spell Card from your opponent's Graveyard and use it from the Graveyard as your Spell Card.
et: Viska 1 loitsukaart oma käest. Vali 1 loitsukaart oma vastase hauakambrist ja kasuta seda hauakambrist oma loitsukaardina.

source: Spell Absorption
et: Loitsu Neeldumine

source: Each time a Spell Card is activated, gain 500 Life Points immediately after it resolves.
et: Iga kord, kui aktiveeritakse Võlukaar, saad kohe pärast selle lahendamist 500 Elupunkti juurde.

source: Diffusion Wave-Motion
et: Difusioonilaine-liikumine

source: Pay 1000 Life Points. Select 1 Level 7 or higher Spellcaster-Type monster on your side of the field. During this turn, only the selected monster can attack and it attacks all monsters on your opponent's side of the field once each. The effects of Effect Monsters destroyed by this attack(s) are not activated.
et: Makske 1000 Elupunkti. Vali 1. taseme 7 või kõrgem Võluri-tüüpi koletis oma väljaku poolel. Selle käigu ajal saab rünnata ainult valitud koletis ja see ründab kõiki vastase väljaku poolel olevaid koletisi üks kord. Selle rünnaku(te)ga hävitatud Efektikoletiste efektid ei aktiveeru.

source: Fiend's Sanctuary
et: Deemoni pühamu

source: Special Summon 1 "<M3914>Metal Fiend Token<M>" (Fiend-Type/DARK/Level 1/ATK 0/DEF 0). It cannot attack. When this Token battles, the opponent takes any Battle Damage its controller would have taken. Pay 1000 Life Points during each of your Standby Phases. If you do not, destroy the "<M3914>Metal Fiend Token<M>".
et: Erikutsuge 1 "<M3914>Metallkuradi Maatriks<M>" (Deemonitüüp/PIMEDUS/Tase 1/ATK 0/DEF 0). See ei saa rünnata. Kui see Maatriks võitleb, saab vastane kogu Lahingukahju, mida selle kontrollija oleks saanud. Maksa iga oma Ootefaaside ajal 1000 Elupunkti. Kui sa seda ei tee, hävita "<M3914>Metallkuradi Maatriks<M>".

source: Great Angus
et: Suur Angus

source: A very violent beast, it is always berserk. People say that they have never seen it silent.
et: Väga vägivaldne metsaline, see on alati raevukas. Inimesed ütlevad, et nad pole seda kunagi vaikides näinud.

source: He seems to be very unreliable, but he might have incredible potential.
et: Ta tundub olevat väga ebausaldusväärne, kuid tal võib olla uskumatu potentsiaal.

source: Sonic Duck
et: Sonicu part

source: A duck which can walk at a sonic speed. Sometimes, he cannot deal with his incredible pace and loses control.
et: Part, kes suudab kõndida helikiirusel. Mõnikord ei suuda ta oma uskumatut tempot taltsutada ja kaotab kontrolli.

source: Luster Dragon
et: Lusterdraakon

source: A very beautiful dragon covered with sapphire. It does not like fights, but has incredibly high attack power.
et: Väga ilus safiiriga kaetud draakon. See ei armasta võitlusi, kuid tal on uskumatult kõrge ründejõud.

source: Amazoness Paladin
et: Amazoonlaste paladiin

source: This card gains 100 ATK for each "Amazoness" monster you control.
et: See kaart saab 100 ATK iga "Amazoness" koletise eest, mida sa kontrollid.

source: Amazoness Blowpiper
et: Amazoonia puhur

source: Select 1 face-up monster your opponent controls during each of your Standby Phases. It loses 500 ATK until the end of this turn.
et: Vali iga oma ootejärgu ajal 1 vastase avatud koletis. See kaotab 500 ATK kuni selle käigu lõpuni.

source: Amazoness Tiger
et: Amazoonia Tiiger

source: You can only control 1 "<M5647>Amazoness Tiger<M>". This card gains 400 ATK for each "Amazoness" monster you control. Your opponent cannot attack another "Amazoness" monster.
et: Sa saad kontrollida ainult 1 "<M5647>Amazoness Tiger<M>". See kaart saab 400 ATK iga "Amazoness" koletise eest, mida sa kontrollid. Sinu vastane ei saa rünnata teist "Amazoness" koletist.

source: Skilled White Magician
et: Osav Valge Maag

source: Each time you or your opponent activates 1 Spell Card, put 1 Spell Counter on this card (max 3). By Tributing this card with 3 Spell Counters on it, Special Summon 1 "<M4983>Buster Blader<M>" from your hand, Deck, or Graveyard.
et: Iga kord, kui sina või sinu vastane aktiveerib 1 Võlukaardi, pane sellele kaardile 1 Võluloendur (max 3). Ohverdades selle kaardi, millel on 3 Võluloendurit, kutsu eriliselt välja 1 "<M4983>Buster Blader<M>" oma käest, pakist või hauast.

source: Skilled Dark Magician
et: Osav Tume Maag

source: Each time a Spell Card is activated, place 1 Spell Counter on this card (max. 3). You can Tribute this card with 3 Spell Counters on it to Special Summon 1 "<M4041>Dark Magician<M>" from your hand, Deck, or Graveyard.
et: Iga kord, kui aktiveeritakse Võlukaart, aseta sellele kaardile 1 Võluloendur (maks. 3). Sa võid ohverdada selle kaardi, millel on 3 Võluloendurit, et Kutsuda Eriliselt 1 "<M4041>Pimeduse Maag<M>" oma käest, pakist või Hauast.

source: Apprentice Magician
et: Õpipoiss Maag

source: When this card is Summoned, place 1 Spell Counter on a face-up card that you can place a Spell Counter on. When this card is destroyed by battle, you can Special Summon 1 Level 2 or lower Spellcaster-Type monster from your Deck in face-down Defense Position.
et: Kui see kaart kutsutakse välja, aseta 1 loitsuloendur ülespoole kaardile, millele saad loitsuloenduri asetada. Kui see kaart hävitatakse lahingus, saad eriliselt välja kutsuda 1. või madalama taseme loitsija-tüüpi koletise oma pakist näoga allapoole kaitsepositsioonis.

source: Old Vindictive Magician
et: Vana Vindiktivne Maag

source: FLIP: Destroy 1 monster your opponent controls.
et: FLIP: Hävita 1 koletis, mida sinu vastane kontrollib.

source: Chaos Command Magician
et: Kaose Käskiv Maag

source: Negate the effect of a Monster Card that targets this 1 card.
et: Negateeri selle 1 kaardi sihtiva Koletise Kaardi efekti.

source: Magical Marionette
et: Maagiline Marionett

source: Each time a Spell Card is activated, place 1 Spell Counter on this card. This card gains 200 ATK for each Spell Counter on it. You can remove 2 Spell Counters from this card to destroy 1 monster on the field.
et: Iga kord, kui aktiveeritakse Võlukaart, aseta sellele kaardile 1 Võluloendur. See kaart saab iga Võluloenduri eest 200 ATK juurde. Sa võid eemaldada sellelt kaardilt 2 Võluloendurit, et hävitada 1 koletis väljal.

source: Pixie Knight
et: Pixie Rüütel

source: When this card is sent to the Graveyard as a result of battle, your opponent selects 1 Spell Card from your Graveyard, and places that card on the top of your Deck.
et: Kui see kaart saadetakse lahingu tulemusena Hauakambrisse, valib sinu vastane ühe Loitsukaardi sinu Hauakambrist ja asetab selle kaardi sinu Paki peale.

source: Breaker the Magical Warrior
et: Maagiline Sõdalane Breaker

source: When this card is Normal Summoned, place 1 Spell Counter on it (max. 1). This card gains 300 ATK for each Spell Counter on it. You can remove 1 Spell Counter from this card to destroy 1 Spell or Trap Card on the field.
et: Kui see kaart Normaal-Kutsutakse, pane sellele 1 Loitsuloendur (max. 1). See kaart saab 300 ATK iga Loitsuloenduri kohta, mis sellel on. Sa saad eemaldada 1 Loitsuloenduri sellelt kaardilt, et hävitada 1 Loitsu- või Lõksukaart väljal.

source: Magical Plant Mandragola
et: Maagiline taim Mandragola

source: FLIP: Place 1 Spell Counter on each face-up card on the field that you can place a Spell Counter on.
et: FLIP: Aseta 1 loitsumarker igale avatud kaardile väljal, millele saad asetada loitsumarkeri.

source: Magical Scientist
et: Maagiline Teadlane

source: Pay 1000 Life Points to Special Summon 1 Level 6 or lower Fusion Monster from your Fusion Deck in face-up Attack or Defense Position. That Fusion Monster cannot attack your opponent's Life Points directly, and is returned to your Fusion Deck at the end of the turn.
et: Maksa 1000 Elupunkti, et Kutsuda oma Fusion Deckist eriliselt välja 1 6. taseme või madalama Fusion Monster näoga ülespoole Rünnaku või Kaitseasendisse. See Fusion Monster ei saa rünnata sinu vastase Elupunkte otse ja see tagastatakse sinu Fusion Decki käigu lõpus.

source: Royal Magical Library
et: Kuninglik Maagiline Raamatukogu

source: Each time a Spell Card is activated, place 1 Spell Counter on this card (max 3). You can remove 3 Spell Counters from this card to draw 1 card.
et: Iga kord, kui aktiveeritakse Võlukaart, pane sellele kaardile 1 Võluloendur (maksimaalselt 3). Sa saad eemaldada sellelt kaardilt 3 Võluloendurit, et tõmmata 1 kaart.

source: This card cannot attack in the same turn it is Normal Summoned, Flip Summoned, or Special Summoned. During each of your and your opponent's Standby Phases, remove 1 Spell Counter on your side of the field. If you do not, destroy this card.
et: See kaart ei saa rünnata samal käigul, kui see on Normaal-Kutsutud, Pööratud-Kutsutud või Eriliselt Kutsutud. Iga sinu ja sinu vastase Ootefaaside ajal eemalda 1 Loitsuloendur oma väljaku poolelt. Kui sa seda ei tee, hävita see kaart.

source: Tribe-Infecting Virus
et: Hõimu-nakkusviirus

source: Discard 1 card from your hand and declare 1 Type of monster. Destroy all face-up monsters of the declared Type on the field.
et: Viska 1 kaart oma käest ja nimeta 1 tüüpi koletis. Hävita kõik väljaku peal olevad avatud koletised nimetatud tüübist.

source: FLIP: Inflict 400 damage to your opponent for each card in their hand.
et: FLIP: Põhjusta oma vastasele 400 kahju iga kaardi eest, mis on tema käes.

source: Dark Scorpion - Cliff the Trap Remover
et: Tume Skorpion - Cliff, Lõksude Eemaldaja

source: When this card inflicts Battle Damage to your opponent's Life Points, you can select and activate 1 of the following effects:<BR>● Destroy 1 Spell Card or Trap Card on the field.<BR>● Send 2 cards from the top of your opponent's Deck to his/her Graveyard.
et: Kui see kaart tekitab lahingukahju sinu vastase elupunktidele, saad valida ja aktiveerida ühe järgmistest efektidest:<BR>● Hävita 1 Võlukaar või Lõksukaart väljal.<BR>● Saada 2 kaarti oma vastase paki pealt tema hauakambrisse.

source: Magical Merchant
et: Maagiline Kaupmees

source: FLIP: Pick up cards from the top of your Deck until you pick up a Spell Card or Trap Card. Add that card to your hand. Send the remaining cards to the Graveyard.
et: FLIP: Tõsta oma paki pealt kaarte, kuni tõstad üles Võlukaardi või Lõksukaardi. Lisa see kaart oma kätte. Ülejäänud kaardid saada Hauakambrisse.

source: Once per turn, during your Main Phase, if you control this card on the field, you can equip it to your "<M5642>Aitsu<M>" as an Equip Spell Card, OR unequip the Union equipment and Special Summon this card in face-up Attack Position. While equipped to a monster by this card's effect, increase the ATK of the equipped monster by 3000 points. When it attacks with an ATK that is higher than the DEF of a Defense Position monster, inflict the difference as Battle Damage to your opponent's Life Points. (1 monster can only be equipped with 11 Union Monster at a time. If the equipped monster is destroyed as a result of battle, destroy this card instead.)
et: Kord päevas, oma peafaasi ajal, kui sa kontrollid seda kaarti väljakul, saad selle varustada oma "<M5642>Aitsu<M>" külge kui Varustusloitsu Kaart, VÕI eemaldada Uniooni varustuse ja Kutsuda see kaart eriliselt esile rünnakupositsioonis. Kui see kaart on varustatud koletisele selle kaardi efekti abil, suurenda varustatud koletise rünnakupunkte 3000 võrra. Kui see ründab rünnakupunktidega, mis on kõrgemad kui kaitsepositsioonis oleva koletise kaitsepunkte, põhjusta erinevus lahingukahjuna oma vastase elupunktidele. (1 koletis saab korraga olla varustatud ainult 1 Uniooni Koletisega. Kui varustatud koletis hävitatakse lahingu tulemusena, hävita selle asemel see kaart.)

source: Cat's Ear Tribe
et: Kassikõrva hõim

source: The original ATK of your opponent's monster(s) that battles with this card during his/her turn becomes 200 points during the Damage Step.
et: Sinu vastase koletise(te) algne ATK, mis selle kaardiga tema käigu ajal võitleb, muutub Kahjustuse Etapi ajal 200 punktiks.

source: Ultimate Obedient Fiend
et: Ülim Kuulekas Deemon

source: This card can only attack if this card is the only card on your side of the field and if you also have no cards in your hand. Negate the effects of Effect Monsters destroyed by this card.
et: See kaart saab rünnata ainult siis, kui see kaart on ainus kaart sinu väljaku poolel ja kui sul pole kaarte käes. Tühista selle kaardi poolt hävitatud Efektikoletiste efektid.

source: Dark Cat with White Tail
et: Tume kass valge sabaga

source: FLIP: Return 2 Monster Cards on your opponent's side of the field and 1 Monster Card on your side of the field to their owners' hands.
et: FLIP: Tagasta 2 koletiskaarti oma vastase väljaku poolelt ja 1 koletiskaart oma väljaku poolelt nende omanike kätte.

source: Pitch-Black Power Stone
et: Süsimust Võimu Kivi

source: After activation, place 3 Spell Counters on this card. During each of your turns you can move 1 Spell Counter from this card to another face-up card that you can place a Spell Counter on. When there are no Spell Counters on this card, destroy it.
et: Pärast aktiveerimist aseta sellele kaardile 3 loitsumarkerit. Iga oma käigu ajal saad ühe loitsumarkeri sellelt kaardilt teisele avatud kaardile, millele saab loitsumarkeri asetada, liigutada. Kui sellel kaardil pole ühtegi loitsumarkerit, hävita see.

source: Big Bang Shot
et: Suure Paugu Lask

source: The equipped monster gains 400 ATK. When the equipped monster attacks a Defense Position monster whose DEF is lower than the equipped monster's ATK, inflict the difference as Battle Damage to your opponent. When this card is removed from the field, the equipped monster is removed from play.
et: Varustatud koletis saab 400 ATK juurde. Kui varustatud koletis ründab kaitseasendis koletist, mille DEF on madalam kui varustatud koletise ATK, tekitage vahe lahingukahjuna oma vastasele. Kui see kaart eemaldatakse väljakult, eemaldatakse varustatud koletis mängust.

source: Gather Your Mind
et: Kogu oma mõtted

source: Add 1 "<M5670>Gather Your Mind<M>" card from your Deck to your hand. Your Deck is then shuffled. You can only use 1 "<M5670>Gather Your Mind<M>" per turn.
et: Lisa oma pakist 1 "<M5670>Gather Your Mind<M>" kaart oma kätte. Seejärel sega oma pakk. Sa saad kasutada ainult 1 "<M5670>Gather Your Mind<M>" kaarti ühe käigu jooksul.

source: Tribute 1 monster on your side of the field to inflict 400 points of damage to your opponent's Life Points.
et: Ohverda 1 koletis oma väljaku poolelt, et tekitada vastase Elupunktidele 400 punkti kahju.

source: Senri Eye
et: Senri Silm

source: Once per turn, during each of your Standby Phases, you can pay 100 Life Points to look at 1 card on the top of your opponent's Deck and return it to its original position. Your opponent cannot look at the card.
et: Korra ühe korra oma iga ootejärgu ajal, võid maksta 100 Elupunkti, et vaadata ühte kaarti oma vastase paki peal ja tagastada see oma algsesse asendisse. Sinu vastane ei saa kaarti vaadata.

source: Emblem of Dragon Destroyer
et: Draakoni hävitaja embleem

source: Add 1 "<M4983>Buster Blader<M>" from your Deck or your Graveyard to your hand.
et: Lisa oma käest 1 "<M4983>Buster Blader<M>" oma pakist või hauast.

source: Jar Robber
et: Puruvarga varas

source: You can only activate this card when "<M4844>Pot of Greed<M>" is activated. Negate the effect of the "<M4844>Pot of Greed<M>" and draw 1 card from your Deck.
et: Seda kaarti saab aktiveerida ainult siis, kui "<M4844>Ahneuse Pott<M>" on aktiveeritud. Tühista "<M4844>Ahneuse Pott<M>" efekt ja tõmba oma pakist 1 kaart.

source: My Body as a Shield
et: Minu keha kui kilp

source: Activate only by paying 1500 Life Points when your opponent activates a Spell/Trap Card or Effect Monster's effect that would destroy a monster(s) on the field. Negate the activation of that card and destroy it.
et: Aktiveeri ainult 1500 Elupunkti maksmisega, kui sinu vastane aktiveerib Võlu-/Lõksukaardi või Efektkoletise efekti, mis hävitaks koletise(d) väljal. Tühista selle kaardi aktiveerimine ja hävita see.

source: Pigeonholing Books of Spell
et: Loitsuraamatute sorteerimine

source: Pick up the top 3 cards of your Deck and return those cards to the top of the Deck in any order. Your opponent cannot look at the cards.
et: Tõsta oma paki 3 ülemist kaarti ja aseta need kaardid paki tippu suvalises järjekorras tagasi. Sinu vastane ei saa neid kaarte vaadata.

source: Mega Ton Magical Cannon
et: Mega Ton Maagiline Kahur

source: Remove 10 Spell Counters on your side of the field. Destroy all cards on your opponent's side of the field.
et: Eemalda oma väljaku poolelt 10 loitsuloendurit. Hävita kõik kaardid vastase väljaku poolelt.

source: Continuous Destruction Punch
et: Pidev hävituslöök
