Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: When you take 2000 or more Battle Damage from your opponent's monster's direct attack, you can select 1 Level 3 or lower "Blackwing" monster in your Graveyard. Special Summon that monster and this card from the Graveyard. Their effects are negated. Each player can only use the effect of "<M9479>Blackwing - Hillen the Tengu-wind<M>" once per Duel.
et: Kui saad oma vastase koletise otsese rünnaku tõttu 2000 või rohkem lahingukahju, võid valida oma kalmistul 1. taseme 3 või madalama "Blackwing" koletise. Kutsu see koletis ja see kaart eriliselt välja kalmistult. Nende efektid on tühistatud. Iga mängija saab kasutada "<M9479>Blackwing - Hillen the Tengu-wind<M>" efekti ainult üks kord duelli jooksul.

source: Blackwing - Kogarashi the Wanderer
et: Mustatiib - Kogarashi, Rändur

source: When a face-up "Blackwing" monster you control is destroyed by a card effect and sent to the Graveyard, you can Special Summon this card from your hand. When you Synchro Summon using this card as a Synchro Material Monster, your opponent cannot activate cards or effects.
et: Kui sinu kontrolli all olev avatud "Blackwing" koletis hävitatakse kaardi efekti tõttu ja saadetakse Hauakambrisse, saad selle kaardi oma käest eriliselt kutsuda. Kui sa kasutad seda kaarti Sünkro Materjal Koletisena Sünkro Kutsumiseks, ei saa sinu vastane aktiveerida kaarte ega efekte.

source: Morphtronic Lantron
et: Morftronik Lantron

source: ● While in Attack Position: When you would take Effect Damage from an opponent's card effect, it is inflicted to your opponent's Life Points instead.<BR>● While in Defense Position: When this card is destroyed by battle and sent to the Graveyard, you take no Battle Damage this turn
et: ● Rünnakupositsioonil olles: Kui sa peaksid saama Efektikahju vastase kaardi efekti tõttu, kantakse see kahju hoopis sinu vastase Elupunktidele.<BR>● Kaitsepositsioonil olles: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse, ei saa sa sellel käigul Lahingukahju

source: Morphtronic Staplen
et: Morftronik Staplen

source: ● While in Attack Position: Your opponent cannot select another monster you control as an attack target. If this card is destroyed by battle, the monster that destroyed it loses 300 ATK.<BR>● While in Defense Position: This card cannot be destroyed by battle. If this card is attacked, select 1 face-up Attack Position monster your opponent controls, after damage calculation. Change it to face-up Defense Position and change this card to face-up Attack Position.
et: ● Rünnakupositsioonil olles: Sinu vastane ei saa valida teist sinu kontrollitavat koletist rünnaku sihtmärgiks. Kui see kaart hävitatakse lahingus, kaotab koletis, kes selle hävitas, 300 ATK.<BR>● Kaitsepositsioonil olles: Seda kaarti ei saa lahingus hävitada. Kui seda kaarti rünnatakse, vali 1 vastase kontrollitav avatud rünnakupositsioonis koletis pärast kahju arvutamist. Muuda see avatud kaitsepositsiooniks ja muuda see kaart avatud rünnakupositsiooniks.

source: Machine Imperial Soldier Wisel Ein
et: Masina Imperiaalne Sõdur Wisel Ein

source: This card gains 100 ATK for each face-up "Machine Imperial" monster you control, except this card. Once per turn, when another "Meklord" monster you control declares an attack on a Defense Position monster your opponent controls, you can activate this effect. During battle between an attacking "Meklord" monster you control, except this card, and a Defense Position monster whose DEF is lower than the ATK of the attacking monster, inflict the difference as Battle Damage to your opponent.
et: See kaart saab 100 ATK iga sinu kontrollitava avatud "Masinaimpeeriumi" koletise eest, välja arvatud see kaart. Kord käigu jooksul, kui teine sinu kontrollitav "Meklord" koletis kuulutab välja rünnaku vastase kaitsepositsioonis oleva koletise vastu, võid aktiveerida selle efekti. Lahingu ajal sinu kontrollitava ründava "Meklord" koletise ja kaitsepositsioonis oleva koletise vahel, mille DEF on madalam kui ründava koletise ATK, põhjusta vahe vastasele Lahingukahjuna.

source: Machine Imperial Soldier Skiel Ein
et: Masinaimpeeriumi sõdur Skiel Ein

source: This card gains 200 ATK for each face-up "Machine Imperial" monster you control, except this card. When this card is destroyed by battle and sent to the Graveyard, you can Special Summon 1 "Meklord Army" monster from your Deck.
et: See kaart saab 200 ATK iga avatud "Masinaimpeeriumi" koletise eest, mida sa kontrollid, välja arvatud see kaart. Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse, saad sa eriliselt kutsuda 1 "Meklordi armee" koletise oma pakist.

source: Machine Imperial Soldier Granel Ein
et: Masinaimpeeriumi Sõdur Granel Ein

source: This card gains 100 ATK for each face-up "Machine Imperial" monster you control, except this card. When this card is Normal Summoned, you can halve the ATK of 1 face-up monster your opponent controls until the End Phase.
et: See kaart saab 100 ATK iga avatud "Machine Imperial" koletise eest, mida sa kontrollid, välja arvatud see kaart. Kui see kaart on normaalselt kutsutud, saad sa vähendada ühe vastase avatud koletise ATK-d poole võrra kuni lõppfaasini.

source: Machine Imperial God Dragon Asterisk
et: Masina Keiserlik Jumal Draakon Asterisk

source: This card cannot be Normal Summoned or Set. This card can only be Special Summoned by controlling 3 or more face-up "Machine Imperial" monsters. When this card is Special Summoned, you can select any number of face-up "Machine Imperial" monsters you control, except this card, and send them to the Graveyard. This card's ATK is equal to the total original ATK of the monsters sent to the Graveyard by this effect. While this card is face-up on the field, when a Synchro Monster(s) is Special Summoned, inflict 1000 damage to the player that Summoned.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti saab eriliselt kutsuda ainult siis, kui kontrollid 3 või enamat avatud "Masinaimpeeriumi" koletist. Kui see kaart on eriliselt kutsutud, saad valida suvalise arvu avatud "Masinaimpeeriumi" koletisi, mida sa kontrollid, välja arvatud see kaart, ja saata need Hauakambrisse. Selle kaardi rünnakujõud (ATK) on võrdne nende koletiste algse rünnakujõu kogusummaga, kes saadeti selle efekti abil Hauakambrisse. Kui see kaart on väljakul avatud, siis kui Sünkroonkoletis(ed) kutsutakse eriliselt, tekitab see 1000 kahju mängijale, kes kutsus.

source: T.G. Cyber Magician
et: T.G. Kübermaag

source: If this card is used as a Synchro Material Monster for the Synchro Summon of a "T.G." Synchro Monster, you can use "T.G." monsters in your hand as non-Tuner Synchro Material Monsters. During the End Phase of the turn this card on the field was destroyed and sent to the Graveyard, you can add 1 "T.G." monster from your Deck to your hand, except "<M9487>T.G. Cyber Magician<M>".
et: Kui seda kaarti kasutatakse "T.G." Sünkroonkoletise sünkroonväljakutse jaoks sünkroonmaterjalina, võid kasutada oma käes olevaid "T.G." koletisi mitte-häälestajana sünkroonmaterjalina. Selle käigu lõppfaasis, mil see kaart väljakul hävitati ja saadeti hauakambrisse, võid lisada oma pakist ühe "T.G." koletise oma kätte, välja arvatud "<M9487>T.G. Kübermaag<M>".

source: T.G. Striker
et: T.G. Ründaja

source: If your opponent controls a monster and you control no monsters, you can Special Summon this card from your hand. During the End Phase of the turn this card on the field was destroyed and sent to the Graveyard, you can add 1 "T.G." monster from your Deck to your hand, except "<M9488>T.G. Striker<M>".
et: Kui sinu vastasel on koletis ja sul ei ole ühtegi koletist, saad selle kaardi oma käest eriliselt kutsuda. Selle käigu lõppfaasis, mil see kaart väljal hävitati ja saadeti Hauakambrisse, saad lisada oma pakist ühe "T.G." koletise oma kätte, välja arvatud "<M9488>T.G. Striker<M>".

source: T.G. Jet Falcon
et: T.G. Jeti Pistrik

source: If this card is sent to the Graveyard as a Synchro Material Monster, inflict 500 damage to your opponent.
et: Kui see kaart saadetakse Sünkromaterjalina Hauakambrisse, tekitage oma vastasele 500 kahju.

source: T.G. Catapult Dragon
et: T.G. Katapultdraakon

source: Once per turn, you can Special Summon 1 Level 3 or lower "T.G." Tuner monster from your hand.
et: Korra ühe korra käigu jooksul saad oma käest eriliselt kutsuda 1. taseme 3 või madalama "T.G." häälestuskoletise.

source: T.G. Warwolf
et: T.G. Sõjasusi

source: When a Level 4 or lower monster is Special Summoned, you can Special Summon this card from your hand. During the End Phase of the turn this card on the field was destroyed and sent to the Graveyard, you can add 1 "T.G." monster from your Deck to your hand, except "<M9491>T.G. Warwolf<M>".
et: Kui tase 4 või madalama tasemega koletis kutsutakse erikutsena, võid selle kaardi oma käest erikutsuda. Selle käigu lõppfaasis, mil see kaart väljal hävitati ja saadeti hauakambrisse, võid lisada oma pakist ühe "T.G." koletise oma kätte, välja arvatud "<M9491>T.G. Warwolf<M>".

source: T.G. Rush Rhino
et: T.G. Tormasarv

source: If this card attacks, it gains 400 ATK during the Damage Step only. During the End Phase of the turn this card on the field was destroyed and sent to the Graveyard, you can add 1 "T.G." monster from your Deck to your hand, except "<M9492>T.G. Rush Rhino<M>".
et: Kui see kaart ründab, saab see ainult Kahjustuse Etapi ajal 400 ATK juurde. Selle käigu lõppfaasis, mil see kaart väljal hävitati ja saadeti Hauakambrisse, saad lisada oma pakist ühe "T.G." koletise oma kätte, välja arvatud "<M9492>T.G. Rush Rhino<M>".

source: Once per turn, during your Main Phase, you can equip this card to a monster you control as an Equip Card, OR unequip it to Special Summon this card in face-up Attack Position. The equipped monster loses 500 ATK and DEF. If the equipped monster destroys an opponent's monster by battle, destroy all monsters your opponent controls with the same Type as the destroyed monster. (A monster can only be equipped with 11 Union Monster at a time. If the equipped monster would be destroyed, destroy this card instead.)
et: Korra ühe korra oma peafaasis saad selle kaardi kinnitada oma kontrollitava koletise külge kui Varustuskaart VÕI eemaldada see, et Kutsuda see kaart erilisel viisil Nähtavas Rünnakupositsioonis. Varustatud koletis kaotab 500 ATK ja DEF. Kui varustatud koletis hävitab lahingus vastase koletise, hävita kõik vastase kontrollitavad sama tüüpi koletised nagu hävitatud koletis. (Koletis saab olla varustatud ainult 1 Ühenduskoletisega korraga. Kui varustatud koletis hävitatakse, hävita selle asemel see kaart.)

source: Esper Girl
et: Esperi Tüdruk

source: When this removed from play card is Special Summoned, remove from play the top card of your Deck, face-down. When this card is sent from the field to the Graveyard, add that removed card to your hand.
et: Kui see mängust eemaldatud kaart kutsutakse eriliselt välja, eemalda mängust oma paki pealmine kaart, pildipool allapoole. Kui see kaart saadetakse väljakult Hauakambrisse, lisa see eemaldatud kaart oma kätte.

source: Mental Seeker
et: Mentaalne Otsija

source: When this removed from play card is Special Summoned, reveal the top 3 cards of your opponent's Deck and select 1 of them. Remove the selected card from play, then return the rest to their Deck.
et: Kui see mängust eemaldatud kaart kutsutakse eriliselt välja, paljasta oma vastase paki 3 ülemist kaarti ja vali neist 1. Eemalda valitud kaart mängust, seejärel pane ülejäänud kaardid tagasi nende pakki.

source: Silent Psychic Wizard
et: Vaikne Psüühiline Võlur

source: When this card is Normal Summoned, you can select 1 Psychic-Type monster in your Graveyard, and remove it from play. When this card is sent from the field to the Graveyard, Special Summon that removed monster.
et: Kui see kaart on normaal-summonitud, saad valida 1 psüühika-tüüpi koletise oma hauakambris ja eemaldada see mängust. Kui see kaart saadetakse väljakult hauakambrisse, kutsu see eemaldatud koletis eriliselt välja.

source: Serene Psychic Witch
et: Rahulik Psüühiline Nõid

source: When this card on the field is destroyed and sent to the Graveyard, you can remove from play 1 Psychic-Type monster with 2000 or less ATK from your Deck. During the next Standby Phase, Special Summon the monster removed from play by this effect.
et: Kui see kaart väljal hävitatakse ja saadetakse Hauakambrisse, võid mängust eemaldada ühe Psüühika-tüüpi koletise, mille ATK on 2000 või vähem, oma pakist. Järgmise Ootefaasiga, Kutsu eriliselt esile selle efekti abil mängust eemaldatud koletis.

source: Hushed Psychic Cleric
et: Vaikne Psüühiline Klerik

source: When this card is Normal or Flip Summoned, it is changed to Defense Position. Once per turn, you can send 1 card from your hand to the Graveyard to select 1 Psychic-Type monster in your Graveyard, and remove it from play. When this card is sent from the field to the Graveyard, select 1 monster removed from play by this effect, and Special Summon it.
et: Kui see kaart on Normaal- või Pöördkutsutud, muudetakse see Kaitsepositsiooni. Kord kord käigu jooksul võid saata 1 kaardi oma käest Hauakambrisse, et valida 1 Psüühika-tüüpi koletis oma Hauakambris ja eemaldada see mängust. Kui see kaart saadetakse väljakult Hauakambrisse, vali 1 koletis, mis on selle efekti tõttu mängust eemaldatud, ja Kutsu see Eriliselt.

source: Elder of the Six Samurai
et: Kuue Samuraide Vanem

source: Shien's Advisor
et: Shieni Nõunik

source: When this card is Normal Summoned, if you control a face-up "Six Samurai" monster, declare 1 Monster Type. While this card is face-up on the field, monsters with the declared Monster Type cannot declare an attack or be Special Summoned.
et: Kui see kaart on Normaal-Kutsutud ja kui sa kontrollid avatud "Kuue Samuraid" koletist, kuuluta 1 Koletise Tüüp. Kuni see kaart on avatud väljakul, ei saa kuulutatud Koletise Tüübiga koletised rünnakut kuulutada ega olla Eriliselt Kutsutud.

source: This card must attack if able. When this face-up card on the field is selected as an attack target, change its battle position. While this card is face-up on the field, once per turn during your Main Phase, you can Normal Summon a "Karakuri" monster in addition to your Normal Summon or Set. (You can only gain this effect once per turn.)
et: See kaart peab ründama, kui võimalik. Kui see avatud kaart väljakul valitakse rünnaku sihtmärgiks, muuda selle lahingupositsiooni. Kui see kaart on väljakul avatud, saad kord oma peafaasist lisaks oma tavapärasele kutsumisele või asetamisele kord oma käigul kutsuda "Karakuri" koletise. (Seda efekti saab kasutada ainult kord käigu jooksul.)

source: This card must attack if able. When this face-up card on the field is selected as an attack target, change its battle position. When this card is Normal Summoned, you can draw 1 card for each face-up Defense Position "Karakuri" monster you control.
et: See kaart peab ründama, kui võimalik. Kui see avatud kaart väljal valitakse rünnaku sihtmärgiks, muuda selle lahingupositsiooni. Kui see kaart kutsutakse tavaliselt välja, võid tõmmata 1 kaardi iga avatud kaitsepositsioonis oleva "Karakuri" koletise kohta, mida sa kontrollid.

source: Scrap Kong
et: Kõrvaldamise Kong

source: When this card is Normal Summoned, destroy this card. When this card is destroyed by the effect of a "Scrap" card and sent to Graveyard, you can select 1 "Scrap" Monster other than "<M9503>Scrap Kong<M>" from your Graveyard and add it to your hand.
et: Kui see kaart on Normaal-Summonitud, hävita see kaart. Kui see kaart hävitatakse "Scrap" kaardi efekti tõttu ja saadetakse Hauakambrisse, saad valida 1 "Scrap" koletise peale "<M9503>Scrap Kong<M>" oma Hauakambrist ja lisada selle oma kätte.

source: Tradetoad
et: Konnkaupleja

source: Once per turn, you can Tribute 1 Aqua-Type monster to select 1 "Frog" monster in your Graveyard, except "<M4555>Frog the Jam<M>". Special Summon that monster from your Graveyard.
et: Korra ühe korra käigu jooksul saad sa ohverdada 1 Aqua-tüüpi koletise, et valida 1 "Konna" koletis oma Hauakambris, välja arvatud "<M4555>Frog the Jam<M>". Kutsu see koletis oma Hauakambrist eriliselt välja.

source: Gladiator Beast Tygerius
et: Gladiaatorikutsar Tygerius

source: This card cannot be used as a Fusion Material Monster. When this card is Special Summoned by the effect of a "Gladiator Beast" monster, you can discard 1 "Gladiator Beast" card to add 1 "Gladiator Beast" monster from the Deck to your hand.
et: Seda kaarti ei saa kasutada Fusion Material Monsterina. Kui see kaart kutsutakse eriliselt välja "Gladiator Beast" koletise efekti abil, võid sa ühe "Gladiator Beast" kaardi ära visata, et lisada üks "Gladiator Beast" koletis pakist oma kätte.

source: Jar Turtle
et: Purukilpkonn

source: Each time "<M5210>Jar of Greed<M>" is activated, draw 1 card.
et: Iga kord, kui "<M5210>Ahneuse purk<M>" aktiveeritakse, tõmba 1 kaart.

source: Neither player can Special Summon monsters. When another monster is Normal Summoned to either player's side of the field, destroy this card.
et: Kumbki mängija ei saa erikutsuda koletisi. Kui teisele mängijale kutsutakse normaalne koletis, hävita see kaart.

source: Junk Berserker
et: Rämpsu Berserker

source: "<M7687>Junk Synchron<M>" + 1 or more non-Tuner monsters<BR>You can remove from play 1 "Junk" monster in your Graveyard to select 1 face-up monster your opponent controls. It loses ATK equal to the removed monster's ATK. If this card attacks a Defense Position monster, destroy the monster with this card's effect without applying damage calculation.
et: "<M7687>Junk Synchron<M>" + 1 või rohkem mittehäälestaja koletist<BR>Sa võid eemaldada oma kalmistult mängust 1 "Junk" koletise, et valida 1 vastase kontrollitav avatud koletis. See kaotab ATK-d võrdselt eemaldatud koletise ATK-ga. Kui see kaart ründab kaitsepositsioonis olevat koletist, hävita see koletis selle kaardi efektiga ilma kahju arvutamata.

source: Life Stream Dragon
et: Eluvoo Vooludraakon

source: 1 Tuner + "<M8137>Power Tool Dragon<M>"<BR>When this card is Synchro Summoned, you can make your Life Points become 4000. Any effect damage you take becomes 0. If this face-up card would be destroyed, you can remove from play 1 Equip Spell Card from your Graveyard instead.
et: 1 Tuner + "<M8137>Power Tool Dragon<M>"<BR>Kui see kaart on Sünkrosummonitud, võid oma Elupunktid muuta 4000-ks. Iga efektikahju, mida sa saad, muutub 0-ks. Kui see avatud kaart hävitatakse, võid selle asemel eemaldada oma Hauakambrist mängust 1 Varustuse Loitsukaardi.

source: T.G. Recipro Dragonfly
et: T.G. Vastastik-Liblikas

source: 1 Tuner + 1 non-Tuner monster<BR>Once per turn, you can send 1 other "T.G." Synchro Monster you control to the Graveyard. Then, if all of the Synchro Monsters that were used for the Synchro Summon of that monster are in your Graveyard, you can Special Summon them.
et: 1 Tuner + 1 mitte-Tuner koletis<BR>Korra käigu jooksul võid saata 1 teise "T.G." Sünkro Koletise, mida sa kontrollid, Hauakambrisse. Seejärel, kui kõik Sünkro Koletised, mida kasutati selle koletise Sünkro Kutsumiseks, on sinu Hauakambris, võid need Eriliselt Kutsuda.

source: T.G. Wonder Magician
et: T.G. Imemagister

source: 1 Tuner + 1 or more non-Tuner "T.G." monsters<BR>When this card is Synchro Summoned, select 1 Spell/Trap Card on the field and destroy it. When this card on the field is destroyed, draw 1 card. During your opponent's Main Phase, you can Synchro Summon using this face-up card you control as a Synchro Material Monster.
et: 1 Tuner + 1 või rohkem mitte-Tuner "T.G." koletist<BR>Kui see kaart on Sünkrosummonitud, vali 1 Võlu-/Lõksukaart väljal ja hävita see. Kui see kaart väljal hävitatakse, tõmba 1 kaart. Oma vastase peafaasis saad Sünkrosummonida, kasutades seda ülespööratud kaarti, mida sa kontrollid, Sünkromaterjalikoletisena.

source: T.G. Power Gladiator
et: T.G. Võimugladiaator

source: 1 Tuner + 1 or more non-Tuner "T.G." monsters<BR>During battle between this attacking monster and a Defense Position monster whose DEF is lower than the ATK of this card, inflict the difference as Battle Damage to your opponent. When this card on the field is destroyed, draw 1 card.
et: 1 Tuner + 1 või rohkem mitte-Tuner "T.G." koletist<BR>Lahingu ajal selle ründava koletise ja kaitseasendis oleva koletise vahel, mille DEF on madalam kui selle kaardi ATK, põhjusta vahe vastasele Lahingukahjuna. Kui see kaart väljakul hävitatakse, tõmba 1 kaart.

source: T.G. Blade Blaster
et: T.G. Terasahkaja

source: 1 Tuner Synchro Monster + 1 or more non-Tuner Synchro Monsters<BR>When an opponent's Spell/Trap Card is activated that targets this card, you can send 1 card from your hand to the Graveyard to negate the effect. Once per opponent's turn, you can remove from play 1 "T.G." monster from your Graveyard to remove this face-up card on the field from play. During the next Standby Phase, Special Summon this card, if removed by this effect.
et: 1 Tuner Sünkroonkoletis + 1 või rohkem mitte-Tuner Sünkroonkoletisi<BR>Kui vastase Loitsu/Lõksukaart aktiveeritakse, mis sihib seda kaarti, saad saata 1 kaardi oma käest Hauakambrisse, et selle efekti tühistada. Kord vastase käigu jooksul saad eemaldada mängust 1 "T.G." koletise oma Hauakambrist, et eemaldada see avatud kaart mänguväljalt. Järgmise Ootefaasiga, kui see kaart eemaldati selle efektiga, kutsu see kaart eriliselt välja.

source: T.G. Halberd Cannon
et: T.G. Halberdikahur

source: 1 Tuner Synchro Monster + 2 or more non-Tuner Synchro Monsters<BR>This card cannot be Special Summoned except by Synchro Summon. Once per turn, while this card is face-up on the field, you can negate the Summon of a monster and destroy it. When this card is sent from the field to the Graveyard, you can select 1 "T.G." monster in your Graveyard, and Special Summon it.
et: 1 Tuner Sünkroonkoletis + 2 või rohkem mitte-Tuner Sünkroonkoletist<BR>Seda kaarti ei saa eriliselt kutsuda, välja arvatud sünkroonväljakutsega. Kord käigu jooksul, kui see kaart on näoga ülespoole väljakul, saad tühistada koletise kutsumise ja hävitada selle. Kui see kaart saadetakse väljakult hauakambrisse, saad valida 1 "T.G." koletise oma hauakambris ja eriliselt kutsuda selle.

source: Overmind Archfiend
et: Ülemõistuse Kurivaim

source: 1 Psychic-Type Tuner + 2 or more non-Tuner Psychic-Type monsters<BR>Once per turn, you can select 1 Psychic-Type monster in your Graveyard, and remove it from play. When this card is sent from the field to the Graveyard, Special Summon as many monsters as possible that were removed from play by this effect.
et: 1 Psüühika-tüüpi Tuner + 2 või rohkem mitte-Tuner Psüühika-tüüpi koletist<BR>Korra käigu jooksul saad valida 1 Psüühika-tüüpi koletise oma Hauas ja eemaldada see mängust. Kui see kaart saadetakse väljakult Hauale, kutsu eriliselt välja nii palju koletisi kui võimalik, mis eemaldati mängust selle efekti tõttu.

source: Scarlet Security
et: Sarlakaitse

source: Activate only if you control a face-up1 "<M7735>Red Demon's Dragon<M>". Destroy all Spell/Trap Cards your opponent controls.
et: Aktiveeri ainult siis, kui sa kontrollid avatud1 "<M7735>Red Demon's Dragon<M>". Hävita kõik Võlu-/Lõksukaardid, mida su vastane kontrollib.

source: Red Dragon Vase
et: Punase Draakoni Vaas

source: Activate only if you control a face-up1 "<M7735>Red Demon's Dragon<M>". Draw 2 cards. You cannot Normal or Special Summon another monster until the end of your opponent's turn if you activate this card.
et: Aktiveeri ainult siis, kui sa kontrollid avatud1 "<M7735>Red Demon's Dragon<M>". Tõmba 2 kaarti. Sa ei saa normaal- ega erikutsuda teist koletist kuni sinu vastase käigu lõpuni, kui sa aktiveerid selle kaardi.

source: Resonator Call
et: Resonaatori Kutsung

source: Add 1 "Resonator" monster from your Deck to your hand.
et: Lisa oma pakist 1 "Resonator" koletis oma kätte.

source: Resonant Destruction
et: Resonantne hävitus
