Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: Super Junior Confrontation
et: Super Juniori vastasseis

source: You can only activate this card when your opponent's monster declares an attack. Negate the attack, and 1 monster with the lowest ATK in face-up Attack Position on your opponent's side of the field battles against 1 monster with the lowest DEF in face-up Defense Position on your side of the field. After the battle ends, end the Battle Phase.
et: Seda kaarti saad aktiveerida ainult siis, kui sinu vastase koletis kuulutab välja rünnaku. Tühista rünnak ja 1 koletis, kellel on madalaim rünnakupunktide arv sinu vastase poolel, võitleb 1 koletisega, kellel on madalaim kaitsepunkide arv sinu poolel. Pärast lahingu lõppu lõpeta Lahingufaas.

source: Miracle Kids
et: Imelised Lapsed

source: Target 1 monster your opponent controls; that target loses 400 ATK for each "Hero Kid" in your Graveyard, until the End Phase.
et: Vali 1 koletis, mida sinu vastane kontrollib; see sihtmärk kaotab 400 ATK iga sinu Hauakambris oleva "Hero Kid" kohta kuni End Phase'ini.

source: Attack Reflector Unit
et: Rünnaku Peegeldamise Üksus

source: Tribute 1 "<M6390>Cyber Dragon<M>". Special Summon 1 "Cyber Barrier Dragon" from your hand or Deck.
et: Ohverda 1 "<M6390>Küberdraakon<M>". Kutsu eriliselt välja 1 "Küberbarjäärdraakon" oma käest või pakist.

source: Damage Condenser
et: Kahjukondensaator

source: Activate only by discarding 1 card when you take Battle Damage. Special Summon, in Attack Position, 1 monster from your Deck with ATK equal to or less than the Battle Damage you took.
et: Aktiveeri ainult 1 kaardi ära viskamisega, kui saad lahingukahju. Kutsu eriliselt välja, rünnakupositsioonis, 1 koletis oma pakist, mille rünnakujõud on võrdne või väiksem saadud lahingukahjust.

source: Treasure Map
et: Aardekaart

source: You can only activate this card in response to the activation of an effect that would return this card from the field to the hand. Draw 2 cards from your Deck and discard 1 card from your hand.
et: Seda kaarti saab aktiveerida ainult vastuseks efekti aktiveerimisele, mis tagastaks selle kaardi väljakult kätte. Tõmba oma pakist 2 kaarti ja viska 1 kaart oma käest ära.

source: Hero Spirit
et: Kangelase Vaim

source: During the Battle Phase, if an1 "Elemental HERO" monster you controlled was destroyed by battle this turn: Make the Battle Damage from 1 of your opponent's monsters 0.
et: Lahingufaasis, kui sel käigul hävitati lahingus sinu kontrollitud "Elemental HERO" koletis: Muuda ühe vastase koletise lahingukahju 0-ks.

source: Ancient Gear Cannon
et: Muinasaja Käik Kahur

source: By Tributing this card, inflict 500 damage to your opponent, and then neither player can activate Trap Cards during the Battle Phase of this turn.
et: Ohverdades selle kaardi, tekitad vastasele 500 kahju ja siis ei saa kumbki mängija selle käigu Lahingu Faasis Lõksukaarte aktiveerida.

source: Proto-Cyber Dragon
et: Proto-Küberdraakon

source: This card's name becomes "<M6390>Cyber Dragon<M>" while it is face-up on the field.
et: Selle kaardi nimi muutub "<M6390>Cyber Dragon<M>", kui see on lahinguväljal avatud.

source: Adhesive Explosive
et: Adhesiivne Lõhkekeha

source: If your opponent's monster attacks this face-down Defense Position card, this card becomes an Equip Card equipped to the attacking monster, without applying damage calculation. Destroy the equipped monster during the Standby Phase of your opponent's next turn.
et: Kui sinu vastase koletis ründab seda tagurpidi Kaitsepositsioonis kaarti, muutub see kaart Ründavale koletisele varustatud Varustuskaardiks, ilma kahju arvutust rakendamata. Hävita varustatud koletis oma vastase järgmise käigu Ootefaasil.

source: Machine King Prototype
et: Masina Kuning Prototüüp

source: Increase the ATK and DEF of this card by 100 points for each Machine-Type monster on the field other than this card.
et: Suurenda selle kaardi ATK ja DEF 100 punkti võrra iga teise Väljal oleva Masinatüüpi koletise kohta peale selle kaardi.

source: B.E.S. Covered Core
et: B.E.S. Kaetud Südamik

source: When this card is Normal Summoned, put 2 counters on it. This card cannot be destroyed by battle. If this card attacks or is attacked, at the end of the Damage Step toss a coin and call it. If you call it wrong, remove 1 counter. If this card battles without a counter, destroy it at the end of the Damage Step.
et: Kui see kaart Normaal-Summonitakse, pane sellele 2 loendurit. Seda kaarti ei saa lahingus hävitada. Kui see kaart ründab või teda rünnatakse, viska Kahjustuse Sammu lõpus münti ja ütle, kummale poole see jääb. Kui sa eksid, eemalda 1 loendur. Kui see kaart võitleb ilma loendurita, hävita see Kahjustuse Sammu lõpus.

source: D.D. Guide
et: D.D. Teejuht

source: When this card is Normal Summoned, control of this card shifts to your opponent. During each player's End Phase, your opponent selects 1 card from the Graveyard of this card's controller and removes it from play.
et: Kui see kaart on normaal-summonitud, läheb selle kaardi kontroll sinu vastasele. Iga mängija lõppfaasis valib sinu vastane ühe kaardi selle kaardi kontrollija hauast ja eemaldab selle mängust.

source: Chain Thrasher
et: Ahelpeksja

source: In addition to a normal attack, this card can attack during the same Battle Phase as many times as the number of "Chain Thrasher"(s) in your Graveyard.
et: Lisaks tavarünnakule võib see kaart rünnata sama Lahingufaasi jooksul nii mitu korda, kui palju on sinu Hauakambris "Chain Thrasher" kaarte.

source: Disciple of the Forbidden Spell
et: Keelatud Loitsu Jünger

source: When this card is Summoned, declare different Monster Card Attributes equal to the number of "Disciple of the Forbidden Spell"(s) in your Graveyard. If this card attacks a monster that has a declared Attribute, destroy the monster with this card's effect without applying damage calculation.
et: Kui see kaart kutsutakse välja, kuuluta välja erinevad Monster Card Attributes, mis on võrdne sinu kalmistul olevate "Disciple of the Forbidden Spell" kaartide arvuga. Kui see kaart ründab koletist, millel on kuulutatud omadus, hävita koletis selle kaardi efektiga ilma kahju arvutamata.

source: Parasitic Ticky
et: Parasiitne Ticky

source: The ATK and DEF of this card are equal to the number of tokens on the field x 500 points.
et: Selle kaardi ATK ja DEF on võrdne väljal olevate žetoonide arvuga x 500 punkti.

source: When this card is destroyed by battle and sent to the Graveyard, add 1 Insect-Type monster with 1500 or less ATK from your Deck to your hand.
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse, lisa oma pakist 1 putukaliiki koletis, mille ATK on 1500 või vähem, oma kätte.

source: Silent Insect
et: Vaikne Putukas

source: This card is changed to Defense Position when it is Normal Summoned or Flip Summoned. While this card is face-up on the field, negate the effects of all Continuous Spell Cards and Continuous Trap Cards.
et: See kaart muudetakse kaitsepositsiooni, kui see on tavakutsutud või pöördkutsutud. Kui see kaart on lahinguväljal avatud, tühista kõigi pidevate loitsukaartide ja pidevate lõksukaartide efektid.

source: Chainsaw Insect
et: Saelind

source: If this card attacks or is attacked, your opponent draws 1 card at the end of the Damage Step.
et: Kui see kaart ründab või teda rünnatakse, tõmbab sinu vastane 1 kaardi Kahjustuse Etapi lõpus.

source: This card cannot be Normal Summoned or Set. This card cannot be Special Summoned except by sending 2 Spell or Trap Cards you control to the Graveyard. You can destroy 1 Spell or Trap Card your opponent controls. If you activate this effect, this card cannot attack during this turn.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti ei saa eriliselt kutsuda, välja arvatud juhul, kui saadad 2 loitsu- või lõksukaarti, mida sa kontrollid, hauakambrisse. Sa võid hävitada 1 loitsu- või lõksukaardi, mida su vastane kontrollib. Kui sa aktiveerid selle efekti, ei saa see kaart sellel käigul rünnata.

source: Saber Beetle
et: Mõõgakabri

source: Doom Dozer
et: Hukatusroomik

source: This card cannot be Normal Summoned or Set. This card cannot be Special Summoned except by removing from play 2 Insect-Type monsters from your Graveyard. When this card inflicts Battle Damage to your opponent, send 1 card from the top of your opponent's Deck to the Graveyard.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti ei saa eriliselt kutsuda, välja arvatud juhul, kui eemaldate oma kalmistult mängust 2 putukaliiki koletist. Kui see kaart tekitab teie vastasele lahingukahju, saatke 1 kaart oma vastase paki ülaosast kalmistule.

source: Treeborn Frog
et: Puu-sündinud Konn

source: If this card is in your Graveyard during your Standby Phase and you control no Spell or Trap Cards, you can Special Summon it. This effect cannot be activated if you control a face-up "Treeborn Frog".
et: Kui see kaart on sinu Hauakambris sinu Ootefaasil ja sul pole kontrolli all ühtegi Loitsu ega Lõksukaarti, saad selle Eriliselt Kutsuda. Seda efekti ei saa aktiveerida, kui sul on kontrolli all avatud "Treeborn Frog".

source: Beelze Frog
et: Beelze Konn

source: Increase the ATK of this card by 300 points for each "T.A.D.P.O.L.E." in your Graveyard.
et: Suurenda selle kaardi ATK-d 300 punkti võrra iga sinu Hauakambris oleva "T.A.D.P.O.L.E." eest.

source: Princess Pikeru
et: Printsess Pikeru

source: This card cannot be Normal Summoned or Set. This card cannot be Special Summoned except with "Trial of the Princesses". During your Standby Phase, gain 800 Life Points for each monster you control.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti ei saa eriliselt kutsuda, välja arvatud "Printsesside proovilepanekuga". Oma ootejärgu faasis saad 800 elupunkti iga sinu kontrollitava koletise eest.

source: Princess Curran
et: Printsess Curran

source: This card cannot be Normal Summoned or Set. This card cannot be Special Summoned except with "Trial of the Princesses". During your Standby Phase, inflict 600 damage to your opponent for each monster they control.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti ei saa eriliselt kutsuda, välja arvatud "Printsesside prooviga". Sinu ootejärgus põhjusta oma vastasele 600 kahju iga nende kontrollitava koletise eest.

source: Memory Crusher
et: Mälupurustaja

source: If this card successfully attacks directly, inflict 100 damage to your opponent for each card in their Extra Deck.
et: Kui see kaart ründab edukalt otse, põhjusta oma vastasele 100 kahju iga kaardi eest nende Lisapakist.

source: Malice Ascendant
et: Pahatahtlikkuse Tõus

source: During your opponent's Standby Phase, send 1 card from the top of their Deck to the Graveyard for each "Malice Ascendant" in your Graveyard.
et: Oma vastase ootejärgu ajal saada 1 kaart nende pakist hauakambrisse iga sinu hauakambris oleva "Malice Ascendant" eest.

source: Grass Phantom
et: Rohu Fantoom

source: This card gains 500 ATK for each "Grass Phantom" in your Graveyard.
et: See kaart saab 500 ATK iga "Grass Phantom" eest sinu Hauakambris.

source: Sand Moth
et: Liivakoi

source: When this face-down Defense Position card is destroyed and sent to the Graveyard, except by battle, switch the original ATK and DEF of this card, and Special Summon it.
et: Kui see näoga allapoole kaitsepositsioonis kaart hävitatakse ja saadetakse Hauakambrisse, välja arvatud lahingus, vaheta selle kaardi algne RÜN ja KAIT ning Kutsu see Eriliselt Välja.

source: Divine Dragon - Excelion
et: Jumalik Draakon - Excelion

source: When this card is Normal Summoned, it gets 1 of the following effects for each "Divine Dragon - Excelion" in your Graveyard when this effect resolves (your choice). These effects cannot accumulate.<BR>● This card gains 1000 ATK.<BR>● If this card destroys your opponent's monster by battle, it can attack once again in a row.<BR>● When this card destroys a monster by battle and sends it to the Graveyard, inflict damage to your opponent equal to the ATK of the destroyed monster.
et: Kui see kaart on Normaal-Kutsutud, saab see ühe järgmistest efektidest iga "Divine Dragon - Excelion" kohta sinu Hauas, kui see efekt lahendatakse (sinu valik). Need efektid ei saa koguneda.<BR>● See kaart saab 1000 ATK.<BR>● Kui see kaart hävitab lahingus sinu vastase koletise, saab see rünnata veel kord järjest.<BR>● Kui see kaart hävitab lahingus koletise ja saadab selle Hauale, põhjusta oma vastasele kahju, mis on võrdne hävitatud koletise ATK-ga.

source: Ruin, Queen of Oblivion
et: Unustuskuninganna Ruin

source: This card can only be Ritual Summoned with the Ritual Spell Card, "End of the World". If this card destroys your opponent's monster by battle, it can attack once again in a row.
et: Seda kaarti saab Rituaali Kutsuda ainult Rituaali Loitsukaardiga "Maailma Lõpp". Kui see kaart hävitab lahingus sinu vastase koletise, saab see rünnata veel kord järjest.

source: Demise, King of Armageddon
et: Hukatus, Armageddoni Kuningas

source: This card can only be Ritual Summoned with the Ritual Spell Card, "End of the World". You can pay 2000 Life Points to destroy all cards on the field, except this card.
et: Seda kaarti saab rituaalkutsuda ainult rituaaliloitsukaardiga "Maailma lõpp". Sa võid maksta 2000 Elupunkti, et hävitada kõik kaardid väljal, välja arvatud see kaart.

source: D.3.S. Frog
et: D.3.S. Konn

source: 3 × "<M6424>Des Frog<M>"<BR>A Fusion Summon of this card can only be conducted with the above Fusion Material Monsters. Increase the ATK of this card by 500 points for every "Treeborn Frog" in your Graveyard.
et: 3 × "<M6424>Des Frog<M>"<BR>Selle kaardi Fusion Summon'i saab läbi viia ainult ülaltoodud Fusion Material Monsters'itega. Suurenda selle kaardi ATK-d 500 punkti võrra iga sinu kalmistul oleva "Treeborn Frog" eest.

source: Symbol of Heritage
et: Pärandi Sümbol

source: Activate only while there are 3 Monster Cards with the same name in your Graveyard. Select 1 of those monsters, Special Summon it, and equip it with this card. When this card is destroyed, destroy the equipped monster.
et: Aktiveeri ainult siis, kui sinu Hauakambris on 3 sama nimega Koletise Kaarti. Vali üks neist koletistest, Kutsu see Eriliselt välja ja varusta see selle kaardiga. Kui see kaart hävitatakse, hävita varustatud koletis.

source: Trial of the Princesses
et: Printsesside proov

source: You can only equip this card to "White Magician Pikeru" or "Ebon Magician Curran". Increase the ATK of the equipped monster by 800 points. During a turn that the equipped monster destroyed a Level 5 or higher monster as a result of battle, by Tributing the equipped monster and this card, Special Summon from your hand or Deck: 1 "Princess Pikeru" if you Tributed "White Magician Pikeru", or 1 "Princess Curran" if you Tributed "Ebon Magician Curran".
et: Seda kaarti saab varustada ainult "White Magician Pikeru" või "Ebon Magician Curran" külge. Suurenda varustatud koletise ATK-d 800 punkti võrra. Kui varustatud koletis hävitas lahingu tulemusena 5. või kõrgema taseme koletise, saad varustatud koletise ja selle kaardi ohverdamisega eriliselt kutsuda oma käest või pakist: 1 "Princess Pikeru", kui ohverdasid "White Magician Pikeru", või 1 "Princess Curran", kui ohverdasid "Ebon Magician Curran".

source: End of the World
et: Maailma lõpp

source: This card can be used to Ritual Summon "Ruin, Queen of Oblivion", or "Demise, King of Armageddon". You must also Tribute monsters from the field or your hand whose total Levels equal the Level of the Ritual Monster you are attempting to Ritual Summon.
et: Seda kaarti saab kasutada "Ruin, Queen of Oblivion" või "Demise, King of Armageddon" rituaalsummonimiseks. Sa pead ka ohverdama koletisi väljakult või oma käest, kelle kogutasemed on võrdsed rituaalkoletise tasemega, keda sa üritad rituaalsummonida.

source: Monster Cards Tributed for a Ritual Summon are returned to the owner's Deck instead of being sent to the Graveyard. Then shuffle the Deck.
et: Rituaalsummoniks ohverdatud koletiskaardid tagastatakse omaniku pakki, selle asemel et need saadetaks hauakambrisse. Seejärel sega pakk.

source: Karma Cut
et: Karma Lõige

source: Discard 1 card to select 1 face-up monster your opponent controls, and remove it from play. Then, remove from play any cards in your opponent's Graveyard with the same name as that monster.
et: Viska 1 kaart, et valida 1 avatud koletis, mida sinu vastane kontrollib, ja eemalda see mängust. Seejärel eemalda mängust kõik kaardid sinu vastase Hauakambris, millel on sama nimi kui sellel koletisel.

source: Next to be Lost
et: Järgmine, kes kaob

source: Select 1 face-up monster you control. Send 1 card from your Deck to the Graveyard with the same name as the selected card.
et: Vali 1 avatud koletis, mida sa kontrollid. Saada 1 kaart oma pakist hauakambrisse, millel on sama nimi kui valitud kaardil.

source: Generation Shift
et: Põlvkonna Vahetus

source: Destroy 1 face-up monster you control. Add 1 card from your Deck to your hand with the same name as the destroyed card.
et: Hävita 1 avatud koletis, mida sa kontrollid. Lisa 1 kaart oma pakist oma kätte, millel on sama nimi kui hävitatud kaardil.

source: Full Salvo
et: Täielik Salvo

source: When this card resolves, send your entire hand to the Graveyard. Inflict 200 damage to your opponent for each card you sent to the Graveyard by this effect.
et: Kui see kaart aktiveerub, saada kogu oma käsi Hauakambrisse. Tekita oma vastasele 200 kahju iga kaardi eest, mille sa selle efekti abil Hauakambrisse saatsid.

source: Success Probability 0%
et: Edukuse tõenäosus 0%

source: Send 2 random Fusion Monsters from your opponent's Extra Deck to the Graveyard.
et: Saada 2 juhuslikku Fusion Monsterit oma vastase Extra Deckist Hauakambrisse.

source: Option Hunter
et: Valikujahtija

source: Activate only when a monster you control is destroyed by battle and sent to the Graveyard. Gain Life Points equal to the original ATK of the destroyed monster.
et: Aktiveeri ainult siis, kui sinu kontrollitav koletis hävitatakse lahingus ja saadetakse Hauakambrisse. Saa Elupunkte, mis on võrdne hävitatud koletise algse rünnakuga.

source: Goblin Out of the Frying Pan
et: Pannist välja hüpanud goblin

source: Pay 500 Life Points. Negate the activation of a Spell Card and return it to the owner's hand.
et: Makske 500 Elupunkti. Tühista Loitsukaardi aktiveerimine ja tagasta see omaniku kätte.

source: Malfunction
et: Rike

source: Pay 500 Life Points. Negate the activation of a Trap Card and return it to its original position.
et: Makske 500 Elupunkti. Tühista Lõksukaardi aktiveerimine ja vii see tagasi algsesse asendisse.

source: The Flute of Summoning Kuriboh
et: Kuriiboh' kutsumise flööt

source: Add 1 "<M4064>Kuriboh<M>" or 1 "<M6314>Winged Kuriboh<M>" from your Deck to your hand, OR Special Summon 1 "<M4064>Kuriboh<M>" or 1 "<M6314>Winged Kuriboh<M>" from your Deck.
et: Lisa oma pakist 1 "<M4064>Kuriboh<M>" või 1 "<M6314>Winged Kuriboh<M>" oma kätte, VÕI kutsu eriliselt välja 1 "<M4064>Kuriboh<M>" või 1 "<M6314>Winged Kuriboh<M>" oma pakist.

source: Elemental Hero Electrum
et: Elementaalne Kangelane Elektrum

source: "<M6310>Elemental HERO Avian<M>" + "<M6311>Elemental HERO Burstinatrix<M>" + "<M6312>Elemental HERO Clayman<M>" + "<M6393>Elemental HERO Bubbleman<M>"<BR>Must be Fusion Summoned and cannot be Special Summoned by other ways. While face-up on the field, this card is also WIND, WATER, FIRE, and EARTH-Attribute. When this card is Fusion Summoned: Shuffle all banished cards into the Deck(s). This card gains 300 ATK for each monster your opponent controls that shares an Attribute with this card.
et: "<M6310>Elemental HERO Avian<M>" + "<M6311>Elemental HERO Burstinatrix<M>" + "<M6312>Elemental HERO Clayman<M>" + "<M6393>Elemental HERO Bubbleman<M>"<BR>Peab olema Fusion Summoned ja ei saa olla Special Summoned muul viisil. Kui see kaart on väljakul, on see kaart ka WIND, WATER, FIRE ja EARTH-Attribute. Kui see kaart on Fusion Summoned: sega kõik eemaldatud kaardid tagasi pakki. See kaart saab 300 ATK iga vastase kontrollitava koletise kohta, mis jagab selle kaardiga atribuuti.

source: Exxod, Master of The Guard
et: Exxod, Valvurite Meister

source: This card cannot be Normal Summoned or Set. This card cannot be Special Summoned except by Tributing 1 "sphinx" monster. Each time an EARTH monster is Flip Summoned while this card remains face-up on the field, inflict 1000 damage to your opponent.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti ei saa eriliselt kutsuda, välja arvatud 1 "sfinks" koletise ohverdamise teel. Iga kord, kui MAA koletis on ümberpööratud kutsutud, kui see kaart jääb väljale ülespoole, tekitage oma vastasele 1000 kahju.

source: Great Spirit
et: Suur Vaim

source: Once per turn, during your Main Phase, you can flip this card into face-down Defense Position. When this card is Flip Summoned, you can switch the original ATK and DEF of 1 face-up EARTH monster on the field until the end of this turn.
et: Korra ühe korra oma peafaasil saad selle kaardi pöörata näoga allapoole kaitsepositsiooni. Kui see kaart on pööratud üleskutseks, saad vahetada ühe näoga ülespoole oleva MAA koletise algse ATK ja DEF selle käigu lõpuni.

source: Canyon
et: Kanjoni

source: If a Rock-Type monster in Defense Position is attacked, double any Battle Damage to the controller of the attacking monster.
et: Kui kaitseasendis Kiviliigi koletist rünnatakse, kahekordistatakse ründava koletise kontrollija lahingukahju.

source: Elemental Hero Wild Wingman
et: Elementaalne Kangelane Metsik Tiivamees

source: "<M6478>Elemental Hero Wildheart<M>" + "<M6310>Elemental HERO Avian<M>"<BR>Must be Fusion Summoned and cannot be Special Summoned by other ways. You can discard 1 card to target 1 Spell/Trap Card on the field; destroy that target.
et: "<M6478>Elementaalne Kangelane Metsasüda<M>" + "<M6310>Elementaalne KANGELANE Avian<M>"<BR>Peab olema Fusion Summoned ja ei saa olla Special Summoned muul viisil. Sa võid ühe kaardi ära visata, et sihtida ühte Väljal olevat Loitsu/Lõksu Kaarti; hävita see sihtmärk.

source: Elemental Hero Necroid Shaman
et: Elementaalne Kangelane Nekroid Šamaan

source: "<M6478>Elemental Hero Wildheart<M>" + "<M6527>Elemental Hero Necroshade<M>"<BR>Must be Fusion Summoned and cannot be Special Summoned by other ways. When this card is Special Summoned: Target 1 monster your opponent controls; destroy that target, then Special Summon 1 monster from your opponent's Graveyard to their side of the field.
et: "<M6478>Elementaalne Kangelane Metsasüda<M>" + "<M6527>Elementaalne Kangelane Nekrovari<M>"<BR>Peab olema Fusion Summoned ja ei saa olla Special Summoned muul viisil. Kui see kaart on Special Summoned: Sihtige 1 koletis, mida teie vastane kontrollib; hävitage see sihtmärk, seejärel Special Summon 1 koletis teie vastase kalmistult nende väljale.

source: Golden Homunculus
et: Kuldne Homunkulus

source: This card gains 300 ATK and DEF for each of your removed from play cards.
et: See kaart saab 300 ATK ja DEF iga sinu mängust eemaldatud kaardi eest.

source: Helios - The Primordial Sun
et: Helios - Algne Päike

source: This card's ATK and DEF are each equal to the number of removed from play monsters x 100.
et: Selle kaardi ATK ja DEF on võrdsed mängust eemaldatud koletiste arvuga x 100.
