Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: Once per turn you can pay 500 Life Points to declare 1 card name. Pick up the top card from your Deck and if the card name is the one you declared, add it to your hand. If not, send the card you picked up to the Graveyard.
et: Korra ühe korra käigu jooksul võid maksta 500 Elupunkti, et nimetada 1 kaardi nimi. Tõsta oma pakist pealmine kaart ja kui kaardi nimi on see, mille sa nimetasid, lisa see oma kätte. Kui ei, saada tõstetud kaart Hauakambrisse.

source: Mustering of the Dark Scorpions
et: Pimedate Skorpionide Kogunemine

source: You can only activate this card when there is a face-up "<M5426>Don Zaloog<M>"(s) on your side of the field. You can Special Summon from your hand any of the cards that include "Dark Scorpion" in their card name, or are named "<M5662>Dark Scorpion - Cliff the Trap Remover<M>". (You can only Special Summon up to 1 card with each card name.)
et: Seda kaarti saad aktiveerida ainult siis, kui sinu väljaku poolel on avatud "<M5426>Don Zaloog<M>". Sa saad oma käest eriliselt kutsuda ükskõik millise kaardi, mille nimes on "Dark Scorpion", või mille nimi on "<M5662>Dark Scorpion - Cliff the Trap Remover<M>". (Sa saad eriliselt kutsuda ainult ühe kaardi iga kaardi nimega.)

source: Neither player has to pay Life Points during the Standby Phase for "Archfiend" monsters. Each time a player's "Archfiend" monster(s) is destroyed and sent to the Graveyard, except by battle, that player can add 1 "Archfiend" monster from their Deck to their hand that is a lower Level than the destroyed card.
et: Kumbki ei pea Standby Phase'i ajal maksma Life Points "Archfiend" koletiste eest. Iga kord, kui mängija "Archfiend" koletis(ed) hävitatakse ja saadetakse Hauakambrisse, välja arvatud lahingus, võib see mängija lisada oma pakist ühe "Archfiend" koletise oma kätte, mis on hävitatud kaardist madalama tasemega.

source: Altar for Tribute
et: Ohvrialtar

source: Select 1 monster on your side of the field and send it to the Graveyard. Increase your Life Points by an amount equal to the original ATK of the monster.
et: Vali välja 1 koletis oma väljaku poolelt ja saada see Hauakambrisse. Suurenda oma Elupunkte summa võrra, mis on võrdne koletise algse rünnakupunktide arvuga.

source: Frozen Soul
et: Külmunud Hing

source: You can only activate this card when your Life Points are at least 2000 lower than your opponent's. Skip your opponent's next Battle Phase.
et: Seda kaarti saad aktiveerida ainult siis, kui sinu Elupunktid on vähemalt 2000 võrra madalamad kui sinu vastasel. Jäta vahele oma vastase järgmine Lahingufaas.

source: Battle-Scarred
et: Lahinguarme

source: Select 1 Archfiend monster on your side of the field to activate this card. Your opponent also pays the same Life Points that you pay for the selected monster during the Standby Phase. If this card is removed from the field, destroy the selected monster. When the selected monster is removed from the field, destroy this card.
et: Vali 1 Archfiend koletis oma väljaku poolelt, et aktiveerida see kaart. Sinu vastane maksab sama palju Elupunkte, kui sina maksad valitud koletise eest Ootefaasil. Kui see kaart eemaldatakse väljalt, hävita valitud koletis. Kui valitud koletis eemaldatakse väljalt, hävita see kaart.

source: Dark Scorpion Combination
et: Pimedate Skorpionide Kombinatsioon

source: You can only activate this card when there are "<M5426>Don Zaloog<M>", "<M5662>Dark Scorpion - Cliff the Trap Remover<M>", "<M5718>Dark Scorpion - Chick the Yellow<M>", "<M5765>Dark Scorpion - Gorg the Strong<M>" and "<M5766>Dark Scorpion - Meanae the Thorn<M>" face-up on your side of the field. During this turn, any of these 5 cards can attack your opponent's Life Points directly. In that case, the Battle Damage inflicted to your opponent by each of those cards becomes 400 points.
et: Seda kaarti saab aktiveerida ainult siis, kui sinu väljaku avatud poolel on "<M5426>Don Zaloog<M>", "<M5662>Dark Scorpion - Cliff the Trap Remover<M>", "<M5718>Dark Scorpion - Chick the Yellow<M>", "<M5765>Dark Scorpion - Gorg the Strong<M>" ja "<M5766>Dark Scorpion - Meanae the Thorn<M>". Selle käigu ajal võivad kõik need 5 kaarti rünnata sinu vastase Elupunkte otse. Sel juhul muutub iga nende kaartide poolt sinu vastasele tekitatud Lahingukahju 400 punktiks.

source: Archfiend's Roar
et: Deemonite möire

source: Pay 500 Life Points to activate this card. Special Summon 1 Archfiend Monster Card from your Graveyard. This monster cannot be Tributed under any conditions and is destroyed during the End Phase of this turn.
et: Makske 500 Elupunkti, et aktiveerida see kaart. Kutsu eriliselt välja 1 Deemon Koletise Kaart oma Hauakambrist. Seda koletist ei saa mingil tingimusel ohverdada ja see hävitatakse selle käigu lõppfaasis.

source: Dice Re-Roll
et: Täringu ümberveeretamine

source: Once this turn, negate 1 six-sided die roll and re-roll it.
et: Korra sellel käigul 1 kuuepoolse täringu veeretus ja veereta see uuesti.

source: Spell Vanishing
et: Loitsu Kadumine

source: Discard 2 cards from your hand to negate the activation of a Spell Card and destroy it. Also, check your opponent's hand and Deck and if you find any Spell Cards with the same name as the destroyed Spell Card, send all of them to the Graveyard.
et: Viska 2 kaarti oma käest, et tühistada Võlusõna Kaardi aktiveerimine ja hävitada see. Samuti kontrolli oma vastase kätt ja Paki ning kui leiad mõne Võlusõna Kaardi, millel on sama nimi kui hävitatud Võlusõna Kaardil, saada need kõik Hauakambrisse.

source: Activate only when an opponent's monster declares an attack. Destroy the attacking monster.
et: Aktiveeri ainult siis, kui vastase koletis kuulutab välja rünnaku. Hävita ründav koletis.

source: Ray of Hope
et: Lootusekiir

source: Add 2 LIGHT monsters from your Graveyard to your Deck and shuffle it.
et: Lisa oma kalmistult 2 VALGUS koletist oma pakki ja sega see läbi.

source: Nightmare Penguin
et: Õudusunenäo Pingviin

source: When this card is flipped face-up, select 1 card your opponent controls, and return it to the hand. All face-up WATER monsters you control gain 200 ATK.
et: Kui see kaart pööratakse avatud asendisse, vali 1 kaart, mida sinu vastane kontrollib, ja tagasta see käele. Kõik avatud asendis VEE koletised, mida sa kontrollid, saavad 200 ATK juurde.

source: Perfect Machine King
et: Perfektne Masinakuningas

source: This card gains 500 ATK for each other Machine-Type monster on the field.
et: See kaart saab 500 ATK iga teise väljal oleva Masinatüüpi koletise eest.

source: Chiron the Mage
et: Maag Chiron

source: Once per turn, you can discard 1 Spell Card to destroy 1 Spell or Trap Card your opponent controls.
et: Korra ühe korra käigu jooksul saad sa visata ära 1 Loitsukaardi, et hävitada 1 Loitsu- või Lõksukaart, mida sinu vastane kontrollib.

source: Ojama Yellow
et: Ojama Kollane

source: Ojama Black
et: Ojama Must

source: Soul Tiger
et: Hingetiiger

source: The soul of a tiger that is said to devour human souls. He is a famous soul that you wouldn't want to run into in a dark alley.
et: Tiigri hing, kes väidetavalt neelab inimhingi. Ta on kuulus hing, keda sa ei tahaks pimedas allees kohata.

source: Big Koala
et: Suur Koala

source: A species of huge Des Koala. He's meek, but people are afraid of him because he's very powerful.
et: Hiiglasliku Des Koala liik. Ta on arglik, kuid inimesed kardavad teda, sest ta on väga võimas.

source: Des Kangaroo
et: Des Känguru

source: If the ATK of a monster that attacks this monster is lower than the DEF of this card, destroy the attacking monster. (Damage calculation is applied normally.)
et: Kui selle koletise ründava koletise ATK on madalam kui selle kaardi DEF, hävita ründav koletis. (Kahju arvutamine toimub tavapäraselt.)

source: Crimson Ninja
et: Veripunane Ninja

source: Strike Ninja
et: Löögininja

source: You can remove this card from play until the End Phase of this turn by removing 2 DARK monsters in your Graveyard from play. You can use this effect during either player's turn. You can only use this effect once per turn.
et: Saad selle kaardi mängust eemaldada kuni selle käigu lõppfaasini, eemaldades oma kalmistult mängust 2 PIMEDUST koletist. Saad seda efekti kasutada mõlema mängija käigu ajal. Saad seda efekti kasutada ainult üks kord käigu jooksul.

source: Gale Lizard
et: Tormilisko

source: FLIP: Select 1 Monster Card on your opponent's side of the field and return it to its owner's hand.
et: FLIP: Vali 1 koletisekaart oma vastase väljaku poolelt ja tagasta see selle omaniku kätte.

source: Spirit of the Pot of Greed
et: Ahne Pot of Greed

source: While this card is in face-up Attack Position on the field, if a player activates "<M4844>Pot of Greed<M>", they can draw 1 more card.
et: Kui see kaart on lahinguväljal avatud ründeasendis ja mängija aktiveerib "<M4844>Ahneuse Pott<M>", võib ta tõmmata 1 kaardi rohkem.

source: Chopman the Desperate Outlaw
et: Hädasolev lindprii Chopman

source: When this card is Flip Summoned, you can equip 1 Equip Spell Card in your Graveyard to this card.
et: Kui see kaart on ümberpööratud, saad varustada sellele kaardile ühe Varustuse Võlusõna Kaardi oma Hauakambrist.

source: When this card inflicts Battle Damage to your opponent's Life Points, your opponent draws cards until his/her hand has 7 cards.
et: Kui see kaart tekitab lahingukahju sinu vastase elupunktidele, tõmbab sinu vastane kaarte, kuni tema käes on 7 kaarti.

source: D.D. Scout Plane
et: D.D. Skautlennuk

source: If this card is removed from play, Special Summon it in face-up Attack Position during the End Phase of this turn.
et: Kui see kaart eemaldatakse mängust, kutsu see selle käigu lõppfaasis eriliselt välja avatud ründeasendis.

source: If this card is in face-up Defense Position on the field, destroy this card. The controller of this card must attack with this card if possible.
et: Kui see kaart on väljakul avatud kaitsepositsioonis, hävita see kaart. Selle kaardi kontrollija peab selle kaardiga ründama, kui võimalik.

source: Freed the Brave Wanderer
et: Vapper Rändur Freed

source: Once per turn you can remove from play 2 LIGHT monsters in your Graveyard to destroy 1 face-up monster on the field with higher ATK than this card.
et: Korra ühe käigu jooksul saad eemaldada oma kalmistult mängust 2 VALGUSE koletist, et hävitada 1 avatud koletis väljal, mille ATK on sellest kaardist suurem.

source: Coach Goblin
et: Treener Goblin

source: While this card is face-up on your side of the field, you can return 1 Normal Monster Card in your hand to the bottom of your Deck during your End Phase to draw 1 card from your Deck. You can only use this effect once per turn.
et: Kui see kaart on sinu väljaku poolel avatud, saad oma lõppfaasis ühe tavalise koletise kaardi oma käest oma paki põhja tagasi panna, et tõmmata üks kaart oma pakist. Seda efekti saab kasutada ainult üks kord käigu jooksul.

source: Witch Doctor of Chaos
et: Kaose Nõidarst

source: FLIP: Select 1 Monster Card from you or your opponent's Graveyard. Remove it from play.
et: FLIP: Vali 1 koletise kaart enda või vastase kalmistult. Eemalda see mängust.

source: Chaos Necromancer
et: Kaose Nekromant

source: The ATK of this card becomes the number of Monster Cards in your Graveyard x 300 points.
et: Selle kaardi ATK muutub sinu Hauakambris olevate Koletiskaartide arvuks x 300 punkti.

source: Chaosrider Gustaph
et: Kaosiratsur Gustaph

source: Once per turn, you can remove from play up to 2 Spell Cards in your Graveyard. This card gains 300 ATK for each card removed, until the end of your opponent's next turn.
et: Korra ühe käigu jooksul saad eemaldada oma kalmistult mängust kuni 2 Võlukaarti. See kaart saab iga eemaldatud kaardi eest 300 ATK-d juurde kuni sinu vastase järgmise käigu lõpuni.

source: Inferno
et: Põrgu

source: This card cannot be Normal Summoned or Set. This card can only be Special Summoned by removing 1 FIRE monster in your Graveyard from play. When this card destroys your opponent's monster and sends it to the Graveyard as a result of battle, inflict 1500 points of damage to your opponent's Life Points.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti saab eriliselt kutsuda ainult eemaldades oma kalmistult mängust 1 TULE monster. Kui see kaart hävitab sinu vastase koletise ja saadab selle lahingu tulemusena kalmistule, tekitab see sinu vastase elupunktidele 1500 punkti kahju.

source: This card cannot be Normal Summoned or Set. This card can only be Special Summoned by removing 2 WATER monsters in your Graveyard from play. When this card destroys an opponent's monster as a result of battle, your opponent skips his/her next Draw Phase.
et: Seda kaarti ei saa normaalset kutsuda ega asetada. Seda kaarti saab eriliselt kutsuda ainult eemaldades oma kalmistult mängust 2 VEE koletist. Kui see kaart hävitab lahingu tulemusena vastase koletise, jätab vastane vahele oma järgmise tõmbamisfaasi.

source: Gigantes
et: Gigandid

source: This card cannot be Normal Summoned or Set. This card can only be Special Summoned by removing from play 1 EARTH monster in your Graveyard. When this card is destroyed by battle and sent to the Graveyard, destroy all Spell and Trap Cards on the field.
et: Seda kaarti ei saa normaalset kutsuda ega asetada. Seda kaarti saab eriliselt kutsuda ainult eemaldades oma kalmistult mängust 1 MAA koletise. Kui see kaart hävitatakse lahingus ja saadetakse kalmistule, hävita kõik Väljal olevad Loitsu- ja Lõksukaardid.

source: This card cannot be Normal Summoned or Set. This card can only be Special Summoned by removing from play 1 WIND monster in your Graveyard. When this card is destroyed as a result of battle and sent to the Graveyard, your opponent discards 1 random card from their hand.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti saab eriliselt kutsuda ainult eemaldades mängust 1 TUULE koletise oma hauakambrist. Kui see kaart hävitatakse lahingu tulemusena ja saadetakse hauakambrisse, viskab sinu vastane oma käest juhuslikult ühe kaardi ära.

source: Chaos Sorcerer
et: Kaose Võlur

source: This card cannot be Normal Summoned or Set. This card can only be Special Summoned by removing from play 1 LIGHT and 1 DARK monster in your Graveyard. Once per turn, during your Main Phase, you can select 1 face-up monster on the field, and remove it from play. If you activate this effect, this card cannot attack this turn
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti saab eriliselt kutsuda ainult eemaldades mängust 1 VALGUSE ja 1 PIMEDUSE koletise oma hauakambris. Kord käigu jooksul, oma põhifaasis, saad valida 1 avatud koletise väljal ja eemaldada see mängust. Kui aktiveerid selle efekti, ei saa see kaart sel käigul rünnata

source: This card's ATK and DEF are each equal to the number of your removed from play cards x 400.
et: Selle kaardi ATK ja DEF on võrdsed sinu mängust eemaldatud kaartide arvuga x 400.

source: Black Luster Soldier - Envoy of the Beginning
et: Musta Luster Sõdur - Alguse Käskjalg

source: This card cannot be Normal Summoned or Set. This card can only be Special Summoned by removing from play 1 LIGHT and 1 DARK monster in your Graveyard. Once during each of your turns, you can select and activate 1 of the following effects:<BR>● Select 1 monster on the field, and remove it from play. If you activate this effect, this card cannot attack during this turn.<BR>● If this card destroyed your opponent's monster by battle, it can attack once again in a row.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti saab eriliselt kutsuda ainult eemaldades mängust 1 VALGUS ja 1 PIMEDUS koletise oma hauakambris. Kord iga oma käigu jooksul saad valida ja aktiveerida ühe järgmistest efektidest:<BR>● Vali 1 koletis väljakul ja eemalda see mängust. Kui aktiveerid selle efekti, ei saa see kaart sellel käigul rünnata.<BR>● Kui see kaart hävitas lahingus sinu vastase koletise, saab see rünnata veel kord järjest.

source: You can only equip this card to a "Ninja" monster. Increase the ATK of the equipped monster by 700 points. When this card is sent from the field to the Graveyard, inflict 700 points of damage to your opponent's Life Points.
et: Seda kaarti saab varustada ainult "Ninja" koletisele. Suurenda varustatud koletise ATK-d 700 punkti võrra. Kui see kaart saadetakse väljakult Hauakambrisse, põhjusta oma vastase Elupunktidele 700 punkti kahju.

source: Heart of the Underdog
et: Autsaideri Süda

source: During your Draw Phase, when you draw a Normal Monster Card(s), you can draw 1 more card by showing it to your opponent.
et: Oma Tõmbamisfaasis, kui tõmbad Tavalise Koletise Kaardi(d), võid tõmmata 1 kaardi rohkem, näidates seda oma vastasele.

source: Wild Nature's Release
et: Metsiku Looduse Vabastamine

source: Select 1 Beast-Type or Beast-Warrior-Type monster; it gains ATK equal to its DEF until the end of this turn. Destroy the monster during the End Phase.
et: Vali 1 Põhjuse- või Põhjuse-Sõdalase-tüüpi koletis; see saab ATK-d, mis on võrdne selle DEF-iga kuni käigu lõpuni. Hävita koletis Lõppfaasis.

source: Ojama Delta Hurricane!!
et: Ojama Delta Orkaan!!

source: You can only activate this card while "<M5761>Ojama Green<M>", "<M5811>Ojama Yellow<M>" and "<M5812>Ojama Black<M>" are face-up on your side of the field. Destroy all cards on your opponent's side of the field.
et: Seda kaarti saad aktiveerida ainult siis, kui "<M5761>Ojama Green<M>", "<M5811>Ojama Yellow<M>" ja "<M5812>Ojama Black<M>" on sinu väljaku poolel avatud. Hävita kõik kaardid vastase väljaku poolel.

source: Stumbling
et: Kompamine

source: Any monster that is Normal Summoned, Flip Summoned or Special Summoned is changed to Defense Position.
et: Iga koletis, mis kutsutakse välja normaal-, ümberpööramis- või erikutsumise teel, muudetakse kaitseasendisse.

source: Chaos End
et: Kaose lõpp

source: You can only activate this card if 7 or more of your cards are currently removed from play. Destroy all Monster Cards on the field.
et: Seda kaarti saab aktiveerida ainult siis, kui 7 või enam sinu kaarti on praegu mängust eemaldatud. Hävita kõik koletiskaardid väljal.

source: Chaos Greed
et: Kaose Ahnus

source: You can only activate this card if 4 or more of your cards are currently removed and there are no cards in your Graveyard. Draw 2 cards.
et: Seda kaarti saad aktiveerida ainult siis, kui 4 või enam sinu kaarti on praegu eemaldatud ja sinu Hauakambris pole ühtegi kaarti. Tõmba 2 kaarti.

source: D.D. Designator
et: D.D. Määrang

source: Declare 1 card name. Look at your opponent's hand, and if they have the declared card in their hand, remove that 1 card from play. If they doesn't have the declared card in their hand, remove 1 random card in your hand from play.
et: Teata 1 kaardi nimi. Vaata oma vastase kätt ja kui tal on nimetatud kaart käes, eemalda see 1 kaart mängust. Kui tal ei ole nimetatud kaarti käes, eemalda 1 juhuslik kaart oma käest mängust.

source: D.D. Borderline
et: D.D. Piirjoon

source: When there are no Spell Cards in your Graveyard, neither player can conduct their Battle Phase.
et: Kui sinu kalmistul pole ühtegi loitsukaarti, ei saa kumbki mängija oma lahingufaasi läbi viia.

source: Recycle
et: Taaskasutus

source: During your Standby Phase, by paying 300 Life Points, select 1 non-Monster Card in your Graveyard and return it to the bottom of your Deck.
et: Oma Standby Phase'i ajal, makstes 300 Elupunkti, vali 1 mitte-Koletis Kaart oma Hauakambris ja tagasta see oma Paki põhja.

source: Primal Seed
et: Algeseeme

source: If there is a face-up "<M5835>Black Luster Soldier - Envoy of the Beginning<M>" or "<M5860>Chaos Emperor Dragon - Envoy of the End<M>" on the field: Target 2 of your banished cards; add those targets to your hand.
et: Kui väljakul on avatud "<M5835>Must Luster Sõdur - Alguse Käskjalg<M>" või "<M5860>Kaose Keisri Draakon - Lõpu Käskjalg<M>": Sihtige 2 oma eemaldatud kaarti; lisage need sihtmärgid oma kätte.

source: Thunder Crash
et: Äikese Krahh

source: Destroy all monsters on your side of the field. Inflict damage to your opponent's Life Points equal to the number of monsters destroyed x 300 points.
et: Hävita kõik koletised oma väljaku poolel. Tekita oma vastase Elupunktidele kahju, mis on võrdne hävitatud koletiste arvuga x 300 punkti.

source: Dimension Distortion
et: Dimensioonimoonutus

source: You can only activate this card if there are no cards in your Graveyard. Select 1 removed from play monster and Special Summon it on your side of the field.
et: Seda kaarti saad aktiveerida ainult siis, kui sinu Hauakambris pole ühtegi kaarti. Vali 1 mängust eemaldatud koletis ja Kutsu see oma väljaku poolele.

source: Reload
et: Laadimine

source: Add all the cards in your hand to your Deck and shuffle it. Then draw the same number of cards that you added to your Deck.
et: Lisa kõik kaardid oma käest oma pakki ja sega see läbi. Seejärel tõmba sama arv kaarte, kui lisasid oma pakki.

source: Soul Absorption
et: Hinge Imendumine

source: Each time a card(s) is removed from play, increase your Life Points by 500 points for each card removed from play.
et: Iga kord, kui kaart või kaardid mängust eemaldatakse, suurenda oma Elupunkte 500 punkti võrra iga mängust eemaldatud kaardi eest.

source: Big Burn
et: Suur Põlemine

source: You can only activate this card when your opponent activates a card that targets a monster in the Graveyard. Remove from play all monsters in both players' Graveyards.
et: Seda kaarti saab aktiveerida ainult siis, kui sinu vastane aktiveerib kaardi, mis sihib koletist hauakambris. Eemalda mängust kõik koletised mõlema mängija hauakambrites.

source: Blasting the Ruins
et: Varemete purustamine

source: You can only activate this card if there are 30 or more cards in your Graveyard. Inflict 3000 points of damage to your opponent's Life Points.
et: Seda kaarti saab aktiveerida ainult siis, kui sinu Hauakambris on 30 või rohkem kaarti. Põhjusta oma vastase Elupunktidele 3000 punkti kahju.

source: Cursed Seal of the Forbidden Spell
et: Keelatud loitsu neetud pitser

source: Discard 1 Spell Card. Negate the activation and the effect of a Spell Card and destroy it. Your opponent cannot activate Spell Cards with that name during the rest of this Duel.
et: Viska 1 Võlukaart. Tühista Võlukaardi aktiveerimine ja efekt ning hävita see. Sinu vastane ei saa selle Duelli jooksul selle nimega Võlukaarte aktiveerida.

source: Tower of Babel
et: Paabeli torn

source: Each time a Spell Card is activated, place 1 Spell Counter on this card. When the 4th Spell Counter is placed on this card, destroy this card and inflict 3000 damage to the player that activated the Spell Card at that time.
et: Iga kord, kui Aktiveeritakse Võlukaarte, pane sellele kaardile 1 Võluloendur. Kui sellele kaardile on pandud 4. Võluloendur, hävita see kaart ja tekita 3000 kahju mängijale, kes sel ajal Võlukaardi aktiveeris.

source: Spatial Collapse
et: Ruumiline Kokkuvarisemine

source: You can only activate this card when both you and your opponent each have 5 or less cards on the field. As long as this card remains face-up on the field, the total number of cards that each player can have on the field is 5.
et: Seda kaarti saab aktiveerida ainult siis, kui nii sinul kui ka sinu vastasel on väljakul 5 või vähem kaarti. Kuni see kaart jääb väljakule avatud olekus, võib iga mängija väljakul olla kokku 5 kaarti.

source: Chain Disappearance
et: Ahela Kadumine

source: When a monster(s) with 1000 or less ATK is Summoned: Banish that monster(s), then your opponent banishes all cards with the same name as that card(s) from their hand and Deck.
et: Kui kutsutakse välja koletis(ed) 1000 või vähem ATK-ga: Kõrvalda see koletis(ed) mängust, seejärel kõrvaldab sinu vastane kõik sama nimega kaardid oma käest ja pakist.

source: Zero Gravity
et: Nullgravitatsioon
