Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: Gift of The Mystical Elf
et: Müstilise Elfi Kingitus

source: Increase your Life Points by 300 points for each monster on the field.
et: Suurenda oma Elupunkte 300 punkti võrra iga koletise eest, mis on väljakul.

source: The Eye of Truth
et: Tõe Silm

source: As long as this card remains face-up on the field, your opponent must show his/her hand. Your opponent increases his/her Life Points by 1000 points at each of his/her Standby Phases if he/she has a Spell Card in his/her hand.
et: Niikaua kui see kaart jääb väljale avatud olekus, peab sinu vastane oma kätt näitama. Sinu vastane suurendab oma Elupunkte 1000 punkti võrra iga oma Ootefaasiga, kui tal on käes Loitsukaart.

source: Dust Tornado
et: Tolmutornaado

source: Target 1 Spell/Trap Card your opponent controls; destroy that target. Then you can Set 1 Spell or Trap Card from your hand.
et: Sihti 1 loitsu/lõksukaart, mida sinu vastane kontrollib; hävita see sihtmärk. Seejärel saad oma käest 1 loitsu või lõksukaardi asetada.

source: Call of the Haunted
et: Kummituste kutse

source: Select 1 monster from your Graveyard and Special Summon it in face-up Attack Position. When this card is removed from the field, destroy that monster. When that monster is destroyed, destroy this card.
et: Vali oma kalmistult 1 koletis ja Kutsu see erilisel viisil välja näoga ülespoole Rünnakupositsioonis. Kui see kaart eemaldatakse väljakult, hävita see koletis. Kui see koletis hävitatakse, hävita see kaart.

source: Solomon's Lawbook
et: Salomoni seaduseraamat

source: Skip your next Standby Phase.
et: Jäta oma järgmine Ootefaas vahele.

source: Earthshaker
et: Maa-raputaja

source: Select 2 Monster Card Attributes. Your opponent then selects 1 of the 2 Attributes and destroys all face-up monsters with that Attribute on the field.
et: Vali 2 koletise kaardi atribuuti. Sinu vastane valib seejärel ühe kahest atribuudist ja hävitab kõik selle atribuudiga avatud koletised väljal.

source: Enchanted Javelin
et: Lummatud Odapuu

source: Increase your Life Points by the ATK of 1 attacking monster.
et: Suurenda oma Elupunkte 1 ründava koletise ATK võrra.

source: Mirror Wall
et: Peegelsein

source: Halve the ATK of all your opponent's attacking monsters. During each of your Standby Phases, pay 2000 Life Points or destroy this card.
et: Vähenda kõigi sinu vastase ründavate koletiste ATK-d poole võrra. Iga oma ooteetapi ajal maksa 2000 Elupunkti või hävita see kaart.

source: Obelisk the Tormentor
et: Obelisk Piinaja

source: You must Tribute 3 monsters to Normal Summon this card (you cannot Set this card). The Normal Summon of this card cannot be negated. When this card is Normal Summoned, cards and effects cannot be activated. This card cannot be targeted by Spells, Traps, Spell/Trap effects, or Effect Monster effects. If this card is Special Summoned, it is sent to the Graveyard during the End Phase. You can Tribute 2 monsters to destroy all monsters your opponent controls. This card cannot declare an attack the turn this effect is activated.
et: Sa pead ohverdama 3 koletist, et seda kaarti normaalselt kutsuda (sa ei saa seda kaarti asetada). Selle kaardi normaalset kutsumist ei saa tühistada. Kui see kaart on normaalselt kutsutud, ei saa kaarte ja efekte aktiveerida. Seda kaarti ei saa sihtida loitsude, lõksude, loitsu/lõksu efektide ega efektkoletiste efektidega. Kui see kaart on eriliselt kutsutud, saadetakse see lõppfaasis hauakambrisse. Sa võid ohverdada 2 koletist, et hävitada kõik koletised, mida sinu vastane kontrollib. See kaart ei saa rünnakut kuulutada sellel käigul, kui see efekt on aktiveeritud.

source: Slifer the Sky Dragon
et: Taevadraakon Slifer

source: You must Tribute 3 monsters to Normal Summon this card (You cannot Set this card). The Normal Summon of this card cannot be negated. When this card is Normal Summoned, Spells, Traps, and Effect Monster effects cannot be activated. This card cannot be targeted by the effects of Spells, Traps, or Effect Monsters. If this card is Special Summoned, it is sent to the Graveyard during the End Phase. The ATK and DEF of this card becomes the number of cards in your Hand x 1000. When your opponent Normal Summons or Flip Summons a monster with 2000 DEF or less, destroy that monster.
et: Selle kaardi tavaliseks kutsumiseks pead sa ohverdama 3 koletist (sa ei saa seda kaarti asetada). Selle kaardi tavalist kutsumist ei saa tühistada. Kui see kaart on tavaliselt kutsutud, ei saa aktiveerida loitse, lõkse ega efektkoletiste efekte. Selle kaardi sihtmärgiks ei saa olla loitsude, lõksude ega efektkoletiste efektid. Kui see kaart kutsutakse eriliselt, saadetakse see lõppfaasis surnuaeda. Selle kaardi ATK ja DEF muutuvad sinu käes olevate kaartide arvuks x 1000. Kui sinu vastane kutsub tavaliselt või ümberpööramise teel koletise, mille DEF on 2000 või vähem, hävita see koletis.

source: The Winged Dragon of Ra
et: Ra tiivuline draakon

source: Cannot be Special Summoned. Requires 3 Tributes to Normal Summon (cannot be Normal Set). This card's Normal Summon cannot be negated. When Normal Summoned, other cards and effects cannot be activated. When this card is Normal Summoned: You can pay Life Points so that you only have 100 left; this card gains ATK and DEF equal to the amount of Life Points paid. You can pay 1000 Life Points, then target 1 monster on the field; destroy that target.
et: Ei saa erikutsuda. Nõuab 3 ohverdust, et tavakutsuda (ei saa tavaliselt asetada). Selle kaardi tavakutsumist ei saa tühistada. Kui see kaart on tavakutsutud, ei saa teisi kaarte ja efekte aktiveerida. Kui see kaart on tavakutsutud: Sa võid maksta elupunkte nii, et sul jääb alles ainult 100; see kaart saab ATK ja DEF võrdseks makstud elupunktide arvuga. Sa võid maksta 1000 elupunkti, seejärel sihtida 1 koletist väljal; hävita see sihtmärk.

source: Windstorm of Etaqua
et: Etaqua tuuleiil

source: Change the battle positions of all face-up monsters your opponent controls.
et: Muuda kõigi vastase kontrollitavate avatud positsioonis olevate koletiste lahingupositsioone.

source: Valkyrion the Magna Warrior
et: Valkyrion, Magna Sõdalane

source: This card cannot be Normal Summoned or Set. This card can only be Special Summoned by Tributing "<M4744>Alpha The Magnet Warrior<M>", "<M4763>Beta The Magnet Warrior<M>", and "<M4792>Gamma the Magnet Warrior<M>" from your hand or your side of the field. You can Tribute this card to Special Summon "<M4744>Alpha The Magnet Warrior<M>", "<M4763>Beta The Magnet Warrior<M>", and "<M4792>Gamma the Magnet Warrior<M>" from your Graveyard.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti saab eriliselt kutsuda ainult ohverdades "<M4744>Alpha The Magnet Warrior<M>", "<M4763>Beta The Magnet Warrior<M>" ja "<M4792>Gamma the Magnet Warrior<M>" oma käest või oma väljaku poolelt. Sa saad ohverdada selle kaardi, et eriliselt kutsuda "<M4744>Alpha The Magnet Warrior<M>", "<M4763>Beta The Magnet Warrior<M>" ja "<M4792>Gamma the Magnet Warrior<M>" oma hauakambrist.

source: Alligator's Sword Dragon
et: Alligaatori Mõõgadraakon

source: "<M4010>Baby Dragon<M>" + "<M4767>Alligator's Sword<M>"<BR>This card can attack directly if the only face-up monsters your opponent controls are EARTH, WATER, or FIRE.
et: "<M4010>Beebi Draakon<M>" + "<M4767>Alligaatori Mõõk<M>"<BR>See kaart võib rünnata otse, kui ainsad avatud koletised, mida sinu vastane kontrollib, on MAA, VESI või TULI.

source: This wicked Beast-Warrior does every horrid thing imaginable and loves it! His axe bears the marks of his countless victims.
et: See õel Metssõdalane teeb kõike kujuteldavat jubedat asja ja naudib seda! Tema kirves kannab tema lugematute ohvrite jälgi.

source: Ring of Destruction
et: Hävitusrõngas

source: Select and destroy 1 face-up monster, and inflict damage to both players equal to its ATK.
et: Vali ja hävita 1 avatud positsioonis olev koletis ning põhjusta mõlemale mängijale kahju, mis on võrdne selle rünnakupunktidega.

source: Aqua Chorus
et: Aqua Koor

source: If there are monsters with the same name on the field, increase the ATK and DEF of all those monsters with the same name by 500 points.
et: Kui väljakul on sama nimega koletisi, suurenda kõigi nende sama nimega koletiste ATK ja DEF 500 punkti võrra.

source: Sebek's Blessing
et: Sebeki õnnistus

source: Activate only when a monster you control has attacked your opponent directly. Gain Life Points equal to the Battle Damage that the monster inflicted to your opponent.
et: Aktiveeri ainult siis, kui sinu kontrollitav koletis on rünnanud otse sinu vastast. Saa Elupunkte, mis on võrdne lahingukahjuga, mida koletis sinu vastasele tekitas.

source: Anti-Spell Fragrance
et: Antiloitsu lõhn

source: Both players must Set Spell Cards before activating them, and cannot activate them until their next turn.
et: Mõlemad mängijad peavad enne aktiveerimist Maagia Kaardid asetama ja ei saa neid aktiveerida enne järgmist käiku.

source: Halve the ATK of 1 face-up monster and add the same amount to the ATK of another face-up monster, until the end of this turn.
et: Vähenda ühe avatud koletise ATK poole võrra ja lisa sama kogus teise avatud koletise ATK-le kuni selle käigu lõpuni.

source: Sword of Dragon's Soul
et: Draakoni hinge mõõk

source: This card can only be equipped to a Warrior-Type monster. A monster equipped with this card increases its ATK by 700 points. A Dragon-Type monster that battles with the monster equipped with this card is destroyed at the end of the Battle Phase. (Damage calculation is applied normally.)
et: Seda kaarti saab varustada ainult Sõdalase-tüüpi koletisele. Selle kaardiga varustatud koletis suurendab oma ATK-d 700 punkti võrra. Draakoni-tüüpi koletis, mis võitleb selle kaardiga varustatud koletisega, hävitatakse Lahingufaasi lõpus. (Kahju arvutamine toimub tavapäraselt.)

source: Seal of the Ancients
et: Iidsete Pitser

source: Pay 1000 Life Points. Pick up and see all face-down cards on your opponent's side of the field, then return them to their original positions. (The effects of the face-down cards are not activated.)
et: Maksa 1000 Elupunkti. Tõsta üles ja vaata kõiki vastase väljaku poolel olevaid tagurpidi kaarte, seejärel pane need tagasi oma algsetesse asenditesse. (Tagurpidi kaartide efektid ei aktiveeru.)

source: Luminous Soldier
et: Helendav Sõdur

source: If this card battles with a DARK monster, increase the ATK of this card by 500 points during the Damage Step.
et: Kui see kaart võitleb PIMEDA koletisega, suurenda selle kaardi ATK-d 500 punkti võrra Kahjustuse etapi ajal.

source: King Tiger Wanghu
et: Kuningas Tiiger Wanghu

source: Destroy all monsters with an ATK equal to 1400 or less that are Normal Summoned or Special Summoned.
et: Hävita kõik koletised, kelle ATK on 1400 või vähem ja kes on Normaal- või Erikutsutud.

source: Command Knight
et: Käsukuningas

source: While at least 1 other monster exists on your side of the field, your opponent cannot select this card as an attack target. Also, while this card remains face-up on the field, increase the ATK of all your Warrior-Type monsters by 400 points.
et: Kui sinu väljakul on vähemalt 1 teine koletis, ei saa sinu vastane valida seda kaarti rünnaku sihtmärgiks. Samuti, kui see kaart jääb väljakule avatud olekus, suurenda kõigi oma Sõdalase-tüüpi koletiste rünnakupunkte 400 võrra.

source: Wolf Axwielder
et: Hundikirvesemees

source: Once it has started battle, this monster attacks fiercely and cannot stop.
et: Kord alustanud lahingut, ründab see koletis raevukalt ja ei suuda peatuda.

source: The Illusory Gentleman
et: Illusoorne Härrasmees

source: Wearing odd fashions, this gentleman is very fickle. He sometimes saves people and at other times commits crimes.
et: Kandes moode kandev härrasmees on väga tujukas. Ta päästab mõnikord inimesi ja teinekord sooritab kuritegusid.

source: Patrician of Darkness
et: Pimeduse patriits

source: The controller of this card selects the targets of their opponent's attacks.
et: Selle kaardi kontrollija valib oma vastase rünnakute sihtmärgid.

source: Birdface
et: Linnunägu

source: When this card is sent to the Graveyard as a result of battle, you can add 1 "<M4068>Harpie Lady<M>" from your Deck to your hand. Then shuffle your Deck.
et: Kui see kaart saadetakse lahingu tulemusena Hauakambrisse, võid lisada oma pakist ühe "<M4068>Harpie Lady<M>" oma kätte. Seejärel sega oma pakk.

source: When this card is sent to the Graveyard as a result of battle, toss a coin and call it. If you call it right, destroy 1 monster on your opponent's side of the field.
et: Kui see kaart saadetakse lahingu tulemusena Hauakambrisse, viska münti ja ütle, kummale poole see kukub. Kui arvasid õigesti, hävita 1 koletis vastase väljakupoolel.

source: Airknight Parshath
et: Õhuparun Parshath

source: During battle between this attacking card and a Defense Position monster whose DEF is lower than the ATK of this card, inflict the difference as Battle Damage to your opponent. When this card inflicts Battle Damage to your opponent, draw 1 card.
et: Kui selle ründava kaardi ja kaitsepositsioonis oleva koletise, mille DEF on madalam kui selle kaardi ATK, vahel toimub lahing, põhjusta vahe vastasele Lahingukahjuna. Kui see kaart põhjustab vastasele Lahingukahju, tõmba 1 kaart.

source: Fairy King Truesdale
et: Haldjakuningas Truesdale

source: While this card is in Defense Position, all Plant-Type monsters you control gain 500 ATK and DEF.
et: Kui see kaart on kaitsepositsioonis, saavad kõik sinu kontrolli all olevad Taimetüüpi koletised 500 ATK ja DEF juurde.

source: Serpentine Princess
et: Madude Printsess

source: If this face-up card is returned from the field to your Deck, select and Special Summon 1 Level 3 or lower monster from your Deck to your side of the field. Then shuffle your Deck.
et: Kui see avatud kaart tagastatakse väljakult sinu pakki, vali ja erikutsu 1 3. või madalama taseme koletis oma pakist oma väljaku poolele. Seejärel sega oma pakk.

source: Maiden of the Aqua
et: Vee Neitsi

source: As long as this card remains face-up on the field, the field is treated as "<M4340>Umi<M>" (however there is no increasing or decreasing of ATK/DEF due to "<M4340>Umi<M>"'s effect). If there is an active Field Spell Card on the field, this effect is not applied.
et: Niikaua kui see kaart jääb väljale avatud olekusse, käsitletakse välja kui "<M4340>Umi<M>" (kuid "<M4340>Umi<M>" efekti tõttu ei suurene ega vähene ATK/DEF). Kui väljal on aktiivne Väljaloitsu kaart, siis see efekt ei kehti.

source: Robotic Knight
et: Robotirüütel

source: The Commander of Machine-Types, he serves the Machine King. He is famous for the way he controls his troops.
et: Masinatüüpide komandör, ta teenib Masinakuningat. Ta on kuulus oma vägede juhtimise viisi poolest.

source: Thunder Nyan Nyan
et: Äike Nyan Nyan

source: If there is a non-LIGHT monster on your side of the field, destroy this face-up card.
et: Kui sinu väljaku poolel on mitte-VALGUS koletis, hävita see avatud kaart.

source: Molten Behemoth
et: Sulav Koljat

source: A giant born from magma, it attacks with a magma punch.
et: Magmaast sündinud hiiglane, kes ründab magma löögiga.

source: Twin-Headed Behemoth
et: Kakspealine Behemot

source: If this card is destroyed and sent from the field to the Graveyard, Special Summon it during the End Phase of this turn with 1000 ATK and 1000 DEF. Each player can only use the effect of "<M5030>Twin-Headed Behemoth<M>" once per Duel.
et: Kui see kaart hävitatakse ja saadetakse väljakult Hauakambrisse, kutsu see selle käigu lõppfaasis eriliselt välja 1000 ATK ja 1000 DEF-iga. Iga mängija saab "<M5030>Kakspealine Behemoth<M>" efekti kasutada ainult üks kord duelli jooksul.

source: Injection Fairy Lily
et: Süstihaldjas Lily

source: If this card attacks or is attacked, once during damage calculation you can pay 2000 Life Points to have this card gain 3000 ATK during that damage calculation only.
et: Kui see kaart ründab või teda rünnatakse, võid üks kord kahju arvutamise ajal maksta 2000 Elupunkti, et see kaart saaks selle kahju arvutamise ajal 3000 ATK juurde.

source: Woodland Sprite
et: Metsahaldjas

source: Send 1 Equip Card equipped to this card to the Graveyard. Inflict 500 points of damage to your opponent's Life Points.
et: Saada 1 selle kaardiga varustatud Varustuskaart Hauakambrisse. Tekita oma vastase Elupunktidele 500 punkti kahju.

source: Arsenal Bug
et: Arsenaliputukas

source: If there are no face-up Insect-Type monsters (except this monster) on your side of the field, both the ATK and DEF of this monster become 1000 points.
et: Kui sinu väljaku poolel ei ole ühtegi avatud putukaliiki koletist (välja arvatud see koletis), muutuvad selle koletise ATK ja DEF 1000 punktiks.

source: Kinetic Soldier
et: Kineetiline Sõdur

source: During damage calculation, if this card battles a Warrior-Type monster: This card gains 2000 ATK and DEF during damage calculation only.
et: Kahjukalkulatsiooni ajal, kui see kaart võitleb Sõdalase-tüüpi koletisega: See kaart saab kahjukalkulatsiooni ajal ainult 2000 ATK ja DEF juurde.

source: Jowls of Dark Demise
et: Pimeduse hukatuse lõuad

source: FLIP: Take control of 1 monster on your opponent's side of the field until the end of the turn that this card's effect is activated. When the controlled monster attacks, it may attack your opponent's Life Points directly.
et: FLIP: Võta kontroll 1 koletise üle oma vastase väljaku poolel kuni selle käigu lõpuni, mil selle kaardi efekt aktiveeritakse. Kui kontrollitud koletis ründab, võib see rünnata otse sinu vastase Elupunkte.

source: Souleater
et: Hingeõgija

source: A living wonder of mystery.
et: Elav müsteeriumide ime.

source: Slate Warrior
et: Kiltkivisõdalane

source: FLIP: This card gains 500 ATK and DEF. Any monster that destroys this card by battle loses 500 ATK and DEF.
et: FLIP: See kaart saab 500 ATK ja DEF juurde. Iga koletis, kes hävitab selle kaardi lahingus, kaotab 500 ATK ja DEF.

source: Shapesnatch
et: Kujundivargus

source: A bow tie with horrible power, it attacks an opponent by controlling others.
et: <translatedÕudsa jõuga kikilips, mis ründab vastast teisi kontrollides.

source: Electromagnetic Bagworm
et: Elektromagnetiline kotitäi

source: FLIP: Take control of 1 of your opponent's Machine-Type monsters until the End Phase of your next turn. If this monster is destroyed by battle, the monster that destroyed it loses 500 ATK and DEF.
et: FLIP: Võta kontroll 1 vastase Masinatüüpi koletise üle kuni oma järgmise käigu lõppfaasini. Kui see koletis hävitatakse lahingus, kaotab koletise hävitanud koletis 500 ATK ja DEF.

source: Timeater
et: Ajaõgija

source: If this monster destroys a monster on your opponent's side of the field in battle, your opponent skips his/her next Main Phase 1.
et: Kui see koletis hävitab lahingus vastase poolel oleva koletise, jätab vastane vahele oma järgmise peafaasi 1.

source: Mucus Yolk
et: Limakollane

source: This card can attack your opponent's Life Points directly. Each time this card inflicts Battle Damage to your opponent's Life Points, increase the ATK of this card by 1000 points during your next Standby Phase. The ATK increase lasts as long as this card remains face-up on the field.
et: See kaart võib rünnata otse sinu vastase Elupunkte. Iga kord, kui see kaart tekitab sinu vastase Elupunktidele Lahingukahju, suurenda selle kaardi ATK-d 1000 punkti võrra sinu järgmise Ootefaasini. ATK suurenemine kestab seni, kuni see kaart jääb väljale avatud olekus.

source: Servant of Catabolism
et: Katabolismi teenija

source: Rigorous Reaver
et: Rangelt Reaver

source: FLIP: Each player discards 1 card. A monster that destroys this card by battle loses 500 ATK and DEF.
et: FLIP: Iga mängija viskab 1 kaardi ära. Koletis, kes hävitab selle kaardi lahingus, kaotab 500 ATK ja DEF.

source: Moisture Creature
et: Niiskuse Olend

source: If you Tribute Summon this monster by Tributing 3 monsters on the field, destroy all Spell and Trap Cards on your opponent's side of the field.
et: Kui sa kutsud selle koletise välja ohverdades 3 koletist väljakul, hävita kõik loitsu- ja lõksukaardid vastase väljakupoolel.

source: Boneheimer
et: Kondikütt

source: This monster wanders the seas, sucking dry any creatures it may encounter.
et: See koletis rändab meredel, imedes kuivaks kõik olendid, keda ta võib kohata.

source: Flame Dancer
et: Leekantsija

source: This monster moves while swinging its burning rope.
et: See koletis liigub, samal ajal oma põlevat köit kiigutades.

source: FLIP: Your opponent cannot activate any Spell Cards until the end of the End Phase of the next turn.
et: FLIP: Sinu vastane ei saa aktiveerida ühtegi loitsukaarti kuni järgmise käigu lõppfaasi lõpuni.

source: Gearfried the Iron Knight
et: Raudrüütel Gearfried

source: When an Equip Card is equipped to this card, destroy the Equip Card.
et: Kui sellele kaardile varustatakse Varustuskaart, hävita Varustuskaart.

source: Humanoid Slime
et: Humanoidne Lima

source: This slime apparently has some human genes in its genetic makeup.
et: Selle lima geneetilises koostises on ilmselt mõned inimese geenid.

source: Worm Drake
et: Ussidraakon

source: Once this monster wraps itself around a victim, there is no escape.
et: Kord kui see koletis end ohvri ümber mähib, pole pääsu.

source: Humanoid Worm Drake
et: Humanoidne Ussidrake

source: "<M5061>Worm Drake<M>" + "<M5060>Humanoid Slime<M>"
et: "<M5061>Ussidraakon<M>" + "<M5060>Humanoidne Lima<M>"

source: Revival Jam
et: Elustav Lima

source: When this card is sent to the Graveyard by battle, you can pay 1000 Life Points to Special Summon it in face-up Defense Position during your next Standby Phase.
et: Kui see kaart saadetakse lahingus Hauakambrisse, võid maksta 1000 Elupunkti, et see oma järgmise Ootefaasiga eriliselt kutsuda näoga ülespoole Kaitseasendisse.

source: Flying Fish
et: Lendav kala

source: Three wishes are granted to those fortunate enough to see this monster in flight.
et: Kolm soovi täituvad neil, kes on piisavalt õnnelikud, et näha seda koletist lendamas.

source: Amphibian Beast
et: Amfiibium Koletis

source: On land or in the sea, the speed of this monster is unmatchable.
et: Maal või merel, selle koletise kiirus on ületamatu.

source: Rocket Warrior
et: Raketi Sõdalane

source: This effect is only active during the Battle Phase of your turn. Battle Damage to this card and this card's controller that they take from a battle involving this card becomes 0. After damage calculation, decrease the ATK of the monster that was attacked by this card by 500 points until the end of this turn.
et: See efekt on aktiivne ainult sinu käigu Lahingu Faasis. Selle kaardi ja selle kaardi kontrollija lahingukahju, mida nad saavad selle kaardiga seotud lahingus, muutub 0-ks. Pärast kahju arvutamist vähenda selle kaardi rünnatud koletise ATK-d 500 punkti võrra kuni selle käigu lõpuni.

source: The Legendary Fisherman
et: Legendaarne Kalamees

source: While "<M4340>Umi<M>" is on the field, this card is unaffected by the effects of Spell Cards, and your opponent cannot select it as an attack target.
et: Kui "<M4340>Umi<M>" on väljakul, siis see kaart ei ole mõjutatud Loitsukaartide efektidest ja sinu vastane ei saa seda valida rünnaku sihtmärgiks.

source: Robolady
et: Robodaam

source: A warrior fully covered with metal. It upgrades by fusing with "<M5073>Roboyarou<M>".
et: Metalliga kaetud sõdalane. See täiustub, kui ühineb "<M5073>Roboyarou<M>"-ga.

source: A warrior fully covered with metal. It upgrades by fusing with "<M5072>Robolady<M>".
et: Metalliga kaetud sõdalane. See täiustub, kui ühineb "<M5072>Robolady<M>"-ga.

source: Lightning Conger
et: Välguangerjas

source: This massive eel generates huge charges of electricity and unleashes them as thunderbolts.
et: See tohutu angerjas tekitab suuri elektrilaenguid ja vabastab need välguna.

source: Spherous Lady
et: Sfäärne Daam
