Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: This warwolf was given incalculable strength through horrific genetic manipulation. Its gentle nature was completely wiped out, and it now lives only to unleash destruction.
et: Sellele sõjas hundile anti kohutava geneetilise manipuleerimise kaudu mõõtmatu jõud. Selle õrn loomus pühiti täielikult minema ja nüüd elab see ainult hävingu vallapäästmiseks.

source: This monster's metabolism enables it to endure long periods of cold, harnessing the power to become a creature of solid ice! Nothing else can withstand such temperatures, especially victims of its glacial rampage.
et: Selle koletise ainevahetus võimaldab tal taluda pikki külmaperioode, kasutades võimet muutuda tahkeks jääolendiks! Miski muu ei suuda selliseid temperatuure taluda, eriti selle jääpurustuse ohvrid.

source: Spiral Serpent
et: Spiraalmadu

source: When huge whirlpools lay cities asunder, it is the hunger of this sea serpent at work. No one has ever escaped its dreaded Spiral Wave to accurately describe the terror they experienced.
et: Kui tohutud keeristormid linnu purustavad, on see mere maos oleva nälja töö. Keegi pole kunagi pääsenud selle kardetud Spiraallainest, et täpselt kirjeldada kogetud õudust.

source: The Six Samurai - Yariza
et: Kuusamurai - Yariza

source: While you control another "Six Samurai" monster with a different name, this card can attack your opponent directly. If this card would be destroyed, you can destroy another face-up "Six Samurai" monster you control instead.
et: Kui sa kontrollid teist "Kuue Samuraid" koletist erineva nimega, võib see kaart rünnata sinu vastast otse. Kui see kaart hävitatakse, võid selle asemel hävitada teise ülespööratud "Kuue Samuraid" koletise, mida sa kontrollid.

source: The Six Samurai - Zanji
et: Kuusamurai - Zanji

source: At the end of the Damage Step, if this card attacked: Destroy the monster this card attacked. You must control another "Six Samurai" monster with a different name to activate and to resolve this effect. If this card would be destroyed, you can destroy another face-up "Six Samurai" monster you control instead.
et: Damage Step'i lõpus, kui see kaart ründas: Hävita koletis, mida see kaart ründas. Selle efekti aktiveerimiseks ja lahendamiseks pead kontrollima teist "Kuue Samuraid" koletist erineva nimega. Kui see kaart hävitatakse, võid selle asemel hävitada teise avatud "Kuue Samuraid" koletise, mida sa kontrollid.

source: The Six Samurai - Nisashi
et: Kuusamurai - Nisashi

source: While you control another "Six Samurai" monster with a different name, this card can attack twice during each Battle Phase. If this card would be destroyed, you can destroy another face-up "Six Samurai" monster you control instead.
et: Kui sa kontrollid teist "Kuue Samuraid" koletist erineva nimega, võib see kaart rünnata kaks korda iga Lahingu Faasi jooksul. Kui see kaart hävitatakse, võid selle asemel hävitada teise avatud "Kuue Samuraid" koletise, mida sa kontrollid.

source: The Six Samurai - Yaichi
et: Kuusamurai - Yaichi

source: Once per turn: You can target 1 Set Spell/Trap Card; destroy that target. You must control another "Six Samurai" monster with a different name to activate and to resolve this effect. This monster cannot declare an attack during the turn this effect is used. If this card would be destroyed, you can destroy another face-up "Six Samurai" monster you control instead.
et: Kord päevas: Saad valida 1 seatud Võlu-/Lõksukaardi; hävita see sihtmärk. Selle efekti aktiveerimiseks ja lahendamiseks pead kontrollima teist "Kuue Samuraid" koletist erineva nimega. Sellel koletisel ei ole lubatud rünnata sellel käigul, mil seda efekti kasutati. Kui see kaart hävitatakse, saad selle asemel hävitada teise avatud "Kuue Samuraid" koletise, mida sa kontrollid.

source: The Six Samurai - Kamon
et: Kuusamurai - Kamon

source: Once per turn: You can target 1 face-up Spell/Trap Card; destroy that target. You must control another "Six Samurai" monster with a different name to activate and to resolve this effect. This monster cannot declare an attack during the turn this effect is used. If this card would be destroyed, you can destroy another face-up "Six Samurai" monster you control instead.
et: Kord päevas: Sa võid valida ühe avatud Võlu/Lõksu Kaardi; hävita see sihtmärk. Selle efekti aktiveerimiseks ja lahendamiseks pead kontrollima teist "Kuue Samuraid" koletist erineva nimega. See koletis ei saa rünnakut kuulutada sellel käigul, mil seda efekti kasutati. Kui see kaart hävitatakse, võid selle asemel hävitada teise avatud "Kuue Samuraid" koletise, mida sa kontrollid.

source: The Six Samurai - Irou
et: Kuusamurai - Irou

source: At the start of the Damage Step, if this card attacked a face-down Defense Position monster: Destroy that monster immediately with this card's effect without flipping it face-up or applying damage calculation. You must control another "Six Samurai" monster with a different name to activate and to resolve this effect. If this card would be destroyed, you can destroy another "Six Samurai" monster you control instead.
et: Kahjustusetapi alguses, kui see kaart ründas tagurpidi kaitseasendis olevat koletist: Hävita see koletis kohe selle kaardi efektiga, ilma et see pööritaks seda näoga üles või rakendaks kahju arvutust. Selle efekti aktiveerimiseks ja lahendamiseks pead kontrollima teist "Kuue Samuraid" koletist erineva nimega. Kui see kaart hävitatakse, võid selle asemel hävitada teise "Kuue Samuraid" koletise, mida sa kontrollid.

source: Great Shogun Shien
et: Suur Shogun Shien

source: If you control 2 or more "Six Samurai" monsters, you can Special Summon this card (from your hand). Your opponent can only activate 1 Spell/Trap Card each turn. If this card would be destroyed, you can destroy a face-up "Six Samurai" monster you control instead.
et: Kui sa kontrollid 2 või enamat "Kuue Samuraid" koletist, saad selle kaardi (oma käest) eriliselt kutsuda. Sinu vastane saab igal käigul aktiveerida ainult 1 Loitsu/Lõksu Kaardi. Kui see kaart hävitatakse, saad selle asemel hävitada ühe ülespööratud "Kuue Samuraid" koletise, mida sa kontrollid.

source: Shien's Footsoldier
et: Shieni jalaväelane

source: When this card is destroyed by battle and sent to the Graveyard, you can Special Summon 1 Level 3 or lower "Six Samurai" monster from your Deck.
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse, saad oma pakist eriliselt kutsuda ühe 3. või madalama taseme "Kuue Samuraid" koletise.

source: Sage of Silence
et: Vaikuse Tark

source: If this card destroys an opponent's monster by battle, your opponent cannot activate Spell Cards during the next turn.
et: Kui see kaart hävitab lahingus vastase koletise, ei saa sinu vastane järgmisel käigul aktiveerida Võlukaarte.

source: Sage of Stillness
et: Vaikuse Tark

source: If this card destroys an opponent's monster by battle, your opponent cannot activate Trap Cards during the next turn.
et: Kui see kaart hävitab lahingus vastase koletise, ei saa sinu vastane järgmisel käigul lõksukaarte aktiveerida.

source: Reign-Beaux, Overlord of Dark World
et: Reign-Beaux, Tume Maailma Ülemvalitseja

source: If this card is discarded from your hand to your Graveyard by an opponent's card effect: Special Summon this card from the Graveyard. When this card is Special Summoned this way: Destroy all monsters your opponent controls OR all Spell/Trap Cards they control.
et: Kui see kaart visatakse vastase kaardi efekti tõttu sinu käest hauakambrisse: Kutsu see kaart hauakambrist eriliselt välja. Kui see kaart kutsutakse sel viisil eriliselt välja: Hävita kõik koletised, mida vastane kontrollib VÕI kõik loitsu/lõksukaardid, mida nad kontrollivad.

source: Kahkki, Guerilla of Dark World
et: Kahkki, Pimeduse Maailma Gerilja

source: If this card is discarded to the Graveyard by a card effect: Target 1 monster on the field; destroy that target.
et: Kui see kaart saadetakse kaardiefekti tõttu Hauakambrisse: Sihtige 1 koletis väljal; hävitage see sihtmärk.

source: Gren, Tactician of Dark World
et: Gren, Pimeduse Maailma Taktik

source: If this card is discarded to the Graveyard by a card effect: Target 1 Spell/Trap Card on the field; destroy that target.
et: Kui see kaart saadetakse kaardiefekti tõttu hauakambrisse: Sihtige 1 Võlu-/Lõksukaart väljal; hävitage see sihtmärk.

source: Fusion Devourer
et: Fusioni Neelaja

source: When this card battles a Fusion Monster, the ATK of the Fusion Monster becomes 0 during the Damage Step only.
et: Kui see kaart võitleb Fusion Monsteriga, muutub Fusion Monsteri ATK Damage Stepi ajal ainult 0-ks.

source: Electric Virus
et: Elektriviirus

source: By discarding this card from your hand to the Graveyard, take control of 1 face-up Machine or Dragon-Type monster your opponent controls until the end of this turn.
et: Käest selle kaardi Hauakambrisse viskamisega saad kontrolli 1 vastase kontrollitava avatud Masina- või Draakoni-tüüpi koletise üle kuni käigu lõpuni.

source: Puppet Plant
et: Nukunukktaim

source: You can discard this card to the Graveyard to select 1 face-up Warrior or Spellcaster-Type monster your opponent controls, and take control of it until the End Phase of this turn.
et: Saad selle kaardi Hauakambrisse visata, et valida 1 ülespööratud Sõdalase või Loitsija-tüüpi koletis, mida sinu vastane kontrollib, ja võtta selle üle kontroll kuni selle käigu lõppfaasini.

source: Marionette Mite
et: Marionetiit

source: You can discard this card to the Graveyard to take control of 1 face-up Fiend or Zombie-Type monster your opponent controls until the End Phase this turn.
et: Saad selle kaardi Hauakambrisse visata, et võtta kontroll 1 vastase kontrollitava avatud Deemon- või Zombitüüpi koletise üle kuni selle käigu lõppfaasini.

source: D.D. Crow
et: D.D. Vares

source: During either player's turn: You can discard this card from your hand to the Graveyard to target 1 card in your opponent's Graveyard; banish that target.
et: Mõlema mängija käigu ajal: Sa võid selle kaardi oma käest Hauakambrisse visata, et sihtida 1 kaarti oma vastase Hauakambris; pagenda see sihtmärk.

source: Raging Earth
et: <translated Raev Maa

source: When this card is destroyed by battle and sent to the Graveyard, destroy all face-down and non-EARTH monsters.
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse, hävita kõik tagurpidi ja mitte-MAA koletised.

source: Silent Abyss
et: Vaikne Sügavik

source: When this card is destroyed by battle and sent to the Graveyard, destroy all face-down and non-WATER monsters.
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse, hävita kõik tagurpidi ja mitte-VEEL koletised.

source: Firestorm Prominence
et: Tulekahju Tõus

source: When this card is destroyed by battle and sent to the Graveyard, destroy all face-down and non-FIRE monsters.
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse, hävita kõik tagurpidi ja mitte-TULEKAHJU koletised.

source: Destruction Cyclone
et: Hävitustsüklon

source: When this card is destroyed by battle and sent to the Graveyard, destroy all face-down and non-WIND monsters.
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse, hävita kõik tagurpidi ja mitte-TUULE koletised.

source: Umbral Soul
et: Varjus Hing

source: When this card is destroyed by battle and sent to the Graveyard, destroy all face-down and non-DARK monsters.
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse, hävita kõik tagurpidi ja mitte-PIMEDAD koletised.

source: Radiant Spirit
et: Särav Vaim

source: When this card is destroyed by battle and sent to the Graveyard, destroy all face-down and non-LIGHT monsters.
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse, hävita kõik tagurpidi ja mitte-VALGUS koletised.

source: Alien Psychic
et: Välismaalane Psüühiline

source: This card is changed to Defense Position when it is Normal Summoned or Flip Summoned. Monsters with A-Counters cannot declare an attack.
et: See kaart muudetakse kaitsepositsiooniks, kui see kutsutakse välja normaalselt või ümberpööratult. A-loenduritega koletised ei saa rünnakut kuulutada.

source: Elemental Hero Glow Neos
et: Elementaalkangelane Sära Neos

source: "<M6653>Elemental Hero Neos<M>" + "<M6771>Neo-Spacian Glow Moss<M>"<BR>Must first be Special Summoned (from your Extra Deck) by shuffling the above cards you control into the Deck. (You do not use "<M4837>Polymerization<M>".) During the End Phase: Shuffle this card into the Extra Deck. Once per turn, during your Main Phase 1: You can target 1 face-up card your opponent controls; destroy that target, then apply the effect based on its type.<BR>● Monster: This card cannot attack this turn.<BR>● Spell: This card can attack your opponent directly this turn.<BR>● Trap: Change this card to Defense Position.
et: "<M6653>Elementaalne Kangelane Neos<M>" + "<M6771>Neo-Spatsia Helendav Sammal<M>"<BR>Peab esmalt olema eriliselt kutsutud (teie Ekstra Pakkist) segades ülaltoodud kaardid, mida te kontrollite, tagasi Pakkki. (Te ei kasuta "<M4837>Polümerisatsioon<M>".) Lõppfaasi ajal: Segage see kaart tagasi Ekstra Pakkki. Kord ühe käigu jooksul, teie Peafaas 1 ajal: Te saate sihtida 1 avatud kaarti, mida teie vastane kontrollib; hävitage see sihtmärk, seejärel rakendage mõju vastavalt selle tüübile.<BR>● Koletis: See kaart ei saa sellel käigul rünnata.<BR>● Loits: See kaart saab sellel käigul rünnata teie vastast otse.<BR>● Lõks: Muutke see kaart Kaitsepositsiooni.

source: Elemental Hero Air Neos
et: Elementaalne Kangelane Õhu Neos

source: "<M6653>Elemental Hero Neos<M>" + "<M6769>Neo-Spacian Air Hummingbird<M>"<BR>This card can only be Special Summoned from your Extra Deck by returning the above cards you control to the Deck. (You do not use "<M4837>Polymerization<M>".) While your Life Points are lower than your opponent's, this card gains ATK equal to the difference. This card returns to the Extra Deck during the End Phase.
et: "<M6653>Elemental Hero Neos<M>" + "<M6769>Neo-Spacian Air Hummingbird<M>"<BR>Seda kaarti saab eriliselt kutsuda oma lisapakist, tagastades ülaltoodud kaardid, mida sa kontrollid, pakki. (Sa ei kasuta "<M4837>Polymerization<M>".) Kui sinu Elupunktid on madalamad kui sinu vastasel, saab see kaart ATK-d, mis on võrdne erinevusega. See kaart naaseb lisapakki lõppfaasis.

source: Elemental Hero Grand Neos
et: Elementaalne Kangelane Suur Neos

source: "<M6653>Elemental Hero Neos<M>" + "<M6770>Neo-Spacian Grand Mole<M>"<BR>Must first be Special Summoned (from your Extra Deck) by shuffling the above cards you control into the Deck. (You do not use "<M4837>Polymerization<M>".) Once per turn: You can target 1 monster your opponent controls; return that target to the hand. During the End Phase: Shuffle this card into the Extra Deck.
et: "<M6653>Elemental Hero Neos<M>" + "<M6770>Neo-Spacian Grand Mole<M>"<BR>Esmakordselt tuleb see eriliste kutsuda (oma lisapakist), segades ülaltoodud kaardid, mida sa kontrollid, pakki. (Sa ei kasuta "<M4837>Polymerization<M>".) Kord kord: Sa võid sihtida 1 koletist, mida su vastane kontrollib; tagasta see sihtmärk kätte. Lõppfaasi ajal: sega see kaart lisapakki.

source: Lycanthrope
et: Lükantroop

source: This card can only be Ritual Summoned with the Ritual Spell Card, "<M6997>Synthesis Spell<M>". When this card inflicts Battle Damage to your opponent, inflict 200 damage to your opponent for each Normal Monster in your Graveyard.
et: Seda kaarti saab Rituaali Kutsuda ainult Rituaali Loitsukaardiga, "<M6997>Sünteesi Loits<M>". Kui see kaart tekitab lahingukahju sinu vastasele, tekita 200 kahju oma vastasele iga Tavalise Koletise eest sinu Hauakambris.

source: Cú Chulainn the Awakened
et: Ärganud Cú Chulainn

source: This card can only be Ritual Summoned with the Ritual Spell Card, Emblem of the Awakening. Once per turn, you can remove from play 1 Normal Monster in your Graveyard. This card gains ATK equal to that Normal Monster's ATK, until the Standby Phase of your next turn.
et: Seda kaarti saab Rituaali Kutsuda ainult Rituaali Loitsukaardiga, Ärkamise Embleem. Kord käigu jooksul saad eemaldada oma Hauakambrist mängust 1 Tavalise Koletise. See kaart saab ATK-d, mis on võrdne selle Tavalise Koletise ATK-ga, kuni sinu järgmise käigu Ootefaasini.

source: Neos Force
et: Neose Jõud

source: Equip only to "<M6653>Elemental Hero Neos<M>". It gains 800 ATK. When it destroys a monster by battle and sends it to the Graveyard: Inflict damage to your opponent equal to the original ATK of the destroyed monster. During the End Phase: Shuffle this card into the Deck.
et: Varusta ainult kaardile "<M6653>Elemental Hero Neos<M>". See saab 800 ATK juurde. Kui see hävitab lahingus koletise ja saadab selle Hauakambrisse: Tekita oma vastasele kahju, mis on võrdne hävitatud koletise algse ATK-ga. Lõppfaasis: Sega see kaart tagasi pakki.

source: A Cell Scatter Burst
et: A-raku plahvatus

source: Select 1 face-up "Alien" monster you control. Destroy it and distribute new A-Counters equal to its Level among your opponent's face-up monsters.
et: Vali 1 avatud "Alien" koletis, mida sa kontrollid. Hävita see ja jaota uued A-loendurid, mis on võrdsed selle tasemega, oma vastase avatud koletiste vahel.

source: Ancient Rules
et: Muistsed Reeglid

source: Special Summon 1 Level 5 or higher Normal Monster from your hand.
et: Kutsu oma käest välja 1. taseme 5 või kõrgem tavaline koletis.

source: Advanced Ritual Art
et: Edasijõudnud Rituaalikunst

source: Select 1 Ritual Monster in your hand. Send Normal Monsters from your Deck to the Graveyard whose total Levels are equal to that Ritual Monster's. Ritual Summon a card with the name of the selected Ritual Monster from your hand.
et: Vali 1 Rituaalikoletis oma käes. Saada Tavalised Koletised oma pakist Hauakambrisse, mille kogutasemed on võrdsed selle Rituaalikoletisega. Rituaalikutsu oma käest kaart, mille nimi on valitud Rituaalikoletise nimi.

source: Synthesis Spell
et: Sünteesiloits

source: This card is used to Ritual Summon "<M6991>Lycanthrope<M>". You must also Tribute monsters whose total Level equal 6 or more from the field or your hand.
et: Seda kaarti kasutatakse "<M6991>Lycanthrope<M>" rituaalsummonimiseks. Sa pead ka ohverdama koletisi, kelle kogutase on 6 või rohkem, kas väljakult või oma käest.

source: Emblem of the Awakening
et: Ärkamise Embleem

source: This card is used to Ritual Summon "<M6992>Cú Chulainn the Awakened<M>". You must also Tribute monsters whose total Levels equal 4 or more from the field or your hand.
et: Seda kaarti kasutatakse "<M6992>Ärganud Cú Chulainn<M>" rituaalsummonimiseks. Sa pead ka ohverdama koletisi, kelle kogutasemed on 4 või rohkem, kas väljakult või oma käest.

source: Twister
et: Keeristorm

source: Pay 500 Life Points. Destroy 1 face-up Spell or Trap card.
et: Makske 500 Elupunkti. Hävita 1 avatud Võlu- või Lõksukaart.

source: Legendary Ebon Steed
et: Legendaarne Eebenhobune

source: Equip only to a "Six Samurai" monster. It gains 200 ATK and DEF. If it would be destroyed, destroy this card instead.
et: Varusta ainult "Kuus Samuraid" koletisele. See saab 200 ATK ja DEF juurde. Kui see hävitatakse, hävita selle asemel see kaart.

source: Card Trader
et: Kaardikaupmees

source: Once per turn, during your Standby Phase, you can shuffle 1 card from your hand into the Deck, then draw 1 card.
et: Korra ühe korra oma ootejärgus võid sa segada ühe kaardi oma käest tagasi pakki, seejärel tõmmata ühe kaardi.

source: Dark World Dealings
et: Pimeduse Maailma Tehingud

source: Each player draws 1 card, then each player discards 1 card.
et: Iga mängija tõmbab 1 kaardi, seejärel iga mängija viskab 1 kaardi ära.

source: Shien's Castle of Mist
et: Shieni Udukindlus

source: When a "Six Samurai" monster is attacked, the attacking monster loses 500 ATK during damage calculation only.
et: Kui "Kuue Samuraid" koletist rünnatakse, kaotab ründav koletis ainult kahju arvutamise ajal 500 ATK.

source: Skyscraper 2 - Hero City
et: Pilvelõhkuja 2 - Kangelaste Linn

source: Once per turn, during your Main Phase, if you can control this card: You can target 11 "Elemental HERO" monster in your Graveyard that was destroyed by battle; Special Summon that target.
et: Kord ühe korra oma peafaasis, kui sa saad seda kaarti kontrollida: Sa võid sihtida 11 "Elemental HERO" koletist oma Hauakambris, mis hävitati lahingus; Kutsu see sihtmärk eriliselt välja.

source: Change of Hero - Reflector Ray
et: Kangelase vahetus - Reflektorkiir

source: When an "Elemental HERO" Fusion Monster you control is destroyed by battle and sent to the Graveyard: Inflict damage to your opponent equal to its original Level x 300.
et: Kui sinu kontrollitav "Elemental HERO" Fusion Monster hävitatakse lahingus ja saadetakse Hauakambrisse: Põhjusta oma vastasele kahju, mis on võrdne selle algse tasemega x 300.

source: Hero Medal
et: Kangelase medal

source: When this Set card is destroyed and sent to the Graveyard by an opponent's card effect, shuffle this card into its owner's Deck. Then draw 1 card.
et: Kui see seatud kaart hävitatakse ja saadetakse vastase kaardi efekti tõttu hauakambrisse, sega see kaart omaniku pakki. Seejärel tõmba 1 kaart.

source: Return of the Six Samurai
et: Kuue Samuraid naasevad

source: Target 1 "Six Samurai" monster in your Graveyard; Special Summon that target, then destroy it during the End Phase.
et: Vali 1 "Kuue Samuraid" koletis oma kalmistul; Kutsu see sihtmärk eriliselt välja, seejärel hävita see lõppfaasis.

source: Eliminating the League
et: Liiga likvideerimine

source: Discard 1 Spell Card. Destroy 1 face-up monster your opponent controls. Check your opponent's hand, and all cards in their hand with the same name as the destroyed card are sent to the Graveyard.
et: Viska 1 Võlukaart. Hävita 1 vastase kontrollitav avatud koletis. Kontrolli vastase kätt ja kõik kaardid nende käes, millel on sama nimi kui hävitatud kaardil, saadetakse Hauakambrisse.

source: Flashbang
et: Pimestuspomm

source: Activate only after damage calculation when a monster your opponent controls made a direct attack. It is now the End Phase of this turn.
et: Aktiveeri ainult pärast kahju arvutamist, kui sinu vastase kontrollitav koletis tegi otsese rünnaku. Nüüd on selle käigu lõppfaas.

source: The Transmigration Prophecy
et: Ümberkehastumise Ennustus

source: Target 2 cards in the Graveyard(s); shuffle those targets into the Deck(s).
et: Vali 2 kaarti Hauakambris(t); sega need sihtmärgid tagasi Pakki(de).

source: Anti-Fusion Device
et: Anti-Fusiooni Seade

source: Destroy 1 face-up Fusion Monster on the field.
et: Hävita 1 avatud Fusion Monster väljal.

source: Ritual Sealing
et: Rituaalne Pitseerimine

source: Destroy 1 face-up Ritual Monster on the field.
et: Hävita 1 avatud Rituaalikoletis väljal.

source: Birthright
et: Sünniõigus

source: Select 1 Normal Monster from your Graveyard and Special Summon it in face-up Attack Position. When this card is removed from the field, destroy that monster. When that monster is removed from the field, destroy this card.
et: Vali oma kalmistult 1 tavaline koletis ja kutsu see eriliselt välja näoga ülespoole rünnakupositsioonis. Kui see kaart eemaldatakse väljakult, hävita see koletis. Kui see koletis eemaldatakse väljakult, hävita see kaart.

source: Swift Samurai Storm!
et: Kiire samurai torm!

source: Each turn, after the first time a "Six Samurai" monster you control battles, all "Six Samurai" monsters you control gain 300 ATK until the end of this turn.
et: Igal käigul, pärast esimest korda, kui sinu kontrolli all olev "Kuue Samuraid" koletis võitleb, saavad kõik sinu kontrolli all olevad "Kuue Samuraid" koletised 300 ATK kuni selle käigu lõpuni.

source: Cloak and Dagger
et: Varju ja pistoda
