Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: Metaphysical Regeneration
et: Metafüüsiline Regenereerimine

source: Activate only during the End Phase. Gain 1000 Life Points for each Psychic-Type monster sent to the Graveyard this turn.
et: Aktiveeri ainult lõppfaasis. Saa 1000 Elupunkti iga sellel käigul Hauakambrisse saadetud Psüühika-tüüpi koletise eest.

source: Trojan Gladiator Beast
et: Trooja gladiaatoribeast

source: Special Summon 1 "Gladiator Beast" from your hand to your opponent's side of the field. Then, draw 1 card.
et: Erikutsuge 1 "Gladiaatoribeast" oma käest vastase väljaku poolele. Seejärel tõmba 1 kaart.

source: Wall of Thorns
et: Okaste müür

source: Activate only when a face-up Plant-Type monster you control is selected as an attack target. Destroy all Attack Position monsters your opponent controls.
et: Aktiveeri ainult siis, kui sinu kontrollitav ülespoole suunatud Taimetüüpi koletis valitakse rünnaku sihtmärgiks. Hävita kõik sinu vastase kontrollitavad Rünnakupositsioonis koletised.

source: Planet Pollutant Virus
et: Planeedi saasteviirus

source: Tribute 1 "Alien" monster. Destroy all face-up monsters without A-Counters your opponent controls. Until the end of your opponent's 3rd turn after this card's activation, place 1 A-Counter on each monster they Summon.
et: Lohista 1 "Alien" koletis. Hävita kõik vastase kontrollitavad avatud koletised, millel pole A-loendureid. Kuni vastase 3. käigu lõpuni pärast selle kaardi aktiveerimist aseta 1 A-loendur igale koletisele, mille nad kutsuvad välja.

source: Once per turn, you can select 1 Dragon-Type monster from your opponent's Graveyard, and Special Summon to your side of the field. Your opponent cannot select another face-up Fairy-Type monster as an attack target.
et: Korra ühe korra käigu jooksul saad valida ühe Draakoni-tüüpi koletise oma vastase Hauakambrist ja Kutsuda see Eriliselt oma väljaku poolele. Sinu vastane ei saa valida teist avatud Haldja-tüüpi koletist rünnaku sihtmärgiks.

source: Rose, Warrior of Revenge
et: Roos, Kättemaksu Sõdalane

source: When this card inflicts Battle Damage to your opponent, inflict 300 damage to your opponent.
et: Kui see kaart tekitab lahingukahju sinu vastasele, tekita oma vastasele 300 kahju.

source: Seed of Flame
et: Leegitseemne

source: When this card you control is destroyed by a Card effect and sent to the Graveyard, you can Special Summon 1 Level 4 or lower Plant-Type monster except "<M8078>Seed of Flame<M>", from your Graveyard. Also, Special Summon 1 "<M3951>Seed Token<M>" (Plant-Type/EARTH/Level 1/ATK 0/DEF 0) to your opponent's side of the field in Defense Position. This Token cannot be Tributed for a Tribute Summon.
et: Kui see sinu kontrollitav kaart hävitatakse Kaardi efekti tõttu ja saadetakse Hauakambrisse, saad Sa eriliselt kutsuda 1 Tase 4 või madalama Taim-Tüüpi koletise, välja arvatud "<M8078>Leegi Seeme<M>", oma Hauakambrist. Samuti, kutsu eriliselt 1 "<M3951>Seemne Token<M>" (Taim-Tüüp/MAA/Tase 1/ATK 0/DEF 0) oma vastase väljaku poolele Kaitsepositsioonis. Seda Tokenit ei saa kasutada Ohverdus Kutsumiseks.

source: Cactus Fighter
et: Kaktusevõitleja

source: If this card destroys an opponent's monster by battle, Special Summon 1 "<M3952>Needle Token<M>" (Plant/EARTH/Level 1/ATK 500/DEF 500) to your opponent's side of the field in Defense Position.
et: Kui see kaart hävitab lahingus vastase koletise, kutsu eriliselt esile 1 "<M3952>Needle Token<M>" (Taim/MAA/Tase 1/ATK 500/DEF 500) vastase väljaku poolele kaitsepositsioonis.

source: Overdrive Teleporter
et: Ülekiiruse Teleporter

source: This card cannot be Special Summoned. You can pay 2000 Life Points to Special Summon 2 Level 3 Psychic-Type monsters from your Deck. This effect can only be used once while this card is face-up on the field.
et: Seda kaarti ei saa eriliselt kutsuda. Sa võid maksta 2000 Elupunkti, et eriliselt kutsuda 2 3. taseme Psüühika-tüüpi koletist oma pakist. Seda efekti saab kasutada ainult üks kord, kui see kaart on lahinguväljal avatud.

source: All LIGHT monsters you control gain 100 ATK for each LIGHT monster in your Graveyard. During your End Phase, destroy 1 LIGHT monster you control. There can only be 1 face-up "<M8081>Rai-Jin<M>" on the field.
et: Kõik sinu kontrollitavad VALGUS koletised saavad 100 ATK iga sinu Hauas oleva VALGUS koletise kohta. Sinu Lõppfaasi ajal hävita 1 sinu kontrollitav VALGUS koletis. Väljal võib olla ainult 1 avatud "<M8081>Rai-Jin<M>".

source: When this card is destroyed by battle and sent to the Graveyard, you can add 1 Level 2 or lower LIGHT monster from your Deck to your hand.
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse, saad lisada oma pakist oma kätte 1. taseme või madalama VALGUSE koletise.

source: Gladiator Beast Retiari
et: Gladiaatorikutsar Retiari

source: When this card is Special Summoned by the effect of a "Gladiator Beast" monster, you can banish 1 card from your opponent's Graveyard. At the end of the Battle Phase, if this card attacked or was attacked, you can return it to the Deck to Special Summon 1 "Gladiator Beast" monster from your Deck except "<M8083>Gladiator Beast Retiari<M>".
et: Kui see kaart on eriliselt kutsutud "Gladiaatoribeast" koletise efekti abil, saad sa eemaldada 1 kaardi oma vastase kalmistult. Lahingufaasi lõpus, kui see kaart ründas või teda rünnati, saad sa selle tagasi pakkida, et eriliselt kutsuda 1 "Gladiaatoribeast" koletis oma pakist, välja arvatud "<M8083>Gladiaatoribeast Retiari<M>".

source: Night's End Sorcerer
et: Öö Lõpu Võlur

source: When this card is Special Summoned, you can remove from play up to 2 cards from your opponent's Graveyard.
et: Kui see kaart on eriliselt kutsutud, saad eemaldada mängust kuni 2 kaarti oma vastase hauakambrist.

source: Tempest Magician
et: Tormimaag

source: 1 Tuner + 1 or more non-Tuner Spellcaster-Type monsters<BR>When this card is Synchro Summoned, place 1 Spell Counter on it. Once per turn, you can discard any number of cards to place 1 Spell Counter on a monster(s) you control for each card you discarded. You can remove all Spell Counters on the field to inflict 500 damage to your opponent for each removed Spell Counter.
et: 1 Tuner + 1 või rohkem mitte-Tuner Tüüp Loitsija koletisi<BR>Kui see kaart on Sünkro Kutsutud, pane sellele 1 Loitsu Loendur. Kord käigu jooksul võid sa visata ära suvalise arvu kaarte, et panna 1 Loitsu Loendur koletisele(te)le, mida sa kontrollid, iga ära visatud kaardi eest. Sa võid eemaldada kõik Loitsu Loendurid väljal, et tekitada oma vastasele 500 kahju iga eemaldatud Loitsu Loenduri eest.

source: Treacherous Trap Hole
et: Reetlik lõksuauk

source: Destroy 2 monsters on the field. You cannot activate this card if you have any Trap Cards in your Graveyard.
et: Hävita 2 koletist väljakul. Sa ei saa seda kaarti aktiveerida, kui sul on hauakambris lõksukaardid.

source: Ido the Supreme Magical Force
et: Ido, Kõrgeim Maagiline Jõud

source: You cannot Summon monsters. You can only control 1 "<M8087>Ido the Supreme Magical Force<M>". If this card is destroyed by a card effect and sent to the Graveyard, Special Summon it from your Graveyard during the next turn's Standby Phase and destroy all other monsters you control.
et: Sa ei saa kutsuda koletisi. Sa saad kontrollida ainult 1 "<M8087>Ido, Kõrgeim Maagiline Jõud<M>". Kui see kaart hävitatakse kaardi efekti tõttu ja saadetakse Hauakambrisse, kutsu see järgmisel käigul Standby faasis Hauakambrist eriliselt välja ja hävita kõik teised koletised, mida sa kontrollid.

source: Violet Witch
et: Lilla Nõid

source: When this card is destroyed by battle and sent to the Graveyard, add 1 Plant-Type monster with 1500 or less DEF from your Deck to your hand.
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse, lisa oma pakist 1 taim-tüüpi koletis, mille DEF on 1500 või vähem, oma kätte.

source: When you take Battle Damage: You can Special Summon this card from your hand. This card gains 600 ATK and DEF for each card in your hand. Once per turn: You can send 1 monster from your hand to the Graveyard to target 1 face-up monster your opponent controls with the same Level as the sent monster; take control of that target. Once per turn: You can target 1 monster in your Graveyard; this card's Level becomes the same as that target's, until the End Phase.
et: Kui sa saad lahingukahju: Sa võid selle kaardi oma käest eriliselt kutsuda. See kaart saab 600 ATK ja DEF iga kaardi eest sinu käes. Kord korduses: Sa võid saata 1 koletise oma käest Hauakambrisse, et sihtida 1 ülespööratud koletist, mida sinu vastane kontrollib ja mille tase on sama, mis saadetud koletisel; võta selle sihtmärgi kontroll üle. Kord korduses: Sa võid sihtida 1 koletist oma Hauakambris; selle kaardi tase muutub samaks kui selle sihtmärgi oma, kuni lõppfaasini.

source: Ancient Fairy Dragon
et: Muinasjutu Draakon

source: 1 Tuner + 1 or more non-Tuner Monsters<BR>Once per turn, you can Special Summon 1 Level 4 or lower monster from your hand. You cannot conduct your Battle Phase the turn you activate this effect. Once per turn, you can destroy a Field Spell Card. If you do, gain 1000 Life Points, and you can add 1 Field Spell Card from your Deck to your hand.
et: 1 Tuner + 1 või rohkem mitte-Tuner koletist<BR>Korra käigu jooksul saad eriliselt kutsuda 1 4. või madalama taseme koletise oma käest. Sa ei saa läbi viia oma Lahingu Faasi sellel käigul, kui aktiveerid selle efekti. Korra käigu jooksul saad hävitada ühe Väljaloitsu Kaardi. Kui teed seda, saad 1000 Elupunkti juurde ja võid lisada ühe Väljaloitsu Kaardi oma pakist oma kätte.

source: Stardust Dragon/Assault Mode
et: Stardust Dragon/Rünnakurežiim

source: This card cannot be Normal Summoned or Set. This card cannot be Special Summoned except with its own effect or with "<M8058>Assault Mode Activate<M>". You can Tribute this card to negate the activation of a Spell Card, Trap Card, or Effect Monster's effect, and destroy that card. If you negate an effect this way, you can Special Summon this card from your Graveyard during the End Phase. When this card on the field is destroyed, you can Special Summon 1 "<M7734>Stardust Dragon<M>" from your Graveyard.
et: Seda kaarti ei saa normaalset kutsuda ega asetada. Seda kaarti ei saa eriliselt kutsuda, välja arvatud selle enda efekti või "<M8058>Assault Mode Activate<M>" abil. Sa võid ohverdada selle kaardi, et tühistada Loitsukaardi, Lõksukaardi või Efektkoletise efekti aktiveerimine ja hävitada see kaart. Kui sa tühistad efekti sel viisil, võid Sa eriliselt kutsuda selle kaardi oma Hauakambrist Lõppfaasi ajal. Kui see kaart väljal hävitatakse, võid Sa eriliselt kutsuda 1 "<M7734>Stardust Dragon<M>" oma Hauakambrist.

source: Fabled Lurrie
et: Muinasjutuline Lurrie

source: When this card is discarded from your hand to the Graveyard, Special Summon it.
et: Kui see kaart sinu käest Hauakambrisse visatakse, kutsu see eriliselt välja.

source: Fabled Grimro
et: Muinasjutuline Grimro

source: If you control a face-up "Fabled" monster, you can send this card from your hand to the Graveyard to add 1 "Fabled" monster from your Deck to your hand, except "<M8093>Fabled Grimro<M>".
et: Kui sa kontrollid avatud "Fabled" koletist, saad selle kaardi oma käest Hauakambrisse saata, et lisada 1 "Fabled" koletis oma pakist kätte, välja arvatud "<M8093>Fabled Grimro<M>".

source: Fabled Gallabas
et: Muinasjutuline Gallabas

source: You can discard 1 card to the Graveyard to destroy 1 face-up monster your opponent controls with DEF lower than this card's ATK.
et: Saad ühe kaardi Hauakambrisse visata, et hävitada üks vastase kontrollitav avatud koletis, mille DEF on madalam kui selle kaardi ATK.

source: Fabled Kushano
et: Muinasjutt Kushano

source: You can discard 1 "Fabled" monster to the Graveyard except "<M8095>Fabled Kushano<M>" to add this card from your Graveyard to your hand.
et: Saad saata 1 "Fabled" koletise Hauakambrisse, välja arvatud "<M8095>Fabled Kushano<M>", et lisada see kaart oma Hauakambrist oma kätte.

source: This card gains 100 ATK for each monster your opponent controls.
et: See kaart saab 100 ATK iga koletise eest, mida sinu vastane kontrollib.

source: When this face-up Attack Position card attacks or is attacked, and it is destroyed by battle and sent to the Graveyard, you can Special Summon 1 "Jurrac" monster with 1700 or less ATK from your Deck.
et: Kui see avatud ründeasendis kaart ründab või teda rünnatakse ning ta hävitatakse lahingus ja saadetakse Hauakambrisse, saad sa eriliselt kutsuda 1 "Jurrac" koletise, millel on 1700 või vähem rünnakupunkti, oma pakist.

source: This card can attack all monsters your opponent controls once each.
et: See kaart saab rünnata kõiki vastase kontrollitavaid koletisi üks kord igaüht.

source: You can Tribute 1 Dinosaur-Type monster to have this card gain 500 ATK. When this card destroys an opponent's monster by battle and sends it to the Graveyard, this card gains 300 ATK.
et: Saad ohverdada 1 Dinosauruse-tüüpi koletis, et anda sellele kaardile 500 ATK. Kui see kaart hävitab lahingus vastase koletise ja saadab selle Hauakambrisse, saab see kaart 300 ATK juurde.

source: Naturia Antjaw
et: Naturia Sipelõug

source: When your opponent Special Summons a monster(s), you can Special Summon 1 Level 3 or lower "Naturia" monster from your Deck.
et: Kui sinu vastane kutsub eriliselt välja koletise(d), saad sa oma pakist eriliselt välja kutsuda 1 taseme 3 või madalama "Naturia" koletise.

source: Naturia Spiderfang
et: Naturia Ämblikhammas

source: This card can only declare an attack during a turn that your opponent activates the effect of a Spell, Trap or Effect Monster Card.
et: Selle kaardiga saab rünnata ainult sellel käigul, mil sinu vastane aktiveerib Loitsu, Lõksu või Efektikoletise kaardi efekti.

source: Naturia Rosewhip
et: Naturia Roosipiits

source: Your opponent can only activate 1 Spell or Trap Card per turn.
et: Sinu vastane saab aktiveerida ainult 1 Loitsu või Lõksukaardi ühe käigu jooksul.

source: Naturia Cosmobeet
et: Naturia Kosmopunapuu

source: When your opponent Normal Summons or Sets a monster, you can Special Summon this card from your hand.
et: Kui sinu vastane kutsub normaal- või paigutab koletise, saad selle kaardi oma käest eriliselt kutsuda.

source: Genex Blastfan
et: Genex Plahvatusfänn

source: When this card is Special Summoned, you can add 1 DARK "Genex" monster from your Deck to your hand.
et: Kui see kaart on eriliselt kutsutud, saad lisada 1 PIMEDUS "Genex" koletise oma pakist oma kätte.

source: Genex Recycled
et: Genex Taaskasutatud

source: Once per turn, you can select 1 "Genex" monster in your Graveyard. Until the End Phase, this card's name is treated that monster's name.
et: Korra ühe korra käigu jooksul saad valida 1 "Genex" koletise oma Hauakambris. Kuni lõppfaasini käsitletakse selle kaardi nime kui selle koletise nime.

source: Genex Army
et: Genexi Armee

source: When this card is Tribute Summoned by Tributing a "Genex" monster, you can destroy 1 card your opponent controls.
et: Kui see kaart kutsutakse välja ohverdades "Genex" koletise, saad hävitada 1 kaardi, mida sinu vastane kontrollib.

source: Pilgrim of the Ice Barrier
et: Jääbarjääri Palverändur

source: This card cannot be destroyed by battle with a monster with 1900 or more ATK.
et: Seda kaarti ei saa hävitada lahingus koletisega, kellel on 1900 või rohkem rünnakupunkti.

source: Geomancer of the Ice Barrier
et: Jääbarjääri geomant

source: Discard 1 card and declare 1 Attribute. This card cannot be selected as an attack target by monsters with that Attribute. This effect can only be used once while this card is face-up on the field.
et: Viska 1 kaart ja nimeta 1 Atribuut. Selle kaardi ei saa valida rünnaku sihtmärgiks selle Atribuudiga koletised. Seda efekti saab kasutada ainult üks kord, kui see kaart on väljakul avatud.

source: Mist Valley Falcon
et: Uduorgu Pistrik

source: This card cannot declare an attack unless you return 1 card you control to the hand.
et: See kaart ei saa rünnakut kuulutada, kui sa ei tagasta 1 kaarti, mida sa kontrollid, kätte.

source: Mist Valley Apex Avian
et: Uduorgu Tiptiptipp

source: When an effect is activated, you can select 1 face-up "Mist Valley" card you control. Return that "Mist Valley" card to its owner's hand, negate the effect's activation, and destroy the card whose effect was activated.
et: Kui efekt aktiveeritakse, saad valida 1 avatud "Mist Valley" kaardi, mida sa kontrollid. Tagasta see "Mist Valley" kaart selle omaniku kätte, tühista efekti aktiveerimine ja hävita kaart, mille efekt aktiveeriti.

source: Ally of Justice Reverse Break
et: Õigluse Liitlane: Tagurpidi Purustus

source: If there is a face-up LIGHT monster on the field, destroy this card. If this card attacks a face-down Defense Position monster, destroy the monster immediately with this card's effect without flipping it face-up or applying damage calculation.
et: Kui väljakul on avatud LIGHT koletis, hävita see kaart. Kui see kaart ründab tagurpidi kaitseasendis koletist, hävita koletis kohe selle kaardi efektiga, ilma et see ümber pöörataks või kahju arvutust rakendataks.

source: Ally of Justice Unlimiter
et: Õigluse Liitlane Piiramatu

source: You can Tribute this card to double the original ATK of 1 face-up "Ally of Justice" monster you control until the End Phase.
et: Saad selle kaardi ohverdada, et kahekordistada ühe sinu kontrollitava avatud "Õigluse Liitlane" koletise algne ATK kuni lõppfaasini.

source: Worm Opera
et: Uss Ooper

source: FLIP: All face-up monsters on the field lose 500 ATK, except Reptile-Type "Worm" monsters.
et: FLIP: Kõik avatud positsioonis olevad koletised kaotavad 500 ATK, välja arvatud Reptiil-Tüüpi "Worm" koletised.

source: Worm Prince
et: Ussiprints

source: If this card destroys an opponent's monster by battle, you can add 1 Reptile-Type "Worm" monster from your Deck to your hand. If you don't control at least 1 other Reptile-Type "Worm" monster, destroy this card during the End Phase.
et: Kui see kaart hävitab lahingus vastase koletise, saad lisada oma pakist 1 Reptiili-tüüpi "Uss" koletise oma kätte. Kui sul ei ole vähemalt 1 teist Reptiili-tüüpi "Uss" koletist, hävita see kaart lõppfaasis.

source: Worm Queen
et: Ussikuninganna

source: You can Tribute Summon this card in face-up Attack Position by Tributing 1 Reptile-Type "Worm" monster. Once per turn, you can Tribute 1 Reptile-Type "Worm" monster to Special Summon 1 Reptile-Type "Worm" monster from your Deck with a Level less than or equal to the Tributed monster.
et: Sa saad selle kaardi kutsuda ohverdades 1 Reptiil-tüüpi "Worm" koletise, asetades selle rünnakupositsioonis lauale. Kord ühe käigu jooksul saad ohverdada 1 Reptiil-tüüpi "Worm" koletise, et erikutsuda 1 Reptiil-tüüpi "Worm" koletis oma pakist, mille tase on väiksem või võrdne ohverdatud koletise tasemega.

source: Worm Rakuyeh
et: Uss Rakuyeh

source: This card can only declare an attack during the turn it is flipped face-up. If this card attacks, it is changed to face-down Defense Position at the end of the Battle Phase.
et: Selle kaardiga saab rünnata ainult sellel käigul, mil see pööratakse avatud asendisse. Kui see kaart ründab, muudetakse see lahingufaasi lõpus kinniseks kaitseasendiks.

source: Fabled Valkyrus
et: Muinasjutuline Valkyrus

source: 1 "Fabled" Tuner + 1 or more non-Tuner monsters<BR>Once per turn, you can discard 1 Fiend-Type monster to draw 1 card.
et: 1 "Fabled" Tuner + 1 või rohkem mitte-Tuner koletist<BR>Korra käigu jooksul võid sa visata ühe Deemon-tüüpi koletise, et tõmmata 1 kaart.

source: 1 Tuner + 1 or more non-Tuner Dinosaur-Type monsters<BR>All face-up "Jurrac" monsters you control gain 200 ATK for each "Jurrac" monster in your Graveyard.
et: 1 Tuner + 1 või rohkem mitte-Tuner Dinosauruse-tüüpi koletist<BR>Kõik avatud "Jurrac" koletised, mida sa kontrollid, saavad 200 ATK iga "Jurrac" koletise eest sinu Hauakambris.

source: 1 EARTH Tuner + 1 or more non-Tuner EARTH monsters
et: 1 MAA Tuner + 1 või rohkem mitte-Tuner MAA koletist

source: Windmill Genex
et: Tuuleveski Genex

source: "<M7807>Genex Controller<M>" + 1 or more non-Tuner WIND monsters<BR>This card gains 300 ATK for each face-down Spell and Trap Card on the field. You can send 1 card from your hand to the Graveyard to destroy 1 face-down Spell or Trap Card on the field.
et: "<M7807>Genex Kontroller<M>" + 1 või rohkem mittehäälestaja TUULE koletisi<BR>See kaart saab 300 ATK iga laual oleva tagurpidi Maagia- ja Lõksukaardi eest. Sa saad saata 1 kaardi oma käest Hauakambrisse, et hävitada 1 tagurpidi Maagia- või Lõksukaart laual.

source: Mist Valley Thunder Lord
et: Uduorgu Äikeseisand

source: 1 Tuner + 1 or more non-Tuner "Mist Valley" monsters<BR>Once per turn, you can select and return 1 card you control to the hand, and this card gains 500 ATK until the End Phase. This effect can be activated during either player's turn.
et: 1 Tuner + 1 või rohkem mitte-Tuner "Mist Valley" koletist<BR>Korra ühe käigu jooksul saad valida ja tagastada 1 kaardi, mida sa kontrollid, käesolevasse kätte ning see kaart saab 500 ATK juurde kuni End Phase'ini. Seda efekti saab aktiveerida mõlema mängija käigu ajal.

source: Elemental HERO Gaia
et: Elementaalne KANGELANE Gaia

source: 11 "Elemental HERO" monster + 1 EARTH Monster<BR>Must be Fusion Summoned and cannot be Special Summoned by other ways. When this card is Fusion Summoned: Target 1 face-up monster your opponent controls; until the End Phase, its ATK is halved and this card gains the same amount of ATK.
et: 11 "Elemental HERO" koletist + 1 MAA koletis<BR>Peab olema Fusion Summoned ja ei saa olla Special Summoned muul viisil. Kui see kaart on Fusion Summoned: Sihtige 1 vastase kontrollitavat avatud koletist; kuni End Phase'ini, selle ATK väheneb poole võrra ja see kaart saab sama palju ATK-d juurde.

source: Elemental HERO Ice Edge
et: Elementaalne KANGELANE Jääserv

source: When this card inflicts Battle Damage to your opponent by a direct attack, you can select 1 Set card in your opponent's Spell and Trap Card Zone, and destroy it. Once per turn, during your Main Phase 1, you can discard 1 card to allow this card to attack your opponent directly this turn.
et: Kui see kaart tekitab otsese rünnakuga lahingukahju sinu vastasele, saad valida 1 seatud kaardi oma vastase Võlu- ja Lõksukaartide alas ning hävitada selle. Kord ühe käigu jooksul, oma peafaasi 1 ajal, saad saata 1 kaardi oma käest hauakambrisse, et lubada sellel kaardil rünnata sinu vastast otse sellel käigul.

source: Elemental HERO Absolute Zero
et: Elementaalne KANGELANE Absoluutne Null

source: 1 "HERO" monster + 1 WATER monster<BR>Must be Fusion Summoned and cannot be Special Summoned by other ways. This card gains 500 ATK for each face-up WATER monster on the field, except "<M8129>Elemental HERO Absolute Zero<M>". When this card leaves the field: Destroy all monsters your opponent controls.
et: 1 "HERO" koletis + 1 VEE koletis<BR>Peab olema Fusion Summoned ja ei saa olla Special Summoned muul viisil. See kaart saab 500 ATK iga näoga ülespoole oleva VEE koletise eest väljal, välja arvatud "<M8129>Elemental HERO Absolute Zero<M>". Kui see kaart lahkub väljast: Hävita kõik koletised, mida sinu vastane kontrollib.

source: Endymion, the Master Magician
et: Endymion, Meistermaag

source: You can Special Summon this card from your hand or Graveyard by removing 6 Spell Counters from a "<M8135>Magical Citadel of Endymion<M>" you control. When you do, add 1 Spell Card from your Graveyard to your hand. Once per turn, you can discard 1 Spell Card to destroy 1 card on the field.
et: Saad selle kaardi oma käest või Hauast eriliselt välja kutsuda, eemaldades 6 Loitsuloendurit oma kontrolli all olevast "<M8135>Endymioni Maagilisest Tsitadellist<M>". Kui sa seda teed, lisa 1 Loitsukaart oma Hauast oma kätte. Kord käigu jooksul saad sa ühe Loitsukaardi ära visata, et hävitada 1 kaart väljal.
