Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: Alpha, Beta, and Gamma meld as one to form a powerful monster.
et: Alpha, Beta ja Gamma ühinevad, et moodustada võimas koletis.

source: Invitation to a Dark Sleep
et: Kutse pimedasse unne

source: When this monster is Normal Summoned or Flip Summoned, select 1 of your opponent's monsters. As long as this card remains face-up on the field, the selected monster cannot attack.
et: Kui see koletis on normaal- või ümberpööratud kutsutud, vali 1 oma vastase koletist. Kuni see kaart jääb väljale avatud olekusse, ei saa valitud koletis rünnata.

source: Lord of D.
et: D. Isand

source: Face-up Dragon-Type monsters cannot be targeted by Spell Cards, Trap Cards, or monster effects that target.
et: Avatud näoga Draakoni-tüüpi koletisi ei saa sihtida Loitsukaartide, Lõksukaartide ega koletise efektidega, mis sihivad.

source: Red-Eyes Black Metal Dragon
et: Punasilmne Must Metallist Draakon

source: This card cannot be Normal Summoned or Set. This card can only be Special Summoned from the Deck by Tributing "<M4088>Red Eyes B. Dragon<M>" equipped with "<M4664>Metalmorph<M>". Your Deck is then shuffled.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti saab eriliselt kutsuda ainult pakist, ohverdades "<M4088>Red Eyes B. Dragon<M>", millele on varustatud "<M4664>Metalmorph<M>". Seejärel segatakse sinu pakk.

source: Barrel Dragon
et: Tünn Draakon

source: Once per turn, select 1 monster your opponent controls. Toss a coin 3 times, and if the result is 2 heads or more, destroy the selected monster.
et: Korra ühe käigu jooksul vali 1 koletis, mida sinu vastane kontrollib. Viska münti 3 korda ja kui tulemuseks on 2 või rohkem kulli, hävita valitud koletis.

source: Hannibal Necromancer
et: Hannibal Nekromant

source: When this card is Normal Summoned, place 1 Spell Counter on it (max. 1). You can remove 1 Spell Counter from this card to destroy 1 face-up Trap Card.
et: Kui see kaart on tavaliselt kutsutud, aseta sellele 1 loitsuloendur (maks. 1). Sa saad eemaldada 1 loitsuloenduri sellelt kaardilt, et hävitada 1 avatud lõksukaart.

source: Panther Warrior
et: Panterisõdalane

source: This card cannot attack unless you Tribute 1 monster on your side of the field.
et: See kaart ei saa rünnata, kui sa ei ohverda ühte koletist oma väljaku poolelt.

source: Three-Headed Geedo
et: Kolmepealine Geedo

source: A three-headed nocturnal monster that is absolutely ruthless when fighting.
et: Kolmepealine öine koletis, kes on võitluses täiesti halastamatu.

source: Gazelle the King of Mythical Beasts
et: Gazell, müütiliste metsaliste kuningas

source: This monster moves so fast that it looks like an illusion to mortal eyes.
et: See koletis liigub nii kiiresti, et surelike silmis näib see illusioonina.

source: Stone Statue of the Aztecs
et: Asteekide kivikuju

source: Double any Battle Damage your opponent takes when they attack this monster.
et: Kahekordista igasugune lahingukahju, mida su vastane saab, kui ta ründab seda koletist.

source: When this card is Normal or Flip Summoned, you can add 1 "<M4753>Gazelle the King of Mythical Beasts<M>" from your Deck to your hand.
et: Kui see kaart on Normaal- või Pöördkutsutud, saad lisada 1 "<M4753>Gazelle the King of Mythical Beasts<M>" oma pakist oma kätte.

source: Chimera the Flying Mythical Beast
et: Chimera, lendav müütiline metsaline

source: "<M4753>Gazelle the King of Mythical Beasts<M>" + "<M4755>Berfomet<M>"<BR>(This monster is always treated as a "Phantom Beast" monster.) When this card is destroyed, you can select and Special Summon either "<M4755>Berfomet<M>" or "<M4753>Gazelle the King of Mythical Beasts<M>" from your Graveyard.
et: "<M4753>Müütiliste metsaliste kuningas Gazelle<M>" + "<M4755>Berfomet<M>"<BR>(Seda koletist käsitletakse alati kui "Phantom Beast" koletist.) Kui see kaart hävitatakse, saad valida ja eriliselt kutsuda kas "<M4755>Berfomet<M>" või "<M4753>Müütiliste metsaliste kuningas Gazelle<M>" oma hauakambrist.

source: Gear Golem the Moving Fortress
et: Liikuv kindlus - Käigu Golem

source: Once per turn, during your Main Phase 1, by paying 800 Life Points, this card can attack your opponent directly this turn.
et: Kord ühe korra oma peafaas 1 ajal, makstes 800 elupunkti, võib see kaart sel käigul rünnata otse sinu vastast.

source: Trap Cards cannot be activated. The effects of all face-up Trap Cards are negated.
et: Lõksukaartide aktiveerimine on keelatud. Kõigi avatud lõksukaartide efektid on tühistatud.

source: Swordsman of Landstar
et: Landstari mõõgamees

source: An amateur with a sword, this fairy warrior relies on its mysterious powers.
et: See haldjasõdalane, kes on mõõgaga amatöör, toetub oma salapärastele jõududele.

source: Cyber Raider
et: Küberraider

source: When this card is Normal Summoned, Flip Summoned, or Special Summoned successfully, select and activate 1 of the following effects:<BR>● Select 1 Equip Card equipped to 1 monster on the field and destroy it.<BR>● Select 1 Equip Card equipped to 1 monster on the field and equip it to this card.
et: Kui see kaart on edukalt Normaal- või Pöördkutsutud või Erikutsutud, vali ja aktiveeri üks järgmistest efektidest:<BR>● Vali üks Varustuskaart, mis on varustatud ühele koletisele väljakul, ja hävita see.<BR>● Vali üks Varustuskaart, mis on varustatud ühele koletisele väljakul, ja varusta see sellele kaardile.

source: The Fiend Megacyber
et: Kuradiküberküber

source: You can Special Summon this card from your hand if your opponent has at least 2 more monsters on the field than you do.
et: Saad selle kaardi oma käest eriliselt välja kutsuda, kui sinu vastasel on väljakul vähemalt 2 koletist rohkem kui sinul.

source: Reflect Bounder
et: Peegelpiiraja

source: When this face-up Attack Position card is attacked by an opponent's monster, before damage calculation, inflict damage to your opponent equal to the attacking monster's ATK. Then, destroy this card after damage calculation.
et: Kui vastase koletis ründab seda avatud rünnakupositsioonis kaarti, enne kahju arvutamist, põhjusta vastasele kahju, mis on võrdne ründava koletise ATK-ga. Seejärel hävita see kaart pärast kahju arvutamist.

source: Beta The Magnet Warrior
et: Beta Magnetkangelane

source: Big Shield Gardna
et: Suur Kilp Gardna

source: If this 1 face-down card is targeted by a Spell Card, negate that card's activation and change this card to face-up Defense Position. If this card is attacked, change it to Attack Position at the end of the Damage Step.
et: Kui see 1 allapoole pööratud kaart on sihitud Loitsukaardiga, tühista selle kaardi aktiveerimine ja muuda see kaart ülespoole Kaitsepositsiooniks. Kui seda kaarti rünnatakse, muuda see Rünnakupositsiooniks Kahjustusetapi lõpus.

source: Dark Magician Girl
et: Pimeduse Mustkunstniku Tüdruk

source: This card gains 300 ATK for each "<M4041>Dark Magician<M>" or "<M4728>Magician of Black Chaos<M>" in either player's Graveyard.
et: See kaart saab 300 ATK iga "<M4041>Dark Magician<M>" või "<M4728>Magician of Black Chaos<M>" eest, mis on kummagi mängija Hauakambris.

source: Alligator's Sword
et: Alligaatori Mõõk

source: 'ey, dis mighty lissard man can swing his sword so fast, dat it's more dan da speed a sound!
et: Hei, see võimas sisalikmees suudab oma mõõka nii kiiresti viibutada, et see ületab helikiiruse!

source: Insect Queen
et: Putukakuninganna

source: Each time this card declares an attack, you must Tribute 1 monster. This card gains 200 ATK for each Insect-Type monster on the field. During the End Phase, if this card destroyed an opponent's monster that turn, Special Summon 1 "<M3900>Insect Monster Token<M>" (Insect-Type/EARTH/Level 1/ATK 100/DEF 100) in Attack Position.
et: Iga kord, kui see kaart kuulutab välja rünnaku, pead sa ohverdama 1 koletise. See kaart saab 200 ATK iga väljal oleva Putukate-tüüpi koletise eest. Lõppfaasis, kui see kaart hävitas sellel käigul vastase koletise, kutsu eriliselt välja 1 "<M3900>Putukakoletise Määrang<M>" (Putukate-tüüp/MAA/Tase 1/ATK 100/DEF 100) rünnakupositsioonis.

source: Parasite Paracide
et: Parasiit Parasiit

source: FLIP: Put this card face-up in your opponent's Deck and shuffle it. When your opponent draws this card, it is Special Summoned to their side of the field in face-up Defense Position, and inflicts 1000 damage to them. Then, while this card is face-up on the field, all monsters your opponent controls become Insect-Type monsters.
et: FLIP: Pane see kaart oma vastase paki peale ja sega see. Kui sinu vastane tõmbab selle kaardi, kutsutakse see eriliselt nende väljaku poolele ülespööratud kaitsepositsioonis ja see tekitab neile 1000 kahju. Siis, kui see kaart on väljakul ülespööratud, muutuvad kõik sinu vastase kontrollitavad koletised putukate tüüpi koletisteks.

source: Skull-Mark Ladybug
et: Kolju-Märgi Leetõuk

source: When this card is sent to the Graveyard, increase your Life Points by 1000 points.
et: Kui see kaart saadetakse Hauakambrisse, suurenda oma Elupunkte 1000 punkti võrra.

source: Little-Winguard
et: Väike-Valvur

source: You can change the battle position of this card once per turn, during your End Phase.
et: Sa saad selle kaardi lahinguasendit muuta kord ühe käigu jooksul, oma lõppfaasis.

source: When this card on your side of the field is sent to the Graveyard, you can Special Summon 1 Insect-Type monster from your hand.
et: Kui see kaart sinu väljaku poolelt saadetakse Hauakambrisse, saad sa oma käest eriliselt kutsuda 1 Putukaliigi koletise.

source: Blue-Eyes Toon Dragon
et: Sinisilmne Multikas Draakon

source: This card cannot be Normal Summoned or Set. This card can only be Special Summoned while you control "<M4798>Toon World<M>". You can Special Summon this card from your hand (but Tributes are required if it is Level 5 or higher). This card cannot attack during the turn it is Summoned. This card cannot attack unless you pay 500 Life Points. When "<M4798>Toon World<M>" is destroyed, destroy this card. If your opponent controls a face-up Toon Monster, you must select it as an attack target.
et: Seda kaarti ei saa Normaal-Kutsuda ega Seada. Seda kaarti saab eriliselt Kutsuda ainult siis, kui sa kontrollid "<M4798>Toon World<M>". Sa saad selle kaardi oma käest eriliselt Kutsuda (kuid ohverdused on vajalikud, kui see on 5. või kõrgem tase). See kaart ei saa rünnata sellel käigul, mil see Kutsuti. See kaart ei saa rünnata, kui sa ei maksa 500 Elupunkti. Kui "<M4798>Toon World<M>" hävitatakse, hävita see kaart. Kui sinu vastane kontrollib ülespööratud Toon Koletist, pead sa selle valima rünnaku sihtmärgiks.

source: Sword Hunter
et: Mõõgakütt

source: A monster destroyed by this card as a result of battle becomes an Equip Spell Card at the end of the Battle Phase that increases the ATK of this card by 200 points.
et: Selle kaardi poolt lahingu tulemusena hävitatud koletis muutub Lahingufaasi lõpus Varustusloitsukaardiks, mis suurendab selle kaardi rünnakupunkte 200 võrra.

source: Drill Bug
et: Puurmardikas

source: When this card inflicts Battle Damage to your opponent's Life Points, you can select 1 "<M4769>Parasite Paracide<M>" card from your Deck, shuffle the Deck, and place "<M4769>Parasite Paracide<M>" on top of the Deck.
et: Kui see kaart tekitab lahingukahju sinu vastase Elupunktidele, saad valida 1 "<M4769>Parasite Paracide<M>" kaardi oma pakist, segada paki ja asetada "<M4769>Parasite Paracide<M>" paki peale.

source: Deepsea Warrior
et: Sügavmere Sõdalane

source: As long as "<M4340>Umi<M>" is face-up on the field, this card is unaffected by any Spell Cards.
et: Niikaua kui "<M4340>Umi<M>" on väljal avatud, ei mõjuta seda kaarti ükski Loitsukaart.

source: Bite Shoes
et: Hammustavad Kingad

source: FLIP: Change the battle position of 1 face-up monster on the field.
et: FLIP: Muuda ühe lahinguväljal oleva avatud koletise lahinguasendit.

source: Spikebot
et: Otsarobot

source: A mechanical soldier created by a wicked sorcerer, it attacks with the two steel balls attached to its arms.
et: Kuri nõia loodud mehaaniline sõdur, kes ründab oma kätele kinnitatud kahe teraskuuliga.

source: Satellite Cannon
et: Satelliitkannon

source: This card cannot be destroyed by battle with a Level 7 or lower monster. During each of your End Phases, this card gains 1000 ATK. If this card attacks, its ATK is returned to 0, after damage calculation.
et: Seda kaarti ei saa hävitada lahingus 7. või madalama tasemega koletisega. Iga sinu lõppfaasi ajal saab see kaart 1000 ATK juurde. Kui see kaart ründab, siis pärast kahju arvutamist langeb selle ATK 0-ni.

source: The Last Warrior from Another Planet
et: Viimane sõdalane teiselt planeedilt

source: "<M5245>Zombyra the Dark<M>" + "<M5260>Maryokutai<M>"<BR>When this card is Special Summoned, destroy all monsters on your side of the field except this card. As long as this card remains face-up on the field, neither player can Normal Summon, Flip Summon, or Special Summon any monster.
et: "<M5245>Zombyra the Dark<M>" + "<M5260>Maryokutai<M>"<BR>Kui see kaart on eriliselt kutsutud, hävita kõik koletised sinu väljaku poolel, välja arvatud see kaart. Kuni see kaart jääb väljale avatud olekusse, ei saa kumbki mängija normaalset kutsumist, ümberpööramist ega erilist kutsumist teha.

source: Dunames Dark Witch
et: Dunamesi Tume Nõid

source: Even when all odds are against this brave fairy, she will press onwards in battle and never retreat.
et: Isegi siis, kui kõik on selle vapra haldja vastu, jätkab ta lahingus edasi ja ei tagane kunagi.

source: A monster so heavy that each step rocks the earth.
et: Koletis, mis on nii raske, et iga samm raputab maad.

source: This card is changed to Defense Position when it is Normal Summoned or Flip Summoned successfully. This card can attack while it is in Defense Position. If this card attacks while in Defense Position, apply the ATK of this card for damage calculation.
et: See kaart muudetakse kaitsepositsiooniks, kui see on edukalt normaal- või ümberpööratud kutsutud. See kaart võib rünnata, kui see on kaitsepositsioonis. Kui see kaart ründab kaitsepositsioonis olles, rakendatakse kahju arvutamisel selle kaardi rünnakupunkte.

source: Beast of Talwar
et: Talwari metsaline

source: Only the master of the sword among the Fiend-Type monsters is permitted to hold the Talwar.<BR>(This card is always treated as an "Archfiend" card.)
et: Ainult mõõgameister deemonitüüpi koletiste seas on lubatud Talwari hoida.<BR>(Seda kaarti käsitletakse alati kui "Archfiend" kaarti.)

source: Cyber-Tech Alligator
et: Kübertehniline Alligaator

source: Originally a pterodactyl, he was viciously attacked by a dragon. Using the newest technologies, his keeper saved him from near-fatal wounds and brought him back as a powerful Cyborg.
et: Algselt pterodaktül, ründas teda julmalt draakon. Kasutades uusimaid tehnoloogiaid, päästis tema hooldaja ta peaaegu surmavatest haavadest ja tõi ta tagasi võimsa küberorganismina.

source: Gamma the Magnet Warrior
et: Gamma Magnetkangelane

source: Time Machine
et: Ajanmasin

source: Activate only when a monster is destroyed by battle and sent to the Graveyard. Special Summon that monster to the same side of the field it was on, in the same battle position it was in when destroyed.
et: Aktiveeri ainult siis, kui koletis hävitatakse lahingus ja saadetakse Hauakambrisse. Kutsu see koletis eriliselt välja samale väljaku poolele, kus see oli, samas lahingupositsioonis, milles see hävitati.

source: Copycat
et: Jäljendaja

source: When this card is Summoned, select 1 monster your opponent controls. This card's ATK and DEF become equal to the selected monster's original ATK and DEF.
et: Kui see kaart kutsutakse välja, vali 1 koletis, mida sinu vastane kontrollib. Selle kaardi ATK ja DEF muutuvad võrdseks valitud koletise algse ATK ja DEF-iga.

source: Toon World
et: Multikamaailm

source: Pay 1000 Life Points to activate this card.
et: Maksa 1000 Elupunkti, et aktiveerida see kaart.

source: Gorgon's Eye
et: Gorgoni silm

source: Until the end of this turn, all effects of Defense Position monsters are negated.
et: Kuni selle käigu lõpuni on kõik Kaitseasendis olevate koletiste efektid tühistatud.

source: Black Illusion Ritual
et: Musta Illusiooni Rituaal

source: This card is used to Ritual Summon "<M4737>Relinquished<M>". You must also Tribute monsters from the field or your hand whose total Levels equal 1 or more.
et: Seda kaarti kasutatakse "<M4737>Relinquished<M>" rituaalsummonimiseks. Sa pead ka ohverdama koletisi väljakult või oma käest, kelle kogutasemed on kokku 1 või rohkem.

source: Brain Control
et: Aju kontroll

source: Pay 800 Life Points. Select 1 face-up monster your opponent controls. Take control of it until the End Phase.
et: Maksa 800 Elupunkti. Vali 1 avatud koletis, mida sinu vastane kontrollib. Võta selle üle kontroll kuni Lõppfaasini.

source: Negate Attack
et: Rünnaku Tõrjumine

source: Activate only when an opponent's monster declares an attack. Negate the attack and end the Battle Phase.
et: Aktiveeri ainult siis, kui vastase koletis kuulutab välja rünnaku. Tühista rünnak ja lõpeta lahingufaasi.

source: Multiply
et: Korrutamine

source: Tribute 1 face-up "<M4064>Kuriboh<M>". Special Summon as many "<M3901>Kuriboh Token<M>" (Fiend-Type/DARK/Level 1/ATK 300/DEF 200) as possible in Defense Position. These Tokens cannot be Tributed for a Tribute Summon.
et: Ohverda 1 avatud "<M4064>Kuriboh<M>". Kutsu välja nii palju "<M3901>Kuriboh Token<M>" (Deemonitüüp/PIMEDUS/Tase 1/ATK 300/DEF 200) kui võimalik kaitseasendis. Neid žetoone ei saa ohverdada ohverdussummoniks.

source: 7 Completed
et: 7 Täidetud

source: Increases either the ATK or DEF of a Machine-Type monster equipped with this card by 700 points. You cannot change your choice as long as this card remains face-up on the field.
et: Suurendab selle kaardiga varustatud Masinatüüpi koletise ATK või DEF 700 punkti võrra. Sa ei saa oma valikut muuta, kuni see kaart jääb väljale avatud olekusse.

source: Lightforce Sword
et: Valgusejõu Mõõk

source: Select 1 random card from your opponent's hand and remove it from play face-down. During your opponent's 4th Standby Phase after this card's activation, return that card to their hand.
et: Vali juhuslikult 1 kaart oma vastase käest ja eemalda see mängust tagurpidi. Selle kaardi aktiveerimise järel, vastase 4. Ootefaasil, tagasta see kaart nende kätte.

source: The Flute of Summoning Dragon
et: Draakoni kutsumise flööt

source: Activate only while "<M4747>Lord of D.<M>" is face-up on the field. Special Summon up to 2 Dragon-Type monsters from your hand.
et: Aktiveeri ainult siis, kui "<M4747>Lord of D.<M>" on lahinguväljal avatud. Kutsu eriliselt välja kuni 2 Draakoni-tüüpi koletist oma käest.

source: Shield & Sword
et: Kilp ja Mõõk

source: Switch the original ATK and DEF of all face-up monsters on the field until the end of this turn. Any additions and subtractions to ATK and DEF due to card effects are applied to the new ATK and DEF. Monsters Summoned after this card's activation are excluded.
et: Vaheta kõigi väljaku avatud positsioonis olevate koletiste algne ATK ja DEF selle käigu lõpuni. Kõik kaardiefektidest tulenevad ATK ja DEF lisamised ja lahutamised rakendatakse uuele ATK-le ja DEF-le. Pärast selle kaardi aktiveerimist kutsutud koletised on välistatud.

source: Graceful Charity
et: Graatsiline Heategevus

source: Draw 3 cards, then discard 2 cards.
et: Tõmba 3 kaarti, seejärel viska 2 kaarti ära.

source: Chain Destruction
et: Ahela hävitamine

source: Activate only when a monster with 2000 ATK or less is Summoned. Destroy all monsters with the same name in its controller's hand and Deck.
et: Aktiveeri ainult siis, kui kutsutakse välja koletis, millel on 2000 ATK või vähem. Hävita kõik sama nimega koletised selle kontrollija käes ja pakis.

source: Mesmeric Control
et: Mesmeriseeriv Kontroll

source: During your opponent's next turn after you activate this card, your opponent cannot change the battle positions of monsters, except with a card effect.
et: Järgmisel vastase käigul pärast selle kaardi aktiveerimist ei saa vastane muuta koletiste lahingupositsioone, välja arvatud kaardi efekti abil.

source: Graceful Dice
et: Graatsiline Täring

source: Roll 1 six-sided die. The face-up monsters you currently control gain ATK and DEF equal to the result x 100, until the End Phase.
et: Veereta 1 kuuepoolne täring. Näoga ülespoole olevad koletised, mida sa praegu kontrollid, saavad ATK ja DEF juurde võrdse tulemusega x 100 kuni Lõppfaasini.

source: Skull Dice
et: Koljaluude täring

source: Roll 1 six-sided die. The face-up monsters your opponent currently controls lose ATK and DEF equal to the result x 100, until the End Phase.
et: Veereta 1 kuuepoolne täring. Sinu vastase avatud koletised kaotavad ATK ja DEF, mis on võrdne tulemusega x 100, kuni lõppfaasini.

source: Mind Control
et: Mõistuse Kontroll

source: Take control of 1 monster your opponent controls until the End Phase. It cannot declare an attack or be Tributed.
et: Võta oma vastase üks koletis enda kontrolli alla kuni lõppfaasini. See ei saa rünnata ega olla ohverdatud.

source: Scapegoat
et: Põgenik

source: If you activate this card, you cannot Summon other monsters this turn. Special Summon 4 "<M3902>Sheep Token<M>"(s) (Beast-Type/EARTH/Level 1/ATK 0/DEF 0) in Defense Position. The "<M3902>Sheep Token<M>"(s) cannot be used as a Tribute for a Tribute Summon (or Set).
et: Kui aktiveerid selle kaardi, ei saa sa sellel käigul teisi koletisi kutsuda. Kutsu eriliselt välja 4 "<M3902>Lambatoken<M>"(it) (Loom-Tüüp/MAA/Tase 1/ATK 0/DEF 0) kaitsepositsioonis. "<M3902>Lambatoken<M>"(it) ei saa kasutada ohverdusena Ohverduskutsumiseks (või paigutamiseks).

source: Amplifier
et: Võimendi

source: Equip only to "<M4758>Jinzo<M>". While this card is equipped, the equipped monster's effect does not negate the effects of its controller's Trap Cards. When this card is removed from the field, destroy the equipped monster. This card's activation and effect cannot be negated.
et: Varusta ainult "<M4758>Jinzo<M>". Kui see kaart on varustatud, ei tühista varustatud koletise efekt selle kontrollija lõksukaartide efekte. Kui see kaart eemaldatakse väljakult, hävita varustatud koletis. Selle kaardi aktiveerimist ja efekti ei saa tühistada.

source: Card Destruction
et: Kaardi hävitamine

source: Each player discards their entire hand, then draws the same number of cards they discarded.
et: Iga mängija viskab kogu oma käe ära, seejärel tõmbab sama palju kaarte, kui ta ära viskas.

source: Dark Renewal
et: Pime Uuenemine

source: Activate only when your opponent Summons a monster(s). Send 1 of those monsters and 1 monster you control to the Graveyard, and Special Summon 1 Spellcaster-Type monster from your Graveyard.
et: Aktiveeri ainult siis, kui sinu vastane kutsub välja koletise(id). Saada 1 neist koletistest ja 1 koletis, mida sa kontrollid, Hauakambrisse ning Kutsu eriliselt välja 1 Võluri-tüüpi koletis oma Hauakambrist.

source: Tragedy
et: Tragöödia

source: Activate only when a monster on your opponent's side of the field in face-up Attack Position is changed to face-up Defense Position. Destroy all Defense Position monsters on your opponent's side of the field.
et: Aktiveeri ainult siis, kui sinu vastase poolel olev ründepoosis olev koletis muudetakse kaitsepoosi. Hävita kõik kaitsepoosis olevad koletised sinu vastase poolel.

source: Mystical Refpanel
et: Müstiline Peegel

source: Activate only when a Spell Card that targets 1 player is activated. The effect of that Spell Card is applied to the other player instead.
et: Aktiveeri ainult siis, kui aktiveeritakse ühe mängija sihtimiseks mõeldud loitsukaart. Selle loitsukaardi mõju rakendatakse teisele mängijale.

source: Ectoplasmer
et: Ektoplasmaator
