Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: You can only activate this card's effect when you have a Fiend-Type monster on your side of the field. Pay 500 Life Points to use this effect. Both players select 1 Monster Card from their opponent's Graveyard. Remove the selected cards from play.
et: Selle kaardi efekti saad aktiveerida ainult siis, kui sul on väljakul üks Deemon-tüüpi koletis. Selle efekti kasutamiseks maksa 500 Elupunkti. Mõlemad mängijad valivad ühe Koletise Kaardi oma vastase Hauakambrist. Eemalda valitud kaardid mängust.

source: Double Snare
et: Topelt Lõks

source: Destroy 1 face-up card on the field that has an effect that negates Trap Cards' effects.
et: Hävita 1 avatud kaart väljal, millel on lõksukaartide efektide tühistamise efekt.

source: Freed the Matchless General
et: Võitmatu kindral Freed

source: Negate the effect of any Spell Card that targets this card and destroy it. You can add 1 Level 4 or lower Warrior-Type monster from your Deck to your hand instead of conducting a normal draw in your Draw Phase.
et: Negateeri selle kaardi sihtmärgiks oleva Võlukaardi mõju ja hävita see. Sa võid oma Tõmbamisfaasis tavalise tõmbamise asemel lisada oma pakist oma kätte 1 4. taseme või madalama Sõdalase-tüüpi koletise.

source: Throwstone Unit
et: Kiviviskeüksus

source: Tribute 1 Warrior-Type monster on your side of the field to destroy 1 face-up monster on the field whose DEF is equal to or less than the ATK of this card.
et: Lohverda 1 Sõdalase-tüüpi koletis oma väljaku poolelt, et hävitada 1 avatud koletis väljal, mille DEF on võrdne või väiksem selle kaardi ATK-st.

source: Marauding Captain
et: Röövellikapten

source: Your opponent cannot target face-up Warrior-Type monsters for attacks, except this one. When this card is Normal Summoned: You can Special Summon 1 Level 4 or lower monster from your hand.
et: Sinu vastane ei saa rünnakuteks valida näoga ülespoole olevaid Sõdalase-tüüpi koletisi, välja arvatud seda. Kui see kaart on Normaal-Kutsutud: Sa saad oma käest Eriliselt Kutsuda 1 4. taseme või madalama koletise.

source: "<M5320>Warrior Dai Grepher<M>" + "<M5335>Spirit Ryu<M>"<BR>A Fusion Summon of this monster can only be conducted with the above Fusion Material Monsters. As long as this card remains face-up on the field, negate the effect of a Normal Trap Card by paying 1000 Life Points. Negate the effect of a Spell Card that targets this card and destroy it.
et: "<M5320>Sõdalane Dai Grepher<M>" + "<M5335>Vaim Ryu<M>"<BR>Selle koletise sulandumise saab läbi viia ainult ülaltoodud sulandumismaterjalidega. Nii kaua kui see kaart jääb väljale avatud olekusse, tühista Tavalise Lõksukaardi efekt, makstes 1000 Elupunkti. Tühista selle kaarti sihtiva Loitsukaardi efekt ja hävita see.

source: Warrior Dai Grepher
et: Sõdalane Dai Grepher

source: The warrior who can manipulate dragons. Nobody knows his mysterious past.
et: Sõdalane, kes suudab lohesid manipuleerida. Keegi ei tea tema salapärast minevikku.

source: Mysterious Guard
et: Müsteeriumlik Valvur

source: FLIP: Return 1 face-up monster on the field to the top of its owner's Deck. Also, if there is a face-up Warrior-Type monster on your side of the field, you can return another face-up monster to its owner's hand.
et: FLIP: Tõsta 1 avatud koletis väljal selle omaniku paki peale. Kui sinu poolel väljal on avatud Sõdalase-tüüpi koletis, võid lisaks tõsta teise avatud koletise selle omaniku kätte.

source: Frontier Wiseman
et: Pioneer Tark

source: As long as this card remains face-up on your side of the field, negate the effects of Spell Cards that target face-up Warrior-Type monsters on your side of the field and destroy the Spell Cards.
et: Niikaua kui see kaart jääb sinu väljaku poolel avatud olekusse, tühista Võitleja-tüüpi koletisi sihtivate Loitsukaartide efektid sinu väljaku poolel ja hävita Loitsukaardid.

source: Exiled Force
et: Pagendatud Jõud

source: You can Tribute this card to destroy 1 monster on the field.
et: Saad selle kaardi ohverdada, et hävitada 1 koletis väljal.

source: The Hunter with 7 Weapons
et: Seitsme Relvaga Kütt

source: When this card is Normal Summoned, declare 1 Type of monster. When battling that Type of monster, increase the ATK of this card by 1000 points during Damage Calculation.
et: Kui see kaart Normaal-Kutsutakse, kuuluta 1 tüüpi koletis. Selle tüüpi koletisega võideldes suurenda selle kaardi ATK-d 1000 punkti võrra Kahju Arvutamise ajal.

source: Shadow Tamer
et: Varjutaltsutaja

source: (This card is always treated as an "Archfiend" card.)<BR>FLIP: Take control of 1 face-up Fiend-Type monster on your opponent's side of the field until the end of the End Phase.
et: (Seda kaarti käsitletakse alati kui "Archfiend" kaarti.)<BR>FLIP: Võta kontroll 1 vastase väljaku avatud Fiend-tüüpi koletise üle kuni End Phase'i lõpuni.

source: Dragon Manipulator
et: Draakoni Manipulaator

source: FLIP: Take control of 1 face-up Dragon-Type monster on your opponent's side of the field until the end of the End Phase.
et: FLIP: Võta kontroll 1 vastase poolel olevale avatud Draakoni-tüüpi koletisele kuni End Phase lõpuni.

source: The A. Forces
et: A. Jõud

source: Increase the ATK of all Warrior-Type monsters on your side of the field by 200 points for each face-up Warrior-Type and Spellcaster-Type monster on your side of the field.
et: Suurenda kõigi Sõdalase-tüüpi koletiste rünnakupunkte sinu väljaku poolel 200 punkti võrra iga sinu väljaku poolel oleva avatud Sõdalase-tüüpi ja Võluri-tüüpi koletise kohta.

source: Reinforcement of the Army
et: Armee tugevdamine

source: Add 1 Level 4 or lower Warrior-Type monster from your Deck to your hand.
et: Lisa oma pakist 1 4. või madalama tasemega Sõdalase-tüüpi koletis oma kätte.

source: Array of Revealing Light
et: Paljastava valguskiir

source: Declare 1 Type of monster. Any monster of the declared Type cannot declare an attack during the turn it is Normal Summoned, Flip Summoned, or Special Summoned.
et: Vali 1 tüüpi koletis. Ükski valitud tüüpi koletis ei saa rünnakut kuulutada sellel käigul, mil see on Normaal-Summonitud, Flip-Summonitud või Erilis-Summonitud.

source: The Warrior Returning Alive
et: Sõdalane, kes naaseb ellu

source: Target 1 Warrior-Type monster in your Graveyard; add that target to your hand.
et: Vali 1 Sõdalase-tüüpi koletis oma Hauakambris; lisa see sihtmärk oma kätte.

source: Ready for Intercepting
et: Valmis Pealtkuulamiseks

source: Flip 1 face-up Warrior or Spellcaster-Type monster on the field into face-down Defense Position.
et: Muuda 1 avatud Sõdalase või Loitsija-tüüpi koletis väljal kinniseks Kaitsepositsiooniks.

source: A Feint Plan
et: Pettemanööver

source: A player cannot attack face-down monsters during this turn.
et: Mängija ei saa sellel käigul rünnata tagurpidi olevaid koletisi.

source: Tyrant Dragon
et: Türannodraakon

source: During your Battle Phase, if your opponent controls a monster after this card's first attack, this card can attack once again. Negate the effect of any Trap Card that targets this card and destroy it. If this card is Special Summoned from the Graveyard by a card effect, you must Tribute 1 Dragon-Type monster.
et: Oma Lahingufaasis, kui sinu vastasel on pärast selle kaardi esimest rünnakut veel koletis, võib see kaart rünnata uuesti. Tühista iga lõksukaardi efekt, mis sihib seda kaarti, ja hävita see. Kui see kaart kutsutakse eriliselt välja hauast kaardi efekti abil, pead ohverdama 1 Draakoni-tüüpi koletise.

source: Spear Dragon
et: Oda Draakon

source: During battle between this attacking card and a Defense Position monster whose DEF is lower than the ATK of this card, inflict the difference as Battle Damage to your opponent. If this card attacks, it is changed to Defense Position at the end of the Damage Step.
et: Kui selle ründava kaardi ja kaitsepositsioonis oleva koletise, mille DEF on madalam kui selle kaardi ATK, vahel toimub lahing, põhjusta vahe vastasele Lahingukahjuna. Kui see kaart ründab, muudetakse see Kahjustuse Samme lõpus kaitsepositsiooniks.

source: Spirit Ryu
et: Vaimu Ryu

source: You can only activate this effect during your Battle Step, if this card battles during your turn. Discard 1 Dragon-Type monster from your hand to the Graveyard to increase the ATK and DEF of this card by 1000 points until the End Step.
et: Seda efekti saab aktiveerida ainult oma lahingusammu ajal, kui see kaart võitleb sinu käigu ajal. Saada 1 Draakoni-tüüpi koletis oma käest Hauakambrisse, et suurendada selle kaardi ATK ja DEF 1000 punkti võrra kuni Lõpusammuni.

source: The Dragon Dwelling in the Cave
et: Koopas elav draakon

source: A huge dragon dwelling in a cave. It is horrible when it gets angry, although it is usually quiet. It is said to preserve certain treasures.
et: Hiiglaslik koobas elav draakon. See on kohutav, kui see vihastab, kuigi tavaliselt on see vaikne. Öeldakse, et see säilitab teatud aardeid.

source: Lizard Soldier
et: Sisalikusõdur

source: A beast soldier derived from dragons, it is small for a Dragon-Type. Moving very quickly, this monster is an excellent strategist.
et: Loomadest sõdur, kes on pärit draakonitest, on see Draakoni-tüübi jaoks väike. Väga kiiresti liikudes on see koletis suurepärane strateeg.

source: Fiend Skull Dragon
et: Deemonpealuu Draakon

source: "<M5339>Cave Dragon<M>" + "<M5303>Lesser Fiend<M>"<BR>(This card is always treated as an "Archfiend" card.)<BR>A Fusion Summon of this monster can only be conducted with the above Fusion Material Monsters. As long as this card remains face-up on the field, negate the effects of Flip Effect Monsters. Negate the effects of a Trap Card that targets this card and destroy it.
et: "<M5339>Koopasaar<M>" + "<M5303>Väike Deemon<M>"<BR>(Seda kaarti käsitletakse alati kui "Archfiend" kaarti.)<BR>Selle koletise Fusion Summon'i saab läbi viia ainult ülaltoodud Fusion Material Monsters'itega. Kuni see kaart jääb väljale avatud olekusse, tühista Flip Effect Monsters'i efektid. Tühista selle kaarti sihtiva Trap Card'i efektid ja hävita see.

source: Cave Dragon
et: Koopadraakon

source: If there is a monster on your side of the field, you cannot Normal Summon this monster. In addition, if there are no Dragon-Type monsters except this card on your side of the field, this monster cannot declare an attack.
et: Kui sinu väljaku poolel on koletis, ei saa sa seda koletist normaalselt kutsuda. Lisaks, kui sinu väljaku poolel pole ühtegi teist Draakoni-tüüpi koletist peale selle kaardi, ei saa see koletis rünnakut kuulutada.

source: Gray Wing
et: Hall Tiib

source: Discard 1 card from your hand during your Main Phase 1. This monster can attack twice during the Battle Phase of this turn.
et: Viska oma peafaas 1 ajal 1 kaart oma käest. See koletis võib selle käigu lahingufaasi ajal rünnata kaks korda.

source: Troop Dragon
et: Väe Draakon

source: If this card is destroyed and sent to the Graveyard as a result of battle, select and Special Summon 1 "<M5341>Troop Dragon<M>" from your Deck to your side of the field. Then shuffle your Deck.
et: Kui see kaart hävitatakse ja saadetakse lahingu tulemusena Hauakambrisse, vali ja Kutsu Eriliselt välja 1 "<M5341>Troop Dragon<M>" oma Paki seest oma väljaku poolele. Seejärel sega oma Pakk.

source: The Dragon's Bead
et: Draakoni Helmes

source: Discard 1 card from your hand. Negate the effect of a Trap Card that targets 1 face-up Dragon-Type monster and destroy the Trap Card.
et: Viska 1 kaart oma käest. Tühista lõksukaardi efekt, mis sihib 1 avatud Draakoni-tüüpi koletist ja hävita lõksukaart.

source: A Wingbeat of Giant Dragon
et: Hiidlohe tiivalöök

source: Return 1 face-up Level 5 or higher Dragon-Type monster you control to the owner's hand and destroy all Spell and Trap Cards.
et: Tagasta 1 avatud näoga 5. või kõrgema taseme Draakoni-tüüpi koletis, mida sa kontrollid, omaniku kätte ja hävita kõik Loitsu- ja Lõksukaardid.

source: Dragon's Gunfire
et: Draakoni Tulesõda

source: Activate only if you control a face-up Dragon-Type monster. Activate 1 of these effects:<BR>● Inflict 800 damage to your opponent.<BR>● Select 1 face-up monster with 800 or less DEF, and destroy it.
et: Aktiveeri ainult siis, kui sa kontrollid avatud Dragon-Tüüpi koletist. Aktiveeri 1 nendest efektidest:<BR>● Tekita oma vastasele 800 kahju.<BR>● Vali 1 avatud koletis, mille DEF on 800 või vähem, ja hävita see.

source: Stamping Destruction
et: Purustav Tempel

source: Activate only if you control a face-up Dragon-Type monster. Select 1 Spell or Trap Card on the field, destroy it and inflict 500 damage to its controller.
et: Aktiveeri ainult siis, kui kontrollid avatud Nähtavat Draakoni-tüüpi koletist. Vali 1 Väljal olev Võlu- või Lõksukaart, hävita see ja tekita selle kontrollijale 500 kahju.

source: Super Rejuvenation
et: Supernoorendamine

source: During the End Phase of the turn this card is activated, draw 1 card from your Deck for each Dragon-Type monster discarded from your hand and/or Tributed during this turn.
et: End Phase'i ajal, mil see kaart aktiveeritakse, tõmba oma pakist 1 kaart iga Draakoni-tüüpi koletise eest, mis selle käigu jooksul sinu käest ära visati ja/või ohverdati.

source: Dragon's Rage
et: Draakoni Raev

source: During battle between an attacking Dragon-Type monster you control and a Defense Position monster whose DEF is lower than the ATK of the attacking monster, inflict the difference as Battle Damage to your opponent.
et: Kui sinu kontrollitava ründava Draakoni-tüüpi koletise ja Kaitseasendis oleva koletise, kelle DEF on madalam kui ründava koletise ATK, vahel toimub lahing, põhjusta vahe vastasele Lahingukahjuna.

source: Burst Breath
et: Puhanguline Hingus

source: Tribute 1 Dragon-Type monster on your side of the field. Destroy all face-up monsters on the field whose DEF is equal to or less than the ATK of the Tributed monster.
et: Lohverda 1 Draakoni-tüüpi koletis oma väljaku poolel. Hävita kõik avatud koletised väljakul, kelle DEF on võrdne või väiksem kui lohverdatud koletise ATK.

source: Luster Dragon #2
et: Lustakas Draakon #2

source: This dragon feeds on emerald. Enchanted by this monster even when attacked, few people live to tell of its beauty.
et: See draakon toitub smaragdidest. Võlutud selle koletise poolt isegi rünnaku all olles, vähesed inimesed elavad, et rääkida selle ilust.

source: Emergency Provisions
et: Hädaolukorra Varud

source: Send any number of other Spell and Trap Cards you control to the Graveyard. Gain 1000 Life Points for each card sent.
et: Saada ükskõik milline arv teisi loitsu- ja lõksukaarte, mida sa kontrollid, Hauakambrisse. Saavuta 1000 Elupunkti iga saadetud kaardi eest.

source: When this card is destroyed and sent to the Graveyard as a result of battle, select 2 cards from your opponent's Graveyard, add them to your opponent's Deck and the Deck is then shuffled.
et: Kui see kaart hävitatakse ja saadetakse lahingu tulemusena Hauakambrisse, vali 2 kaarti oma vastase Hauakambrist, lisa need oma vastase Paki hulka ja seejärel sega Pakk.

source: Dragged Down into the Grave
et: Hauatõmme

source: You and your opponent look at each other's hands, select 1 card from each other's hands and discard them to the Graveyard, and each draw 1 card.
et: Sina ja su vastane vaatate üksteise käsi, valite ühe kaardi üksteise käest ja saadate need Hauakambrisse, ning seejärel tõmbate mõlemad ühe kaardi.

source: This card cannot be destroyed by battle with a monster that has the same ATK. When this card is destroyed and sent to the Graveyard, return 1 monster on the field to its owner's hand.
et: Seda kaarti ei saa hävitada lahingus koletisega, kellel on sama ATK. Kui see kaart hävitatakse ja saadetakse Hauakambrisse, tagasta 1 koletis väljakult selle omaniku kätte.

source: Spell Reproduction
et: Loitsu Reproduktsioon

source: Send 2 Spell Cards from your hand to the Graveyard. Select 1 Spell Card from your Graveyard and add it to your hand.
et: Saada 2 loitsukaarti oma käest hauakambrisse. Vali 1 loitsukaart oma hauakambrist ja lisa see oma kätte.

source: Shrink
et: Kahanemine

source: Select 1 face-up monster on the field. The original ATK of that monster is halved until the end of this turn.
et: Vali 1 avatud näoga koletis väljal. Selle koletise algne ATK väheneb poole võrra kuni selle käigu lõpuni.

source: This card gains 200 ATK for every Fairy-Type monster in your Graveyard.
et: See kaart saab 200 ATK iga sinu Hauakambris oleva Haldjatüüpi koletise eest.

source: Cestus of Dagla
et: Dagla kestas

source: You can only equip this card to a Fairy-Type monster. Increase the ATK of the monster equipped with this card by 500 points. When the monster equipped with this card inflicts damage to your opponent's Life Points, increase your own Life Points by the same amount.
et: Seda kaarti saab varustada ainult haldjatüüpi koletisele. Suurenda selle kaardiga varustatud koletise rünnakupunkte 500 punkti võrra. Kui selle kaardiga varustatud koletis tekitab kahju sinu vastase elupunktidele, suurenda oma elupunkte sama palju.

source: Virus Cannon
et: Viiruse Kahur

source: Tribute any number of non-Token monsters you control. For each Tributed monster, your opponent selects 1 Spell Card from their Deck and sends it to the Graveyard.
et: Ohverda ükskõik kui palju mitte-Tokeneid koletisi, mida sa kontrollid. Iga ohverdatud koletise eest valib sinu vastane oma pakist ühe Loitsukaardi ja saadab selle Hauakambrisse.

source: Des Feral Imp
et: Desi metsik deemon

source: FLIP: Select 1 card from your Graveyard, add it to your Deck and shuffle your Deck.
et: FLIP: Vali 1 kaart oma Hauakambrist, lisa see oma Paki hulka ja sega oma Pakk.

source: Exchange of the Spirit
et: Vaimude vahetus

source: Activate only while there are 15 or more cards in your Graveyard. Pay 1000 Life Points. Both players swap the card(s) in their Graveyard with the card(s) in their Deck. Then, both players shuffle their Deck.
et: Aktiveeri ainult siis, kui sinu Hauakambris on 15 või rohkem kaarti. Maksa 1000 Elupunkti. Mõlemad mängijad vahetavad oma Hauakambris olevad kaardid oma Paki kaartidega. Seejärel segavad mõlemad mängijad oma Paki.

source: A monster that attacks this card return to the hand. Damage calculation is applied normally.
et: Koletis, mis ründab seda kaarti, naaseb kätte. Kahju arvutamine toimub tavapäraselt.

source: Null and Void
et: Tühistamine

source: Activate only when your opponent draws a card from his/her Deck, or plays a card from his/her hand. That card is negated and sent to the Graveyard.
et: Aktiveeri ainult siis, kui sinu vastane tõmbab kaardi oma pakist või mängib kaardi oma käest. See kaart tühistatakse ja saadetakse Hauakambrisse.

source: When you Tribute Summon a monster by Tributing this card, increase the Life Points of the player who controlled this card on the field by 2000 points.
et: Kui sa kutsud koletise välja, ohverdades selle kaardi, suurenda mängija, kes seda kaarti väljal kontrollis, elupunkte 2000 punkti võrra.

source: Blast Held by a Tribute
et: Plahvatus ohverduse läbi

source: Activate only when your opponent declares an attack with a Tribute Summoned monster they control. Destroy all Attack Position monsters they control and inflict 1000 damage to your opponent.
et: Aktiveeri ainult siis, kui sinu vastane kuulutab välja rünnaku nende kontrollitava ohverdamisega kutsutud koletisega. Hävita kõik nende kontrollitavad rünnakupositsioonis koletised ja tekita vastasele 1000 kahju.

source: When this card is destroyed and sent to the Graveyard as a result of battle, roll a six-sided die. You can Special Summon 1 Fairy-Type monster from your Graveyard whose Level is equal to the number rolled. (If the result is 6, you can Special Summon a Level 6 or higher monster.)
et: Kui see kaart hävitatakse ja saadetakse lahingu tulemusena Hauakambrisse, veereta kuuepoolset täringut. Sa saad eriliselt kutsuda 1 Haldjatüüpi koletise oma Hauakambrist, mille tase on võrdne veeretatud numbriga. (Kui tulemus on 6, saad eriliselt kutsuda 6. taseme või kõrgema koletise.)

source: Silent Doom
et: Vaikne Hukk

source: Special Summon 1 Normal Monster from your Graveyard in face-up Defense Position. It cannot attack.
et: Erikutsuge oma kalmistult 1 tavaline koletis avatud kaitsepositsioonis. See ei saa rünnata.

source: Fiber Jar
et: Kiudpurk

source: FLIP: Both players unite all their respective cards on the field, in their hands, and in their Graveyards with their respective Decks and shuffle them. Then both players draw 5 cards from their shuffled Decks.
et: FLIP: Mõlemad mängijad ühendavad kõik oma vastavad kaardid väljal, käes ja Hauakambris oma vastavate Pakkidega ja segavad need. Seejärel tõmbavad mõlemad mängijad oma segatud Pakkidest 5 kaarti.

source: Gradius' Option
et: Gradiuse valik

source: This card cannot be Normal Summoned or Set. This monster can only be Special Summoned by selecting 1 face-up "<M5140>Gradius<M>" on your side of the field. The ATK and DEF of this card becomes the same as the ATK and DEF of the selected "<M5140>Gradius<M>". If the selected "<M5140>Gradius<M>" is removed from the field, destroy this card.
et: Seda kaarti ei saa normaalset kutsuda ega asetada. Seda koletist saab eriliselt kutsuda ainult valides 1 avatud "<M5140>Gradius<M>" oma väljaku poolel. Selle kaardi ATK ja DEF muutuvad samaks kui valitud "<M5140>Gradius<M>" ATK ja DEF. Kui valitud "<M5140>Gradius<M>" eemaldatakse väljalt, hävita see kaart.

source: This card cannot be Special Summoned. This card returns to the owner's hand during the End Phase of the turn that this card is Normal Summoned, or flipped face-up. If this card is Normal Summoned or flipped face-up, see 1 card on the top of your Deck during your next Draw Phase before you draw, and return the card to the top or the bottom of your Deck.
et: Seda kaarti ei saa eriliselt kutsuda. See kaart naaseb omaniku kätte selle käigu lõppfaasis, mil see kaart on tavakutsutud või ümber pööratud. Kui see kaart on tavakutsutud või ümber pööratud, vaata oma järgmise tõmbefaasi ajal enne tõmbamist oma paki ülemist kaarti ja pane see tagasi paki ülemisele või alumisele kohale.

source: Inaba White Rabbit
et: Inaba Valge Jänes

source: This card cannot be Special Summoned. This card returns to the owner's hand during the End Phase of the turn that this card is Normal Summoned or flipped face-up. This monster attacks your opponent's Life Points directly.
et: Seda kaarti ei saa eriliselt kutsuda. See kaart naaseb omaniku kätte selle käigu lõppfaasis, mil see kaart on normaalselt kutsutud või ümber pööratud. See koletis ründab otse sinu vastase elupunkte.

source: This card cannot be Special Summoned. This card returns to its owner's hand during the End Phase of the turn it is Normal Summoned or flipped face-up. When this card inflicts Battle Damage to your opponent, they skip their next Draw Phase.
et: Seda kaarti ei saa eriliselt kutsuda. See kaart naaseb omaniku kätte selle käigu lõppfaasis, mil see on tavakutsutud või ümber pööratud. Kui see kaart tekitab lahingukahju sinu vastasele, jätab ta oma järgmise tõmbefaasi vahele.

source: Susa Soldier
et: Susa Sõdur

source: This card cannot be Special Summoned. This card returns to the owner's hand during the End Phase of the turn that this card is Normal Summoned or flipped face-up. The Battle Damage this card inflicts to your opponent's Life Points is halved.
et: Seda kaarti ei saa eriliselt kutsuda. See kaart naaseb omaniku kätte selle käigu lõppfaasis, mil see kaart on normaalselt kutsutud või ümber pööratud. Selle kaardi tekitatud lahingukahju sinu vastase elupunktidele on poole väiksem.

source: Yamata Dragon
et: Yamata Draakon
