Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: Select 2 face-up monsters you control (1 Synchro Monster and 1 non-Synchro monster). Until the End Phase of this turn, reduce the ATK of the Synchro Monster to 0, and the other monster gains ATK equal to the Synchro Monster's original ATK.
et: Vali 2 avatud näoga koletist, mida sa kontrollid (1 Sünkro Koletis ja 1 mitte-Sünkro koletis). Selle käigu lõppfaasini vähenda Sünkro Koletise ATK 0-ni ja teine koletis saab juurde ATK, mis on võrdne Sünkro Koletise algse ATK-ga.

source: Card Of Sacrifice
et: Ohverduskaart

source: Draw 2 cards, if the combined ATK of all your face-up Attack Position monsters (minimum 2) is less than the ATK of your opponent's face-up monster with the lowest ATK. You cannot Summon or change Battle Position the turn you activate this card.
et: Tõmba 2 kaarti, kui kõigi sinu avatud rünnakupositsioonis olevate koletiste (vähemalt 2) kombineeritud ATK on väiksem kui sinu vastase avatud koletise madalaim ATK. Sa ei saa sellel käigul, mil aktiveerid selle kaardi, kutsuda ega muuta lahingupositsiooni.

source: Synchro Material
et: Sünkromaterjal

source: Select 1 face-up monster your opponent controls. If you Synchro Summon this turn, you can use the selected monster as a Synchro Material Monster. You cannot conduct your Battle Phase during the turn you activate this card.
et: Vali 1 avatud positsioonis koletis, mida sinu vastane kontrollib. Kui sa teed sellel käigul Sünkro Kutsumise, võid kasutada valitud koletist Sünkro Materjal Koletisena. Sa ei saa läbi viia oma Lahingu Faasi sellel käigul, mil sa aktiveerid selle kaardi.

source: Blackwing - Kochi the Daybreak
et: Mustatiib - Päikesetõusu Kochi

source: If this card was Special Summoned, this card cannot be used as a Synchro Material Monster.
et: Kui see kaart kutsuti eriliselt välja, ei saa seda kaarti kasutada Sünkro Materjal Koletisena.

source: Blackwing - Jetstream the Blue Sky
et: Mustatiib - Jetstream, Sinine Taevas

source: During damage calculation, you can send this card from your hand to the Graveyard to prevent a "Blackwing" monster you control from being destroyed by this battle.
et: Kahjukalkulatsiooni ajal võid saata selle kaardi oma käest Hauakambrisse, et takistada sinu kontrollitavat "Musttiiva" koletist selles lahingus hävitatud saamast.

source: Blackwing - Zephyros the Elite
et: Mustatiib - Eliit Zephyros

source: If this card is in your Graveyard, you can return 1 face-up card you control to the hand to Special Summon this card from the Graveyard and take 400 damage. Each player can only use the effect of "<M9244>Blackwing - Zephyros the Elite<M>" once per Duel.
et: Kui see kaart on sinu Hauakambris, saad ühe avatud kaardi, mida sa kontrollid, käesolevasse kätte tagasi tuua, et see kaart Hauakambrist eriliselt välja kutsuda ja saad 400 kahju. Iga mängija saab kasutada "<M9244>Musttiib - Zephyros Eliit<M>" efekti ainult üks kord Duelli jooksul.

source: Black Feather Beacon
et: Musta Sulepesa

source: Activate only when you take damage from a card effect. Special Summon 1 Level 4 or lower "Blackwing" monster from your hand.
et: Aktiveeri ainult siis, kui saad kahju kaardi efekti tõttu. Kutsu eriliselt välja 1. taseme 4 või madalama "Blackwing" koletis oma käest.

source: Black Return
et: Must Tagasi

source: Activate only when exactly 1 "Blackwing" monster is Special Summoned, by selecting 1 face-up monster your opponent controls. Gain Life Points equal to the ATK of that monster, then return it to the hand.
et: Aktiveeri ainult siis, kui täpselt 1 "Blackwing" koletis kutsutakse eriliselt välja, valides 1 vastase kontrollitava avatud koletise. Saavuta Elupunkte, mis on võrdne selle koletise rünnakuga, seejärel tagasta see käele.

source: Stardust Divinity
et: Tähetolmu Jumalus

source: 1 LIGHT Tuner + 2 or more non-Tuner Fairy-Type Monsters<BR>This card cannot be Special Summoned except by Synchro Summon. If this card attacks your opponent directly and reduces their Life Points to 0, you win the Match.
et: 1 VALGUSTI Häälestaja + 2 või rohkem mitte-Häälestaja Halijatüüpi Koletist<BR>Seda kaarti ei saa Eriliselt Kutsuda, välja arvatud Sünkrokutsumise teel. Kui see kaart ründab sinu vastast otse ja vähendab nende Elupunktid nulli, võidad Matši.

source: Grizzly, the Red Star Beast
et: Grizzly, Punane Tähteloom

source: 1 EARTH Tuner + 2 or more non-Tuner Beast-Type monsters<BR>This card cannot be Special Summoned except by Synchro Summon. If this card attacks your opponent directly and reduces their Life Points to 0, you win the Match.
et: 1 EARTH Tuner + 2 või rohkem mitte-Tuuner Loodus-Tüüpi koletist<BR>Seda kaarti ei saa Erikutsuda, välja arvatud Sünkrokutsumise teel. Kui see kaart ründab sinu vastast otse ja vähendab nende Elupunktid 0-ni, võidad Matši.

source: Blaze Fenix, the Burning Bombardment Bird
et: Leek Fenix, Põlev Pommituslind

source: 1 Machine-Type monster + 1 Pyro-Type monster<BR>Once per turn, during your Main Phase: You can inflict 300 damage to your opponent for each card on the field. This card cannot declare an attack during the turn this effect is activated.
et: 1 Masina-tüüpi koletis + 1 Püro-tüüpi koletis<BR>Kord kord käigu jooksul, oma peafaasis: Sa võid tekitada oma vastasele 300 kahju iga väljal oleva kaardi eest. See kaart ei saa rünnakut kuulutada sellel käigul, mil see efekt aktiveeritakse.

source: Cannot be Normal Summoned or Set. Must be Special Summoned by its own effect, and cannot be Special Summoned by other ways. When a face-up monster you control is destroyed by a card effect and sent to the Graveyard: You can Special Summon this card (from your hand). Other monsters you control cannot declare an attack. Once per turn: You can target 1 Synchro Monster your opponent controls; equip that target to this card. This card gains ATK equal to those equipped monsters' combined ATK. Once per turn, when an opponent's Spell Card is activated: You can negate the activation and destroy it.
et: Ei saa olla normaalkaardistatud ega seatud. Peab olema erikaardistatud omaenda efektiga ja ei saa olla erikaardistatud muul viisil. Kui sinu kontrollitav avatud koletis hävitatakse kaardi efektiga ja saadetakse Hauakambrisse: Sa saad selle kaardi (oma käest) erikaardistada. Teised koletised, mida sa kontrollid, ei saa rünnakut kuulutada. Kord käigu jooksul: Sa saad sihtida 1 Sünkro Koletist, mida sinu vastane kontrollib; kinnita see sihtmärk sellele kaardile. See kaart saab ATK-d, mis on võrdne nende kinnitatud koletiste kombineeritud ATK-ga. Kord käigu jooksul, kui vastase Loitsukaart aktiveeritakse: Sa saad aktiveerimise tühistada ja selle hävitada.

source: This card cannot be Normal Summoned or Set. This card cannot be Special Summoned except by its own effect. When a face-up monster you control is destroyed by a card effect and sent to the Graveyard, you can Special Summon this card from your hand. This card gains ATK and DEF equal to half of your Life Points. Once per turn, you can select 1 Synchro Monster your opponent controls and equip it to this card. This card gains ATK equal to those equipped monsters' combined ATK. During your Main Phase, you can select 1 of those equipped monsters, and Special Summon it to your side of the field in face-up Defense Position.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti ei saa eriliselt kutsuda, välja arvatud oma efekti kaudu. Kui sinu kontrollitav avatud koletis hävitatakse kaardi efekti tõttu ja saadetakse hauakambrisse, saad selle kaardi oma käest eriliselt kutsuda. See kaart saab ATK ja DEF võrdseks poolega sinu elupunktidest. Kord käigu jooksul saad valida 1 Sünkro Koletise, mida sinu vastane kontrollib, ja kinnitada see sellele kaardile. See kaart saab ATK võrdseks nende kinnitatud koletiste kombineeritud ATK-ga. Oma põhiperioodi jooksul saad valida ühe neist kinnitatud koletistest ja kutsuda see eriliselt oma väljaku poolele avatud kaitseasendisse.

source: This card cannot be Normal Summoned or Set. This card cannot be Special Summoned except by its own effect. When a face-up monster you control is destroyed by a card effect and sent to the Graveyard, you can Special Summon this card from your hand. Other monsters you control cannot declare an attack. Once per turn, you can select 1 Synchro Monster your opponent controls, and equip it to this card. This card gains ATK equal to those equipped monsters' combined ATK. You can send 1 monster equipped to this card to the Graveyard to allow this card to attack your opponent directly this turn.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti ei saa eriliselt kutsuda, välja arvatud oma efekti kaudu. Kui sinu kontrollitav avatud koletis hävitatakse kaardi efekti tõttu ja saadetakse Hauakambrisse, saad selle kaardi oma käest eriliselt kutsuda. Teised sinu kontrollitavad koletised ei saa rünnakut kuulutada. Kord käigu jooksul saad valida 1 Sünkro Koletise, mida sinu vastane kontrollib, ja kinnitada selle kaardi külge. See kaart saab ATK-d, mis on võrdne kinnitatud koletiste kombineeritud ATK-ga. Sa saad saata 1 selle kaardi külge kinnitatud koletise Hauakambrisse, et lubada sellel kaardil rünnata sinu vastast otse sel käigul.

source: Machine Imperial Castle
et: Masina Impeeriumiloss

source: Face-up "Machine Emperor" monsters you control cannot be targeted by the effects of Synchro Monsters. When this card on the field is destroyed and sent to the Graveyard, you can add 1 "Machine Emperor" monster from your Deck to your hand.
et: Avatud "Masina Keisri" koletisi, mida sa kontrollid, ei saa sihtida Sünkro Koletiste efektidega. Kui see kaart väljal hävitatakse ja saadetakse Hauakambrisse, saad lisada 1 "Masina Keisri" koletise oma pakist oma kätte.

source: Archfiend Empress
et: Deemonikeisrinna

source: If (exactly) 1 face-up DARK Fiend-Type monster on the field, except this card, would be destroyed, you can remove from play 1 DARK Fiend-Type monster from your Graveyard, instead. When this card is destroyed and sent from the field to the Graveyard, you can select 1 Level 6 or higher DARK Fiend-Type monster in your Graveyard, except "<M9277>Archfiend Empress<M>", and Special Summon it.
et: Kui (täpselt) 1 avatud pimeduse deemonitüüpi koletis väljal, välja arvatud see kaart, hävitatakse, võid selle asemel eemaldada mängust 1 pimeduse deemonitüüpi koletise oma hauakambrist. Kui see kaart hävitatakse ja saadetakse väljast hauakambrisse, võid valida 1 6. või kõrgema taseme pimeduse deemonitüüpi koletise oma hauakambrist, välja arvatud "<M9277>Archfiend Empress<M>", ja eriliselt kutsuda selle välja.

source: Skull Meister
et: Kolju Meister

source: During either player's turn, when a card effect is activated in your opponent's Graveyard, you can send this card from your hand to the Graveyard to negate the effect.
et: Kui vastase surnuaias aktiveeritakse kaardi efekt, võid selle kaardi oma käest surnuaeda saata, et efekt tühistada.

source: If your opponent adds a card(s) from their Deck to their hand, except during the Draw Phase, you can send this card from your hand to the Graveyard. For the rest of this turn, neither player can add card(s) from their Deck to their hand. (Drawing cards is also considered as "adding a card to the hand.")
et: Kui sinu vastane lisab kaardi(d) oma pakist kätte, välja arvatud tõmbamisfaasi ajal, saad saata selle kaardi oma käest hauakambrisse. Selle käigu lõpuni ei saa kumbki mängija lisada kaarti(d) oma pakist kätte. (Kaartide tõmbamist loetakse samuti "kaardi kätte lisamiseks.")

source: Spellstone Sorcerer Karood
et: Loitsukivi Võlur Karood

source: Once per turn, when another Monster Card's effect is activated while there is no Spellstone Counter on this card, place 1 Spellstone Counter on this card (max. 1). This card gains 300 DEF for each Spellstone Counter on it. Once per turn, you can remove 1 Spellstone Counter from your side of the field to select 1 card in your opponent's Graveyard, and remove that card from play.
et: Kord päevas, kui teise Koletise Kaardi efekt aktiveeritakse, kui sellel kaardil pole Spellstone Counterit, aseta sellele kaardile 1 Spellstone Counter (maks. 1). See kaart saab 300 DEF iga sellel oleva Spellstone Counteri kohta. Kord päevas, võid eemaldada 1 Spellstone Counteri oma väljaku poolelt, et valida 1 kaart oma vastase Hauakambris ja eemaldada see kaart mängust.

source: Scrap Mind Reader
et: Rämpsu Meeleloetaja

source: Once per turn, while this card is in your Graveyard during your Main Phase 2, you can select 1 face-up "Scrap" monster you control, except "<M9281>Scrap Mind Reader<M>". Destroy that monster and Special Summon this card from the Graveyard. If you do, remove this card from play when it is removed from the field. If this card is used as a Synchro Material Monster, all other Synchro Material Monsters must be "Scrap" monsters.
et: Kord oma käigu jooksul, kui see kaart on sinu Hauakambris oma Peafaasi 2 ajal, saad valida 1 avatud "Scrap" koletise, mida sa kontrollid, välja arvatud "<M9281>Scrap Mind Reader<M>". Hävita see koletis ja Kutsu see kaart Hauakambrist Eriliselt välja. Kui sa seda teed, eemalda see kaart mängust, kui see eemaldatakse väljakult. Kui seda kaarti kasutatakse Sünkroonne Materjal Koletisena, peavad kõik teised Sünkroonne Materjal Koletised olema "Scrap" koletised.

source: Gravekeeper's Recruiter
et: Hauakaevuri Rekruteerija

source: When this card you control is sent to your Graveyard, add 1 "Gravekeeper's" monster with 1500 or less DEF from your Deck to your hand.
et: Kui see kaart, mida sa kontrollid, saadetakse sinu Hauakambrisse, lisa oma pakist oma kätte 1 "Hauavalvuri" koletis, mille DEF on 1500 või vähem.

source: Psi-Blocker
et: Psi-Blokeerija

source: Once per turn, you can declare 1 card name. Cards with that name, and their effects, cannot be used until the End of your opponent's next turn.
et: Korra ühe korra käigu jooksul võid sa nimetada ühe kaardi nime. Selle nimega kaarte ja nende efekte ei saa kasutada kuni sinu vastase järgmise käigu lõpuni.

source: Koa'ki Meiru Wall
et: Koa'ki Meiru Sein

source: During each of your End Phases, destroy this card unless you send 1 "<M8207>Iron Core of Koa'ki Meiru<M>" from your hand to the Graveyard or reveal 1 Rock-Type monster in your hand. You can Tribute this card to negate the activation of an opponent's Spell Card and destroy that card.
et: Iga oma lõppfaasi ajal hävita see kaart, kui sa ei saada ühte "<M8207>Koa'ki Meiru Raudtuum<M>" oma käest hauakambrisse või ei näita ühte Kiviliigi koletist oma käes. Sa võid ohverdada selle kaardi, et tühistada vastase Loitsukaardi aktiveerimine ja hävitada see kaart.

source: Karakuri Barrel mdl 96 "Shinkuro"
et: Karakuri Tünn mdl 96 "Shinkuro"

source: This card must attack if able. When this face-up Attack Position card on the field is selected as an attack target, change it to Defense Position. Once per turn, this card cannot be destroyed by battle.
et: See kaart peab ründama, kui võimalik. Kui see avatud rünnakupositsioonis kaart väljakul valitakse rünnaku sihtmärgiks, muuda see kaitsepositsiooniks. Kord käigu jooksul ei saa seda kaarti lahingus hävitada.

source: Mischief of the Yokai
et: Yokai vemp

source: Each face-up monster on the field loses 2 Levels, until the End Phase. You can remove from play this card from your Graveyard to select 1 face-up monster and reduce its Level by 1, until the End Phase. This effect cannot be activated the same turn this card is sent to the Graveyard.
et: Iga avatud positsioonis olev koletis kaotab 2 taset kuni lõppfaasini. Sa saad eemaldada selle kaardi oma hauast mängust, et valida 1 avatud positsioonis olev koletis ja vähendada selle taset 1 võrra kuni lõppfaasini. Seda efekti ei saa aktiveerida samal käigul, kui see kaart saadeti hauda.

source: Master Hyperion
et: Meister Hyperion

source: You can Special Summon this card from your hand by removing from play 1 "The Agent" monster in your hand, field, or Graveyard. Once per turn, you can remove from play 1 LIGHT Fairy-Type monster from your Graveyard to select 1 card on the field, and destroy it. If "<M5982>The Sanctuary in the Sky<M>" is face-up on the field, you can activate this effect up to twice per turn.
et: Saad selle kaardi oma käest eriliselt välja kutsuda, eemaldades mängust 1 "The Agent" koletise oma käest, väljakult või Hauakambrist. Kord ühe käigu jooksul saad eemaldada mängust 1 VALGUS haldjatüüpi koletise oma Hauakambrist, et valida 1 kaart väljakul ja hävitada see. Kui "<M5982>The Sanctuary in the Sky<M>" on väljakul avatud, saad seda efekti aktiveerida kuni kaks korda käigu jooksul.

source: The Agent of Mystery - Earth
et: Saladuse Agent - Maa

source: When this card is Normal Summoned, you can add 1 "The Agent" monster from your Deck to your hand, except "<M9288>The Agent of Mystery - Earth<M>". While "<M5982>The Sanctuary in the Sky<M>" is face-up on the field, you can add 1 "<M9287>Master Hyperion<M>" from your Deck to your hand instead.
et: Kui see kaart on Normaal-Kutsutud, saad lisada 1 "The Agent" koletise oma pakist oma kätte, välja arvatud "<M9288>The Agent of Mystery - Earth<M>". Kui "<M5982>The Sanctuary in the Sky<M>" on väljaku peal avatud, saad selle asemel lisada 1 "<M9287>Master Hyperion<M>" oma pakist oma kätte.

source: The Agent of Miracles - Jupiter
et: Imedeagent - Jupiter

source: Once per turn, you can remove from play 1 "The Agent" monster in your Graveyard to select 1 face-up LIGHT Fairy-Type monster you control. The selected monster gains 800 ATK until the End Phase. While "<M5982>The Sanctuary in the Sky<M>" is face-up on the field, once per turn, you can discard 1 Fairy-Type monster to select 1 of your removed from play LIGHT Fairy-Type monsters, and Special Summon it.
et: Korra ühe korra käigu jooksul saad eemaldada oma kalmistult mängust 1 "The Agent" koletise, et valida 1 avatud VALGUS Haldjate-Tüüpi koletis, mida sa kontrollid. Valitud koletis saab 800 ATK juurde kuni käigu lõpuni. Kui "<M5982>The Sanctuary in the Sky<M>" on väljakul avatud, saad korra ühe käigu jooksul visata käest ära 1 Haldjate-Tüüpi koletise, et valida 1 oma mängust eemaldatud VALGUS Haldjate-Tüüpi koletis ja kutsuda see eriliselt välja.

source: Cards from the Sky
et: Kaardid taevast

source: Remove from play 1 LIGHT Fairy-Type monster in your hand and draw 2 cards. You cannot Special Summon or conduct your Battle Phase the turn you activate this card.
et: Eemalda mängust 1 VALGUS haldjatüüpi koletis oma käest ja tõmba 2 kaarti. Sa ei saa sellel käigul, mil aktiveerid selle kaardi, eriliselt kutsuda ega läbi viia oma lahingufaasi.

source: Divine Punishment
et: Jumalik karistus

source: Activate only if "<M5982>The Sanctuary in the Sky<M>" is face-up on the field. Negate the activation of a Spell Card, Trap Card, or Effect Monster's effect, and destroy that card.
et: Aktiveeri ainult siis, kui "<M5982>Taevane Pühamu<M>" on väljal avatud. Tühista Võlusõna Kaardi, Lõksu Kaardi või Efekt Koletise efekti aktiveerimine ja hävita see kaart.

source: Cosmic Compass
et: Kosmiline Kompass

source: When this card is Normal Summoned, you can Special Summon a number of "<M3971>Compass Token<M>"s (Machine-Type/EARTH/Level 1/ATK 0/DEF 0) up to the number of monsters your opponent controls.
et: Kui see kaart on Normaal-Kutsutud, saad Eriliselt Kutsuda kuni sama arvu "<M3971>Kompassi Token<M>"eid (Masina-Tüüp/MAA/Tase 1/ATK 0/DEF 0), kui palju koletisi sinu vastane kontrollib.

source: Doppelwarrior
et: Topeltsõdalane

source: When a monster is Special Summoned from your Graveyard, you can Special Summon this card from your hand. If this card is sent to the Graveyard as a Synchro Material Monster, you can Special Summon 2 "<M3972>Doppel Token<M>"s (Warrior-Type/DARK/Level 1/ATK 400/DEF 400) in Attack Position.
et: Kui koletis kutsutakse sinu Hauakambrist eriliselt välja, saad selle kaardi oma käest eriliselt välja kutsuda. Kui see kaart saadetakse Hauakambrisse Sünkro Materjal Koletisena, saad eriliselt välja kutsuda 2 "<M3972>Doppel Token<M>"it (Sõdalane-Tüüp/PIMEDUS/Tase 1/RÜN 400/KAIT 400) Rünnakupositsioonis.

source: Stardust Phantom
et: Tähetolmu Fantoom

source: When this card you control is destroyed by your opponent's attack or card effect and sent to the Graveyard, you can select 11 "<M7734>Stardust Dragon<M>" in your Graveyard, and Special Summon it in face-up Defense Position. You can remove from play this card from your Graveyard to select 1 face-up Dragon-Type Synchro Monster you control. Once per turn, that Synchro Monster cannot be destroyed by battle. At the end of each Damage Step this effect is applied, that Synchro Monster loses 800 ATK and DEF.
et: Kui see kaart, mida sa kontrollid, hävitatakse sinu vastase rünnaku või kaardi efekti tõttu ja saadetakse Hauakambrisse, saad valida 1 "<M7734>Stardust Dragon<M>" oma Hauakambris ja Kutsuda see Eriliselt esile näoga ülespoole Kaitseasendis. Sa saad eemaldada selle kaardi oma Hauakambrist, et valida 1 näoga ülespoole Draakoni-tüüpi Sünkro Koletis, mida sa kontrollid. Kord käigu jooksul ei saa seda Sünkro Koletist lahingus hävitada. Iga Kahjustuse Etapi lõpus, kui see efekt rakendub, kaotab see Sünkro Koletis 800 ATK ja DEF.

source: You can Special Summon this card from your hand by removing from play 1 face-up monster you control. If you do, return the removed from play monster to the field during the next Standby Phase.
et: Saad selle kaardi oma käest eriliselt välja kutsuda, eemaldades mängust 1 avatud koletise, mida sa kontrollid. Kui teed seda, siis järgmise Ootefaasiga too eemaldatud koletis tagasi väljakule.

source: Top Runner
et: Tipptasemel Jooksja

source: All face-up Synchro Monsters you control gain 600 ATK.
et: Kõik sinu kontrolli all olevad avatud Sünkro Koletised saavad 600 ATK juurde.

source: Barrier Resonator
et: Barjääri Resonaator

source: During either player's turn, you can send this card from your hand to the Graveyard to select 1 face-up Tuner monster you control. This turn, that monster cannot be destroyed by battle, and you take no Battle Damage from battles involving it.
et: Mõlema mängija käigu ajal saad saata selle kaardi oma käest Hauakambrisse, et valida 1 avatud Tuner koletis, mida sa kontrollid. Sellel käigul ei saa seda koletist lahingus hävitada ja sa ei saa lahingukahju lahingutest, milles see osaleb.

source: Blackwing - Boreas the Sharp
et: Mustatiib - Terav Boreas

source: You can remove from play this card from your Graveyard to select 1 face-up "Blackwing" monster you control. If that monster battles with an opponent's monster this turn, it cannot be destroyed by battle and you take no Battle Damage from that battle. After damage calculation, destroy the opponent's monster that battled with the selected monster.
et: Saad selle kaardi oma Hauakambrist mängust eemaldada, et valida 1 avatud "Blackwing" koletis, mida sa kontrollid. Kui see koletis võitleb sellel käigul vastase koletisega, ei saa seda lahingus hävitada ja sa ei saa sellest lahingust lahingukahju. Pärast kahju arvutamist hävita vastase koletis, mis võitles valitud koletisega.

source: Blackwing - Brisote the Tailwind
et: Mustatiib - Brisote, Taganttuul

source: If 2 or more "Blackwing" monsters you control are destroyed in the same turn, you can Special Summon this card from your hand. If this card is sent to the Graveyard as a Synchro Material Monster, you gain 600 Life Points.
et: Kui 2 või enam sinu kontrolli all olevat "Blackwing" koletist hävitatakse samal käigul, saad selle kaardi oma käest eriliselt kutsuda. Kui see kaart saadetakse Hauakambrisse Sünkro Materjal Koletisena, saad 600 Elupunkti juurde.

source: Blackwing - Calima the Haze
et: Mustatiib - Udu Calima
