Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: 1 Tuner + 1 or more non-Tuner Plant-Type monsters<BR>Each player must pay 1000 Life Points to Normal or Special Summon a non-Plant-Type monster from their hand.
et: 1 Häälestaja + 1 või rohkem mitte-Häälestaja Taimetüüpi koletist<BR>Iga mängija peab maksma 1000 Elupunkti, et Normaal- või Erikutsuda mitte-Taimetüüpi koletis oma käest.

source: Horseytail
et: Hobusesaba

source: When this card is destroyed by battle and sent to the Graveyard, Special Summon 1 "<M3947>Horseytail Token<M>" (Plant-Type/WIND/Level 1/ATK 0/DEF 0) to your opponent's side of the field in Defense Position. When this Token is destroyed by battle with a Plant-Type monster, its controller sends 1 card from their hand to the Graveyard.
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse, kutsu eriliselt esile 1 "<M3947>Horseytail Token<M>" (Taim-Tüüp/TUUL/Tase 1/ATK 0/DEF 0) oma vastase väljaku poolele kaitsepositsioonis. Kui see Token hävitatakse lahingus Taim-Tüüpi koletisega, saadab selle juht 1 kaardi oma käest Hauakambrisse.

source: Cursed Fig
et: Neetud viigipuu

source: When this card is destroyed by battle and sent to the Graveyard, select 2 Set Spell or Trap Cards on the field. While this card is in the Graveyard, the selected cards cannot be activated.
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse, vali 2 seatud Loitsu- või Lõksukaarti väljal. Kuni see kaart on Hauakambris, ei saa valitud kaarte aktiveerida.

source: Miracle Fertilizer
et: Imeline väetis

source: Once per turn, you can select 1 Plant-Type monster from your Graveyard and Special Summon it. You cannot Normal Summon or Set the turn you Special Summon a monster with this effect. If a monster Special Summoned by this effect is removed from the field, destroy this card.
et: Korra ühe korra käigu jooksul saad valida 1 Taimetüüpi koletise oma Hauakambrist ja Kutsuda see Eriliselt välja. Sa ei saa Normaalset Kutsumist ega Asetamist teha käigul, mil sa Kutsud koletise Eriliselt välja selle efektiga. Kui selle efektiga Eriliselt Kutsutud koletis eemaldatakse väljakult, hävita see kaart.

source: Overworked
et: Ületöötanud

source: Destroy each monster whose ATK is higher than its original ATK.
et: Hävita iga koletis, kelle ATK on kõrgem kui tema algne ATK.

source: Herald of Orange Light
et: Oranži Valguse Kuulutaja

source: You can send this card and 1 other Fairy-Type monster from your hand to the Graveyard to negate the activation of an effect of an Effect Monster your opponent controls, and destroy it. You can activate this effect during either player's turn.
et: Saad selle kaardi ja 1 teise haldjatüüpi koletise oma käest Hauakambrisse, et tühistada oma vastase juhitava Efektikoletise efekti aktiveerimine ja hävitada see. Saad seda efekti aktiveerida mõlema mängija käigu ajal.

source: Herald of Perfection
et: Täiuslikkuse Kuulutaja

source: You can Ritual Summon this card with "<M8834>Dawn of the Herald<M>". During either player's turn, when your opponent activates a Spell Card, Trap Card, or monster effect: You can send 1 Fairy-Type monster from your hand to the Graveyard; negate the activation, and if you do, destroy it.
et: Sa saad selle kaardi Rituaalsummonida "<M8834>Heraldiku Koit<M>" abil. Mõlema mängija käigu ajal, kui sinu vastane aktiveerib Loitsukaardi, Lõksukaardi või koletise efekti: Sa saad saata 1 Haldjate-tüüpi koletise oma käest Hauakambrisse; tühista aktiveerimine ja kui sa seda teed, hävita see.

source: Twin-Barrel Dragon
et: Kaheraudne Draakon

source: When this card is Summoned, select 1 card your opponent controls. Toss a coin twice, and if the result is 2 heads destroy the selected card.
et: Kui see kaart kutsutakse välja, vali 1 kaart, mida sinu vastane kontrollib. Viska münti kaks korda ja kui tulemuseks on 2 kulli, hävita valitud kaart.

source: You can Special Summon this card from your hand by removing from play 1 Spirit Monster from your hand. Spirit Monsters you control do not have to have their effects that return them to the hand activated.
et: Saad selle kaardi oma käest eriliselt välja kutsuda, eemaldades mängust 1 Vaimukoletise oma käest. Vaimukoletised, mida sa kontrollid, ei pea aktiveerima oma efekte, mis tagastavad nad kätte.

source: This card cannot be Special Summoned. This card returns to its owner's hand during the End Phase of the turn it is Normal Summoned or flipped face-up. When this card is Normal Summoned or flipped face-up, you can discard 1 card to add 1 Spirit monster from your Graveyard to your hand.
et: Seda kaarti ei saa eriliselt kutsuda. See kaart naaseb omaniku kätte selle käigu lõppfaasis, mil see on tavakutsutud või ümber pööratud. Kui see kaart on tavakutsutud või ümber pööratud, võid sa ühe kaardi ära visata, et lisada oma hauakambrist üks Vaimu koletis oma kätte.

source: B.E.S. Big Core MK-2
et: B.E.S. Suur Südamik MK-2

source: If you control no monsters, you can Normal Summon this card without Tributing. When this card is Special Summoned, place 3 counters on it. This card cannot be destroyed by battle. If this card attacks or is attacked, remove 1 counter from this card at the end of the Damage Step. If you cannot, destroy it.
et: Kui sul ei ole kontrolli all ühtegi koletist, saad selle kaardi Normaal-Kutsuda ilma ohverdamata. Kui see kaart on Eriliselt Kutsutud, pane sellele 3 loendurit. Seda kaarti ei saa lahingus hävitada. Kui see kaart ründab või teda rünnatakse, eemalda sellelt kaardilt 1 loendur Kahjustuse Etapi lõpus. Kui sa ei saa, hävita see.

source: Road Warrior
et: Teesõdalane

source: "<M7841>Road Synchron<M>" + 2 or more non-Tuner Monsters.<BR>Once per turn, you can Special Summon 1 Level 2 or lower Warrior or Machine-Type monster from your Deck.
et: "<M7841>Road Synchron<M>" + 2 või rohkem mittehäälestajat koletist.<BR>Kord käigu jooksul saad eriliselt kutsuda 1 taseme 2 või madalama Sõdalase või Masina-tüüpi koletise oma pakist.

source: Sword of Kusanagi
et: Kusanagi mõõk

source: Equip only to a Spirit monster. During battle, when it attacks a Defense Position monster whose DEF is lower than the ATK of the equipped monster, inflict the difference as Battle Damage to your opponent. When the equipped monster you control is returned to the hand and this card is sent to the Graveyard, return this card to your hand.
et: Varusta ainult Vaimu koletisele. Lahingu ajal, kui see ründab Kaitseasendis koletist, mille DEF on madalam kui varustatud koletise ATK, põhjusta vahe vastasele Lahingukahjuna. Kui sinu kontrollitav varustatud koletis tagastatakse kätte ja see kaart saadetakse Hauakambrisse, tagasta see kaart oma kätte.

source: Orb of Yasaka
et: Yasaka Orbi

source: Equip only to a Spirit monster. When it destroys an opponent's monster by battle and sends it to the Graveyard, gain Life Points equal to that monster's original ATK. When the equipped monster you control is returned to the hand and this card is sent to the Graveyard, return this card to your hand.
et: Varusta ainult Vaimu koletisega. Kui see hävitab lahingus vastase koletise ja saadab selle Hauakambrisse, saad Elupunkte, mis on võrdne selle koletise algse rünnakuga. Kui varustatud koletis, mida sa kontrollid, tagastatakse kätte ja see kaart saadetakse Hauakambrisse, tagasta see kaart oma kätte.

source: Mirror of Yata
et: Yata peegel

source: Equip only to a Spirit monster. The equipped monster does not have to have its effect that returns it to the hand activated. If it would be destroyed by battle, destroy this card instead.
et: Varusta ainult Vaimu koletisele. Varustatud koletis ei pea oma efekti, mis tagastab selle käele, aktiveerima. Kui see hävitatakse lahingus, hävita selle asemel see kaart.

source: Geartown
et: Hammaslinn

source: Both players can Tribute Summon "Ancient Gear" monsters with 1 less Tribute than required. When this card is destroyed and sent to the Graveyard, you can Special Summon 1 "Ancient Gear" monster from your hand, Deck, or Graveyard.
et: Mõlemad mängijad saavad ohverdada "Ancient Gear" koletisi ühe ohvri võrra vähem kui nõutud. Kui see kaart hävitatakse ja saadetakse Hauakambrisse, saad Sa eriliselt kutsuda ühe "Ancient Gear" koletise oma käest, pakist või Hauakambrist.

source: Tune Warrior
et: Häälestussõdalane

source: The warrior's antenna can attune it to any energy wave. It can monitor transmissions from miles away but always suffers from bad reception.
et: Sõdalase antenn suudab häälestuda igale energialainele. See suudab jälgida edastusi miilide kauguselt, kuid kannatab alati halva vastuvõtu all.

source: Water Spirit
et: Vaimu Vesi

source: This ancient water spirit haunts the glacial monoliths of Antarctica. It has the power to seep into the pores of any substance and chill it to the bone.
et: See iidne veevaim kummitab Antarktika liustikemonoliite. Tal on võime imbuda mis tahes aine pooridesse ja jahutada see läbi luude.

source: Roadrunner
et: Teekondur

source: Junk Synchron
et: Rämpssünkron

source: When this card is Normal Summoned, you can Special Summon 1 Level 2 or lower monster from your Graveyard in face-up Defense Position. That monster's effect(s) is negated.
et: Kui see kaart on Normaal-Kutsutud, saad Sa eriliselt kutsuda 1 Tase 2 või madalama koletise oma Hauakambrist näoga ülespoole Kaitseasendisse. Selle koletise efekt(id) on tühistatud.

source: Speed Warrior
et: Kiirussõdalane

source: During the Battle Phase of the turn you Normal Summon this card, you can double its original ATK until the end of the Battle Phase.
et: Lahingu faasis, mil sa kutsud selle kaardi tavalisel viisil välja, saad selle algse rünnakupunktide arvu kahekordistada kuni lahingufaasi lõpuni.

source: Each time this card inflicts Battle Damage to your opponent, it gains 200 ATK.
et: Iga kord, kui see kaart tekitab vastasele lahingukahju, saab see 200 ATK juurde.

source: Frequency Magician
et: Sagedusmaag

source: When this card is Normal Summoned, place 1 Spell Counter on it (max. 1). You can remove 1 Spell Counter from this card to have 1 face-up monster you control gain 500 ATK, until the End Phase.
et: Kui see kaart on Normaal-Kutsutud, aseta sellele 1 Loitsuloendur (maks. 1). Sa saad eemaldada 1 Loitsuloenduri sellelt kaardilt, et üks sinu kontrollitav avatud koletis saaks 500 ATK juurde kuni Lõppfaasini.

source: Synchro Boost
et: Sünkro Tõuge

source: The equipped monster gains 500 ATK, and its Level is increased by 1.
et: Varustatud koletis saab 500 ATK juurde ja selle tase tõuseb 1 võrra.

source: Synchro Blast Wave
et: Sünkrooni Lööklaine

source: Activate only while you control a face-up Synchro Monster. Destroy 1 monster your opponent controls.
et: Aktiveeri ainult siis, kui sa kontrollid avatud Sünkro Koletist. Hävita 1 koletis, mida sinu vastane kontrollib.

source: Synchronized Realm
et: Sünkroniseeritud Kuningriik

source: Each time you Synchro Summon a Synchro monster, inflict 500 damage to your opponent.
et: Iga kord, kui sa kutsud välja Sünkro koletise, tekitad oma vastasele 500 kahju.

source: Scrap-Iron Scarecrow
et: Kõrvaldatud Raudvarras

source: Activate only when an opponent's monster declares an attack. Negate the attack, and Set this card face-down again instead of sending it to the Graveyard.
et: Aktiveeri ainult siis, kui vastase koletis kuulutab välja rünnaku. Tühista rünnak ja aseta see kaart uuesti näoga allapoole, selle asemel et saata see Hauakambrisse.

source: Miniaturize
et: Miniaturiseeri

source: Select 1 monster with 1000 or more original ATK. It loses 1000 ATK, and its Level is reduced by 1. When that monster is removed from the field, destroy this card.
et: Vali 1 koletis, millel on algne ATK 1000 või rohkem. See kaotab 1000 ATK ja selle tase väheneb 1 võrra. Kui see koletis eemaldatakse väljakult, hävita see kaart.

source: Junk Warrior
et: Rämpssõdalane

source: "<M7687>Junk Synchron<M>" + 1 or more non-Tuner monsters<BR>When this card is Synchro Summoned, it gains ATK equal to the total ATK of all Level 2 and lower monsters you control.
et: "<M7687>Junk Synchron<M>" + 1 või rohkem mittehäälestaja koletisi<BR>Kui see kaart on Sünkroon-Kutsutud, saab see ATK-d, mis on võrdne kõigi sinu kontrolli all olevate 2. taseme ja madalamate koletiste kogurünnakuga.

source: Gaia Knight, the Force of Earth
et: Gaia Rüütel, Maa Jõud

source: 1 Tuner + 1 or more non-Tuner monsters
et: 1 Tuner + 1 või rohkem mitte-Tuner koletist

source: Colossal Fighter
et: Kolossaalne Võitleja

source: 1 Tuner + 1 or more non-Tuner monsters<BR>This card gains 100 ATK for every Warrior-Type monster in any Graveyard. When this card is destroyed by battle and sent to the Graveyard, you can select 1 Warrior-Type monster from either player's Graveyard, and Special Summon it.
et: 1 Tuner + 1 või rohkem mitte-Tuner koletist<BR>See kaart saab 100 ATK iga Sõdalase-tüüpi koletise eest ükskõik millises Hauas. Kui see kaart hävitatakse lahingus ja saadetakse Hauale, saad valida 1 Sõdalase-tüüpi koletise kas enda või vastase Hauast ja Kutsuda see Eriliselt.

source: One Shot Booster
et: Ühe Lasku Võimendi

source: If you have Normal Summoned a monster this turn, you can Special Summon this card from your hand. You can Tribute this card to destroy 1 monster your opponent controls that battled one of your monsters this turn.
et: Kui oled sellel käigul kutsunud välja tavalise koletise, saad selle kaardi oma käest eriliselt välja kutsuda. Sa saad selle kaardi ohverdada, et hävitada 1 koletis, mida sinu vastane kontrollib ja mis võitles ühe sinu koletisega sellel käigul.

source: Nitro Synchron
et: Nitro Sünkron

source: If this card is sent to the Graveyard for the Synchro Summon of a "Nitro" Synchro Monster, draw 1 card.
et: Kui see kaart saadetakse hauakambrisse "Nitro" Sünkrokoletise sünkrokutsumiseks, tõmba 1 kaart.

source: Quillbolt Hedgehog
et: Okkapulk Siil

source: If you control a face-up Tuner monster, you can Special Summon this card from your Graveyard. If this card was Summoned this way, banish it when it leaves the field.
et: Kui sa kontrollid avatud Tuner koletist, saad selle kaardi oma Hauakambrist eriliselt kutsuda. Kui see kaart kutsuti sel viisil, siis eemalda see mängust, kui see lahkub väljakult.

source: Ghost Gardna
et: Kummitusgardna

source: When a face-up monster you control is selected as an attack target, you can change the target to this card. When this card is destroyed and sent to the Graveyard, 1 face-up monster your opponent controls loses 1000 ATK, until the End Phase.
et: Kui sinu kontrollitav avatud koletis valitakse rünnaku sihtmärgiks, saad sihtmärgi muuta selleks kaardiks. Kui see kaart hävitatakse ja saadetakse Hauakambrisse, kaotab 1 sinu vastase kontrollitav avatud koletis 1000 ATK-d kuni Lõppfaasini.

source: Shield Warrior
et: Kilbisõdalane

source: During damage calculation, you can remove from play this card from your Graveyard to prevent monsters you control from being destroyed by this battle.
et: Kahjukalkulatsiooni ajal saad selle kaardi oma kalmistult mängust eemaldada, et takistada oma kontrollitavaid koletisi selles lahingus hävimas.

source: Small Piece Golem
et: Väike Tükk Golem

source: When this card is Summoned, if you control a1 "<M7706>Big Piece Golem<M>", you can Special Summon 1 "<M7705>Medium Piece Golem<M>" from your Deck. That monster's effect is negated while it is face-up on the field.
et: Kui see kaart kutsutakse välja ja kui sa kontrollid "<M7706>Big Piece Golem<M>", saad eriliselt välja kutsuda 1 "<M7705>Medium Piece Golem<M>" oma pakist. Selle koletise efekt on tühistatud, kui see on näoga ülespoole väljakul.

source: Medium Piece Golem
et: Keskosa Golem

source: When this card is Summoned, if you control a1 "<M7706>Big Piece Golem<M>", you can Special Summon 1 "<M7704>Small Piece Golem<M>" from your Deck. That monster's effect is negated while it is face-up on the field.
et: Kui see kaart kutsutakse välja ja kui sa kontrollid "<M7706>Big Piece Golem<M>", saad eriliselt välja kutsuda 1 "<M7704>Small Piece Golem<M>" oma pakist. Selle koletise efekt on tühistatud, kui see on väljaku peal avatud.

source: Big Piece Golem
et: Suur Tükk Golem

source: If your opponent controls a monster and you control no monsters, you can Normal Summon this card without Tributing.
et: Kui sinu vastasel on koletis ja sul ei ole ühtegi koletist, saad selle kaardi normaalset kutsuda ilma ohverdamata.

source: Sinister Sprocket
et: Kurjakuul

source: If this card is sent to the Graveyard for the Synchro Summon of a DARK Synchro Monster, you can destroy 1 face-up Spell or Trap Card.
et: Kui see kaart saadetakse Sünkrosummoni jaoks Hauakambrisse, et kutsuda välja PIMEDUS Sünkromonster, võid hävitada 1 avatud Loitsu- või Lõksukaardi.

source: Dark Resonator
et: Tume Resonator

source: Once per turn, if this card would be destroyed by battle, it is not destroyed. (Damage calculation is applied normally.)
et: Korra ühe käigu jooksul, kui see kaart peaks lahingus hävima, siis seda ei hävitata. (Kahju arvutamine toimub tavapäraselt.)

source: Twin-Shield Defender
et: Kaksikilbi Kaitsja

source: When this card you control is destroyed by battle and sent to your Graveyard, you can halve the current ATK of 1 face-up monster your opponent controls, until the End Phase.
et: Kui see kaart, mida sa kontrollid, hävitatakse lahingus ja saadetakse sinu Hauakambrisse, saad sa vähendada ühe vastase kontrollitava avatud koletise praegust rünnakujõudu poole võrra kuni lõppfaasini.

source: Jutte Fighter
et: Jutte Võitleja

source: Once per turn, you can change 1 face-up Attack Position monster your opponent controls to face-up Defense Position.
et: Korra ühe korra käigu jooksul saad muuta ühe vastase kontrollitava avatud rünnakupositsioonis oleva koletise avatud kaitsepositsiooniks.

source: Handcuffs Dragon
et: Käeraudade Draakon

source: When this card is destroyed by battle with an attacking monster your opponent controls and is sent to the Graveyard, you can equip this card to that monster. The equipped monster loses 1800 ATK. When it is destroyed and this card is sent to the Graveyard, you can Special Summon this card.
et: Kui see kaart hävitatakse lahingus ründava koletisega, mida sinu vastane kontrollib, ja saadetakse Hauakambrisse, saad selle kaardi sellele koletisele varustada. Varustatud koletis kaotab 1800 ATK. Kui see hävitatakse ja see kaart saadetakse Hauakambrisse, saad selle kaardi eriliselt kutsuda.

source: Montage Dragon
et: Montaaždraakon

source: This card cannot be Normal Summoned or Set. This card cannot be Special Summoned except by sending 3 other monsters from your hand to the Graveyard. This card's ATK is equal to the combined Levels of the sent monsters x 300.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti ei saa eriliselt kutsuda, välja arvatud juhul, kui saadate 3 muud koletist oma käest hauakambrisse. Selle kaardi ATK on võrdne saadetud koletiste tasemete summaga x 300.

source: An opponent's monster that battles this card is changed to face-down Defense Position at the end of the Damage Step.
et: Vastase koletis, mis selle kaardiga võitleb, muudetakse Kahjustuse Samme lõpus näoga allapoole Kaitseasendisse.

source: Mind Master
et: Meister Mõistus

source: You can pay 800 Life Points and Tribute 1 Psychic-Type monster, except1 "<M7714>Mind Master<M>", to Special Summon 1 Level 4 or lower Psychic-Type monster from your Deck in face-up Attack Position.
et: Sa võid maksta 800 Elupunkti ja ohverdada 1 Psüühika-tüüpi koletis, välja arvatud "<M7714>Mind Master<M>", et Kutsuda Eriliselt 1 4. taseme või madalama Psüühika-tüüpi koletis oma Pakist avatud Rünnakupositsioonis.

source: Doctor Cranium
et: Doktor Kranium

source: When this card is destroyed by battle and sent to the Graveyard, you can pay 800 Life Points to add 1 Psychic-Type monster from your Deck to your hand.
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse, võid maksta 800 Elupunkti, et lisada 1 Psüühika-tüüpi koletis oma pakist oma kätte.

source: When this card is selected as an attack target, you can pay 800 Life Points to negate the attack.
et: Kui see kaart valitakse rünnaku sihtmärgiks, võid maksta 800 Elupunkti, et rünnak tühistada.

source: Mind Protector
et: Meeltekaitsja

source: This card's controller must pay 500 Life Points during each of their Standby Phases. If they cannot, destroy this card. Monsters with 2000 or less ATK cannot declare an attack, except for Psychic-Type monsters.
et: Selle kaardi kontrollija peab maksma 500 Elupunkti iga oma Ootefaaside ajal. Kui nad ei saa, hävita see kaart. Koletised, kellel on 2000 või vähem RÜN, ei saa rünnakut kuulutada, välja arvatud Psüühika-tüüpi koletised.

source: Psychic Commander
et: Psüühiline Komandör

source: When a Psychic-Type monster you control battles, during the Damage Step you can pay Life Points in multiples of 100 (max. 500) to have the monster it's battling lose that much ATK and DEF, until the End Phase.
et: Kui sinu kontrolli all olev Psüühika-tüüpi koletis võitleb, saad Kahjuastme ajal maksta Elupunkte 100-kaupa (maksimaalselt 500), et vähendada koletise, kellega ta võitleb, ATK ja DEF selle summa võrra kuni Lõppfaasini.

source: Psychic Snail
et: Psüühiline tigu

source: You can pay 800 Life Points and select 1 other face-up Psychic-Type monster you control. That monster can attack twice during each Battle Phase. This card cannot attack the turn you activate this effect.
et: Sa saad maksta 800 Elupunkti ja valida 1 teise ülespööratud Psüühika-tüüpi koletise, mida sa kontrollid. See koletis võib rünnata kaks korda iga Lahingufaasi jooksul. See kaart ei saa rünnata sellel käigul, kui sa aktiveerid selle efekti.

source: Telekinetic Shocker
et: Telekineetiline Šokker

source: If a Psychic-Type monster would be destroyed, you can pay 500 Life Points and destroy this card instead.
et: Kui Psüühika-tüüpi koletis hävitatakse, võid maksta 500 Elupunkti ja hävitada selle kaardi selle asemel.

source: During the End Phase, if this card is the only Psychic-Type monster you control, destroy it. You can pay 1000 Life Points to destroy 1 face-down Spell or Trap Card your opponent controls.
et: End Phase'i ajal, kui see kaart on ainus Psüühika-tüüpi koletis, mida sa kontrollid, hävita see. Sa võid maksta 1000 Elupunkti, et hävitada 1 allapoole pööratud Võlu- või Lõksukaart, mida su vastane kontrollib.

source: Gladiator Beast Equeste
et: Gladiaatorikutsar Equeste

source: When this card is Special Summoned by the effect of a "Gladiator Beast" monster: Target 1 "Gladiator Beast" card in your Graveyard; add that target to your hand. At the end of the Battle Phase, if this card attacked or was attacked: You can shuffle it into the Deck; Special Summon 1 "Gladiator Beast" monster from your Deck, except1 "<M7722>Gladiator Beast Equeste<M>".
et: Kui see kaart on eriliselt kutsutud "Gladiator Beast" koletise efekti abil: Sihtige 1 "Gladiator Beast" kaart oma Hauas; lisage see sihtmärk oma kätte. Lahingufaasi lõpus, kui see kaart ründas või teda rünnati: Võite selle segada tagasi pakki; kutsuge eriliselt 1 "Gladiator Beast" koletis oma pakist, välja arvatud "<M7722>Gladiator Beast Equeste<M>".

source: Jenis, Lightsworn Mender
et: Jenis, Valgusevande Parandaja

source: During the End Phase, if a card(s) was sent from your Deck to the Graveyard by the effect of a "Lightsworn" card this turn, inflict 500 damage to your opponent and gain 500 Life Points.
et: End Phase'i ajal, kui sellel käigul saadeti "Lightsworn" kaardi efekti tõttu sinu pakist kaart või kaardid hauakambrisse, põhjusta oma vastasele 500 kahju ja saa 500 elupunkti juurde.

source: Mecha Bunny
et: Mecha Jänes
