Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: Up to twice per turn, you can remove from play 1 Psychic-Type monster from your Graveyard to have this card gain 500 ATK.
et: Kuni kaks korda käigu jooksul võid eemaldada oma kalmistult mängust 1 Psüühika-tüüpi koletise, et see kaart saaks 500 ATK juurde.

source: Master Gig
et: Meister Gig

source: Once per turn, you can pay 1000 Life Points to destroy monsters your opponent controls equal to the number of face-up Psychic-Type monsters you control.
et: Korra ühe käigu jooksul saad maksta 1000 Elupunkti, et hävitada vastase kontrollitavad koletised, mis on võrdne sinu kontrollitavate ülespööratud Psüühika-tüüpi koletiste arvuga.

source: Emissary from Pandemonium
et: Emissar Pandemooniast

source: This card cannot be Special Summoned. You can Normal Summon this card with 1 Tribute. If you do, it becomes Level 5 and its original ATK and DEF are halved.
et: Seda kaarti ei saa eriliselt kutsuda. Sa saad selle kaardi normaalselt kutsuda ühe ohvriga. Kui sa seda teed, muutub see 5. tasemeks ja selle algne ATK ja DEF vähenevad poole võrra.

source: Gigastone Omega
et: Gigakivi Omega

source: This card cannot be Normal Summoned or Set. This card can only be Special Summoned by removing from play 2 EARTH monsters from your Graveyard. When this face-up card you control is sent to the Graveyard by a card effect, destroy all Spell and Trap Cards your opponent controls.
et: Seda kaarti ei saa normaalset kutsuda ega asetada. Seda kaarti saab eriliselt kutsuda ainult eemaldades oma kalmistult mängust 2 EARTH tüüpi koletist. Kui see avatud kaart, mida sa kontrollid, saadetakse kaardiefekti tõttu kalmistule, hävita kõik loitsu- ja lõksukaardid, mida su vastane kontrollib.

source: Alien Dog
et: Tulnukakoer

source: When you Normal Summon an "Alien" monster, you can Special Summon this card from your hand. When you do, place 2 "A-Counters" on face-up monster(s) your opponent controls.
et: Kui sa kutsud normalkutsumisega välja "Alien" koletise, saad selle kaardi oma käest eriliselt välja kutsuda. Kui sa seda teed, aseta 2 "A-loendurit" vastase kontrollitavatele avatud koletistele.

source: Spined Gillman
et: Ogalik Mees

source: All Fish-Type, Sea Serpent-Type, and Aqua-Type monsters you control gain 400 ATK.
et: Kõik sinu kontrolli all olevad Kalatüüpi, Meremadutüüpi ja Veetüüpi koletised saavad 400 ATK juurde.

source: Deep Sea Diva
et: Sügavmere Diva

source: When this card is Normal Summoned, you can Special Summon 1 Level 3 or lower Sea Serpent-Type monster from your Deck.
et: Kui see kaart on Normaal-Kutsutud, saad oma pakist Eriliselt Kutsuda 1 Tase 3 või madalama Mere Madu-tüüpi koletise.

source: Mermaid Archer
et: Merineitsi Ambur

source: Once per turn, you can equip 1 Level 3 or lower monster you control to this card. If you do, this card gains 800 ATK. If this card would be destroyed, you can destroy the equipped monster instead. (You can only equip 1 monster at a time to this card.)
et: Korra ühe korra käigu jooksul saad varustada selle kaardi külge ühe 3. taseme või madalama koletise, mida sa kontrollid. Kui teed seda, saab see kaart 800 ATK juurde. Kui see kaart hävitatakse, saad selle asemel hävitada varustatud koletise. (Sa saad varustada selle kaardi külge korraga ainult ühe koletise.)

source: Lava Dragon
et: Laava Draakon

source: You can Tribute this face-up Defense Position card to Special Summon 2 Level 3 or lower Dragon-Type monsters: 1 from your hand, and 1 from your Graveyard.
et: Saad selle avatud kaitseasendis kaardi ohverdada, et erikutsuda 2 3. või madalama taseme Draakoni-tüüpi koletist: 1 oma käest ja 1 oma hauast.

source: Vanguard of the Dragon
et: Draakoni eelvägi

source: You can send 1 Dragon-Type monster from your hand to the Graveyard to have this card gain 300 ATK. When this card you control is sent to the Graveyard by your opponent's card effect, you can Special Summon 1 Dragon-Type Normal Monster from either player's Graveyard.
et: Saad oma käest ühe Draakoni-tüüpi koletise Hauakambrisse, et see kaart saaks 300 ATK juurde. Kui see kaart, mida sa kontrollid, saadetakse sinu vastase kaardi efekti tõttu Hauakambrisse, saad sa eriliselt kutsuda ühe Draakoni-tüüpi Tavalise Koletise kas enda või vastase Hauakambrist.

source: G.B. Hunter
et: G.B. Kütt

source: Cards on the field cannot be returned to the Deck.
et: Kaardid väljakul ei saa tagasi paki sisse minna.

source: Exploder Dragonwing
et: Plahvatav Draakontiib

source: 1 Tuner + 1 or more Dragon-Type non-Tuner monsters<BR>If this card battles a monster whose ATK is equal to or less than the ATK of this card, you can destroy the monster immediately with this card's effect without applying damage calculation, and inflict damage to your opponent equal to that monster's ATK.
et: 1 Tuner + 1 või rohkem draakonitüüpi mitte-Tuner koletisi<BR>Kui see kaart võitleb koletisega, mille ATK on võrdne või väiksem kui selle kaardi ATK, võid selle kaardi efektiga koletise koheselt hävitada ilma kahju arvutust rakendamata ja tekitada oma vastasele kahju, mis on võrdne selle koletise ATK-ga.

source: Blackwing Armed Wing
et: Mustatiib Relvastatud Tiib

source: 1 "Blackwing" Tuner + 1 or more non-Tuner monsters<BR>If this card attacks a Defense Position monster, it gains 500 ATK during the Damage Step only. During battle between this attacking card and a Defense Position monster whose DEF is lower then the ATK of this card, inflict the difference as Battle Damage to your opponent.
et: 1 "Mustade tiib" häälestaja + 1 või rohkem mitte-häälestaja koletist<BR>Kui see kaart ründab kaitseasendis koletist, saab see ainult Kahjustuse sammu ajal 500 ATK juurde. Lahingu ajal selle ründava kaardi ja kaitseasendis koletise vahel, mille DEF on madalam kui selle kaardi ATK, põhjusta vahe oma vastasele Lahingukahjuna.

source: 1 Dragon-Type Tuner + 1 or more non-Tuner Dragon-Type monsters<BR>This monster cannot be Special Summoned except by Synchro Summon. When this card is Synchro Summoned, you can destroy up to 2 cards you control. If you do, for each card destroyed by this effect, this card gains 1 additional attack this turn.
et: 1 Draakoni-tüüpi Tuner + 1 või rohkem mitte-Tuner Draakoni-tüüpi koletisi<BR>Seda koletist ei saa eriliselt kutsuda, välja arvatud Sünkro Kutsumise teel. Kui see kaart on Sünkro Kutsutud, saad hävitada kuni 2 kaarti, mida sa kontrollid. Kui sa seda teed, saab see kaart iga selle efekti abil hävitatud kaardi eest 1 lisarünnaku sellel käigul.

source: Sea Dragon Lord Gishilnodon
et: Mere Draakoniisand Gishilnodon

source: 1 Tuner + 1 Level 3 non-Tuner monster<BR>When a face-up Level 3 or lower monster on the field is sent to the Graveyard, this card's ATK becomes 3000 until the End Phase of this turn.
et: 1 Tuner + 1 Tase 3 mitte-Tuner koletis<BR>Kui näoga ülespoole olev Tase 3 või madalama tasemega koletis väljakul saadetakse Hauakambrisse, muutub selle kaardi ATK kuni selle käigu Lõppfaasini 3000-ks.

source: One for One
et: Üks ühe vastu

source: Send 1 Monster Card from your hand to the Graveyard. Special Summon 1 Level 1 monster from your hand or Deck.
et: Saada 1 koletise kaart oma käest hauakambrisse. Kutsu eriliselt välja 1. taseme koletis oma käest või pakist.

source: Mind Trust
et: Meelerahe

source: Tribute 1 Level 2 or higher monster. Add 1 Tuner Monster from your Graveyard to your hand whose Level is less than or equal to half of the Tributed monster's.
et: Lohverda 1. taseme 2 või kõrgem koletis. Lisa oma kalmistult oma kätte 1 Tuner-koletis, mille tase on väiksem või võrdne poolega lohverdatud koletise tasemest.

source: Thorn of Malice
et: Pahameele okas

source: Equip only to1 "<M7898>Black Rose Dragon<M>" or a Plant-Type monster. It gains 600 ATK. When it attacks a Defense Position monster whose DEF is lower than the monster's ATK, inflict the difference as Battle Damage to your opponent. If it attacks a monster, that monster loses 600 ATK and DEF after damage calculation. An opponent's monster that battles with the equipped monster cannot be destroyed by that battle.
et: Varusta ainult kaardile "<M7898>Black Rose Dragon<M>" või Taimetüüpi koletisele. See saab 600 ATK juurde. Kui see ründab Kaitseasendis koletist, mille DEF on madalam kui selle koletise ATK, tekitab vahe vastasele Lahingukahjuna. Kui see ründab koletist, kaotab see koletis pärast kahju arvutamist 600 ATK ja DEF. Vastase koletist, mis võitleb varustatud koletisega, ei saa selles lahingus hävitada.

source: Magic Planter
et: Maagiline Istutaja

source: Send 1 face-up Continuous Trap Card you control to the Graveyard. Draw 2 cards.
et: Saada 1 avatud pidev lõksukaart, mida sa kontrollid, kalmistule. Tõmba 2 kaarti.

source: Wonder Clover
et: Imekas

source: Select 1 face-up monster you control and send 1 Level 4 Plant-Type monster from your hand to the Graveyard. During the turn, the selected monster can attack twice, but other monsters you control cannot declare an attack.
et: Vali 1 avatud asendis olev koletis, mida sa kontrollid, ja saada 1 Tase 4 Taim-Tüüpi koletis oma käest Hauakambrisse. Selle käigu ajal võib valitud koletis rünnata kaks korda, kuid teised koletised, mida sa kontrollid, ei saa rünnakut kuulutada.

source: Against the Wind
et: Tuule vastu

source: Select 1 "Blackwing" monster in your Graveyard. Take damage equal to the ATK of the selected monster, and add it to your hand.
et: Vali 1 "Blackwing" koletis oma Hauakambris. Saa kahju, mis on võrdne valitud koletise rünnakuga, ja lisa see oma kätte.

source: Black Whirlwind
et: Must Whirlwind

source: When a "Blackwing" monster is Normal Summoned to your side of the Field, you can add 1 "Blackwing" monster from your Deck to your hand that has less ATK than that monster.
et: Kui sinu väljale kutsutakse normaalset teed pidi "Blackwing" koletis, saad lisada oma pakist oma kätte ühe "Blackwing" koletise, mille ATK on väiksem kui sellel koletisel.

source: Junk Box
et: Rämpskast

source: Select and Special Summon 1 Level 4 or lower "Morphtronic" monster from your Graveyard. Destroy it during the End Phase.
et: Vali ja Kutsu Eriliselt välja 1 tase 4 või madalam "Morphtronic" koletis oma Hauakambrist. Hävita see Lõppfaasis.

source: Double Tool C&D
et: Topelriist C&D

source: Equip only to a "<M8137>Power Tool Dragon<M>" or Level 4 or higher Machine-Type "Morphtronic" monster you control. While equipped:<BR>● During your turn: It gains 1000 ATK. If it attacks, any effects of the attack target that activate or apply on the field are negated during that Battle Phase.<BR>● During your opponent's turn: Your opponent cannot select a monster other than the equipped monster as an attack target. An opponent's monster that battles the equipped monster is destroyed at the end of the Damage Step.<BR>● During your opponent's turn: Your opponent cannot select a monster other than the equipped monster as an attack target. An opponent's monster that battles the equipped monster is destroyed at the end of the Damage Step.
et: Varusta ainult "<M8137>Power Tool Dragon<M>" või 4. taseme või kõrgema masinatüüpi "Morphtronic" koletisega, mida sa kontrollid. Kui see on varustatud:<BR>● Sinu käigu ajal: See saab 1000 ATK juurde. Kui see ründab, siis rünnaku sihtmärgi kõik väljal aktiveeruvad või rakenduvad efektid tühistatakse selle Lahingufaasi ajal.<BR>● Sinu vastase käigu ajal: Sinu vastane ei saa valida rünnaku sihtmärgiks ühtegi teist koletist peale varustatud koletise. Vastase koletis, mis võitleb varustatud koletisega, hävitatakse Kahjustusetapi lõpus.<BR>● Sinu vastase käigu ajal: Sinu vastane ei saa valida rünnaku sihtmärgiks ühtegi teist koletist peale varustatud koletise. Vastase koletis, mis võitleb varustatud koletisega, hävitatakse Kahjustusetapi lõpus.

source: Morphtronic Repair Unit
et: Morftroniline Remondiseade

source: Send 1 "Morphtronic" monster from your hand to the Graveyard and select 1 "Morphtronic" monster in your Graveyard. Special Summon the selected monster and equip it with this card. The equipped monster cannot change its Battle Position. When this card is removed from the Field, destroy the equipped monster.
et: Saada 1 "Morphtronic" koletis oma käest Hauakambrisse ja vali 1 "Morphtronic" koletis oma Hauakambris. Kutsu valitud koletis eriliselt välja ja varusta see selle kaardiga. Varustatud koletis ei saa oma Lahinguasendit muuta. Kui see kaart eemaldatakse Väljast, hävita varustatud koletis.

source: Iron Core of Koa'ki Meiru
et: Koa'ki Meiru Raudne Südamik

source: During your Draw Phase, if this card is in your Graveyard, you can add this card to your hand instead of drawing, and/or send 1 "Koa'ki Meiru" monster from your hand to your Graveyard to add this card to your hand.
et: Oma tõmbamisfaasis, kui see kaart on sinu hauas, võid selle kaardi lisada oma kätte tõmbamise asemel ja/või saata 1 "Koa'ki Meiru" koletis oma käest hauale, et lisada see kaart oma kätte.

source: Iron Core Immediate Disposal
et: Raudse Tuuma Kohene Hävitus

source: Select and send 1 "<M8207>Iron Core of Koa'ki Meiru<M>" from your Deck to your Graveyard.
et: Vali ja saada 1 "<M8207>Koa'ki Meiru Raudne Südamik<M>" oma pakist oma hauakambrisse.

source: Urgent Synthesis
et: Kiire süntees

source: Return 1 "<M8207>Iron Core of Koa'ki Meiru<M>" from your Graveyard to the Deck. Special Summon 1 Level 4 or lower "Koa'ki Meiru" monster from your hand or your Graveyard.
et: Tagasta 1 "<M8207>Koa'ki Meiru raudne südamik<M>" oma kalmistult tagasi pakki. Kutsu eriliselt välja 1 4. või madalama taseme "Koa'ki Meiru" koletis oma käest või kalmistult.

source: Psychic Path
et: Psüühiline Tee

source: Pay 800 Life Points and select up to 2 of your removed from play Psychic-Type monsters. Add them to your hand.
et: Makske 800 Elupunkti ja vali kuni 2 mängust eemaldatud Psüühika-tüüpi koletist. Lisa need oma kätte.

source: Natural Tune
et: Looduslik Häälestus

source: Select 1 face-up Level 4 or lower Normal Monster you control. It is treated as a Tuner monster while it is face-up on the field.
et: Vali 1 avatud Level 4 või madalama tavalise koletise, mida sa kontrollid. Seda käsitletakse kui Tuner-koletist, kui see on väljakul avatud.

source: Supremacy Berry
et: Ülimusmari

source: If your Life Points were lower than your opponent's when this card was activated, gain 2000 Life Points. If your Life Points were higher than your opponent's, you take 1000 damage.
et: Kui sinu Elupunktid olid selle kaardi aktiveerimisel madalamad kui sinu vastasel, saad 2000 Elupunkti juurde. Kui sinu Elupunktid olid kõrgemad kui sinu vastasel, saad 1000 kahju.

source: Forbidden Chalice
et: Keelatud Karikas

source: One face-up monster on the field gains 400 ATK, but its effect is negated until the End Phase.
et: Üks avatud koletis väljakul saab 400 ATK juurde, kuid selle efekt on tühistatud kuni lõppfaasini.

source: Calming Magic
et: Rahustav Maagia

source: This card can only be activated at the start of Main Phase 1. During the Main Phases and Battle Phase of this turn, neither player can Summon monsters.
et: Seda kaarti saab aktiveerida ainult Main Phase 1 alguses. Selle käigu Main Phase'ide ja Battle Phase'i ajal ei saa kumbki mängija kutsuda koletisi.

source: Miracle Locus
et: Imeväe koht

source: Select 1 face-up Attack Position monster you control. Your opponent draws 1 card. The selected monster gains 1000 ATK until the End Phase and can attack up to 2 monsters during this turn's Battle Phase. When it attacks or is attacked this turn, your opponent takes no Battle Damage.
et: Vali 1 avatud ründeasendis koletis, mida sa kontrollid. Sinu vastane tõmbab 1 kaardi. Valitud koletis saab 1000 ATK juurde kuni lõppfaasini ja võib rünnata kuni 2 koletist selle käigu lahingufaasi ajal. Kui see ründab või seda rünnatakse sellel käigul, ei saa sinu vastane lahingukahju.

source: Crimson Fire
et: Veripunane Tuli

source: Activate only when your opponent activates a Spell or Trap Card that inflicts damage while you control a face-up1 "<M7735>Red Demon's Dragon<M>". You take no damage, and your opponent takes twice the effect damage you would have taken, instead.
et: Aktiveeri ainult siis, kui su vastane aktiveerib loitsu- või lõksukaardi, mis tekitab kahju, kui sul on kontrolli all avatud1 "<M7735>Punase Deemoni Draakon<M>". Sa ei saa kahju ja su vastane saab kaks korda rohkem efektikahju, kui sina oleksid saanud.

source: Tuner Capture
et: Häälestaja Püüdja

source: Activate only when your opponent Synchro Summons a monster. Special Summon 1 Tuner monster used for that Synchro Summon from their Graveyard to your side of the field.
et: Aktiveeri ainult siis, kui sinu vastane kutsub sünkrokutsumisega välja koletise. Kutsu eriliselt välja 1 Tuner-koletis, mida kasutati selle sünkrokutsumise jaoks, nende hauakambrist oma väljaku poolele.

source: Overdoom Line
et: Ülekohtu Joon

source: All Plant-Type monsters Special Summoned from the Graveyard to your side of the field while this card is face-up on the field gain 1000 ATK. Destroy this card during your 2nd End Phase after activation.
et: Kõik Taimetüüpi koletised, kes on eriliselt kutsutud hauast sinu väljaku poolele, saavad selle kaardi väljaku peal olles 1000 ATK juurde. Hävita see kaart oma teise lõppfaasi ajal pärast aktiveerimist.

source: Wicked Rebirth
et: Paha taassünd

source: Pay 800 Life Points, select 1 Synchro Monster from your Graveyard, and Special Summon it in face-up Attack Position. Its effect is negated, and this turn it cannot declare an attack. When this card is removed from the field, destroy that monster. When that monster is destroyed, destroy this card.
et: Makske 800 Elupunkti, vali 1 Sünkromonster oma Hauakambrist ja Kutsu see Eriliselt välja näoga ülespoole Rünnakupositsioonis. Selle efekt on tühistatud ja see ei saa sel käigul rünnakut kuulutada. Kui see kaart eemaldatakse väljakult, hävita see monster. Kui see monster hävitatakse, hävita see kaart.

source: Delta Crow - Anti Reverse
et: Delta Vares - Anti Reverse

source: Activate only while you control a face-up "Blackwing" monster. If you control exactly 3 "Blackwing" monsters, this card can be activated from your hand. Destroy all face-down Spell and Trap Cards your opponent controls.
et: Aktiveeri ainult siis, kui sa kontrollid avatud "Blackwing" koletist. Kui sa kontrollid täpselt 3 "Blackwing" koletist, saab seda kaarti aktiveerida sinu käest. Hävita kõik vastase kontrolli all olevad tagurpidi olevad Võlu- ja Lõksukaardid.

source: Level Retuner
et: Taseme Ümberhäälestaja

source: Reduce the Level of 1 face-up monster you control by up to 2.
et: Vähenda ühe sinu kontrolli all oleva avatud koletise taset kuni 2 võrra.

source: Fake Feather
et: Võlts Sulg

source: Send 1 "Blackwing" monster from your hand to the Graveyard and select 1 Normal Trap Card in your opponent's Graveyard. The effect of this card will be the same as the selected Normal Trap Card.
et: Saada 1 "Blackwing" koletis oma käest Hauakambrisse ja vali 1 Tavaline Lõksukaart oma vastase Hauakambris. Selle kaardi efekt on sama, mis valitud Tavalise Lõksukaardi efekt.

source: Trap Stun
et: Lõksu Summutamine

source: Negate the effects of all other Trap Cards on the field during this turn.
et: Keela sellel käigul kõigi teiste lõksukaartide efektid väljal.

source: Morphtronic Bind
et: Morftroniline Side

source: While you control a face-up "Morphtronic" monster, all Level 4 or higher monsters your opponent controls cannot attack or change their battle positions.
et: Kui sa kontrollid avatud "Morphtronic" koletist, ei saa kõik sinu vastase kontrollitavad 4. või kõrgema taseme koletised rünnata ega muuta oma lahingupositsioone.

source: Reckoned Power
et: Arvestatud Jõud

source: Reveal 1 "<M8207>Iron Core of Koa'ki Meiru<M>" in your hand. Destroy all face-down Spell and Trap Cards your opponent controls.
et: Paljasta oma käes olev "<M8207>Koa'ki Meiru Raudtuum<M>". Hävita kõik vastase kontrollitavad tagurpidi olevad Võlu- ja Lõksukaardid.

source: Automatic Laser
et: Automaatne Laser

source: When your opponent Normal or Special Summons a monster(s) with 1000 or more ATK, reveal 1 "<M8207>Iron Core of Koa'ki Meiru<M>" in your hand to activate this card. Destroy that Summoned monster(s).
et: Kui su vastane kutsub normaal- või erikutsumisega välja koletise(d), millel on 1000 või rohkem ATK-d, paljasta oma käes olev "<M8207>Iron Core of Koa'ki Meiru<M>", et aktiveerida see kaart. Hävita see välja kutsutud koletis(ed).

source: Attack of the Cornered Rat
et: Nurgas lõksu jäänud roti rünnak

source: If a Level 3 or lower Normal Monster you control battles, during the Damage Step you can pay Life Points in multiples of 100. The ATK of the opponent's monster is reduced by the amount of Life Points you paid, until the End Phase. (You cannot pay more Life Points than the ATK of the opponent's monster.)
et: Kui sinu kontrollitav 3. taseme või madalama taseme Normaalne Koletis võitleb, saad Kahjustuse Etapis maksta Elupunkte 100-kaupa. Vastase koletise ATK väheneb makstud Elupunktide võrra kuni Lõppfaasini. (Sa ei saa maksta rohkem Elupunkte kui vastase koletise ATK.)

source: Proof of Powerlessness
et: Võimetuse Tõestus

source: Activate only while you control a face-up Level 7 or higher monster. Destroy all face-up Level 5 or lower monsters your opponent controls. Monsters you control cannot attack this turn.
et: Aktiveeri ainult siis, kui sa kontrollid avatud taseme 7 või kõrgemat koletist. Hävita kõik avatud taseme 5 või madalamad koletised, mida su vastane kontrollib. Koletised, mida sa kontrollid, ei saa sellel käigul rünnata.

source: Bone Temple Block
et: Luude Templi Blokk

source: Discard 1 card. Special Summon 1 Level 4 or lower monster from your opponent's Graveyard to your side of the field, and your opponent Special Summons 1 Level 4 or lower monster from your Graveyard to your opponent's side of the field. Those monsters are destroyed during the End Phase of the next turn.
et: Viska 1 kaart. Kutsu eriliselt välja 1 tase 4 või madalam koletis oma vastase hauakambrist oma väljaku poolele ja su vastane kutsub eriliselt välja 1 tase 4 või madalam koletis sinu hauakambrist oma väljaku poolele. Need koletised hävitatakse järgmise käigu lõppfaasis.

source: Grave of the Super Ancient Organism
et: Superiidse organismi haud

source: All face-up Level 6 or higher Special Summoned monsters on the field cannot declare an attack or activate their effects.
et: Kõik näoga ülespoole olevad 6. või kõrgema taseme erikutsutud koletised väljakul ei saa rünnata ega oma efekte aktiveerida.

source: Swallow Flip
et: Pääsukese Pööre

source: Negate the activation of an Effect Monster's effect that activates when a monster is Special Summoned (including itself), and destroy it.
et: Tühista Efektikoletise efekti aktiveerimine, mis aktiveerub, kui koletis kutsutakse eriliselt (kaasa arvatud see ise), ja hävita see.

source: Mirror of Oaths
et: Vandekohus

source: Activate only when your opponent Special Summons a monster(s) from their Deck. Destroy that monster(s) and draw 1 card.
et: Aktiveeri ainult siis, kui sinu vastane kutsub oma pakist erilisummoniga koletise(d). Hävita see koletis(ed) ja tõmba 1 kaart.

source: Fabled Urustos
et: Muinasjutuline Urustos

source: While you have 2 or less cards in your hand, all face-up "Fabled" monsters you control gain 400 ATK.
et: Kui sul on käes 2 või vähem kaarti, saavad kõik sinu kontrolli all olevad avatud "Fabled" koletised 400 ATK juurde.

source: Fabled Krus
et: Muinasjutt Krus

source: When this card is discarded to the Graveyard, select 1 Level 4 or lower "Fabled" monster in your Graveyard, except this card, and Special Summon it.
et: Kui see kaart saadetakse hauakambrisse, vali 1 tase 4 või madalam "Fabled" koletis oma hauakambris, välja arvatud see kaart, ja kutsu see eriliselt välja.

source: Fabled Topi
et: Muinasjutt Topi
