Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: Equip only to a DARK monster. It gains 400 ATK. When the equipped monster is Tributed and this card is sent to the Graveyard, return this card to your hand.
et: Varusta ainult PIMEDUSE koletisele. See saab 400 ATK juurde. Kui varustatud koletis ohverdatakse ja see kaart saadetakse Hauakambrisse, tagasta see kaart oma kätte.

source: Eradicator Epidemic Virus
et: Epideemia hävitaja viirus

source: Tribute 1 DARK monster with 2500 or more ATK, and choose Spell Cards or Trap Cards; check your opponent's hand, all Spell/Trap Cards they control, and all cards they draw until the end of their 3rd turn after this card's activation, and destroy all cards of the chosen type.
et: Ohverda 1 PIMEDUS koletis, mille ATK on 2500 või rohkem, ja vali Loitsukaardid või Lõksukaardid; kontrolli oma vastase kätt, kõiki Loitsu/Lõksukaarte, mida nad kontrollivad, ja kõiki kaarte, mida nad tõmbavad kuni nende 3. käigu lõpuni pärast selle kaardi aktiveerimist, ja hävita kõik valitud tüüpi kaardid.

source: Cocoon Party
et: Kookonipidu

source: Special Summon 1 "Chrysalis" monster from your Deck for each "Neo-Spacian" monster with a different name in your Graveyard.
et: Erikutsuge oma pakist 1 "Chrysalis" koletis iga "Neo-Spacian" koletise kohta, millel on sinu kalmistul erinev nimi.

source: Chrysalis Chicky
et: Krüsalise Tibuke

source: You can Tribute this card while "Neo Space" is on the field to Special Summon 1 "<M6769>Neo-Spacian Air Hummingbird<M>" from your hand or Deck.
et: Saad selle kaardi ohverdada, kui "Neo Space" on väljakul, et Kutsuda Eriliselt 1 "<M6769>Neo-Spacian Air Hummingbird<M>" oma käest või pakist.

source: Chrysalis Pantail
et: Krisalloom Pantail

source: You can Tribute this card while "Neo Space" is on the field to Special Summon 1 "<M6772>Neo-Spacian Dark Panther<M>" from your hand or Deck.
et: Saad selle kaardi ohverdada, kui "Neo Space" on väljakul, et Kutsuda Eriliselt 1 "<M6772>Neo-Spacian Dark Panther<M>" oma käest või pakist.

source: Chrysalis Pinny
et: Kookon Pinny

source: You can Tribute this card while "Neo Space" is face-up on the field to Special Summon 1 "<M6771>Neo-Spacian Glow Moss<M>" from your hand or Deck.
et: Saad selle kaardi ohverdada, kui "Neo Space" on väljakul avatud, et Kutsuda Eriliselt 1 "<M6771>Neo-Spacian Glow Moss<M>" oma käest või pakist.

source: Cocoon Veil
et: Kookonloor

source: Activate by Tributing 1 face-up "Chrysalis" monster. This turn, any damage to a player caused by an effect becomes 0. Special Summon 1 "Neo-Spacian" monster written on the "Chrysalis" monster you Tributed, from your hand, Deck or from either player's Graveyard.
et: Aktiveeri, ohverdades 1 avatud "Chrysalis" koletise. Sellel käigul muutub mängijale tekitatud efektikahju 0-ks. Kutsu eriliselt välja 1 "Neo-Spacian" koletis, mis on kirjutatud ohverdatud "Chrysalis" koletisele, oma käest, pakist või mõlema mängija hauast.

source: Convert Contact
et: Muuda Kontakt

source: Activate only while you control no monsters. Send 1 "Neo-Spacian" monster from your hand and 1 from your Deck to the Graveyard. Then draw 2 cards.
et: Aktiveeri ainult siis, kui sul pole ühtegi koletist. Saada 1 "Neo-Spacian" koletis oma käest ja 1 oma pakist kalmistule. Seejärel tõmba 2 kaarti.

source: Hero Counterattack
et: Kangelase Vasturünnak

source: When an1 "Elemental HERO" monster you control is destroyed by battle: Your opponent chooses and reveals 1 random card from your hand, then, if it is an "Elemental HERO" monster, you destroy 1 monster your opponent controls and Special Summon the chosen monster.
et: Kui sinu kontrolli all olev "Elemental HERO" koletis hävitatakse lahingus: Sinu vastane valib ja paljastab juhuslikult ühe kaardi sinu käest, seejärel, kui see on "Elemental HERO" koletis, hävitad sa ühe koletise, mida sinu vastane kontrollib, ja Kutsud Eriliselt esile valitud koletise.

source: Fifth Hope
et: Viies Lootus

source: Target 5 "Elemental HERO" cards in your Graveyard; shuffle them into the Deck, then draw 2 cards (draw 3 cards instead, if you had no other cards on your side of the field and in your hand when you activated this card).
et: Vali 5 "Elemental HERO" kaarti oma Hauakambris; sega need tagasi Pakki, seejärel tõmba 2 kaarti (tõmba 3 kaarti, kui sul ei olnud selle kaardi aktiveerimisel ühtegi teist kaarti oma väljal ega käes).

source: Send 1 face-up "Neo-Spacian" monster you control to the Graveyard. Special Summon 1 Level 4 monster with the same name from your Extra Deck.
et: Saada 1 avatud "Neo-Spacian" koletis, mida sa kontrollid, Hauakambrisse. Kutsu eriliselt välja 1 4. taseme koletis sama nimega oma Lisapakist.

source: Reverse of Neos
et: Neose vastand

source: Activate only when a face-up "Neos" Fusion Monster you control is destroyed. Special Summon 1 "<M6653>Elemental Hero Neos<M>" from your Deck in Attack Position. It gains 1000 ATK and is destroyed during the End Phase of this turn.
et: Aktiveeri ainult siis, kui sinu kontrolli all olev avatud "Neos" Fusion Monster hävitatakse. Kutsu eriliselt välja 1 "<M6653>Elemental Hero Neos<M>" oma pakist rünnakupositsioonis. See saab 1000 ATK juurde ja hävitatakse selle käigu lõppfaasis.

source: Venom Swamp
et: Mürgisoos

source: During each player's End Phase: Place 1 Venom Counter on each face-up monster, except "Venom" monsters. Monsters lose 500 ATK for each Venom Counter on them. Destroy a monster if its ATK becomes 0 by this effect.
et: Iga mängija lõppfaasi ajal: Aseta 1 Mürgi loendur igale avatud koletisele, välja arvatud "Mürk" koletised. Koletised kaotavad 500 ATK iga nende peal oleva Mürgi loenduri kohta. Hävita koletis, kui selle ATK muutub selle efekti tõttu 0-ks.

source: Snake Whistle
et: Madu vile

source: Activate only when a Reptile-Type monster you control is destroyed. Special Summon 1 Level 4 or lower Reptile-Type monster from your Deck.
et: Aktiveeri ainult siis, kui sinu kontrolli all olev Reptiil-tüüpi koletis hävitatakse. Kutsu eriliselt välja 1 4. taseme või madalama Reptiil-tüüpi koletis oma pakist.

source: Snake Rain
et: Maduvihm

source: Discard 1 card. Select 4 Reptile-Type monsters from your Deck and send them to the Graveyard.
et: Viska 1 kaart. Vali oma pakist 4 Reptiil-tüüpi koletist ja saada need Hauakambrisse.

source: Damage = Reptile
et: Kahju = Roomaja

source: Once per turn, when you take Battle Damage from a battle involving a Reptile-Type monster, you can Special Summon 1 Reptile-Type monster from your Deck with ATK less than or equal to the Battle Damage you took.
et: Kord ühe korra käigu jooksul, kui sa saad lahingukahju lahingus, mis hõlmab Reptiil-tüüpi koletist, saad sa eriliselt kutsuda ühe Reptiil-tüüpi koletise oma pakist, mille ATK on väiksem või võrdne saadud lahingukahjuga.

source: Snake Deity's Command
et: Maodeemonite käsk

source: Activate by showing your opponent 1 "Venom" monster in your hand. Negate the activation and effect of an opponent's Spell Card, and destroy it.
et: Aktiveeri, näidates vastasele 1 "Venom" koletist oma käes. Tühista vastase Loitsukaardi aktiveerimine ja efekt ning hävita see.

source: Rise of the Snake Deity
et: Maodeity tõus

source: When a face-up1 "<M7183>Vennominon the King of Poisonous Snakes<M>" you control is destroyed, except by battle: Special Summon 1 "<M7184>Vennominaga the Deity of Poisonous Snakes<M>" from your hand or Deck.
et: Kui sinu kontrolli all olev avatud "<M7183>Vennominon the King of Poisonous Snakes<M>" hävitatakse, välja arvatud lahingus: Kutsu eriliselt välja 1 "<M7184>Vennominaga the Deity of Poisonous Snakes<M>" oma käest või pakist.

source: Mirror Gate
et: Peeglivärav

source: When an opponent's monster declares an attack targeting a face-up1 "Elemental HERO" monster you control: Switch control of the opponent's attacking monster with the targeted monster you control, then calculate damage. Control of both monsters switches back during the End Phase.
et: Kui vastase koletis kuulutab välja rünnaku, mis on suunatud sinu kontrollitavale avatud1 "Elemental HERO" koletisele: Vaheta vastase ründava koletise kontroll sihtmärgiks oleva koletisega, mida sa kontrollid, seejärel arvuta kahju. Mõlema koletise kontroll vahetub tagasi Lõppfaasis.

source: Rainbow Dragon
et: Vikerkaare Draakon

source: Cannot be Normal Summoned or Set. Must be Special Summoned (from your hand) by having 7 "Crystal Beast" cards with different names on your field or in your Graveyard, and cannot be Special Summoned by other ways. This card cannot activate its effects the turn it is Special Summoned.<BR>● During either player's turn: You can send all "Crystal Beast" monsters you control to the Graveyard; this card gains 1000 ATK for each card sent.<BR>● You can banish all "Crystal Beast" monsters in your Graveyard; shuffle all cards on the field into the Decks.
et: Ei saa olla normaalset kutsutud ega seatud. Peab olema eriliselt kutsutud (teie käest), kui teie väljal või hauas on 7 erineva nimega "Kristallkoletise" kaarti, ja ei saa olla eriliselt kutsutud muul viisil. See kaart ei saa aktiveerida oma efekte sellel käigul, mil see on eriliselt kutsutud.<BR>● Mõlema mängija käigu ajal: Saate saata kõik "Kristallkoletise" koletised, mida te kontrollite, hauale; see kaart saab iga saadetud kaardi eest 1000 ATK.<BR>● Saate pagendada kõik "Kristallkoletise" koletised oma hauast; segage kõik kaardid väljal tagasi pakkidesse.

source: Chrysalis Larva
et: Krüsalise vastne

source: You can Tribute this card while "Neo Space" is on the field to Special Summon 1 "<M6773>Neo-Spacian Flare Scarab<M>" from your hand or Deck.
et: Saad selle kaardi ohverdada, kui "Neo Space" on väljakul, et Kutsuda Eriliselt 1 "<M6773>Neo-Spacian Flare Scarab<M>" oma käest või pakist.

source: Chrysalis Mole
et: Krisallmutt

source: You can Tribute this card while "Neo Space" is face-up on the field to Special Summon 1 "<M6770>Neo-Spacian Grand Mole<M>" from your hand or Deck.
et: Saad selle kaardi ohverdada, kui "Neo Space" on väljakul avatud, et Kutsuda Eriliselt 1 "<M6770>Neo-Spacian Grand Mole<M>" oma käest või pakist.

source: Neo-Spacian Marine Dolphin
et: Neo-Spacian Meredelfiin

source: This card's name is also treated as "<M6768>Neo-Spacian Aqua Dolphin<M>". This card cannot be Special Summoned except with "<M7162>NEX<M>". Once per turn, you can discard 1 card to look at your opponent's hand and select 1 Monster Card in it. If you control a monster with an ATK greater than or equal to the selected monster's, destroy the selected card and inflict 500 damage to your opponent.
et: Selle kaardi nimeks loetakse ka "<M6768>Neo-Spacian Aqua Dolphin<M>". Seda kaarti ei saa eriliselt kutsuda, välja arvatud "<M7162>NEX<M>" abil. Kord ühe käigu jooksul võid sa ühe kaardi ära visata, et vaadata oma vastase kätt ja valida sealt üks Monster Card. Kui sul on koletis, mille ATK on suurem või võrdne valitud koletisega, hävita valitud kaart ja tekita oma vastasele 500 kahju.

source: Elemental HERO Marine Neos
et: Elementaalne KANGELANE Merineos

source: "<M6653>Elemental Hero Neos<M>" + "<M7174>Neo-Spacian Marine Dolphin<M>"<BR>Must first be Special Summoned (from your Extra Deck) by shuffling the above cards you control into the Deck. (You do not use "<M4837>Polymerization<M>"). Once per turn: You can destroy 1 random card in your opponent's hand.
et: "<M6653>Elemental Hero Neos<M>" + "<M7174>Neo-Spacian Marine Dolphin<M>"<BR>Esmaltada tuleb kõigepealt eriliselt kutsuda (oma lisapakist), segades ülaltoodud kaardid, mida sa kontrollid, tagasi pakki. (Sa ei kasuta "<M4837>Polymerization<M>"). Kord käigu jooksul: Sa võid hävitada 1 juhusliku kaardi oma vastase käest.

source: Elemental HERO Darkbright
et: Elementaalne KANGELANE Pimeduserkirkus

source: "<M6313>Elemental HERO Sparkman<M>" + "<M6527>Elemental Hero Necroshade<M>"<BR>Must be Fusion Summoned and cannot be Special Summoned by other ways. If this card attacks a Defense Position monster, inflict piercing Battle Damage to your opponent. If this card attacks, change it to Defense Position at the end of the Damage Step. If this card is destroyed: Target 1 monster your opponent controls; destroy that target.
et: "<M6313>Elemental HERO Sparkman<M>" + "<M6527>Elemental Hero Necroshade<M>"<BR>Peab olema Fusion Summoned ja ei saa olla Special Summoned muul viisil. Kui see kaart ründab Defense Position koletist, tekitab see vastasele läbistavat Battle Damage'i. Kui see kaart ründab, muuda see Damage Step lõpus Defense Position'iks. Kui see kaart hävitatakse: sihi 1 koletis, mida vastane kontrollib; hävita see sihtmärk.

source: Elemental HERO Magma Neos
et: Elementaalne KANGELANE Magma Neos

source: "<M6653>Elemental Hero Neos<M>" + "<M6773>Neo-Spacian Flare Scarab<M>" + "<M6770>Neo-Spacian Grand Mole<M>"<BR>Must be first Special Summoned (from your Extra Deck) by shuffling the above cards you control into the Deck. (You do not use "<M4837>Polymerization<M>"). This card gains 400 ATK for each card on the field. During the End Phase: Shuffle this card into the Extra Deck. When this card is shuffled into the Extra Deck this way: Return all cards on the field to the hand.
et: "<M6653>Elemental Hero Neos<M>" + "<M6773>Neo-Spacian Flare Scarab<M>" + "<M6770>Neo-Spacian Grand Mole<M>"<BR>Peab olema esmalt eriliselt kutsutud (sinu lisapakist) segades ülaltoodud kaardid, mida sa kontrollid, pakki. (Sa ei kasuta "<M4837>Polümerisatsioon<M>"). See kaart saab 400 ATK iga kaardi eest väljakul. Lõppfaasi ajal: Sega see kaart lisapakki. Kui see kaart segatakse sel viisil lisapakki: Tagasta kõik kaardid väljakul kätte.

source: During your opponent's turn: You can banish this card from your Graveyard; negate 1 attack from a monster your opponent controls.
et: Oma vastase käigu ajal: Sa võid selle kaardi oma Hauakambrist eemaldada; tühista 1 rünnak vastase kontrollitavalt koletiselt.

source: Ojama Knight
et: Ojama Rüütel

source: 2 "Ojama" monsters<BR>Select up to 2 of your opponent's Monster Card Zones. The selected zones cannot be used.
et: 2 "Ojama" koletist<BR>Vali kuni 2 oma vastase Monster Card Zone'i. Valitud tsoone ei saa kasutada.

source: Venom Snake
et: Mürgi Madu

source: Once per turn, you can place 1 Venom Counter on 1 monster your opponent controls. If you activate this effect, this card cannot attack during this turn.
et: Korra ühe korra käigu jooksul saad panna 1 Mürgi Loenduri ühele vastase kontrollitavale koletisele. Kui aktiveerid selle efekti, ei saa see kaart sellel käigul rünnata.

source: Venom Boa
et: Veenuse Boaga

source: Once per turn, you can place 2 Venom Counters on 1 monster your opponent controls. If you activate this effect, this card cannot attack during this turn.
et: Korra ühe korra käigu jooksul saad panna 2 Mürgiloendurit ühele vastase kontrollitavale koletisele. Kui aktiveerid selle efekti, ei saa see kaart sellel käigul rünnata.

source: Venom Serpent
et: Mürgi Madu

source: Once per turn, you can place 1 Venom Counter on 1 monster your opponent controls.
et: Korra ühe korra käigu jooksul saad panna 1 Mürgi Loenduri ühele vastase kontrollitavale koletisele.

source: Vennominon the King of Poisonous Snakes
et: Vennominon, mürgiste madude kuningas

source: Cannot be Special Summoned by another Effect Monster's effect. This card is unaffected by1 "<M7164>Venom Swamp<M>". This card gains 500 ATK for each Reptile-Type monster in your Graveyard. When this card is destroyed by battle and sent to the Graveyard: You can banish 1 other Reptile-Type monster from your Graveyard; Special Summon this card.
et: Ei saa eriliselt kutsuda teise Efektkoletise efekti abil. See kaart ei ole mõjutatud "<M7164>Venom Swamp<M>" poolt. See kaart saab 500 ATK iga sinu Hauakambris oleva Reptiili-tüüpi koletise eest. Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse: Sa võid eemaldada mängust 1 teise Reptiili-tüüpi koletise oma Hauakambrist; Kutsu see kaart eriliselt välja.

source: Vennominaga the Deity of Poisonous Snakes
et: Vennominaga, mürgiste madude jumalus

source: Cannot be Normal Summoned or Set. Must first be Special Summoned with "<M7169>Rise of the Snake Deity<M>" and cannot be Special Summoned by other ways except by its own effect. This card gains 500 ATK for each Reptile-Type monster in your Graveyard. This card cannot be targeted by, and is unaffected by, Spell/Trap effects and other Effect Monsters' effects. When this card is destroyed by battle and sent to the Graveyard: You can banish 1 other Reptile-Type monster from your Graveyard; Special Summon this card. When this card inflicts Battle Damage to your opponent: Place 1 Hyper-Venom Counter on it. When 3 Hyper-Venom Counters are on this card, you win the Duel.
et: Ei saa olla normaalkutsutud ega seatud. Peab esmalt olema erikutsutud "<M7169>Madude Jumalanna Tõus<M>" abil ja ei saa olla erikutsutud muul viisil, välja arvatud oma efekti abil. See kaart saab 500 ATK iga sinu Hauakambris oleva Reptiil-tüüpi koletise eest. Seda kaarti ei saa sihtida ja see ei ole mõjutatud Loitsu/Lõksu efektidest ega teistest Efektikoletiste efektidest. Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse: Sa võid pagendada 1 teise Reptiil-tüüpi koletise oma Hauakambrist; Erikutsu see kaart. Kui see kaart tekitab lahingukahju sinu vastasele: Pane sellele 1 Hüper-Mürgi Loendur. Kui sellel kaardil on 3 Hüper-Mürgi Loendurit, võidad Duelli.

source: A Hero Lives
et: Kangelane Elab

source: If you control no face-up monsters: Pay half of your Life Points; Special Summon 1 Level 4 or lower1 "Elemental HERO" monster from your Deck.
et: Kui sul pole ühtegi avatud koletist: Maksa pool oma Elupunktidest; Kutsu eriliselt välja 1 4. taseme või madalam "Elemental HERO" koletis oma pakist.

source: Ritual Raven
et: Rituaalne Ronk

source: If you Ritual Summon a DARK Ritual Monster, this 1 card can be used as the entire Tribute.
et: Kui sa kutsud rituaaliga välja PIMEDA Rituaalikoletise, võib seda 1 kaarti kasutada kogu ohvrina.

source: Venom Shot
et: Mürginoole Lask

source: Activate only while you control a face-up "Venom" monster,1 "<M7184>Vennominaga the Deity of Poisonous Snakes<M>", or1 "<M7183>Vennominon the King of Poisonous Snakes<M>". Send 1 Reptile-Type monster from your Deck to the Graveyard and place 2 Venom Counters on 1 face-up monster your opponent controls.
et: Aktiveeri ainult siis, kui sa kontrollid avatud "Venom" koletist,1 "<M7184>Vennominaga the Deity of Poisonous Snakes<M>", või1 "<M7183>Vennominon the King of Poisonous Snakes<M>". Saada 1 Reptiili-tüüpi koletis oma pakist hauakambrisse ja aseta 2 Venomi loendurit ühele avatud koletisele, mida sinu vastane kontrollib.

source: Alien Shocktrooper
et: Välismaalane Šokisõdur

source: The Aliens have used a mysterious biological substance to create a supreme race of soldiers. They do not have the natural powers of the other Aliens, but can make stunning physical attacks.
et: Tulnukad on kasutanud salapärast bioloogilist ainet, et luua ülim sõdurite rass. Neil ei ole teiste tulnukate loomulikke võimeid, kuid nad suudavad teha vapustavaid füüsilisi rünnakuid.

source: Volcanic Rat
et: Vulkaanirott

source: This mutated mouse dwells in the core of active volcanoes. No amount of heat is too much for it to bear.
et: See muteerunud hiir elab aktiivsete vulkaanide südames. Ükski kuumuse hulk pole talle liiga suur.

source: Renge, Gatekeeper of Dark World
et: Renge, Tume Maailma Väravavaht

source: His renowned athletic physique has made him famous with the populace of Dark World. They call him "Iron Wall Renge" because no one can break through his incredible defenses.
et: Tema tuntud sportlik füüsis on teinud ta Dark Worldi elanike seas kuulsaks. Nad kutsuvad teda "Raudseina Rengeks", sest keegi ei suuda tema uskumatutest kaitsetest läbi murda.

source: Hunter Dragon
et: Kütt Draakon

source: This dragon has taken down countless prey with its sharp fangs. It strikes very quickly, because if it does not strike first, it is vulnerable to a counter-attack.
et: See draakon on oma teravate kihvadega maha võtnud lugematul hulgal saaki. Ta ründab väga kiiresti, sest kui ta ei ründa esimesena, on ta vasturünnaku suhtes haavatav.

source: Venom Cobra
et: Mürkmaja

source: Hard scales cover all parts of this gigantic cobra. It hunts by shooting large amounts of venom, but because of its large size, its attack pattern is easily predicted.
et: Kõik selle hiiglasliku kobra osad on kaetud kõvade soomustega. See jahtib, tulistades suuri koguseid mürki, kuid oma suure suuruse tõttu on selle rünnakumuster kergesti ennustatav.

source: Elemental HERO Neos Alius
et: Elementaalne KANGELANE Neos Alius

source: This card is treated as a Normal Monster while face-up on the field or in the Graveyard. While this card is face-up on the field, you can Normal Summon it to have it become an Effect Monster with this effect.<BR>● This face-up card's name becomes "<M6653>Elemental Hero Neos<M>".
et: See kaart loetakse tavaliseks koletiseks, kui see on väljaku peal või hauas. Kui see kaart on väljaku peal, võid selle normaalselt kutsuda, et see muutuks efektikoletiseks järgmise efektiga.<BR>● Selle avatud kaardi nimi muutub "<M6653>Elemental Hero Neos<M>".

source: Chthonian Emperor Dragon
et: Chthonian Keisridraakon

source: This card is treated as a Normal Monster while face-up on the field or in the Graveyard. While this card is face-up on the field, you can Normal Summon it to have it be treated as an Effect Monster with this effect:<BR>● This card can attack twice during the same Battle Phase.
et: See kaart loetakse tavaliseks koletiseks, kui see on väljaku peal või hauas. Kui see kaart on väljaku peal, võid selle tavaliselt kutsuda, et seda käsitletaks efektkoletisena, millel on järgmine efekt:<BR>● See kaart võib rünnata kaks korda sama lahingufaasi jooksul.

source: Aquarian Alessa
et: Veealkeemik Alessa

source: This card is treated as a Normal Monster while face-up on the field or in the Graveyard. While this card is face-up on the field, you can Normal Summon it to have it be treated as an Effect Monster with this effect:<BR>● When this card destroys an opponent's monster by battle and sends it to the Graveyard, they discard 1 random card.
et: See kaart loetakse tavaliseks koletiseks, kui see on väljaku peal või hauas. Kui see kaart on väljaku peal, võid selle tavaliselt välja kutsuda, et seda käsitletaks efektkoletisena järgmise efektiga:<BR>● Kui see kaart hävitab lahingus vastase koletise ja saadab selle hauda, siis vastane viskab juhuslikult ühe kaardi ära.

source: Lucky Pied Piper
et: Õnnelik Viledamängija

source: This card is treated as a Normal Monster while face-up on the field or in the Graveyard. While this card is face-up on the field, you can Normal Summon it to have it be treated as an Effect Monster with this effect:<BR>● When this card destroys an opponent's monster by battle and sends it to the Graveyard, draw 1 card.
et: See kaart loetakse tavaliseks koletiseks, kui see on väljaku peal või hauas. Kui see kaart on väljaku peal, võid selle tavaliselt kutsuda, et seda käsitletaks efektkoletisena järgmise efektiga:<BR>● Kui see kaart hävitab lahingus vastase koletise ja saadab selle hauda, tõmba 1 kaart.

source: Grasschopper
et: Rohutirts

source: This card is treated as a Normal Monster while face-up on the field or in the Graveyard. While this card is face-up on the field, you can Normal Summon it to have it be treated as an Effect Monster with this effect:<BR>● This card can attack all monsters your opponent controls once each.
et: See kaart loetakse tavaliseks koletiseks, kui see on väljaku peal või hauas. Kui see kaart on väljaku peal, saad selle tavaliselt kutsuda, et seda käsitletaks efektkoletisena järgmise efektiga:<BR>● See kaart võib rünnata kõiki vastase kontrollitavaid koletisi üks kord igaüht.
