Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: Select 1 face-up "Aesir" monster you control. Give control of that monster to your opponent. During your opponent's next End Phase, destroy the selected monster and remove from play all cards your opponent controls.
et: Vali 1 avatud "Aesir" koletis, mida sa kontrollid. Anna selle koletise kontroll oma vastasele. Järgmise vastase lõppfaasi ajal hävita valitud koletis ja eemalda mängust kõik kaardid, mida su vastane kontrollib.

source: March Towards Ragnarok
et: Marss Ragnarokile

source: Select 1 face-up "Aesir" monster you control. Until the End Phase, it is unaffected by the effects of other Spell/Trap Cards but its effect(s) are negated.
et: Vali 1 avatud "Aesir" koletis, mida sa kontrollid. Kuni lõppfaasini ei mõjuta seda teiste Loitsu/Lõksukaartide efektid, kuid selle efekt(id) on tühistatud.

source: Shien's Smoke Signal
et: Shieni Suitsignaal

source: Add 1 Level 3 or lower "Six Samurai" monster from your Deck to your hand.
et: Lisa oma pakist 1. taseme 3 või madalama "Kuue Samuraid" koletis oma kätte.

source: Six Strike - Triple Impact
et: Kuue löök - Kolmekordne mõju

source: If you control 3 or more face-up "Six Samurai" monsters, you can activate 1 of these effects:<BR>●Destroy all face-up monsters your opponent controls.<BR>●Destroy all face-up Spell/Trap Cards your opponent controls.<BR>●Destroy all Set Spell/Trap Cards your opponent controls.
et: Kui sa kontrollid 3 või enamat avatud "Kuue Samuraid" koletist, saad aktiveerida ühe neist efektidest:<BR>●Hävita kõik avatud koletised, mida su vastane kontrollib.<BR>●Hävita kõik avatud Loitsu/Lõksu Kaardid, mida su vastane kontrollib.<BR>●Hävita kõik seatud Loitsu/Lõksu Kaardid, mida su vastane kontrollib.

source: Asceticism of the Six Samurai
et: Kuue samurai askees

source: Select 1 face-up "Six Samurai" monster you control. Special Summon 1 "Six Samurai" monster from your Deck with a different name but equal ATK to the selected monster. During the End Phase of this turn, destroy the selected monster.
et: Vali 1 avatud "Six Samurai" koletis, mida sa kontrollid. Kutsu eriliselt välja 1 "Six Samurai" koletis oma pakist, millel on erinev nimi, kuid sama ATK kui valitud koletisel. Selle käigu lõppfaasis hävita valitud koletis.

source: Temple of the Six
et: Kuue tempel

source: Each time a "Six Samurai" monster is Normal or Special Summoned, place 1 Bushido Counter on this card. Face-up monsters your opponent controls lose 100 ATK for each Bushido Counter on this card.
et: Iga kord, kui "Kuue Samuraid" koletis kutsutakse normaalselt või eriliselt välja, pane sellele kaardile 1 Bushido loendur. Näoga ülespoole olevad koletised, mida sinu vastane kontrollib, kaotavad 100 ATK-d iga Bushido loenduri kohta sellel kaardil.

source: Karakuri Cash Cache
et: Karakuri Rahakassa

source: Select 1 face-up "Karakuri" monster you control. Add 1 Level 4 or lower "Karakuri" monster from your Deck to your hand, and change the battle position of the selected monster.
et: Vali 1 avatud "Karakuri" koletis, mida sa kontrollid. Lisa 1 4. taseme või madalam "Karakuri" koletis oma pakist oma kätte ja muuda valitud koletise lahingupositsiooni.

source: Karakuri Gold Dust
et: Karakuri Kuldtolm

source: Activate only during the Battle Phase. Select 2 face-up "Karakuri" monsters in Attack Position. Change 1 of the selected monsters to Defense Position, and the other gains ATK equal to the ATK of the monster changed to Defense Position, until the End Phase.
et: Aktiveeri ainult Lahingu Faasis. Vali 2 ründepoosis olevat avatud "Karakuri" koletist. Muuda üks valitud koletistest kaitsepositsiooni ja teine saab ATK-d, mis on võrdne kaitsepositsiooni muudetud koletise ATK-ga, kuni Lõppfaasini.

source: Wattkey
et: Wattvõti

source: Face-up "Watt" monsters you control can attack your opponent directly this turn.
et: Avatud "Watt" koletised, mida sa kontrollid, võivad sel käigul rünnata otse sinu vastast.

source: Stardust Shimmer
et: Tähevalguse Sära

source: Select 1 Dragon-Type Synchro Monster in your Graveyard. Remove from play other monsters in your Graveyard whose total Levels equal the Level of the selected monster, and Special Summon it from the Graveyard.
et: Vali oma kalmistult 1 Draakon-tüüpi Sünkrokoletis. Eemalda mängust teised koletised oma kalmistult, mille kogutasemed on võrdne valitud koletise tasemega, ja Kutsu see eriliselt välja kalmistult.

source: Resonator Engine
et: Resonaator Mootor

source: Select 2 "Resonator" monsters in your Graveyard. Add 1 Level 4 monster from your Deck to your hand and return the selected monsters in your Graveyard to the Deck.
et: Vali oma kalmistult 2 "Resonator" koletist. Lisa 1 4. taseme koletis oma pakist oma kätte ja tagasta valitud koletised oma kalmistult pakki.

source: Token Sundae
et: Tokeni jäätis

source: Destroy all Tokens you control, then destroy cards on the field, up to the number of Tokens destroyed by this effect.
et: Hävita kõik sinu kontrolli all olevad Tokenid, seejärel hävita kaardid väljal, kuni selle efekti tõttu hävitatud Tokenite arvuni.

source: Foolish Return
et: Rumal Tagasitulek

source: Select 1 card in your opponent's Graveyard. Return it to the Deck.
et: Vali 1 kaart oma vastase kalmistul. Tagasta see pakki.

source: Divine Wind of Mist Valley
et: Uduorgu oru jumalikkus

source: Once per turn, if a face-up WIND monster you control returns to the hand, you can Special Summon 1 Level 4 or lower WIND monster from your Deck.
et: Korra ühe käigu jooksul, kui sinu kontrolli all olev avatud WIND koletis naaseb kätte, saad sa oma pakist eriliselt kutsuda 1. taseme 4 või madalama WIND koletise.

source: Select 3 Equip Spell Cards in your Graveyard. Return those cards to your Deck, and apply one of these effects:<BR>● Draw 1 card.<BR>● Destroy 1 card your opponent controls.
et: Vali oma kalmistult 3 Varustuse Võlusõna Kaarti. Tagasta need kaardid oma pakki ja rakenda ühte järgmistest efektidest:<BR>● Tõmba 1 kaart.<BR>● Hävita 1 kaart, mida sinu vastane kontrollib.

source: Forbidden Lance
et: Keelatud Odal

source: Select 1 face-up monster on the field. Until the End Phase, it loses 800 ATK, but is unaffected by the effects of other Spell/Trap Cards.
et: Vali 1 avatud positsioonis olev koletis väljakul. Kuni lõppfaasini kaotab see 800 ATK, kuid see ei ole mõjutatud teiste Loitsu/Lõksu kaartide efektidest.

source: Terminal World
et: Terminali Maailm

source: Activate only during Main Phase 1. While this card is on the field, both players skip their Main Phase 2.
et: Aktiivi ainult peafaas 1 ajal. Kui see kaart on väljakul, jätavad mõlemad mängijad oma peafaas 2 vahele.

source: Hope for Escape
et: Põgenemise Lootus

source: Activate only if your opponents Life Points are at least 1000 higher than yours. Pay 1000 Life Points. Draw 1 card for every 2000 points difference between your Life Points and your opponent's.
et: Aktiveeri ainult siis, kui sinu vastase Elupunktid on vähemalt 1000 võrra kõrgemad kui sinu omad. Maksa 1000 Elupunkti. Tõmba 1 kaart iga 2000 punkti erinevuse eest sinu ja vastase Elupunktide vahel.

source: Zero Force
et: Nulljõud

source: Activate only when a face-up monster you control is removed from play. The ATK of all face-up monsters on the field becomes 0.
et: Aktiveeri ainult siis, kui sinu kontrollitav avatud koletis eemaldatakse mängust. Kõigi väljakul olevate avatud koletiste ATK muutub 0-ks.

source: Blackboost
et: Musttõus

source: Remove from play 2 face-up "Blackwing" Tuner monsters you control. Draw 2 cards.
et: Eemalda mängust 2 avatud "Blackwing" Tuner koletist, mida sa kontrollid. Tõmba 2 kaarti.

source: Divine Relic Mjollnir
et: Jumalik Relikt Mjollnir

source: Select 1 face-up "Aesir" monster you control. It can attack twice during each Battle Phase this turn.
et: Vali 1 avatud "Aesir" koletis, mida sa kontrollid. See võib rünnata kaks korda iga Lahingu Faasi jooksul sel käigul.

source: Solemn Authority
et: Pühalik Autoriteet

source: Select 1 face-up "Aesir" monster you control. While this card is on the field, that monster cannot be targeted by other card effects. Send this card to the Graveyard during your 2nd Standby Phase after activation.
et: Vali 1 avatud "Aesir" koletis, mida sa kontrollid. Kuni see kaart on väljal, ei saa seda koletist sihtida teiste kaardiefektidega. Saada see kaart Hauakambrisse oma 2. Ootefaasil pärast aktiveerimist.

source: Nordic Relic Brisingamen
et: Põhjala Relikt Brisingamen

source: Select 1 face-up monster you control and 1 face-up monster your opponent controls. The ATK of your monster becomes equal to the original ATK of your opponent's monster; this change lasts until the End Phase.
et: Vali 1 avatud asendis olev koletis, mida sa kontrollid, ja 1 avatud asendis olev koletis, mida su vastane kontrollib. Sinu koletise ATK muutub võrdseks su vastase koletise algse ATK-ga; see muutus kestab kuni Lõppfaasini.

source: Nordic Relic Laevateinn
et: Põhjala Relikt Laevateinn

source: Select 1 face-up monster on the field that destroyed a monster by battle this turn. Destroy the selected monster. Cards and effects cannot be activated in response to this card.
et: Vali 1 avatud koletis väljal, mis hävitas sellel käigul lahingus koletise. Hävita valitud koletis. Selle kaardi aktiveerimisele ei saa reageerida kaartide ega efektidega.

source: Nordic Relic Gungnir
et: Põhjala Relikt Gungnir

source: Remove from play 1 face-up "Aesir" or "Nordic" monster you control to select 1 card on the field. Destroy that card. During your 2nd End Phase after activation, the monster you removed to activate this card returns to the field in face-up Attack Position.
et: Eemalda mängust 1 avatud "Aesir" või "Nordic" koletis, mida sa kontrollid, et valida 1 kaart väljal. Hävita see kaart. Teise lõppfaasi ajal pärast aktiveerimist naaseb koletis, mille sa eemaldasid selle kaardi aktiveerimiseks, väljakule avatud rünnakupositsioonis.

source: The Golden Apples
et: Kuldõunad

source: Activate only when you take Battle Damage while you control no monsters. Gain Life Points equal to the Battle Damage you took, and Special Summon 1 "<M3975>Malus Token<M>" (Fiend-Type/DARK/Level 1/ATK ?/DEF ?). Its ATK and DEF are each equal to the amount of Life Points you gained by this effect.
et: Aktiveeri ainult siis, kui saad lahingukahju, kui sul pole ühtegi koletist. Saad Elupunkte võrdse summaga saadud lahingukahjule ja Kutsu Eriliselt välja 1 "<M3975>Malus Token<M>" (Deemonitüüp/PIMEDUS/Tase 1/RÜN ?/KAIT ?). Selle RÜN ja KAID on võrdsed elupunktide summaga, mida selle efekti abil said.

source: Odin's Eye
et: Odini Silm

source: Once per turn, during each player's Standby Phase, you can select 1 face-up "Aesir" monster you control. Negate its effect(s) until the End Phase, and look at all cards in your opponent's hand and all Set cards they control. Cards and effects cannot be activated in response to this effect's activation.
et: Korra ühe korra käigu jooksul, iga mängija Ootefaaside ajal, saad valida ühe avatud "Aesir" koletise, mida sa kontrollid. Tühista selle mõju(d) kuni Lõppfaasini ja vaata kõiki kaarte oma vastase käes ja kõiki seatud kaarte, mida nad kontrollivad. Kaardid ja efektid ei saa aktiveeruda vastuseks selle efekti aktiveerimisele.

source: Gleipnir, the Fetters of Fenrir
et: Gleipnir, Fenriri köidikud

source: Add 1 "Nordic" monster from your Deck to your hand.
et: Lisa 1 "Nordic" koletis oma pakist oma kätte.

source: Activate only if you control a face-up "Six Samurai" monster when your opponent activates a Spell Card, Trap Card or Effect Monster's effect that would destroy a card(s): Negate the card's activation and destroy it.
et: Aktiveeri ainult siis, kui sa kontrollid avatud "Kuue Samuraid" koletist, kui sinu vastane aktiveerib Loitsukaardi, Lõksukaardi või Efektikoletise efekti, mis hävitaks kaardi(d): Tühista kaardi aktiveerimine ja hävita see.

source: Shien's Scheme
et: Shieni skeem

source: Activate only if a "Six Samurai" monster you control is destroyed by battle. Special Summon up to 2 "Six Samurai" monsters from your hand.
et: Aktiveeri ainult siis, kui lahingus hävitatakse sinu kontrolli all olev "Kuue Samuraid" koletis. Kutsu eriliselt välja kuni 2 "Kuue Samuraid" koletist oma käest.

source: Token Stampede
et: Märgi Torm

source: Tokens in Attack Position gain 1000 ATK, and cannot be destroyed by battle.
et: Rünnakupositsioonis olevad tokenid saavad 1000 ATK juurde ja neid ei saa lahingus hävitada.

source: Xing Zhen Hu Replica
et: Xing Zhen Hu koopia

source: Select 1 Set Spell/Trap Card on the field. It cannot be activated. Cards and effects cannot be activated in response to this card's activation.
et: Vali 1 lahinguväljal olev seatud Võlu-/Lõksukaart. Seda ei saa aktiveerida. Kaardid ja efektid ei saa reageerida selle kaardi aktiveerimisele.

source: Tyrant's Tirade
et: Türanni Tiraad

source: Tribute 2 monsters. Effects of Effect Monsters that activate in the hand or on the field cannot be activated.
et: Ohverda 2 koletist. Käes või väljal aktiveeruvate Efektkoletiste efektid ei saa aktiveeruda.

source: Tiki Curse
et: Tiki needus

source: After activation, Special Summon this card; it is treated as an Effect Monster Card (Rock-Type/DARK/Level 4/ATK 1800/DEF 1000). (This card is still treated as a Trap Card.) While this card is treated as an Effect Monster, if another Trap Card you control that is treated as a monster battles an opponent's monster, destroy the opponent's monster after damage calculation.
et: Pärast aktiveerimist kutsu see kaart eriliselt välja; seda käsitletakse kui Efektikoletise Kaarti (Kiviliik/PIMEDUS/Tase 4/ATK 1800/DEF 1000). (Seda kaarti käsitletakse endiselt kui Lõksukaarti.) Kui seda kaarti käsitletakse kui Efektikoletist, siis kui teine Lõksukaart, mida sa kontrollid ja mida käsitletakse kui koletist, võitleb vastase koletisega, hävita vastase koletis pärast kahju arvutamist.

source: Tiki Soul
et: Tiki Hing

source: After activation, Special Summon this card; it is treated as an Effect Monster Card (Rock-Type/LIGHT/Level 4/ATK 1000/DEF 1800). (This card is still treated as a Trap Card.) While this card is treated as an Effect Monster, if another Trap Card you control that is treated as a monster would be destroyed by your opponent's card (either by battle or by card effect) and sent to your Graveyard, you can Set it on the Spell & Trap Card Zone instead.
et: Pärast aktiveerimist kutsu see kaart eriliselt välja; seda käsitletakse kui Efektikoletise Kaarti (Kiviliik/TULI/Tase 4/ATK 1000/DEF 1800). (Seda kaarti käsitletakse endiselt kui Lõksukaarti.) Kui seda kaarti käsitletakse kui Efektikoletist, siis kui teine Lõksukaart, mida sa kontrollid ja mida käsitletakse kui koletist, hävitatakse sinu vastase kaardi poolt (kas lahingus või kaardi efekti tõttu) ja saadetakse sinu Hauakambrisse, saad selle asetada Loitsu & Lõksukaardi Alale.

source: A high-ranking "Gem-Knight" who gains power by optimizing Crystal Power, and overwhelms his opponents. But, he often feels a limit to his optimizing capability, and values bonds with his friends.
et: Kõrge auastmega "Gem-Knight", kes suurendab oma jõudu, optimeerides kristallivõimu, ja alistab oma vastased. Kuid ta tunneb sageli oma optimeerimisvõime piire ja hindab sidemeid oma sõpradega.

source: Tender of The Laval Volcano
et: Lavali Vulkaani Hooldaja

source: When this card is sent to the Graveyard while a "Laval" monster other than "<M9373>Tender of The Laval Volcano<M>" is in your Graveyard, you can send 1 "Laval" monster from your Deck to the Graveyard.
et: Kui see kaart saadetakse Hauakambrisse, kui sinu Hauakambris on mõni "Laval" koletis peale "<M9373>Laval Volcano Tender<M>", võid saata 1 "Laval" koletise oma pakist Hauakambrisse.

source: Laval Cannoneer
et: Lavali kahurväelane

source: When this card is Normal or Flip Summoned, you can select 1 of your removed from play "Laval" monsters, and Special Summon it.
et: Kui see kaart on normaal- või pöördkutsutud, saad valida ühe oma mängust eemaldatud "Laval" koletise ja eriliselt kutsuda selle välja.

source: Vylon Sphere
et: Vylon Kera

source: If this card is sent from the Monster Card Zone to the Graveyard, you can pay 500 Life Points to equip it as an Equip Card to 1 face-up monster you control. You can send this card equipped to a monster to the Graveyard to select 1 Equip Spell Card in your Graveyard, and equip it to the monster equipped with this card.
et: Kui see kaart saadetakse Monster Card Zone'ist Hauakambrisse, võid maksta 500 Elupunkti, et kinnitada see Varustuskaardina ühele avatud koletisele, mida sa kontrollid. Sa võid saata selle kaardi, mis on kinnitatud koletisele, Hauakambrisse, et valida 1 Varustusloitsukaart oma Hauakambris ja kinnitada see koletisele, millele see kaart on kinnitatud.

source: If this card is sent from the Monster Card Zone to the Graveyard, you can pay 500 Life Points to equip it as an Equip Card to 1 face-up monster you control. If the equipped monster would be destroyed, you can destroy this card instead.
et: Kui see kaart saadetakse Monster Card Zone'ist Hauakambrisse, võid maksta 500 Elupunkti, et kinnitada see Varustuskaardina ühele avatud koletisele, mida sa kontrollid. Kui varustatud koletis hävitatakse, võid selle asemel hävitada selle kaardi.

source: If this card is sent from the Monster Card Zone to the Graveyard, you can pay 500 Life Points to equip this card to a face-up monster you control as an Equip Card. If the equipped monster battles an opponent's monster, destroy that monster at the end of the Damage Step.
et: Kui see kaart saadetakse Monster Card Zone'ist Hauakambrisse, võid maksta 500 Elupunkti, et kinnitada see kaart ülespoole suunatud koletise külge, mida sa kontrollid, kui Varustuskaart. Kui varustatud koletis võitleb vastase koletisega, hävita see koletis Kahjustuse etapi lõpus.

source: If this card is sent from the Monster Card Zone to the Graveyard, you can pay 500 Life Points to equip this card to a face-up monster you control as an Equip Card. If the equipped monster battles, it gains 1000 ATK during damage calculation only.
et: Kui see kaart saadetakse Monster Card Zone'ist kalmistule, võid maksta 500 elupunkti, et kinnitada see kaart varustuskaardina ülespoole suunatud koletisele, mida sa kontrollid. Kui varustatud koletis võitleb, saab see ainult kahjuarvutuse ajal 1000 ATK juurde.

source: Once per turn, you select 1 face-up "Vylon" monster you control treated as an Equip Card, and Special Summon it in face-up Defense Position. When that monster is removed from the field, remove it from play.
et: Korra ühe korra käigu jooksul saad valida ühe ülespööratud "Vylon" koletise, mida sa kontrollid ja mida käsitletakse Varustuse Kaardina, ning Kutsuda see Eriliselt välja ülespööratud Kaitseasendisse. Kui see koletis eemaldatakse väljakult, eemalda see mängust.

source: Gishki Eater
et: Gishki Sööja

source: When this card is Normal or Flip Summoned while you control another face-up "Gishki" monster, you can target 1 monster you control other than this card, and return it to the hand.
et: Kui see kaart on Normaal- või Pöördkutsutud, kui sa kontrollid teist avatud "Gishki" koletist, saad valida ühe koletise, mida sa kontrollid peale selle kaardi, ja tagastada see käele.

source: When this card is Normal Summoned, reveal the top 5 cards of your Deck. If there is a Ritual Spell Card or "Gishki" monster among these cards, send that card(s) to the Graveyard. Return the other cards to the bottom of your Deck in any order.
et: Kui see kaart on Normaal-Kutsutud, paljasta oma Paki 5 ülemist kaarti. Kui nende kaartide hulgas on Rituaal-Loitsukaart või "Gishki" koletis, saada see kaart(ed) Hauakambrisse. Tagasta ülejäänud kaardid oma Paki põhja suvalises järjekorras.

source: When this card is destroyed by a card effect and sent to the Graveyard, you can Special Summon 1 Level 5 or higher "Gusto" monster from your Deck.
et: Kui see kaart hävitatakse kaardi efekti tõttu ja saadetakse Hauakambrisse, saad Sa eriliselt kutsuda 1 taseme 5 või kõrgema "Gusto" koletise oma pakist.

source: Reeze,Whirlwind of Gusto
et: Reeze, Gusto keeristorm

source: Once per turn, you can return 1 card from your hand to the bottom of the Deck to select 1 monster your opponent controls and 1 face-up "Gusto" monster you control. Switch control of the selected monsters.
et: Korra ühe korra käigu jooksul saad sa tagastada ühe kaardi oma käest paki põhja, et valida üks koletis, mida sinu vastane kontrollib, ja üks avatud "Gusto" koletis, mida sa kontrollid. Vaheta valitud koletiste kontrolli.

source: Steelswarm Genesoid
et: Terassülem Geenisoid

source: If this card is used to Tribute Summon a "Steelswarm" monster, this card can be treated as 2 Tributes.
et: Kui seda kaarti kasutatakse "Steelswarm" koletise ohverdamiseks, võib seda kaarti käsitleda kui 2 ohverdust.

source: Steelswarm Sentinel
et: Terasülemite valvur

source: While this card is in face-up Attack Position, Level 5 or higher Special Summoned monsters on the field cannot activate their effects.
et: Kui see kaart on avatud rünnakupositsioonis, ei saa väljal olevad 5. või kõrgema taseme erikutsutud koletised oma efekte aktiveerida.

source: Steelswarm Needle
et: Terassülem Nõel

source: When this card you control is sent to the Graveyard, select 1 face-up Ritual, Fusion, or Synchro Monster on the field, and destroy it.
et: Kui see sinu kontrolli all olev kaart saadetakse Hauakambrisse, vali 1 avatud Rituaal-, Fusiooni- või Sünkroonkoletis väljal ja hävita see.

source: Steelswarm Longhorn
et: Terasülem Pikkarv

source: If you Tribute Summon this card by Tributing a "Steelswarm" monster(s), it gains this effect: Once per turn, you can pay 1000 Life Points to select 1 monster on the field, and destroy it.
et: Kui sa kutsud selle kaardi välja ohverdades "Steelswarm" koletise(id), saab see järgmise efekti: Kord ühe käigu jooksul saad maksta 1000 Elupunkti, et valida 1 koletis väljal ja hävitada see.

source: Steelswarm Hercules
et: Terassülem Herakles

source: This card cannot be Special Summoned. You must Tribute 3 "Steelswarm" monsters to Normal Summon this card (you cannot Set this card). Once per turn, you can pay half your Life Points to destroy all other cards on the field.
et: Seda kaarti ei saa eriliselt kutsuda. Selle kaardi normaalseks kutsumiseks pead ohverdama 3 "Steelswarm" koletist (seda kaarti ei saa asetada). Kord ühe käigu jooksul võid maksta poole oma Elupunktidest, et hävitada kõik teised kaardid väljal.

source: This card can only be Ritual Summoned with a "Gishki" Ritual Spell Card. Once per turn, you can declare a card type (Monster, Spell, or Trap). Your opponent can discard 1 card from their hand to negate this card's effect. If they do not, each player must send 1 card of the declared type from their Deck to the Graveyard.
et: Seda kaarti saab Rituaali Kutsuda ainult "Gishki" Rituaaliloitsukaardiga. Kord ühe käigu jooksul võid sa kuulutada välja kaarditüübi (Koletis, Loits või Lõks). Sinu vastane võib oma käest ühe kaardi ära visata, et selle kaardi efekti tühistada. Kui nad seda ei tee, peab iga mängija saatma ühe kuulutatud tüüpi kaardi oma pakist Hauakambrisse.

source: Gem-Knight Citrine
et: Gem-Knight Tsitriin

source: 1 "Gem-Knight" Monster + 1 Pyro-Type Monster This monster can only be Special Summoned by Fusion Summon (from the Extra Deck). If this card battles, your opponent cannot activate any Spell/Trap/Effect Monster's effects until the end of the Damage Step.
et: 1 "Gem-Knight" koletis + 1 Püro-tüüpi koletis Selle koletise saab eriliselt kutsuda ainult fusion-summoniga (lisapakist). Kui see kaart võitleb, ei saa sinu vastane aktiveerida ühtegi loitsu/lõksu/efektikoletise efekti kuni Kahjustuse sammu lõpuni.

source: Gem-Knight Prism Aura
et: Gem-Knight Prisma Aura
