Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: 3 Level 1 monsters<BR>During your Main Phase 1: You can detach 1 Xyz Material from this card to target 1 face-up Level 1 monster you control. While that monster is face-up on the field, it can attack your opponent directly.
et: 3. taseme 1 koletist<BR>Oma peafaasi 1 ajal: Sa võid eemaldada 1 Xyz Materjali selle kaardi küljest, et sihtida 1 avatud taseme 1 koletist, mida sa kontrollid. Kuni see koletis on väljas väljakul, võib see rünnata sinu vastast otse.

source: Number 83: Galaxy Queen
et: Number 83: Galaktika Kuninganna

source: 3 Level 1 monsters<BR>Once per turn: You can detach 1 Xyz Material from this card; until your opponent's next End Phase, face-up monsters you currently control cannot be destroyed by battle, and if they attack a Defense Position monster, inflict piercing Battle Damage to your opponent.
et: 3. taseme 1 koletist<BR>Korra käigu jooksul: Sa võid eemaldada 1 Xyz Materjali selle kaardi küljest; kuni sinu vastase järgmise Lõppfaasini ei saa sinu praegu kontrollitavad avatud koletised lahingus hävitatud, ja kui nad ründavad Kaitseasendis koletist, tekitavad nad sinu vastasele läbistavat Lahingukahju.

source: Black Ray Lancer
et: Musta Kiire Lancer

source: 2 Level 3 WATER monsters<BR>Once per turn: You can detach 1 Xyz Material from this card to target 1 face-up Effect Monster on the field; negate its effects, until the End Phase.
et: 2. taseme 3 VEE koletist<BR>Kord ühe käigu jooksul: Sa võid eemaldada 1 Xyz Materjali sellelt kaardilt, et sihtida 1 avatud Efektikoletist väljakul; tühista selle efektid kuni Lõppfaasini.

source: 3 Level 4 monsters<BR>Once per turn: You can detach 1 Xyz Material from this card; send 1 card from your hand to the Graveyard and draw 1 card.
et: 3. taseme 4 koletist<BR>Kord ühe käigu jooksul: Sa võid eemaldada 1 Xyz Materjali selle kaardi küljest; saada 1 kaart oma käest Hauakambrisse ja tõmba 1 kaart.

source: 2 Level 3 monsters<BR>Once per turn: You can detach 1 Xyz Material from this card; face-up monsters you control gain 300 ATK.
et: 2. taseme 3 koletist<BR>Kord ühe käigu jooksul: Sa võid eemaldada 1 Xyz Materjali selle kaardi küljest; avatud koletised, mida sa kontrollid, saavad 300 ATK juurde.

source: 2 Level 4 Dinosaur-Type monsters<BR>When a monster(s) would be Normal or Special Summoned, OR a Spell/Trap Card is activated: You can detach 2 Xyz Materials from this card; negate that Summon or activation and destroy that card.
et: 2. taseme 4 Dinosauruse-tüüpi koletist<BR>Kui koletis(t) kutsutakse Normaal- või Erikutsega, VÕI kui aktiveeritakse Loitsu/Lõksukaart: Sa võid sellelt kaardilt eemaldada 2 Xyz Materjali; tühista see kutse või aktiveerimine ja hävita see kaart.

source: Thunder End Dragon
et: Äikese Lõpu Draakon

source: 2 Level 8 Normal Monsters<BR>Once per turn: You can detach 1 Xyz Material from this card; destroy all other monsters on the field.
et: 2. taseme 8 tavalist koletist<BR>Kord ühe käigu jooksul: Sa võid eemaldada 1 Xyz Materjali sellelt kaardilt; hävita kõik teised koletised väljal.

source: Attack Regulation
et: Rünnaku Reguleerimine

source: While your opponent controls 3 or more monsters, those monsters cannot declare an attack.
et: Kui sinu vastasel on 3 või rohkem koletist, ei saa need koletised rünnakut kuulutada.

source: Giant Shadow of Egotism
et: Egoismi hiiglaslik vari

source: When a monster declares an attack: Target 1 face-up monster on the field; it gains 1000 ATK until the end of the Battle Phase.
et: Kui koletis kuulutab rünnaku: Sihtige 1 avatud koletis väljal; see saab 1000 ATK kuni Lahingufaasi lõpuni.

source: Monster Slot
et: Koletise pesa

source: Target 1 monster you control; banish 1 monster in your Graveyard with the same Level as that monster. Then, draw 1 card and reveal it. If it is a monster with the same Level as the target: Special Summon it.
et: Vali 1 koletis, mida sa kontrollid; eemalda oma Hauakambrist mängust 1 koletis, millel on sama tase kui sellel koletisel. Seejärel tõmba 1 kaart ja näita seda. Kui see on koletis, millel on sama tase kui sihtmärgil: Kutsu see eriliselt välja.

source: Cross Attack
et: Ristirünnak

source: Target 2 face-up Attack Position monsters with the same ATK; during this turn, 1 of the targeted monsters can attack your opponent directly, but the other target cannot attack.
et: Vali 2 avatud ründeasendis koletist, millel on sama ATK; selle käigu ajal võib üks sihtmärgiks olevatest koletistest rünnata otse sinu vastast, kuid teine sihtmärk ei saa rünnata.

source: Xyz Gift
et: Xyz Kingitus

source: If you control 2 or more face-up Xyz Monsters: Detach 2 Xyz Materials you control; draw 2 cards.
et: Kui sul on kontrolli all 2 või rohkem avatud Xyz koletist: eemalda 2 Xyz materjali, mida sa kontrollid; tõmba 2 kaarti.

source: Photon Veil
et: Fotonloor

source: Return 3 LIGHT monsters from your hand to the Deck; add up to 3 Level 4 or lower LIGHT monsters from your Deck to your hand. If you add 2 or more cards to your hand, they must have the same card name.
et: Tagasta 3 VALGUST koletist oma käest tagasi pakki; lisa kuni 3 4. taseme või madalama tasemega VALGUST koletist oma pakist oma kätte. Kui lisad oma kätte 2 või rohkem kaarti, peavad neil olema samad kaardinimed.

source: Photon Lead
et: Fotonijuht

source: Special Summon 1 Level 4 or lower LIGHT monster (from your hand) in face-up Attack Position.
et: Kutsu eriliselt välja 1 tase 4 või madalam VALGUS koletis (oma käest) avatud ründeasendisse.

source: Photon Booster
et: Fotonivõimendi

source: Target 1 face-up Level 4 or lower non-Token LIGHT monster on the field; the ATK of that target and other monster(s) on the field with the same name become 2000 until the End Phase.
et: Vali 1 avatud Level 4 või madalama mitte-Token LIGHT koletis väljal; selle sihtmärgi ja teiste sama nimega koletiste ATK väljal muutub 2000 kuni End Phase'ini.

source: When a monster(s) is Special Summoned by the effect of an "Evoltile" monster you control, your opponent cannot activate cards or effects.
et: Kui sinu kontrolli all oleva "Evoltile" koletise efekti abil kutsutakse eriliselt välja koletis(ed), ei saa sinu vastane aktiveerida kaarte ega efekte.

source: Evo-Miracle
et: Evo-Ime

source: Target 1 monster that was Special Summoned by the effect of an "Evoltile" monster; this turn, it cannot be destroyed by battle or by card effects.
et: Vali 1 koletis, mis kutsuti eriliselt välja "Evoltile" koletise efekti abil; sel käigul ei saa seda hävitada lahingus ega kaardiefektide abil.

source: Overwound Spring
et: Ülepinge Vedru

source: Target 1 "Wind-Up" monster in your Graveyard; Special Summon the target in face-up Defense Position. Its effects are negated, and it cannot be Tributed or be used as a Synchro Material Monster.
et: Vali 1 "Wind-Up" koletis oma kalmistul; Kutsu sihtmärk eriliselt esile avatud kaitsepositsioonis. Selle efektid on tühistatud ja seda ei saa ohverdada ega kasutada sünkromaterjalina.

source: Extra Gate
et: Lisavärav

source: Declare a Level from 1 to 12. Your opponent banishes 1 monster from their Extra Deck with that Level. If there is no monster with the declared Level in their Extra Deck, discard 1 card.
et: Teata tasand 1 kuni 12. Sinu vastane pagendab ühe koletise oma lisapakist sellel tasandil. Kui nende lisapakis ei ole koletist teatud tasemega, viska 1 kaart ära.

source: Shard of Greed
et: Ahne killuke

source: Each time you conduct your normal draw during your Draw Phase, immediately place 1 Greed Counter on this card. If this card has 2 or more Greed Counters: You can send this card to the Graveyard; draw 2 cards.
et: Iga kord, kui teete oma tavalise tõmbe oma Tõmbefaasis, asetage kohe sellele kaardile 1 Ahnuse Loendur. Kui sellel kaardil on 2 või rohkem Ahnuse Loendurit: saate saata selle kaardi Hauakambrisse; tõmmake 2 kaarti.

source: Noise of The Forest
et: Metsa Müra

source: Target 1 face-up monster your opponent controls; change it to face-down Defense Position, and you can return 1 Field Spell Card on the field to the hand.
et: Vali 1 avatud asendis olev koletis, mida sinu vastane kontrollib; muuda see kinniseks kaitseasendiks ja sa võid tagastada 1 väljaloitsu kaardi väljakult kätte.

source: Tri-Wight Zone
et: Kolmevalge tsoon

source: Target 3 Level 2 or lower Normal Monsters in your Graveyard; Special Summon those targets.
et: Vali 3. taseme või madalama taseme Tavalist Koletist oma Hauakambris; Kutsu need sihtmärgid erilisele väljakutsele.

source: One Day of Peace
et: Üks rahupäev

source: Both players draw 1 card. Until your opponent's next End Phase, all damage either player takes becomes 0.
et: Mõlemad mängijad tõmbavad 1 kaardi. Kuni sinu vastase järgmise lõppfaasini muutub kogu kahju, mida kumbki mängija saab, nulliks.

source: Space Cyclone
et: Kosmiline Tsüklon

source: Detach 1 Xyz Material on the field.
et: Eemalda 1 Xyz Materjal väljal.

source: Deadly Wind
et: Surmav Tuul

source: Neither player can Special Summon WIND monsters and all face-up WIND monsters lose 500 ATK.
et: Kumbki ei saa eriliselt kutsuda TUULE-olendeid ja kõik avatud TUULE-olendid kaotavad 500 ATK.

source: Regretful Complaint
et: Kahetsusväärne Kaebus

source: When you take Battle Damage by a direct attack: Take control of your opponent's monster with the highest DEF, until your next End Phase. While you control that monster, its effect(s) is negated and it cannot attack.
et: Kui saad otsese rünnaku tõttu lahingukahju: Võta oma vastase koletis, millel on kõrgeim DEF, oma kontrolli alla kuni järgmise lõppfaasini. Kui sa kontrollid seda koletist, on selle mõju(d) tühistatud ja see ei saa rünnata.

source: Burning Fighting Spirit
et: Põlev Võitlusvaim

source: Equip this card to a monster you control. If your opponent controls a monster whose ATK is higher than the original ATK of the equipped monster, then the equipped monster's ATK becomes equal to double its original ATK during the Damage Step only.
et: Varusta see kaart sinu kontrollitavale koletisele. Kui sinu vastane kontrollib koletist, kelle ATK on kõrgem kui varustatud koletise algne ATK, siis varustatud koletise ATK muutub võrdseks tema algse ATK kahekordse väärtusega ainult Kahjustuse Arvutamise sammu ajal.

source: Damage Diet
et: Kahju dieet

source: Any damage you take this turn is halved. You can banish this card in your Graveyard; halve all effect damage you take this turn.
et: Sel käigul saadav kahju väheneb poole võrra. Sa võid selle kaardi oma Hauakambrist välja saata; vähenda sel käigul saadavat efektikahju poole võrra.

source: Copy Knight
et: Kopeerimisrüütel

source: Activate only when you Normal Summon a Level 4 or lower Warrior-Type monster. After activation, Special Summon this card; it is treated as a Normal Monster Card (Warrior-Type/LIGHT/ATK 0/DEF 0) with the same name and Level as the Summoned monster. (This card is still treated as a Trap Card).
et: Aktiveeri ainult siis, kui sa kutsud normalkutsumisega välja 4. või madalama taseme Sõdalase-tüüpi koletise. Pärast aktiveerimist kutsu see kaart eriliselt välja; seda käsitletakse kui Normaalset Koletisekaarti (Sõdalase-tüüp/VALGUS/ATK 0/DEF 0) sama nime ja tasemega kui kutsutud koletis. (Seda kaarti käsitletakse endiselt kui Lõksukaarti).

source: Holy Armor -Mirror Mail-
et: Püha Rüü -Peegli Post-

source: When a face-up monster you control is targeted for an attack: The ATK of that monster becomes the ATK of the attacking monster.
et: Kui sinu kontrollitav avatud koletis on rünnaku sihtmärk: Selle koletise ATK muutub ründava koletise ATK-ks.

source: Fish Rain
et: Kalade vihm

source: When a face-up Fish, Sea Serpent, or Aqua-Type monster you control is banished: Special Summon 1 Level 3 or lower Fish, Aqua or Sea Serpent-Type monster from your hand.
et: Kui sinu kontrolli all olev avatud Kalade, Meremadude või Vee tüüpi koletis eemaldatakse mängust: Kutsu eriliselt välja 1 3. taseme või madalam Kalade, Vee või Meremadude tüüpi koletis oma käest.

source: Hate Crevasse
et: Vihalõhe

source: When a monster you control is destroyed by an opponent's card effect and sent to the Graveyard: Target 1 monster your opponent controls; send that target to the Graveyard, and inflict damage to your opponent's Life Points equal to that monster's original ATK.
et: Kui sinu kontrollitav koletis hävitatakse vastase kaardi efekti tõttu ja saadetakse Hauakambrisse: Sihtmärk 1 koletis, mida sinu vastane kontrollib; saada see sihtmärk Hauakambrisse ja tekita oma vastase Elupunktidele kahju, mis on võrdne selle koletise algse rünnakuga (ATK).

source: Lumenize
et: Lumeniseerimine

source: When your opponent's monster declares an attack: Negate the attack, and 1 face-up LIGHT monster you control gains ATK equal to the attacking monster until your next End Phase.
et: Kui sinu vastase koletis kuulutab välja rünnaku: Tühista rünnak ja 1 sinu kontrollitav avatud VALGUS koletis saab ründava koletisega võrdse ATK kuni sinu järgmise lõppfaasini.

source: Evolutionary Bridge
et: Evolutsioonisild

source: When a monster you control is targeted for an attack: Target 1 "Evoltile" in your Graveyard; Special Summon that monster, then change the attack target to that monster and conduct damage calculation.
et: Kui sinu kontrollitav koletis on rünnaku sihtmärk: Sihti 1 "Evoltile" oma Hauas; Kutsu see koletis eriliselt välja, seejärel muuda rünnaku sihtmärk selleks koletiseks ja vii läbi kahju arvutamine.

source: Spring Rewinding
et: Kevad Taaskeerdumine

source: Target 1 face-up Level 4 or lower "Wind-Up" monster you control; return that target to the hand, and Special Summon 1 "Wind-Up" monster with the same Level as that target from your hand.
et: Vali 1 avatud Level 4 või madalama "Wind-Up" koletis, mida sa kontrollid; tagasta see sihtmärk käele ja Kutsu Eriliselt välja 1 "Wind-Up" koletis, millel on sama tase kui sellel sihtmärgil, oma käest.

source: Watt Cancel
et: Watt Tühistamine

source: When an opponent's monster is Normal or Special Summoned: Discard 1 "Watt" monster; negate the Summon and destroy the monster.
et: Kui vastase koletis Normaal- või Erikutsutakse: Viska ära 1 "Watt" koletis; tühista Kutsumine ja hävita koletis.

source: Ruler's Penetrating Gaze
et: Valitseja Läbistav Pilk

source: If you control a face-up Level 7 or higher Normal Monster: Negate the activation of a Spell/Trap Card, or the Summon of a monster, and destroy that card.
et: Kui sa kontrollid avatud taseme 7 või kõrgemat tavalist koletist: Tühista loitsu/lõksukaardi aktiveerimine või koletise kutsumine ja hävita see kaart.

source: Dark Flash
et: Tume Välgatus

source: Tribute 1 DARK monster you control with 1500 or more ATK; destroy all monsters that were Special Summoned this turn.
et: Ohverda 1 PIMEDUS koletis, mida sa kontrollid ja millel on 1500 või rohkem RÜN; hävita kõik koletised, mis sellel käigul Eriliselt Kutsuti.

source: Tyrant's Desperation
et: Türanni meeleheide

source: Tribute 2 non-Token Normal Monsters you control; While this card is face-up on the field, neither player can Normal or Special Summon any Effect Monsters.
et: Ohverda 2 mitte-token tavalist koletist, mida sa kontrollid; Kui see kaart on väljakul näoga ülespoole, ei saa kumbki mängija normaal- ega erikutsuda ühtegi efektikoletist.

source: Order to Retreat
et: Käsk taganeda

source: Return all monsters you control to the hand(s).
et: Tagasta kõik sinu kontrolli all olevad koletised kätesse.

source: Deep Black Trap Hole
et: Sügav Musta Lõksuauk

source: When a Level 5 or higher Effect Monster(s) is Special Summoned: Banish that monster(s).
et: Kui tase 5 või kõrgem Efektikoletis(ed) kutsutakse eriliselt välja: Saada see koletis(ed) pagendusse.

source: Eisbahn
et: Jääväljak

source: If you control a face-up WATER monster when a non-WATER monster is Normal or Special Summoned in Attack Position: Change the Summoned monster to Defense Position.
et: Kui sa kontrollid avatud VEE koletist, kui mitte-VEE koletis kutsutakse tavaliselt või eriliselt rünnakupositsioonis: Muuda kutsutud koletis kaitsepositsiooniks.

source: Sealing Ceremony of Suiton
et: Suitoni pitseritsemine

source: Once per turn: You can send 1 WATER monster from your hand to the Graveyard to target 1 monster in your opponent's Graveyard; banish that target.
et: Kord korra käigu jooksul: Sa võid saata 1 VEE koletise oma käest Hauakambrisse, et sihtida 1 koletist oma vastase Hauakambris; pagenda see sihtmärk.

source: Sonic Warrior
et: Sonic Sõdalane

source: When this card is sent to the Graveyard: Level 2 or lower monsters you control gain 500 ATK.
et: Kui see kaart saadetakse Hauakambrisse: 2. või madalama tasemega koletised, mida sa kontrollid, saavad 500 ATK juurde.

source: Influence Dragon
et: Mõju Draakon

source: Once per turn: You can target 1 face-up monster you control; the target is treated as a Dragon-Type, until the End Phase.
et: Korra ühe korra käigu jooksul: Sa võid valida ühe avatud koletise, mida sa kontrollid; valitud sihtmärk loetakse Draakoni-tüüpi koletiseks kuni Lõppfaasini.

source: Crimson Blader
et: Veripunane Mõõgamees

source: 1 Tuner + 1 or more non-Tuner monsters<BR>If this card destroys an opponent's monster by battle and sends it to the Graveyard: Your opponent cannot Normal or Special Summon Level 5 or higher monsters during their next turn.
et: 1 Tuner + 1 või rohkem mitte-Tuner koletist<BR>Kui see kaart hävitab lahingus vastase koletise ja saadab selle Hauakambrisse: Sinu vastane ei saa oma järgmisel käigul Normaal- ega Erikutsuda 5. või kõrgema taseme koletisi.

source: Star Bright Dragon
et: Tähesära Draakon

source: When this card is Normal Summoned: You can target 1 face-up monster on the field, except this card; increase that target's Level by 2 until the End Phase.
et: Kui see kaart on Normaal-Kutsutud: Sa saad sihtida 1 avatud koletist väljal, välja arvatud see kaart; tõsta selle sihtmärgi Tase 2 võrra kuni Lõppfaasini.

source: Full Elf
et: Täis Elf

source: Once per turn: You can reveal 1 Monster Card in your hand; increase this card's Level by the Level of the revealed monster's, until the End Phase.
et: Korra ühe korra käigu jooksul: Sa võid paljastada ühe Koletise Kaardi oma käes; suurenda selle kaardi taset paljastatud koletise taseme võrra kuni Lõppfaasini.

source: Chew-Bone
et: Närimiskont

source: FLIP: Special Summon 3 "<M3976>Chew-Bone Jr. Token<M>"s (Zombie-Type/EARTH/Level 1/ATK 100/DEF 300) to your opponent's side of the field in face-up Defense Position.
et: FLIP: Kutsu vastase väljale 3 "<M3976>Chew-Bone Jr. Token<M>"i (Zombi-Tüüp/MAA/Tase 1/ATK 100/DEF 300) avatud kaitseasendisse.

source: Tri-Star Trion
et: Kolmiktäht Trion

source: During the End Phase of the turn this card was Tributed for a Tribute Summon or Set: You can Special Summon this card from the Graveyard.
et: End Phase'i ajal, mil see kaart ohverdati Ohverdus Kutsumiseks või Asetamiseks: Sa saad selle kaardi Hauakambrist Eriliselt Kutsuda.

source: Super Star Mira
et: Superstaar Mira

source: 3 Level 1 monsters<BR>If this face-up card on the field would be destroyed: You can detach 1 Xyz Material from this card, instead. While this card is face-up on the field, face-up Level 4 or lower monsters you control cannot be destroyed by card effects.
et: 3. taseme 1 koletist<BR>Kui see avatud kaart väljal hävitatakse: Sa võid selle kaardi küljest eemaldada 1 Xyz Materjali, selle asemel. Kui see kaart on väljal avatud, ei saa sinu kontrollitavad avatud 4. taseme või madalama tasemega koletised kaartide efektide tõttu hävitatud.

source: Shine Elf
et: Särav Elf

source: 2 Level 2 monsters<BR>When your opponent Normal or Special Summons a monster(s): You can detach 1 Xyz Material from this card; that monster(s) loses 500 ATK.
et: 2. taseme 2 koletist<BR>Kui sinu vastane kutsub koletise(d) normaalselt või eriliselt välja: Sa võid sellelt kaardilt eemaldada 1 Xyz Materjali; see koletis(ed) kaotab 500 ATK.

source: Elemental HERO Escuridao
et: Elementaalne KANGELANE Escuridao

source: 11 "Elemental HERO" monster + 1 DARK monster<BR>Must be Fusion Summoned and cannot be Special Summoned by other ways. This card gains 100 ATK for each1 "Elemental HERO" monster in your Graveyard.
et: 11 "Elemental HERO" koletist + 1 PIMEDUS koletis<BR>Peab olema Fusion Summoned ja ei saa olla Special Summoned muul viisil. See kaart saab 100 ATK iga sinu kalmistul oleva "Elemental HERO" koletise kohta.

source: Kachi Kochi Dragon
et: Kachi Kochi Draakon

source: 2 Level 4 monsters<BR>Once per turn, if this card destroys your opponent's monster by battle and sends it to the Graveyard: You can detach 1 Xyz Material from this card; this card can attack once again.
et: 2. taseme 4 koletist<BR>Kord ühe käigu jooksul, kui see kaart hävitab lahingus sinu vastase koletise ja saadab selle Hauakambrisse: Sa võid sellelt kaardilt eemaldada 1 Xyz Materjali; see kaart võib rünnata veel kord.
