Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: You can Special Summon this card by Tributing 1 "Helios - The Primordial Sun". This card's ATK and DEF are equal to the number of removed from play monsters x 200. If this card is destroyed by battle and sent to the Graveyard, Special Summon it during the End Phase, and it gains 300 ATK and DEF.
et: Saad selle kaardi eriliselt välja kutsuda, ohverdades 1 "Helios - The Primordial Sun". Selle kaardi ATK ja DEF on võrdne mängust eemaldatud koletiste arvuga x 200. Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse, kutsu see End Phase'i ajal eriliselt välja ja see saab 300 ATK ja DEF juurde.

source: You can Special Summon this card by Tributing 1 "Helios Duo Megistus". This card's ATK and DEF are each equal to the number of removed from play monsters x 300. After this card attacks, it can attack once more if your opponent controls a monster. If this card is destroyed by battle and sent to the Graveyard, Special Summon it during the End Phase and it gains 500 ATK and DEF.
et: Sa saad selle kaardi eriliselt välja kutsuda, ohverdades 1 "Helios Duo Megistus". Selle kaardi ATK ja DEF on võrdsed mängust eemaldatud koletiste arvuga x 300. Pärast selle kaardi rünnakut saab see rünnata veel kord, kui sinu vastane kontrollib koletist. Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse, kutsu see End Phase'i ajal eriliselt välja ja see saab 500 ATK ja DEF juurde.

source: Elemental Hero Neos
et: Elementaalne Kangelane Neos

source: A new Elemental HERO has arrived from Neo-Space! When he initiates a Contact Fusion with a Neo-Spacian his unknown powers are unleashed.
et: Uus Elemental HERO on saabunud Neo-Space'ist! Kui ta alustab Kontaktfusiooni Neo-Spacianiga, vabanevad tema tundmatud jõud.

source: Dandylion
et: Võilill

source: When this card is sent to the Graveyard: Special Summon 2 "<M3925>Fluff Token<M>"(s) (Plant-Type/WIND/Level 1/ATK 0/DEF 0) in Defense Position. These Tokens cannot be Tributed for a Tribute Summon during the turn they are Special Summoned.
et: Kui see kaart saadetakse Hauakambrisse: Kutsu välja 2 "<M3925>Fluff Token<M>"(it) (Taim-Tüüp/TUUL/Tase 1/ATK 0/DEF 0) kaitsepositsioonis. Neid žetoone ei saa ohverdada ohverdussummoniks sellel käigul, mil nad kutsuti välja.

source: Elemental Hero Phoenix Enforcer
et: Elementaalne Kangelane Phoenix Enforcer

source: "<M6310>Elemental HERO Avian<M>" + "<M6311>Elemental HERO Burstinatrix<M>"<BR>Must be Fusion Summoned and cannot be Special Summoned by other ways. This card cannot be destroyed by battle.
et: "<M6310>Elemental HERO Avian<M>" + "<M6311>Elemental HERO Burstinatrix<M>"<BR>Peab olema Fusion Summoned ja ei saa olla Special Summoned muul viisil. Seda kaarti ei saa lahingus hävitada.

source: Elemental Hero Shining Phoenix Enforcer
et: Elementaalne Kangelane Särav Fööniksi Täideviija

source: "<M6655>Elemental Hero Phoenix Enforcer<M>" + "<M6313>Elemental HERO Sparkman<M>"<BR>Must be Fusion Summoned and cannot be Special Summoned by other ways. This card gains 300 ATK for each "Elemental HERO" card in your Graveyard. This card cannot be destroyed by battle.
et: "<M6655>Elementaalne Kangelane Phoenix Enforcer<M>" + "<M6313>Elementaalne KANGELANE Sparkman<M>"<BR>Peab olema Fusion Summoned ja ei saa olla Special Summoned muul viisil. See kaart saab 300 ATK iga "Elementaalne KANGELANE" kaardi eest sinu Hauakambris. Seda kaarti ei saa lahingus hävitada.

source: Elemental Hero Mariner
et: Elementaalne Kangelane Meremees

source: "<M6393>Elemental HERO Bubbleman<M>" + "<M6310>Elemental HERO Avian<M>"<BR>Must be Fusion Summoned and cannot be Special Summoned by other ways. While you have any face-down card(s) in your Spell & Trap Card Zones, this card can attack your opponent's directly.
et: "<M6393>Elementaalne KANGELANE Mullimees<M>" + "<M6310>Elementaalne KANGELANE Avian<M>"<BR>Peab olema sulandumise teel kutsutud ja ei saa olla eriliselt kutsutud muul viisil. Kui sul on mõni kaardid näoga allpool oma Loitsu & Lõksu Kaardi Tsoonides, võib see kaart rünnata otse sinu vastast.

source: Destiny Hero - Doom Lord
et: Saatuskangelane - Hukkumishärra

source: Once per turn: You can target 1 monster your opponent controls; banish that target. You cannot declare an attack the turn you activate this effect. You must control this face-up Attack Position card to activate and to resolve this effect. The banished monster returns to the opponent's side of the field, in the same battle position, during your 2nd Standby Phase after activation.
et: Kord korra: Saad valida 1 koletise, mida sinu vastane kontrollib; eemalda see sihtmärk mängust. Sa ei saa sellel käigul rünnakut kuulutada, kui aktiveerid selle efekti. Sa pead kontrollima seda avatud Rünnakupositsioonis kaarti, et aktiveerida ja lahendada see efekt. Eemaldatud koletis naaseb vastase väljale, samas lahingupositsioonis, sinu 2. Ootefaasil pärast aktiveerimist.

source: Destiny Hero - Captain Tenacious
et: Saatuskangelane - Kapten Tenacious

source: Once per turn, during your Standby Phase: You can target 1 "Destiny HERO" monster in your Graveyard that was destroyed by battle since your last Standby Phase, if you controlled this face-up card when the target was destroyed; Special Summon that target.
et: Kord ühe korra oma ootejärgus: Sa võid valida ühe "Destiny HERO" koletise oma hauas, mis hävitati lahingus alates sinu viimasest ootejärgust, kui sa kontrollisid seda avatud kaarti, kui sihtmärk hävitati; Kutsu see sihtmärk eriliselt välja.

source: Destiny Hero - Diamond Dude
et: Saatuskangelane - Teemantkutt

source: Once per turn: You can reveal the top card of your Deck, and if it is a Normal Spell Card, send it to the Graveyard, otherwise place it on the bottom of your Deck. During the Main Phase of your next turn, you can activate the effect of that Spell Card in your Graveyard (even if you no longer control this face-up card).
et: Kord korra: Sa võid paljastada oma pakist ülemise kaardi ja kui see on tavaline loitsukaart, saata see hauakambrisse, vastasel juhul aseta see oma paki alla. Järgmise käigu põhifaasis võid aktiveerida selle loitsukaardi efekti oma hauakambris (isegi kui sa enam ei kontrolli seda avatud kaarti).

source: Destiny Hero - Dreadmaster
et: Saatuskangelane - Hirmuvalitseja

source: If this card is Special Summoned by "<M6668>Clock Tower Prison<M>": Destroy all monsters you control, except face-up "Destiny HERO" monsters, then you can Special Summon up to 2 "Destiny HERO" monsters from your Graveyard. During any turn this card is Special Summoned, "Destiny HERO" monsters you control cannot be destroyed, and you take no Battle Damage when they battle. The ATK and DEF of this card are equal to the combined original ATK of all other "Destiny HERO" monsters you control.
et: Kui see kaart on eriliselt kutsutud "<M6668>Clock Tower Prison<M>": Hävita kõik koletised, mida sa kontrollid, välja arvatud avatud "Destiny HERO" koletised, seejärel saad sa eriliselt kutsuda kuni 2 "Destiny HERO" koletist oma Hauakambrist. Igal käigul, mil see kaart on eriliselt kutsutud, ei saa sinu kontrollitavad "Destiny HERO" koletised hävitatud ja sa ei saa lahingukahju, kui nad võitlevad. Selle kaardi ATK ja DEF on võrdne kõigi teiste sinu kontrollitavate "Destiny HERO" koletiste algse ATK-ga kokku.

source: Cyber Kirin
et: Küberne Kirin

source: You can Tribute this card to make any effect damage you take this turn 0.
et: Saad selle kaardi ohverdada, et muuta sellel käigul saadav efektikahju 0-ks.

source: Cyber Phoenix
et: Küberfööniks

source: While this card is in face-up Attack Position, negate any Spell/Trap effects that target exactly 1 Machine-Type monster you control. When this face-up card is destroyed by battle and sent to the Graveyard: You can draw 1 card.
et: Kui see kaart on avatud rünnakupositsioonis, tühista kõik loitsu/lõksu efektid, mis sihivad täpselt ühte masinatüüpi koletist, mida sa kontrollid. Kui see avatud kaart hävitatakse lahingus ja saadetakse hauakambrisse: Sa võid tõmmata 1 kaardi.

source: Cyber Tutu
et: Küber Tutu

source: If the ATK of each monster your opponent controls is higher than the ATK of this card, this card can attack your opponent directly.
et: Kui iga sinu vastase kontrollitava koletise ATK on kõrgem kui selle kaardi ATK, võib see kaart rünnata sinu vastast otse.

source: Cyber Gymnast
et: Kübervõimleja

source: Once per turn, you can discard 1 card to destroy 1 face-up Attack Position monster your opponent controls.
et: Korra ühe korra käigu jooksul saad sa ühe kaardi ära visata, et hävitada üks vastase kontrollitav avatud rünnakupositsioonis olev koletis.

source: Cyber Prima
et: Küber Prima

source: When this card is Tribute Summoned, destroy all face-up Spell Cards on the field.
et: Kui see kaart on ohverdatud kutsumiseks, hävita kõik avatud loitsukaardid väljal.

source: Guard Penalty
et: Valvuri karistus

source: Select 1 monster on the field. If the selected monster is changed to Defense Position this turn, draw 1 card from your Deck.
et: Vali 1 koletis väljal. Kui valitud koletis muudetakse sellel käigul kaitsepositsiooni, tõmba oma pakist 1 kaart.

source: Clock Tower Prison
et: Kellatorni vangla

source: During each of your opponent's Standby Phases: Place 1 Clock Counter on this card. While there are 4 or more Clock Counters on this card, you do not take any Battle Damage. When this card with 4 or more Clock Counters is destroyed and sent to the Graveyard: Special Summon 1 "Destiny HERO - Dreadmaster" from your hand or Deck.
et: Iga vastase Standby Phase'i ajal: Aseta sellele kaardile 1 Kella Loendur. Kui sellel kaardil on 4 või rohkem Kella Loendurit, siis sa ei saa lahingukahju. Kui see kaart, millel on 4 või rohkem Kella Loendurit, hävitatakse ja saadetakse Hauakambrisse: Kutsu eriliselt välja 1 "Destiny HERO - Dreadmaster" oma käest või pakist.

source: Misfortune
et: Ebaõnn

source: Select 1 face-up monster your opponent controls. Inflict damage to your opponent equal to half that monster's original ATK. Your monsters cannot attack this turn.
et: Vali 1 avatud näoga koletis, mida sinu vastane kontrollib. Tekita oma vastasele kahju, mis on võrdne poolega selle koletise algsest rünnakust. Sinu koletised ei saa sel käigul rünnata.

source: Grand Convergence
et: Suur Ühendus

source: If you control "Macro Cosmos": Inflict 300 damage to your opponent and destroy all monsters on the field.
et: Kui sa kontrollid "Macro Cosmos": Tekita oma vastasele 300 kahju ja hävita kõik koletised väljakul.

source: H - Heated Heart
et: H - Kuum Süda

source: Target 1 face-up monster you control; until the End Phase, it gains 500 ATK, and if it attacks a Defense Position monster, inflict piercing Battle Damage to your opponent.
et: Vali 1 avatud asendis olev koletis, mida sa kontrollid; kuni lõppfaasini saab see 500 ATK juurde ja kui see ründab kaitseasendis olevat koletist, põhjusta vastasele läbistavat lahingukahju.

source: E - Emergency Call
et: E - Hädaabikõne

source: Add 11 "Elemental HERO" monster from your Deck to your hand.
et: Lisa oma pakist 11 "Elemental HERO" koletist oma kätte.

source: R - Righteous Justice
et: R - Õiglane Õiglus

source: Destroy Spell/Trap Cards equal to the number of face-up "Elemental HERO" cards you control.
et: Hävita loitsu/lõksukaardid, mis on võrdne sinu kontrolli all olevate avatud "Elemental HERO" kaartide arvuga.

source: O - Oversoul
et: O - Ülehing

source: Target 1 "Elemental HERO" Normal Monster in your Graveyard; Special Summon that target.
et: Vali 1 "Elemental HERO" tavaline koletis oma kalmistul; Kutsu see sihtmärk eriliselt välja.

source: HERO Flash!!
et: KANGELASE Välgatus!!

source: Banish "H - Heated Heart", "E - Emergency Call", "R - Righteous Justice" and "O - Oversoul" from your Graveyard; Special Summon 1 "Elemental HERO" Normal Monster from your Deck. All "Elemental HERO" Normal Monsters you currently control can attack your opponent directly this turn.
et: Eemalda oma Hauakambrist "H - Heated Heart", "E - Emergency Call", "R - Righteous Justice" ja "O - Oversoul"; Kutsu eriliselt välja 1 "Elemental HERO" Tavaline Koletis oma Pakist. Kõik "Elemental HERO" Tavalised Koletised, mida sa praegu kontrollid, võivad sel käigul rünnata otse sinu vastast.

source: Elemental Recharge
et: Elementaalne Laadimine

source: Gain 1000 Life Points for each1 "Elemental HERO" monster you control.
et: Saa 1000 Elupunkti iga "Elemental HERO" koletise eest, mida sa kontrollid.

source: Destruction of Destiny
et: Saatuselõhkumine

source: Send 3 cards from the top of your Deck to the Graveyard, and take 1000 damage for each Spell or Trap Card sent to the Graveyard this way.
et: Saada 3 kaarti oma paki pealt hauakambrisse ja saa 1000 kahju iga loitsu- või lõksukaardi eest, mis sel viisil hauakambrisse saadeti.

source: D - Time
et: D - Aeg

source: When an1 "Elemental HERO" monster you control leaves the field: Add 1 "Destiny HERO" monster from your Deck to your hand whose Level is less than or equal to that "Elemental HERO" monster's Level.
et: Kui sinu kontrolli all olev "Elemental HERO" koletis lahkub väljalt: Lisa oma pakist oma kätte 1 "Destiny HERO" koletis, mille tase on väiksem või võrdne selle "Elemental HERO" koletise tasemega.

source: Destiny Signal
et: Saatussignaal

source: When a monster you control is destroyed by battle and sent to the Graveyard: Special Summon 1 Level 4 or lower "Destiny HERO" monster from your hand or Deck.
et: Kui sinu kontrollitav koletis hävitatakse lahingus ja saadetakse Hauakambrisse: Kutsu eriliselt välja 1 tase 4 või madalam "Destiny HERO" koletis oma käest või pakist.

source: D - Shield
et: D - Kilp

source: When an Attack Position "Destiny HERO" monster you control is targeted for an attack: Target it; change it to Defense Position and equip it with this card. The equipped monster cannot be destroyed by battle.
et: Kui rünnakupositsioonis olevat "Destiny HERO" koletist, mida sa kontrollid, rünnatakse: Sihtmärk see; muuda see kaitsepositsiooniks ja varusta see selle kaardiga. Varustatud koletist ei saa lahingus hävitada.

source: Elemental Absorber
et: Elementide Absorbeerija

source: Remove from play 1 Monster Card in your hand to activate this card. Your opponent's monsters that have the same Attribute as the monster removed by this effect cannot declare an attack.
et: Eemaldage mängust 1 koletise kaart oma käest, et aktiveerida see kaart. Teie vastase koletised, millel on sama atribuut kui selle efekti abil eemaldatud koletisel, ei saa rünnakut kuulutada.

source: Macro Cosmos
et: Makrokosmos

source: When this card resolves: You can Special Summon 1 "Helios - The Primordial Sun" from your hand or Deck. While this card is face-up on the field, any card sent to the Graveyard is banished instead.
et: Kui see kaart aktiveerub: Sa võid eriliselt kutsuda 1 "Helios - The Primordial Sun" oma käest või pakist. Kui see kaart on lahinguväljal avatud, siis iga kaart, mis saadetakse Hauakambrisse, on selle asemel pagendatud.

source: Searchlightman
et: Otsingutulemees

source: FLIP: Your opponent cannot Set (or flip face-down) any cards for the rest of this turn.
et: FLIP: Sinu vastane ei saa selle käigu lõpuni ühtegi kaarti asetada (ega ümber pöörata näoga allapoole).

source: When this card destroys an opponent's monster by battle, select and activate 1 of the following effects:<BR>● This card gains 400 ATK.<BR>● Destroy 1 face-up Spell or Trap Card.<BR>● Special Summon 1 "<M3927>Option Token<M>". It always has the same Type, Attribute, Level, ATK and DEF as this card.
et: Kui see kaart hävitab lahingus vastase koletise, vali ja aktiveeri üks järgmistest efektidest:<BR>● See kaart saab 400 ATK juurde.<BR>● Hävita 1 avatud Loitsu- või Lõksukaart.<BR>● Kutsu eriliselt välja 1 "<M3927>Option Token<M>". Sellel on alati sama Tüüp, Atribuut, Tase, ATK ja DEF nagu sellel kaardil.

source: Super-Electromagnetic Voltech Dragon
et: Super-elektromagnetiline Voltech Draakon

source: If you Tribute Summon this card by Tributing 1 of the following monsters, it gains the appropriate effect:<BR>● Batteryman D: Negate the effect of a Spell or Trap Card that targets this 1 card.<BR>● Batteryman C: During battle between this attacking card and a Defense Position monster whose DEF is lower than the ATK of this card, inflict the difference as Battle Damage to your opponent.<BR>● Batteryman AA: This card gains 1000 ATK.
et: Kui sa kutsud selle kaardi välja ohverdades ühe järgmistest koletistest, saab see vastava efekti:<BR>● Batteryman D: Tühista selle kaardi sihtiva Loitsu või Lõksukaardi efekt.<BR>● Batteryman C: Kui see ründav kaart võitleb Kaitseasendis koletisega, mille DEF on madalam kui selle kaardi ATK, põhjusta vahe oma vastasele Lahingukahjuna.<BR>● Batteryman AA: See kaart saab 1000 ATK juurde.

source: Harpie's Pet Baby Dragon
et: Harpyia Lemmik Beebi Draakon

source: This card gains effects based on the number of "Harpie" monsters you control (other than "<M6686>Harpie's Pet Baby Dragon<M>" and "<M4980>Harpie's Brother<M>").<BR>● 1+: Your opponent cannot select "Harpie" monsters you control as attack targets (except "<M6686>Harpie's Pet Baby Dragon<M>" and "<M4980>Harpie's Brother<M>").<BR>● 2+: Double the original ATK and DEF of this card.<BR>● 3+: Once per turn, you can destroy 1 card your opponent controls.
et: Sellel kaardil on efektid, mis põhinevad sinu kontrollitavate "Harpie" koletiste arvul (välja arvatud "<M6686>Harpie's Pet Baby Dragon<M>" ja "<M4980>Harpie's Brother<M>").<BR>● 1+: Sinu vastane ei saa valida sinu kontrollitavaid "Harpie" koletisi rünnaku sihtmärkideks (välja arvatud "<M6686>Harpie's Pet Baby Dragon<M>" ja "<M4980>Harpie's Brother<M>").<BR>● 2+: Selle kaardi algne ATK ja DEF kahekordistatakse.<BR>● 3+: Kord ühe käigu jooksul saad hävitada 1 kaardi, mida sinu vastane kontrollib.

source: Majestic Mech - Senku
et: Majesteetlik Mehh - Senku

source: When this card inflicts Battle Damage to your opponent by a direct attack: Draw 1 card. During the End Phase of the turn this card was Summoned: Send it to the Graveyard.
et: Kui see kaart tekitab otsese rünnakuga lahingukahju sinu vastasele: Tõmba 1 kaart. Selle käigu lõppfaasis, mil see kaart kutsuti välja: Saada see Hauakambrisse.

source: Majestic Mech - Ohka
et: Majesteetlik Mehh - Ohka

source: You can Normal Summon this card without Tributing. If you do, it is sent to the Graveyard during the End Phase.
et: Seda kaarti saab tavaliselt kutsuda ilma ohverdusteta. Kui teete seda, saadetakse see lõppfaasis hauakambrisse.

source: Majestic Mech - Goryu
et: Majesteetlik Mehh - Goryu

source: You can Normal Summon this card with 1 Tribute. If you do, it is sent to the Graveyard during the End Phase. During battle between this attacking card and a Defense Position monster whose DEF is lower than the ATK of this card, inflict the difference as Battle Damage to your opponent.
et: Sa saad selle kaardi Normaal-Kutsuda ühe ohverdusega. Kui sa seda teed, saadetakse see Lõppfaasi ajal Hauakambrisse. Lahingu ajal selle ründava kaardi ja kaitsepositsioonis oleva koletise vahel, mille DEF on madalam kui selle kaardi ATK, põhjusta vahe oma vastasele Lahingukahjuna.

source: Bountiful Artemis
et: Rikkalik Artemis

source: Each time a Counter Trap Card resolves, immediately draw 1 card (during the Chain).
et: Iga kord, kui vastukaardilõks lahendatakse, tõmba kohe 1 kaart (ahela ajal).

source: Royal Knight
et: Kuninglik Rüütel

source: When this card destroys a monster by battle and sends it to the Graveyard, gain Life Points equal to the DEF of the destroyed monster.
et: Kui see kaart hävitab lahingus koletise ja saadab selle Hauakambrisse, saad Elupunkte, mis on võrdne hävitatud koletise DEF-iga.

source: Herald of Purple Light
et: Lilla Valguse Kuulutaja

source: You can send this card and 1 other Fairy-Type monster from your hand to the Graveyard to negate the activation of an opponent's Trap Card and destroy it. This effect can be activated during either player's turn.
et: Saad selle kaardi ja 1 teise haldjatüüpi koletise oma käest kalmistule, et tühistada vastase lõksukaardi aktiveerimine ja see hävitada. Seda efekti saab aktiveerida mõlema mängija käigu ajal.

source: Herald of Green Light
et: Rohelise Valguse Kuulutaja

source: You can send this card and 1 other Fairy-Type monster from your hand to the Graveyard to negate the activation of an opponent's Spell Card and destroy it. This effect can be activated during either player's turn.
et: Saad selle kaardi ja 1 teise haldjatüüpi koletise oma käest Hauakambrisse, et tühistada vastase Loitsukaardi aktiveerimine ja see hävitada. Seda efekti saab aktiveerida mõlema mängija käigu ajal.

source: Layard the Liberator
et: Vabastaja Layard

source: Add 2 of your removed from play Fairy-Type monsters to your hand each time a Counter Trap Card is activated.
et: Lisa oma eemaldatud mängust 2 haldjatüüpi koletist oma kätte iga kord, kui aktiveeritakse vastulõksukaart.

source: Banisher of the Radiance
et: Kiirguse Väljaheitja

source: Any card sent to the Graveyard is banished instead.
et: Mis tahes kaart, mis saadetakse Hauakambrisse, pagendatakse selle asemel.

source: Voltanis the Adjudicator
et: Voltanis, Kohtumõistja

source: After 1 of your Counter Trap Cards has been activated and has resolved, you can Tribute all monsters you control to Special Summon this card. If this card is Special Summoned in this way, you can destroy cards your opponent controls up to the number of Fairy-Type monsters you Tributed.
et: Pärast seda, kui 1 sinu Vastulõksukaartidest on aktiveeritud ja lahendatud, saad sa ohverdada kõik oma kontrollitavad koletised, et Kutsuda see kaart Eriliselt välja. Kui see kaart on sel viisil Eriliselt välja Kutsutud, saad sa hävitada vastase kontrollitavad kaardid kuni ohverdatud Haljatüüpi koletiste arvuni.

source: Guard Dog
et: Valvekoer

source: FLIP: Your opponent cannot Special Summon for the rest of this turn.
et: FLIP: Sinu vastane ei saa selle käigu jooksul erikutsuda.

source: Whirlwind Weasel
et: Pööristuule Näär

source: FLIP: Your opponent cannot activate any Spell or Trap Cards for the rest of this turn.
et: FLIP: Sinu vastane ei saa selle käigu lõpuni aktiveerida ühtegi Loitsu ega Lõksukaarti.

source: Avalanching Aussa
et: Laviin Aussa

source: Once per turn, you can Tribute 1 EARTH monster (except this card) to Special Summon 1 EARTH monster from your hand. The monster Special Summoned by this effect is destroyed if "<M6699>Avalanching Aussa<M>" is removed from your side of the field.
et: Korra ühe korra käigu jooksul võid sa ohverdada 1 MAA koletise (välja arvatud see kaart), et Kutsuda Eriliselt 1 MAA koletis oma käest. Selle efekti abil Eriliselt Kutsutud koletis hävitatakse, kui "<M6699>Avalanching Aussa<M>" eemaldatakse sinu väljalt.

source: Raging Eria
et: Raev Eria

source: Once per turn, you can Tribute 1 WATER monster you control (except this card) to Special Summon 1 WATER monster from your hand. The monster Special Summoned by this effect is destroyed if "<M6700>Raging Eria<M>" is removed from your side of the field.
et: Korra ühe korra käigu jooksul, võid ohverdada 1 VEE koletise, mida sa kontrollid (välja arvatud see kaart), et Kutsuda Eriliselt 1 VEE koletis oma käest. Selle efekti abil Eriliselt Kutsutud koletis hävitatakse, kui "<M6700>Raging Eria<M>" eemaldatakse sinu väljalt.

source: Blazing Hiita
et: Põlev Hiita

source: Once per turn, you can Tribute 1 FIRE monster (except this card) to Special Summon 1 FIRE monster from your hand. The monster Special Summoned by this effect is destroyed if "<M6701>Blazing Hiita<M>" is removed from your side of the field.
et: Korra ühe korra käigu jooksul, võid ohverdada 1 TULEKAHJU koletise (välja arvatud see kaart), et Kutsuda Eriliselt 1 TULEKAHJU koletis oma käest. Selle efekti abil Eriliselt Kutsutud koletis hävitatakse, kui "<M6701>Leegitsev Hiita<M>" eemaldatakse sinu väljalt.

source: Storming Wynn
et: Tormine Wynn
