Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: 1 "Gem-Knight" monster + 1 Thunder-Type monster This monster can only be Special Summoned by Fusion Summon (from the Extra Deck). Once per turn: You can send 1 "Gem-Knight" card from your hand to the Graveyard to target 1 face-up card on the field; destroy it.
et: 1 "Gem-Knight" koletis + 1 Äikese-tüüpi koletis Selle koletise saab eriliselt kutsuda ainult fusion-summoniga (lisapakist). Kord ühe käigu jooksul: Sa võid saata 1 "Gem-Knight" kaardi oma käest hauakambrisse, et sihtida 1 avatud kaarti väljal; hävita see.

source: 1 Tuner + 1 or more non-Tuner FIRE monsters<BR>When this card is Synchro Summoned, send 1 card from your hand to the Graveyard. When this card is targeted by a card effect, you can remove from play 1 "Laval" monster from your Graveyard to negate the activation of that card effect, and destroy that card.
et: 1 Tuner + 1 või rohkem mitte-Tuner TULEKAHJU koletist<BR>Kui see kaart on Sünkro Kutsutud, saada 1 kaart oma käest Hauakambrisse. Kui see kaart on sihitud kaardi efektiga, võid mängust eemaldada 1 "Laval" koletise oma Hauakambrist, et selle kaardi efekti aktiveerimine tühistada ja see kaart hävitada.

source: 1 "Vylon" Tuner + 1 or more non-Tuner monsters<BR>When this card is Synchro Summoned, select 1 Equip Spell Card in your Graveyard and equip it to this card. While this card is equipped with an Equip Card, this card cannot be destroyed by the effects of Spell/Trap Cards, except Equip Cards.
et: 1 "Vylon" Tuner + 1 või rohkem mitte-Tuner koletist<BR>Kui see kaart on Sünkro Kutsutud, vali 1 Varustuse Võlukaart oma Hauakambris ja varusta see sellele kaardile. Kui see kaart on varustatud Varustuse Kaardiga, ei saa seda kaarti hävitada Võlu/Lõksukaartide efektide poolt, välja arvatud Varustuse Kaardid.

source: 2 Tuners + 1 non-Tuner "Vylon" monster<BR>When this card is Synchro Summoned, destroy all face-up Normal Summoned monsters on the field. Once per turn, you can select 1 "Vylon" monster in your Graveyard, and equip it to this card as an Equip Card. When the effect of an Effect Monster is activated, you can send 1 Equip Card equipped to this card to the Graveyard to negate that activation and destroy that monster.
et: 2 Tunerit + 1 mitte-Tuner "Vylon" koletis<BR>Kui see kaart on Sünkrosummonitud, hävita kõik avatud Normalsummonitud koletised väljal. Kord ühe käigu jooksul saad valida 1 "Vylon" koletise oma Hauas ja kinnitada see kaart sellele kui Varustuskaart. Kui Efektikoletise efekt aktiveeritakse, saad saata 1 sellele kaardile kinnitatud Varustuskaart Hauale, et see aktiveerimine tühistada ja see koletis hävitada.

source: 1 Tuner + 1 or more non-Tuner "Gusto" monsters<BR>When this card is Synchro Summoned: You can add 1 "Gusto" card from your Graveyard to the hand. Your opponent takes all Battle Damage you would take from battles involving "Gusto" monsters you control. This card cannot be destroyed by battle.
et: 1 Tuner + 1 või rohkem mitte-Tuner "Gusto" koletist<BR>Kui see kaart on Sünkrosummonitud: Sa võid lisada 1 "Gusto" kaardi oma Hauakambrist kätte. Sinu vastane saab kogu Lahingukahju, mida sa saaksid lahingutest, mis hõlmavad sinu kontrollitavaid "Gusto" koletisi. Seda kaarti ei saa lahingus hävitada.

source: Vylon Component
et: Vylon Komponent

source: Equip only to a "Vylon" monster. During battle between that equipped monster and a Defense Position, inflict piercing Battle Damage to your opponent. If this face-up card is sent to the Graveyard, you can add 1 "Vylon" Spell Card from your Deck to your hand.
et: Varusta ainult "Vylon" koletisega. Lahingu ajal selle varustatud koletise ja kaitsepositsioonis oleva koletise vahel, põhjusta vastasele läbistavat lahingukahju. Kui see avatud kaart saadetakse Hauakambrisse, saad lisada 1 "Vylon" loitsukaardi oma pakist oma kätte.

source: When a face-up "Vylon" Equip Card(s) you control is destroyed, you can Special Summon "Vylon" Tuner monsters from your Deck up to the number of Equip Cards destroyed. The Special Summoned monster(s) can only be used as a Synchro Material Monster for the Synchro Summon of a "Vylon" monster.
et: Kui sinu kontrolli all olevad avatud "Vylon" Varustuskaardid hävitatakse, saad oma pakist eriliselt kutsuda "Vylon" Häälestaja koletisi kuni hävitatud Varustuskaartide arvuni. Eriliselt kutsutud koletisi saab kasutada ainult "Vylon" koletise Sünkrokutsumiseks Sünkromaterjalina.

source: Forbidden Arts of the Gishki
et: Gishki keelatud kunstid

source: This card is used to Ritual Summon a "Gishki" Ritual Monster. You must also Tribute monsters from either side of the field whose total Levels are equal to the Level of the Ritual Monster you are attempting to Ritual Summon. The ATK of the monster Ritual Summoned by this effect is halved. You cannot conduct your Battle Phase during the same turn you activate this card.
et: Seda kaarti kasutatakse "Gishki" rituaalikoletise rituaalsummonimiseks. Sa pead ka ohverdama koletisi mõlemalt väljaku poolelt, mille kogutasemed on võrdsed rituaalikoletise tasemega, mida sa üritad rituaalsummonida. Selle efekti abil rituaalsummonitud koletise ATK on poole väiksem. Sa ei saa oma lahingufaasi läbi viia samal käigul, kui aktiveerid selle kaardi.

source: Pyroxene Fusion
et: Pürokseeni Sulandumine

source: Send, from your hand or side of the field to your Graveyard, Fusion Material Monsters listed on a "Gem-Knight" Fusion Monster Card, and Special Summon that monster from your Extra Deck (This Special Summon is treated as a Fusion Summon).
et: Saada oma käest või väljakupoolelt oma Hauakambrisse Fusion Material Monsters, mis on loetletud "Gem-Knight" Fusion Monster Card'il, ja Special Summon see koletis oma Extra Deck'ist (See Special Summon käsitletakse kui Fusion Summon).

source: Infestation Ripples
et: Nakatumise lained

source: Pay 500 Life Points and select 1 Level 4 or lower "Steelswarm" monster in your Graveyard. Special Summon it.
et: Makske 500 Elupunkti ja vali oma Hauakambris 1 tase 4 või madalam "Steelswarm" koletis. Kutsu see eriliselt välja.

source: Means of Infestation
et: Nakatumise vahendid

source: Activate by sending 1 "Steelswarm" monster from your Deck to your Graveyard and select 1 face-up "Steelswarm" monster you control. The selected monster gains 800 ATK until the End Phase.
et: Aktiveeri, saates 1 "Steelswarm" koletis oma pakist hauakambrisse ja valides 1 avatud "Steelswarm" koletise, mida sa kontrollid. Valitud koletis saab 800 ATK juurde kuni lõppfaasini.

source: Barbaroid, the Ultimate Battle Machine
et: Barbaroid, Ülim Lahingumasin

source: 5 "roid" Machine-Type monsters. This card can attack twice during the same Battle Phase. If this card attacks an opponent's monster, negate the effect(s) of the attack target after damage calculation. If this card destroys an opponent's monster by battle, inflict 1000 damage to your opponent. This card cannot attack your opponent directly.
et: 5 "roid" tüüpi Masinat. See kaart võib rünnata kaks korda sama Lahingu Faasi jooksul. Kui see kaart ründab vastase koletist, tühista rünnaku sihtmärgi efekt(id) pärast kahju arvutamist. Kui see kaart hävitab vastase koletise lahingus, põhjusta oma vastasele 1000 kahju. See kaart ei saa rünnata otse sinu vastast.

source: Fallen Angel of Roses
et: Rooside langenud ingel

source: You can return 1 face-up Plant-Type monster you control to the hand, except "<M9420>Fallen Angel of Roses<M>", and Special Summon this card from your hand. If this card is Special Summoned this way, remove it from play when it is removed from the field.
et: Saad ühe oma kontrollitava avatud Taim-tüüpi koletise, välja arvatud "<M9420>Rooside Langenu Ingel<M>", käesolevasse kätte tagasi saata ja selle kaardi oma käest eriliselt välja kutsuda. Kui see kaart kutsutakse sel viisil eriliselt välja, eemalda see mängust, kui see väljakult eemaldatakse.

source: Machina Cannon
et: Masina Kahur

source: This card cannot be Normal Summoned or Set. This card can only Special Summoned by sending any number of Machine-Type monsters from your hand to the Graveyard. If this card is Special Summoned by its own effect, it gains 800 ATK for each monster sent to the Graveyard for its Special Summon.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti saab eriliselt kutsuda ainult siis, kui saadad oma käest ükskõik millise arvu Masinatüüpi koletisi hauakambrisse. Kui see kaart kutsutakse eriliselt välja omaenda efekti abil, saab see iga hauakambrisse saadetud koletise eest, mis eriliseks kutsumiseks saadeti, 800 ATK juurde.

source: When this card is sent to the Graveyard, randomly select 1 card in your opponent's hand, and remove it from play until the End Phase. The effect of "<M9435>Snap Dragon<M>" can only be used once per turn.
et: Kui see kaart saadetakse Hauakambrisse, vali juhuslikult 1 kaart oma vastase käest ja eemalda see mängust kuni Lõppfaasini. "<M9435>Snap Dragoni<M>" efekti saab kasutada ainult üks kord käigu jooksul.

source: Gladiator Beast Lanista
et: Gladiaatorikutsar Lanista

source: When this card is Special Summoned by the effect of a "Gladiator Beast" monster: Target 1 "Gladiator Beast" monster from your Graveyard; banish that target, and this card's name becomes the target's name until the End Phase. At the end of the Battle Phase, if this card attacked or was attacked: You can shuffle this card into the Deck; Special Summon 1 "Gladiator Beast" monster from your Deck, except "<M9436>Gladiator Beast Lanista<M>".
et: Kui see kaart on eriliselt kutsutud "Gladiator Beast" koletise efekti tõttu: Sihtige 1 "Gladiator Beast" koletis oma Hauakambrist; pagendage see sihtmärk ja selle kaardi nimi muutub sihtmärgi nimeks kuni Lõppfaasini. Lahingufaasi lõpus, kui see kaart ründas või seda rünnati: Saate selle kaardi segada tagasi pakki; eriliselt kutsuge 1 "Gladiator Beast" koletis oma pakist, välja arvatud "<M9436>Gladiator Beast Lanista<M>".

source: Blackwing - Jin the Rain Shadow
et: Mustatiib - Jin Vihmavarju

source: If this card battles with a monster whose DEF is lower than this card's ATK, destroy that monster immediately with this card's effect (without applying damage calculation).
et: Kui see kaart võitleb koletisega, kelle DEF on madalam kui selle kaardi ATK, hävita see koletis kohe selle kaardi efektiga (ilma kahju arvutamist rakendamata).

source: Scrap Orthros
et: Rämps-Orthros

source: This card cannot be Normal Summoned or Set.This card can only be Special Summoned by controlling a face-up "Scrap" monster. When Special Summoned this way, select 1 face-up "Scrap" monster you control, and destroy it. If this card is destroyed by the effect of a "Scrap" card and sent to the Graveyard, you can select 1 "Scrap" monster in your Graveyard, except "<M9438>Scrap Orthros<M>", and add it to your hand.
et: Seda kaarti ei saa tavaliselt kutsuda ega asetada. Seda kaarti saab eriliselt kutsuda ainult siis, kui kontrollid avatud "Scrap" koletist. Kui see on eriliselt kutsutud sel viisil, vali 1 avatud "Scrap" koletis, mida kontrollid, ja hävita see. Kui see kaart hävitatakse "Scrap" kaardi efekti tõttu ja saadetakse Hauakambrisse, saad valida 1 "Scrap" koletise oma Hauakambris, välja arvatud "<M9438>Scrap Orthros<M>", ja lisada selle oma kätte.

source: Elemental HERO Nova Master
et: Elementaalne KANGELANE Nova Meister

source: 11 "Elemental HERO" monster + 1 FIRE monsterMust be Fusion Summoned and cannot be Special Summoned in other ways. If this card destroys an opponent's monster by battle: Draw 1 card.
et: 11 "Elemental HERO" koletist + 1 TULE koletisPeab olema Fusion Summoned ja ei saa olla Special Summoned muul viisil. Kui see kaart hävitab lahingus vastase koletise: Tõmba 1 kaart.

source: Naturia Eggplant
et: Naturia Baklažaan

source: When this card is sent from the field to the Graveyard, you can select 1 "Naturia" monster in your Graveyard, except "<M9440>Naturia Eggplant<M>", and add it to your hand.
et: Kui see kaart saadetakse väljakult Hauakambrisse, saad valida 1 "Naturia" koletise oma Hauakambris, välja arvatud "<M9440>Naturia Baklažaan<M>", ja lisada see oma kätte.

source: Gem-Turtle
et: Gem-Kilpkonn

source: FLIP: You can add 1 "<M8918>Gem-Knight Fusion<M>" from your Deck to your hand.
et: FLIP: Saad oma pakist ühe "<M8918>Gem-Knight Fusion<M>" oma kätte lisada.

source: Laval Lancelord
et: Laval Lancerüütel

source: You can Normal Summon this card without Tributing. If you do, this card is sent to the Graveyard during the End Phase. When this card on the field is destroyed and sent to the Graveyard, you can add 1 of your removed from play FIRE monsters to your hand.
et: Seda kaarti saab normaalset kutsuda ilma ohverdusteta. Kui teed seda, saadetakse see kaart lõppfaasis hauakambrisse. Kui see kaart väljal hävitatakse ja saadetakse hauakambrisse, saad lisada ühe oma mängust eemaldatud TULEKAHJU koletise oma kätte.

source: Gishki Beast
et: Gishki metsaline

source: When this card is Normal Summoned, you can select and Special Summon 1 Level 4 or lower "Gishki" monster from your Graveyard in face-up Defense Position.
et: Kui see kaart on Normaal-Kutsutud, saad valida ja Eriliselt Kutsuda 1 Tase 4 või madalama "Gishki" koletise oma Hauakambrist näoga ülespoole Kaitseasendisse.

source: 1 Tuner + 1 or more non-Tuner "X-Saber" monsters<BR>You can Tribute 1 "X-Saber" monster; this card gains 1 of these effects until the End Phase:<BR>● If this card battles a monster: Destroy that monster immediately with this card's effect (without damage calculation).<BR>● This card cannot be destroyed by the effects of Trap Cards.
et: 1 Tuner + 1 või rohkem mitte-Tuner "X-Saber" koletist<BR>Sa võid ohverdada 1 "X-Saber" koletise; see kaart saab ühe neist efektidest kuni End Phase'ini:<BR>● Kui see kaart võitleb koletisega: Hävita see koletis kohe selle kaardi efektiga (ilma kahju arvutamiseta).<BR>● Seda kaarti ei saa lõksukaartide efektidega hävitada.

source: If this card is destroyed by a card effect and sent to the Graveyard, you can Special Summon 1 "<M9446>Sorciere de Fleur<M>" from your Deck.
et: Kui see kaart hävitatakse kaardi efekti tõttu ja saadetakse Hauakambrisse, saad Sa eriliselt kutsuda 1 "<M9446>Sorciere de Fleur<M>" oma pakist.

source: When this card is Normal or Special Summoned, select 1 monster in your opponent's Graveyard. Special Summon that monster to your side of the field. It cannot attack your opponent directly, and is destroyed during the End Phase of this turn. The effect of "<M9446>Sorciere de Fleur<M>" can only be activated once per turn.
et: Kui see kaart on Normaal- või Erikutsutud, vali 1 koletis oma vastase Hauakambris. Erikutsu see koletis oma väljaku poolele. See ei saa rünnata sinu vastast otse ja hävitatakse selle käigu Lõppfaasis. "<M9446>Sorciere de Fleur<M>" efekti saab aktiveerida ainult üks kord käigu jooksul.

source: When this Set card is destroyed and sent to the Graveyard, select 1 Continuous Spell or Field Spell Card in your Graveyard, and add it to your hand.
et: Kui see seatud kaart hävitatakse ja saadetakse Hauakambrisse, vali 1 Pidev Võlu- või Väljavõlukaart oma Hauakambris ja lisa see oma kätte.

source: Blue Rose Dragon
et: Sinine Roosidraakon

source: When this card is destroyed and sent from the field to the Graveyard, you can select 11 "<M7898>Black Rose Dragon<M>" or 1 Plant-Type monster in your Graveyard, and Special Summon it.
et: Kui see kaart hävitatakse ja saadetakse väljakult hauakambrisse, saad valida 1 "<M7898>Black Rose Dragon<M>" või 1 Taimetüüpi koletise oma hauakambris ja kutsuda see eriliselt välja.

source: Vortex the Whirlwind
et: Vortex, keeristorm

source: 1 Tuner + 1 or more non-Tuner Winged Beast-Type monsters<BR>When this card is destroyed by battle and sent to the Graveyard, you can Special Summon 1 Level 4 or lower Winged Beast-Type monster from your Deck.
et: 1 Häälestaja + 1 või rohkem mitte-Häälestaja Tiivulise Metssiga tüüpi koletist<BR>Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse, saad sa eriliselt kutsuda 1 taseme 4 või madalama Tiivulise Metssiga tüüpi koletise oma pakist.

source: Vanadis of the Nordic Ascendant
et: Põhjala tõusja Vanadis

source: You can substitute this card for any 1 "Nordic" Tuner monster for a Synchro Summon. If this card is used as a Synchro Material Monster, all other Synchro Material Monsters must be "Nordic" monsters. Once per turn, you can send 1 "Nordic" monster from your Deck to the Graveyard to change this card's Level to the Level of the monster you sent to the Graveyard, until the End Phase.
et: Saate selle kaardi asendada ükskõik millise "Nordic" Tuner koletisega Sünkro Kutsumiseks. Kui seda kaarti kasutatakse Sünkro Materjal Koletisena, peavad kõik teised Sünkro Materjal Koletised olema "Nordic" koletised. Kord ühe käigu jooksul saate saata ühe "Nordic" koletise oma pakist Hauakambrisse, et muuta selle kaardi tase samaks tasemeks, mis on koletisel, mille saatsite Hauakambrisse, kuni Lõppfaasini.

source: Shien's Daredevil
et: Shieni Julgeolek

source: When this card is Normal Summoned, place 1 Bushido Counter on it (max. 1). This card gains 300 ATK while it has a Bushido Counter on it. Once per turn, you can remove 1 Bushido Counter from this card to select 1 face-up card on the field that you can place a Bushido Counter on, and place 1 Bushido Counter on it.
et: Kui see kaart on normaalset kutsutud, pane sellele 1 Bushido loendur (maks. 1). See kaart saab 300 ATK juurde, kui sellel on Bushido loendur. Kord käigu jooksul saad eemaldada 1 Bushido loenduri sellelt kaardilt, et valida 1 avatud kaart väljal, millele saad panna Bushido loenduri, ja pane sellele 1 Bushido loendur.

source: This card must attack if able. When this face-up Attack Position card is selected as an attack target, change it to Defense Position. If this card attacks, change it to Defense Position at the end of the Battle Phase.
et: See kaart peab ründama, kui see on võimalik. Kui see avatud Rünnakupositsioonis kaart valitakse rünnaku sihtmärgiks, muuda see Kaitsepositsiooni. Kui see kaart ründab, muuda see Kaitsepositsiooni Lahingufaasi lõpus.

source: Scrap Breaker
et: Rämpsumurdja

source: If your opponent controls a monster, you can Special Summon this card from your hand. When this card is Special Summoned this way, select 1 face-up "Scrap" monster you control, and destroy it.
et: Kui sinu vastasel on koletis, saad selle kaardi oma käest eriliselt kutsuda. Kui see kaart kutsutakse sel viisil eriliselt välja, vali 1 avatud "Scrap" koletis, mida sa kontrollid, ja hävita see.

source: Chaos Hunter
et: Kaosekütt

source: When your opponent Special Summons a monster, you can discard 1 card to Special Summon this card from your hand. Your opponent cannot remove cards from play.
et: Kui sinu vastane kutsub eriliselt välja koletise, võid sa ühe kaardi ära visata, et see kaart oma käest eriliselt välja kutsuda. Sinu vastane ei saa kaarte mängust eemaldada.

source: You can activate this effect during either player's turn by sending this card from your hand to the Graveyard. This turn, each time your opponent Special Summon a monster(s), draw 1 card. You can only activate "<M9455>Maxx "C"<M>" once per turn.
et: Saad seda efekti aktiveerida mõlema mängija käigu ajal, saates selle kaardi oma käest Hauakambrisse. Sellel käigul, iga kord kui su vastane kutsub eriliselt välja koletise(d), tõmba 1 kaart. Sa saad aktiveerida "<M9455>Maxx "C"<M>" ainult korra käigu jooksul.

source: The Nordic Lights
et: Põhjamaade tuled

source: "Nordic" monsters on the field cannot be destroyed by battle. When this card on the field is destroyed, destroy all face-up "Nordic" monsters.
et: Väljal olevad "Nordic" koletised ei saa lahingus hävitatud. Kui see kaart väljal hävitatakse, hävita kõik avatud "Nordic" koletised.

source: Nordic Relic Megingjord
et: Põhjala Relikt Megingjord

source: Select 1 face-up "Aesir" or "Nordic" monster you control. Its ATK/DEF become double the original ATK/DEF, until the End Phase. That monster cannot attack your opponent directly this turn.
et: Vali 1 avatud "Aesir" või "Nordic" koletis, mida sa kontrollid. Selle ATK/DEF muutuvad algse ATK/DEF kahekordseks kuni End Phase'ini. See koletis ei saa sel käigul sinu vastast otse rünnata.

source: Six Strike - Thunder Blast
et: Kuue löök - Äikeseplahvatus

source: Remove 1 Bushido Counter on the field to activate one of the following effects:<BR>●Select 1 monster your opponent controls, and destroy it.<BR>●Select 1 card your opponent controls, and return it to the hand.
et: Eemaldage 1 Bushido loendur väljal, et aktiveerida üks järgmistest efektidest:<BR>●Valige 1 koletis, mida teie vastane kontrollib, ja hävitage see.<BR>●Valige 1 kaart, mida teie vastane kontrollib, ja tagastage see kätte.

source: Junk Servant
et: Rämekäskija

source: If you control a face-up "Junk" monster, you can Special Summon this card from your hand.
et: Kui sa kontrollid avatud "Junk" koletist, saad selle kaardi oma käest eriliselt kutsuda.

source: Unknown Synchron
et: Tundmatu Sünkron

source: If your opponent controls a monster and you control no monsters, you can Special Summon this card from your hand. Each player can only use the effect of "<M9473>Unknown Synchron<M>" once per Duel.
et: Kui sinu vastasel on koletis ja sul ei ole koletisi, saad selle kaardi oma käest eriliselt kutsuda. Iga mängija saab "<M9473>Unknown Synchron<M>" efekti kasutada ainult üks kord duelli jooksul.

source: Salvage Warrior
et: Päästmissõdalane

source: When this card is Tribute Summoned, you can Special Summon 1 Tuner Monster from your hand or Graveyard.
et: Kui see kaart on ohverdamisega välja kutsutud, saad eriliselt välja kutsuda 1 häälestuskoletise oma käest või hauast.

source: Necro Defender
et: Necro Kaitsja

source: During your Main Phase, you can remove from play this card from your Graveyard to select 1 monster you control. Until your opponent's next End Phase, that monster cannot be destroyed by battle, and you take no Battle Damage from battles involving it.
et: Oma peafaasiajal saad sa eemaldada selle kaardi oma kalmistult mängust, et valida 1 koletis, mida sa kontrollid. Kuni sinu vastase järgmise lõppfaasini ei saa seda koletist lahingus hävitada ja sa ei saa lahingukahju lahingutest, milles see osaleb.

source: Mystic Piper
et: Müstiline Torupillimängija

source: You can Tribute this card to draw and reveal 1 card. If that card is a Level 1 Monster Card, draw 1 more card. The effect of "<M9476>Mystic Piper<M>" can only be activated once per turn.
et: Saad selle kaardi ohverdada, et tõmmata ja paljastada 1 kaart. Kui see kaart on 1. taseme koletisekaart, tõmba veel 1 kaart. "<M9476>Mystic Piper<M>" efekti saab aktiveerida ainult üks kord käigu jooksul.

source: Force Resonator
et: Jõu Resonaator

source: You can send this face-up card you control to the Graveyard to select 1 face-up monster you control. If that monster attacks during this turn, your opponent cannot activate the effects of any Spell, Trap, or Effect Monster Cards that target a monster(s), until the end of the Damage Step.
et: Saadad selle avatud kaardi, mida sa kontrollid, Hauakambrisse, et valida 1 avatud koletis, mida sa kontrollid. Kui see koletis ründab sellel käigul, ei saa sinu vastane aktiveerida ühegi Loitsu, Lõksu või Efektkoletise kaardi efekte, mis sihivad koletist(e), kuni Kahjustuse sammu lõpuni.

source: Clock Resonator
et: Kella Resonator

source: Once per turn, this face-up Defense Position card cannot be destroyed by battle or by card effects.
et: Kord ühe korra käigu jooksul ei saa seda avatud Kaitseasendis kaarti hävitada lahingus ega kaardi efektide tõttu.

source: Blackwing - Hillen the Tengu-wind
et: Mustatiib - Hillen, Tengu-tuul
