Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: Each time a Fairy-Type monster(s) is Summoned, inflict 600 damage to your opponent. Once per turn, you can send 1 face-up Fairy-Type monster you control, except "Athena", to the Graveyard to select 1 Fairy-Type monster from your Graveyard, except "Athena", and Special Summon it.
et: Iga kord, kui kutsutakse välja haldjatüüpi koletis(ed), tekitage oma vastasele 600 kahju. Kord ühe käigu jooksul võite saata ühe ülespööratud haldjatüüpi koletise, mida te kontrollite, välja arvatud "Athena", hauakambrisse, et valida üks haldjatüüpi koletis oma hauakambrist, välja arvatud "Athena", ja kutsuda see eriliselt välja.

source: Hecatrice
et: Hekatriits

source: You can discard this card to the Graveyard to add 1 "<M7573>Valhalla, Hall of the Fallen<M>" from your Deck to your hand.
et: Saad selle kaardi Hauakambrisse, et lisada oma pakist 1 "<M7573>Valhalla, Hall of the Fallen<M>" oma kätte.

source: Valhalla, Hall of the Fallen
et: Valhalla, langenute saal

source: Once per turn, if you control no monsters, you can Special Summon 1 Fairy-Type monster from your hand.
et: Kord ühe korra käigu jooksul, kui sul pole ühtegi koletist, saad oma käest eriliselt kutsuda 1 haldjatüüpi koletise.

source: Honest
et: Aus

source: During your Main Phase, you can return this card from the field to its owner's hand. During either player's Damage Step, when a face-up LIGHT monster you control battles, you can send this card from your hand to the Graveyard to have that monster gain ATK equal to the ATK of the opponent's monster it is battling, until the End Phase.
et: Oma peafaasiajal saad selle kaardi väljakult omaniku kätte tagasi tuua. Mõlema mängija Kahjustusetapi ajal, kui sinu kontrolli all olev avatud VALGUS koletis võitleb, saad saata selle kaardi oma käest Hauakambrisse, et see koletis saaks ATK-d juurde võrdse vastase koletise ATK-ga, millega ta võitleb, kuni Lõppfaasini.

source: Cross Porter
et: Ristkandja

source: You can send 1 monster you control to the Graveyard and Special Summon 1 "Neo-Spacian" monster from your hand. When this card is sent to the Graveyard, you can add 1 "Neo-Spacian" monster from your Deck to your hand.
et: Saadad ühe sinu kontrolli all oleva koletise Hauakambrisse ja Kutsu eriliselt välja 1 "Neo-Spacian" koletis oma käest. Kui see kaart saadetakse Hauakambrisse, saad lisada 1 "Neo-Spacian" koletis oma Paki seest oma kätte.

source: Miracle Flipper
et: Imeflipper

source: If you control a1 "<M7576>Miracle Flipper<M>", you cannot Summon this card. Your opponent cannot select another face-up monster as an attack target. If this card is destroyed by battle, Special Summon it to your opponent's side of the field at the end of the Battle Phase. If this card is destroyed by the effect of a Spell or Trap Card, destroy 1 monster your opponent controls.
et: Kui sa kontrollid "<M7576>Miracle Flipper<M>", ei saa sa seda kaarti välja kutsuda. Sinu vastane ei saa valida teist avatud koletist rünnaku sihtmärgiks. Kui see kaart hävitatakse lahingus, kutsu see eriliselt välja oma vastase väljale lahingufaasi lõpus. Kui see kaart hävitatakse loitsu või lõksukaardi efekti tõttu, hävita 1 koletis, mida sinu vastane kontrollib.

source: Destiny Hero - Dread Servant
et: Saatuskangel - Hirmu Teener

source: When this card is Normal Summoned: Place 1 Clock Counter on "<M6668>Clock Tower Prison<M>". When this card is destroyed by battle and sent to the Graveyard: You can target 1 Spell/Trap Card you control; destroy that target.
et: Kui see kaart on Normaal-Kutsutud: Aseta 1 Kella Loendur "<M6668>Clock Tower Prison<M>" peale. Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse: Sa võid sihtida 1 Loitsu/Lõksu Kaarti, mida sa kontrollid; hävita see sihtmärk.

source: Volcanic Queen
et: Vulkaanikuninganna

source: This card cannot be Normal Summoned or Set. This card can only be Special Summoned from your hand to your opponent's side of the field by Tributing 1 monster your opponent controls. If you Special Summon this card, you cannot Normal Summon or Set this turn.<BR>Once per turn, you can send 1 other card you control to the Graveyard to inflict 1000 damage to your opponent. During your End Phase, either Tribute 1 other monster or take 1000 damage.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti saab eriliselt kutsuda ainult oma käest vastase väljaku poolele, ohverdades 1 koletise, mida vastane kontrollib. Kui sa kutsud selle kaardi eriliselt, ei saa sa sellel käigul normaalselt kutsuda ega asetada.<BR>Kord käigu jooksul saad saata 1 teise kaardi, mida sa kontrollid, hauakambrisse, et tekitada vastasele 1000 kahju. Oma lõppfaasis ohverda kas 1 teine koletis või saa 1000 kahju.

source: Jinzo - Returner
et: Jinzo - Tagasipöörduja

source: This card can attack your opponent directly. When this card is sent to the Graveyard, you can Special Summon 1 "<M4758>Jinzo<M>" from your Graveyard. Destroy it during your End Phase.
et: See kaart võib rünnata sinu vastast otse. Kui see kaart saadetakse Hauakambrisse, saad sa eriliselt kutsuda 1 "<M4758>Jinzo<M>" oma Hauakambrist. Hävita see oma lõppfaasis.

source: Jinzo - Lord
et: Jinzo - Isand

source: This card cannot be Normal Summoned or Set. This card cannot be Special Summoned except by sending 1 face-up "<M4758>Jinzo<M>" you control to the Graveyard. Trap Cards cannot be activated and the effects of all Trap Cards on the field are negated. Once per turn, you can destroy all face-up Trap Cards. Inflict 300 damage to your opponent for each card destroyed by this effect.
et: Seda kaarti ei saa tavaliselt kutsuda ega asetada. Seda kaarti ei saa eriliselt kutsuda, välja arvatud juhul, kui saadate ühe ülespoole suunatud "<M4758>Jinzo<M>" oma kontrolli all olevast kaardist hauakambrisse. Lõksukaartide aktiveerimine on keelatud ja kõigi väljakul olevate lõksukaartide efektid on tühistatud. Kord ühe käigu jooksul saate hävitada kõik ülespoole suunatud lõksukaardid. Tehke oma vastasele 300 kahju iga selle efekti abil hävitatud kaardi eest.

source: Arcana Force 0 - The Fool
et: Arkana Jõud 0 - Narr

source: This card cannot be destroyed by battle. This card cannot be changed to Defense Position, except with a card effect. When this card is Summoned, toss a coin:<BR>● Heads: Negate the effects of your Spells, Traps and Effect Monsters' effects that target this card, and destroy them.<BR>● Tails: Negate the effects of your opponent's Spells, Traps and Effect Monsters' effects that target this card, and destroy them.
et: Seda kaarti ei saa lahingus hävitada. Seda kaarti ei saa muuta kaitsepositsiooniks, välja arvatud kaardi efektiga. Kui see kaart kutsutakse välja, viska münti:<BR>● Kull: Tühista oma Võlukaartide, Lõksukaartide ja Efektikoletiste efektid, mis sihivad seda kaarti, ja hävita need.<BR>● Kiri: Tühista oma vastase Võlukaartide, Lõksukaartide ja Efektikoletiste efektid, mis sihivad seda kaarti, ja hävita need.

source: Arcana Force I - The Magician
et: Arkaani jõud I - Maag

source: When this card is Summoned, toss a coin.<BR>● Heads: When a Spell Card is activated, this card's ATK becomes double its original ATK until the End Phase of that turn.<BR>● Tails: When a Spell Card is activated, your opponent gains 500 Life Points.
et: Kui see kaart kutsutakse välja, viska münti.<BR>● Kull: Kui aktiveeritakse Võlukaart, muutub selle kaardi rünnakupunktid (ATK) kahekordseks oma algsest rünnakupunktist kuni selle käigu lõppfaasini.<BR>● Kiri: Kui aktiveeritakse Võlukaart, saab sinu vastane 500 Elupunkti juurde.

source: Arcana Force III - The Empress
et: Arcana Force III - Keisrinna

source: When this card is Summoned, toss a coin.<BR>● Heads: Each time your opponent Normal Summons or Sets a monster, you can Special Summon 1 "Arcana Force" monster from your hand.<BR>● Tails: Each time your opponent Normal Summons or Sets a monster, send 1 card from your hand to the Graveyard.
et: Kui see kaart kutsutakse välja, viska münti.<BR>● Kull: Iga kord, kui su vastane kutsub välja või asetab koletise, saad sa oma käest eriliselt välja kutsuda 1 "Arcana Force" koletise.<BR>● Kiri: Iga kord, kui su vastane kutsub välja või asetab koletise, saada 1 kaart oma käest Hauakambrisse.

source: Arcana Force IV - The Emperor
et: Arkaani Jõud IV - Keiser

source: When this card is Summoned, toss a coin.<BR>● Heads: All "Arcana Force" monsters you control gain 500 ATK.<BR>● Tails: All "Arcana Force" monsters you control lose 500 ATK.
et: Kui see kaart kutsutakse välja, viska münti.<BR>● Kull: Kõik sinu kontrolli all olevad "Arcana Force" koletised saavad 500 ATK juurde.<BR>● Kiri: Kõik sinu kontrolli all olevad "Arcana Force" koletised kaotavad 500 ATK.

source: Arcana Force VI - The Lovers
et: Arkaani Jõud VI - Armastajad

source: When this card is Summoned, toss a coin.<BR>● Heads: This card can be treated as 2 Tributes for the Tribute Summon of an "Arcana Force" monster.<BR>● Tails: You cannot Tribute Summon "Arcana Force" monsters.
et: Kui see kaart on välja kutsutud, viska münti.<BR>● Kull: Seda kaarti võib käsitleda kui 2 ohverdust "Arcana Force" koletise ohverdusväljakutse jaoks.<BR>● Kiri: Sa ei saa ohverdusväljakutsuda "Arcana Force" koletisi.

source: Arcana Force VII - The Chariot
et: Arkana Jõud VII - Sõjavanker

source: When this card is Summoned, toss a coin.<BR>● Heads: If this card destroys an opponent's monster by battle, you can Special Summon that monster to your side of the field.<BR>● Tails: Your opponent gains control of this card.
et: Kui see kaart kutsutakse välja, viska münti.<BR>● Kull: Kui see kaart hävitab lahingus vastase koletise, saad selle koletise eriliselt kutsuda oma väljale.<BR>● Kiri: Sinu vastane saab selle kaardi kontrolli alla.

source: Arcana Force XIV - Temperance
et: Arkaani Jõud XIV - Mõõdukus

source: During either player's turn, you can discard this card to reduce the damage you take from a battle to 0. When this card is Summoned, toss a coin.<BR>● Heads: Halve all Battle Damage you take.<BR>● Tails: Halve all Battle Damage your opponent takes.
et: Mõlema mängija käigu ajal saad selle kaardi ära visata, et vähendada lahingukahju, mida sa saad, nullini. Kui see kaart kutsutakse välja, viska münti.<BR>● Kull: Vähenda kogu lahingukahju, mida sa saad, poole võrra.<BR>● Kiri: Vähenda kogu lahingukahju, mida su vastane saab, poole võrra.

source: Arcana Force XVIII - The Moon
et: Arkana Jõud XVIII - Kuu

source: When this card is Summoned, toss a coin.<BR>● Heads: During your Standby Phase, you can Special Summon 1 "<M3942>Moon Token<M>" (Fairy-Type/LIGHT/Level 1/ATK 0/DEF 0).<BR>● Tails: During each of your End Phases, select 1 monster you control and give control of it to your opponent.
et: Kui see kaart kutsutakse välja, viska münti.<BR>● Kull: Oma ootejärgus saad eriliselt välja kutsuda 1 "<M3942>Moon Token<M>" (Haldjatüüp/VALGUS/Tase 1/ATK 0/DEF 0).<BR>● Kiri: Iga oma lõppfaasi ajal vali 1 koletis, mida sa kontrollid, ja anna selle kontroll oma vastasele.

source: Arcana Force XXI - The World
et: Arkaani jõud XXI - Maailm

source: When this card is Summoned, toss a coin.<BR>● Heads: During your End Phase, you can send 2 monsters you control to the Graveyard to skip your opponent's next turn.<BR>● Tails: During your opponent's Draw Phase, add the top card of their Graveyard to their hand.
et: Kui see kaart on välja kutsutud, viska münti.<BR>● Kull: Oma lõppfaasis saad saata 2 sinu kontrolli all olevat koletist Hauakambrisse, et vahele jätta oma vastase järgmine käik.<BR>● Kiri: Oma vastase tõmbefaasis lisa nende Hauakambri pealmine kaart nende kätte.

source: Arcana Force EX - The Dark Ruler
et: Arcana Force EX - Tume Valitseja

source: This card cannot be Normal Summoned or Set. This card cannot be Special Summoned except by sending 3 monsters you control to the Graveyard. When this card is Special Summoned, toss a coin.<BR>● Heads: This card can attack twice during the same Battle Phase. If this card battles twice using this effect, it is changed to Defense Position at the end of the Battle Phase. This card's battle position cannot be changed until the end of your next turn, except with a card effect.<BR>● Tails: If this card is destroyed, destroy all cards on the field.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti ei saa eriliselt kutsuda, välja arvatud juhul, kui saadad 3 sinu kontrolli all olevat koletist hauakambrisse. Kui see kaart kutsutakse eriliselt, viska münti.<BR>● Kull: See kaart võib rünnata kaks korda sama lahingufaasi jooksul. Kui see kaart ründab kaks korda selle efekti abil, muudetakse see lahingufaasi lõpus kaitsepositsiooni. Selle kaardi lahingupositsiooni ei saa muuta enne sinu järgmise käigu lõppu, välja arvatud kaardi efekti abil.<BR>● Kiri: Kui see kaart hävitatakse, hävita kõik kaardid väljal.

source: Jain, Lightsworn Paladin
et: Jain, Valgussõdalane Paladin

source: If this card attacks an opponent's monster, it gains 300 ATK during the Damage Step only. During each of your End Phases: Send the top 2 cards of your Deck to the Graveyard. You must control this face-up card to activate and to resolve this effect.
et: Kui see kaart ründab vastase koletist, saab see ainult Kahjustuse Arvutamise sammu ajal 300 ATK juurde. Iga oma lõppfaasi ajal: Saada oma paki kaks ülemist kaarti Hauakambrisse. Selle efekti aktiveerimiseks ja lahendamiseks pead kontrollima seda avatud kaarti.

source: Lyla, Lightsworn Sorceress
et: Lyla, Valgusevande Nõid

source: You can change this card from face-up Attack Position to face-up Defense Position and destroy 1 Spell or Trap Card your opponent controls. If you activate this effect, this card's battle position cannot be changed until the end of your next turn, except with a card effect. During each of your End Phases, send the top 3 cards of your Deck to the Graveyard.
et: Saad selle kaardi muuta avatud rünnakupositsioonist avatud kaitsepositsiooniks ja hävitada 1 loitsu- või lõksukaart, mida sinu vastane kontrollib. Kui aktiveerid selle efekti, ei saa selle kaardi lahingupositsiooni muuta kuni sinu järgmise käigu lõpuni, välja arvatud kaardi efektiga. Iga oma lõppfaasi ajal saada oma paki kolm ülemist kaarti hauakambrisse.

source: Garoth, Lightsworn Warrior
et: Garoth, Valgussõdalane

source: Each time a card(s) is sent from your Deck to the Graveyard by the effect of a "Lightsworn" monster you control, except1 "<M7593>Garoth, Lightsworn Warrior<M>": Send the top 2 cards of your Deck to the Graveyard, then draw 1 card for each "Lightsworn" monster sent to the Graveyard by this effect.
et: Iga kord, kui sinu pakist saadetakse kaart või kaardid surnuaeda sinu kontrollitava "Lightsworn" koletise efekti tõttu, välja arvatud "<M7593>Garoth, Lightsworn Warrior<M>": Saada oma paki kaks ülemist kaarti surnuaeda, seejärel tõmba üks kaart iga "Lightsworn" koletise kohta, mis selle efekti tõttu surnuaeda saadeti.

source: Lumina, Lightsworn Summoner
et: Lumina, Valgusevangeeliumi Kutsuja

source: Once per turn: You can discard 1 card, then target 1 Level 4 or lower "Lightsworn" monster in your Graveyard; Special Summon that target. During each of your End Phases: Send the top 3 cards of your Deck to the Graveyard. You must control this face-up card to activate and to resolve this effect.
et: Kord korra: Sa võid ühe kaardi ära visata, seejärel sihtida ühte 4. taseme või madalama "Lightsworn" koletist oma Hauakambris; Kutsu see sihtmärk eriliselt välja. Iga oma lõppfaasi ajal: Saada oma paki kolm ülemist kaarti Hauakambrisse. Selle efekti aktiveerimiseks ja lahendamiseks pead sa kontrollima seda avatud kaarti.

source: Ryko, Lightsworn Hunter
et: Ryko, Valgusevande Kütija

source: FLIP: You can select 1 card on the field, and destroy it. Send the top 3 cards of your Deck to the Graveyard.
et: FLIP: Saad valida 1 kaardi väljal ja hävitada see. Saada oma paki 3 ülemist kaarti hauakambrisse.

source: Wulf, Lightsworn Beast
et: Wulf, Valgusevande Metsaline

source: Cannot be Normal Summoned or Set. When this card is sent from your Deck to the Graveyard: Special Summon it.
et: Ei saa normaalset kutsuda ega asetada. Kui see kaart saadetakse sinu pakist hauakambrisse: Kutsu see eriliselt välja.

source: Celestia, Lightsworn Angel
et: Celestia, Valgusevande Inglis

source: When you Tribute Summon this card by Tributing a "Lightsworn" monster, you can send the top 4 cards of your Deck to the Graveyard to destroy up to 2 cards your opponent controls.
et: Kui sa kutsud selle kaardi välja ohverdades "Lightsworn" koletise, saad saata oma paki 4 ülemist kaarti hauakambrisse, et hävitada kuni 2 kaarti, mida sinu vastane kontrollib.

source: Gragonith, Lightsworn Dragon
et: Gragonith, Valgusevuse Draakon

source: This card gains 300 ATK and DEF for each "Lightsworn" monster with a different name in your Graveyard. During battle between this attacking card and a Defense Position monster whose DEF is lower than the ATK of this card, inflict the difference as Battle Damage to your opponent. During each of your End Phases, send the top 3 cards of your Deck to the Graveyard.
et: See kaart saab 300 ATK ja DEF iga sinu kalmistul oleva erineva nimega "Lightsworn" koletise eest. Lahingu ajal selle ründava kaardi ja kaitsepositsioonis oleva koletise vahel, mille DEF on madalam kui selle kaardi ATK, põhjusta vahe oma vastasele lahingukahjuna. Iga oma lõppfaasi ajal saada oma paki kolm ülemist kaarti kalmistule.

source: Judgment Dragon
et: Kohtumõistja Draakon

source: Cannot be Normal Summoned or Set. Must be Special Summoned (from your hand) by having 4 or more "Lightsworn" monsters with different names in your Graveyard, and cannot be Special Summoned by other ways. You can pay 1000 Life Points; destroy all other cards on the field. During each of your End Phases: Send the top 4 cards of your Deck to the Graveyard. You must control this face-up card to activate and to resolve this effect.
et: Ei saa normaalset kutsuda ega asetada. Peab olema eriliselt kutsutud (teie käest), kui teie hauakambris on 4 või enam erineva nimega "Lightsworn" koletist, ja ei saa olla eriliselt kutsutud muul viisil. Võite maksta 1000 Elupunkti; hävitage kõik teised kaardid väljal. Iga teie lõppfaasi ajal: Saatke oma paki 4 ülemist kaarti hauakambrisse. Selle efekti aktiveerimiseks ja lahendamiseks peate kontrollima seda avatud kaarti.

source: Dark Valkyria
et: Tume Valküüria

source: This card is treated as a Normal Monster while face-up on the field or in the Graveyard. While this card is face-up on the field, you can Normal Summon it to have it be treated as an Effect Monster with this effect:<BR>● One time only, you can place 1 Spell Counter on this card. This card gains 300 ATK for each Spell Counter on it. You can remove 1 Spell Counter from this card to destroy 1 monster on the field.
et: See kaart loetakse tavaliseks koletiseks, kui see on lahinguväljal või hauas. Kui see kaart on lahinguväljal, võid selle tavaliselt kutsuda, et seda käsitletaks efektikoletisena järgmise efektiga:<BR>● Ainult üks kord võid sellele kaardile panna 1 loitsuloenduri. See kaart saab 300 ATK iga loitsuloenduri kohta. Võid eemaldada 1 loitsuloenduri sellelt kaardilt, et hävitada 1 koletis lahinguväljal.

source: Substitoad
et: Asendusvaraan

source: You can Tribute 1 monster to Special Summon 1 "Frog" monster from your Deck, except "<M4555>Frog the Jam<M>". "Frog" monsters, except "<M4555>Frog the Jam<M>", cannot be destroyed by battle.
et: Saad ohverdada 1 koletis, et Kutsuda Eriliselt 1 "Konna" koletis oma pakist, välja arvatud "<M4555>Frog the Jam<M>". "Konna" koletisi, välja arvatud "<M4555>Frog the Jam<M>", ei saa lahingus hävitada.

source: Unifrog
et: Ühtkonn

source: This card can attack your opponent directly. When this card successfully attacks directly, if you control a "Frog" monster other than "<M4555>Frog the Jam<M>" or "<M7602>Unifrog<M>", you can destroy 1 Spell or Trap your opponent controls.
et: See kaart võib rünnata sinu vastast otse. Kui see kaart ründab edukalt otse ja kui sa kontrollid mõnda "Konna" koletist peale "<M4555>Frog the Jam<M>" või "<M7602>Unifrog<M>", saad hävitada ühe Loitsu või Lõksu, mida sinu vastane kontrollib.

source: Batteryman Charger
et: Patareimees Laadija

source: When this card is Normal Summoned, you can Special Summon 1 "Batteryman" monster, except1 "<M7603>Batteryman Charger<M>", from your hand or Deck. This card gains 300 ATK and DEF for each Thunder-Type monster you control.
et: Kui see kaart on normaalset kutsutud, saad eriliselt kutsuda 1 "Batteryman" koletise, välja arvatud "<M7603>Batteryman Charger<M>", oma käest või pakist. See kaart saab 300 ATK ja DEF iga Äikese-tüüpi koletise eest, mida sa kontrollid.

source: Batteryman Industrial Strength
et: Tööstusliku Jõu Patareimees

source: This card cannot be Normal Summoned or Set. This card cannot be Special Summoned except by removing from play 2 "Batteryman" monsters from your Graveyard. Once per turn, you can remove from play 1 Thunder-Type monster from your Graveyard to destroy 1 monster and 1 Spell or Trap Card on the field.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti ei saa eriliselt kutsuda, välja arvatud eemaldades mängust 2 "Batteryman" koletist oma kalmistult. Kord ühe käigu jooksul võid eemaldada mängust 1 Äikese-tüüpi koletise oma kalmistult, et hävitada 1 koletis ja 1 Loitsu- või Lõksukaart väljal.

source: Batteryman Micro-Cell
et: Patareimees Mikro-Rakk

source: FLIP: Special Summon 1 Level 4 or lower "Batteryman" monster from your Deck, except1 "<M7605>Batteryman Micro-Cell<M>". After this card has been flipped face-up, when it is destroyed by battle and sent to the Graveyard, draw 1 card.
et: FLIP: Kutsu oma pakist 1 tase 4 või madalama tasemega "Batteryman" koletis, välja arvatud "<M7605>Batteryman Micro-Cell<M>". Pärast selle kaardi ümberpööramist, kui see hävitatakse lahingus ja saadetakse Hauakambrisse, tõmba 1 kaart.

source: Goblin Recon Squad
et: Goblinite luuremeeskond

source: When this card successfully attacks directly, you can look at 1 random card in your opponent's hand. If it is a Spell Card, send it to the Graveyard. If this card attacks, it is changed to Defense Position at the end of the Battle Phase. This card's battle position cannot be changed until the end of your next turn, except with a card effect.
et: Kui see kaart ründab edukalt otse, saad vaadata ühte juhuslikku kaarti oma vastase käes. Kui see on Võlukaar, saada see Hauakambrisse. Kui see kaart ründab, muudetakse see Lahingufaasi lõpus Kaitsepositsiooni. Selle kaardi lahingupositsiooni ei saa muuta enne sinu järgmise käigu lõppu, välja arvatud kaardi efekti abil.

source: Interplanetary Invader "A"
et: Interplanetaarne Sissetungija "A"

source: Gain control of a monster that attacks this face-up Attack Position card, at the end of the Battle Phase.
et: Võta kontroll selle avatud Rünnakupositsioonis oleva kaardi ründava koletise üle Lahingufaasi lõpus.

source: Diskblade Rider
et: Kettalabida Ratsanik

source: Once per turn, you can remove from play 1 Normal Trap Card from your Graveyard. This card gains 500 ATK until the End Phase of your opponent's turn.
et: Korra ühe korra käigu jooksul saad eemaldada oma Hauakambrist mängust 1 Tavalise Lõksukaardi. See kaart saab 500 ATK juurde kuni sinu vastase käigu lõppfaasini.

source: Golden Ladybug
et: Kuldne Lehetigu

source: Once per turn, during your Standby Phase, you can reveal this card in your hand to gain 500 Life Points. If you do this, this card remains revealed while it is in your hand, until the End Phase.
et: Korra ühe käigu jooksul, oma Ootefaasil, võid sa paljastada selle kaardi oma käes, et saada 500 Elupunkti. Kui sa seda teed, jääb see kaart paljastatuks, kuni see on sinu käes, kuni Lõppfaasini.

source: DUCKER Mobile Cannon
et: DUCKER mobiilne kahur

source: FLIP: Select 1 Level 4 monster in your Graveyard and add it to your hand.
et: FLIP: Vali 1. taseme 4 koletis oma Hauakambrist ja lisa see oma kätte.
