Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: "Lightsworn" monsters (everywhere) cannot be targeted by Spells, Traps, or card effects. During each of your End Phases: Send the top 2 cards of your Deck to the Graveyard. You must control this face-up card to activate and to resolve this effect.
et: "Valgusevuse" koletisi (igal pool) ei saa sihtida Võlud, Lõksud ega kaardiefektid. Iga oma lõppfaasi ajal: Saada oma paki kaks ülemist kaarti Hauakambrisse. Selle efekti aktiveerimiseks ja lahendamiseks pead kontrollima seda avatud kaarti.

source: Ehren, Lightsworn Monk
et: Ehren, Valgusevande Munk

source: If this card attacks a Defense Position monster, return that monster to its owner's Deck before damage calculation. During each of your End Phases, send the top 3 cards of your Deck to the Graveyard.
et: Kui see kaart ründab kaitseasendis olevat koletist, tagasta see koletis selle omaniku pakki enne kahju arvutamist. Iga oma lõppfaasi ajal saada oma paki kolm ülemist kaarti hauakambrisse.

source: Dark General Freed
et: Pimekindral Freed

source: This card cannot be Special Summoned. Negate the effect of any Spell Card that targets a DARK monster you control and destroy it. You can add 1 Level 4 DARK monster from your Deck to your hand instead of conducting a normal draw in your Draw Phase.
et: Seda kaarti ei saa eriliselt kutsuda. Tühista iga Võlukaardi efekt, mis sihib sinu kontrollitavat PIMEDUST koletist, ja hävita see. Sa võid oma Tõmbamisfaasis tavalise tõmbamise asemel lisada oma pakist 1. taseme 4 PIMEDUST koletise oma kätte.

source: Magical Exemplar
et: Maagiline Näide

source: Each time a Spell Card is activated, place 2 Spell Counters on this card. Once per turn, you can remove any number of Spell Counters from this card to Special Summon a Spellcaster-Type monster from your hand or Graveyard whose Level is equal to the number of Spell Counters you removed.
et: Iga kord, kui aktiveeritakse Võlukaarte, aseta sellele kaardile 2 Võluloendurit. Kord käigu jooksul võid eemaldada sellelt kaardilt suvalise arvu Võluloendereid, et Kutsuda Eriliselt oma käest või Hauakambrist välja Võlur-tüüpi koletis, mille Tase on võrdne eemaldatud Võluloendurite arvuga.

source: Maniacal Servant
et: Maniakaalne Teenija

source: Once per turn during your opponent's Standby Phase, you can remove from play any number of DARK monsters from your Graveyard. This monster gains 500 DEF for each monster you removed, until the End Phase.
et: Korra oma vastase Ootejärgu faasi ajal saad sa eemaldada mängust suvalise arvu PIMEDUS tüüpi koletisi oma Hauakambrist. See koletis saab 500 DEF iga eemaldatud koletise kohta kuni Lõppfaasini.

source: Flame Spirit Ignis
et: Leegivaim Ignis

source: You can Tribute 1 face-up FIRE monster to inflict 100 damage to your opponent for each FIRE monster in your Graveyard.
et: Saad ohverdada 1 avatud tulekoletise, et tekitada oma vastasele 100 kahju iga oma hauas oleva tulekoletise eest.

source: Super-Ancient Dinobeast
et: Üliiidne Dinokoletis

source: You can Tribute Summon this card in face-up Attack Position by Tributing 1 Dinosaur-Type monster. When a Dinosaur-Type monster is Special Summoned from your Graveyard, you can draw 1 card.
et: Sa saad selle kaardi pakkuda näoga ülespoole Rünnakupositsioonis, pakkudes 1 Dinosaurus-tüüpi koletist. Kui Dinosaurus-tüüpi koletis kutsutakse sinu Hauakambrist eriliselt välja, saad tõmmata 1 kaardi.

source: Vanquishing Light
et: Võidukas Valgus

source: Tribute 1 "Lightsworn" monster. Negate the Summon of a monster and destroy it.
et: Ohverda 1 "Lightsworn" koletis. Tühista koletise kutsumine ja hävita see.

source: Red Ogre
et: Punane Ogre

source: When this card is Normal Summoned, you can send any number of cards from your hand to the Graveyard to return an equal number of cards from the field to their owners' hand.
et: Kui see kaart on Normaal-Kutsutud, võid saata suvalise arvu kaarte oma käest Hauakambrisse, et tagastada võrdne arv kaarte väljakult nende omanike kätte.

source: Neos Wiseman
et: Neos Tarkmees

source: Cannot be Normal Summoned or Set. Must be Special Summoned (from your hand) by sending 1 face-up "<M6653>Elemental Hero Neos<M>" and 1 face-up1 "<M7409>Yubel<M>" you control to the Graveyard, and cannot be Special Summoned by other ways. This card cannot be destroyed by card effects. At the end of the Damage Step, if this card battled an opponent's monster: Inflict damage to your opponent equal to the ATK of the monster it battled, and you gain Life Points equal to that monster's DEF.
et: Ei saa normaalset kutsuda ega asetada. Peab olema eriliselt kutsutud (teie käest), saates 1 avatud "<M6653>Elemental Hero Neos<M>" ja 1 avatud "<M7409>Yubel<M>", mida te kontrollite, hauakambrisse, ja ei saa olla eriliselt kutsutud muul viisil. Seda kaarti ei saa hävitada kaardiefektidega. Kahju sammu lõpus, kui see kaart võitles vastase koletisega: Põhjustage oma vastasele kahju, mis on võrdne koletisega, millega see võitles, ja te saate elu punkte, mis on võrdne selle koletise DEF-iga.

source: Elemental HERO God Neos
et: Elementaalne KANGELANE Jumal Neos

source: Must be Fusion Summoned using any 5 "Neos", "Neo Space", "Neo-Spacian", or "HERO" monsters, including at least 1 "Neos" or "Neo Space" monster, 1 "Neo-Spacian" monster, and 1 "HERO" monster, and cannot be Special Summoned by other ways. Once per turn: You can banish 1 "Neos", "Neo Space", "Neo-Spacian", or "HERO" monster from your Graveyard; this card gains 500 ATK, and until the End Phase it also gains the banished monster's effects.
et: Peab olema Fusion Summoned, kasutades ükskõik millist 5 "Neos", "Neo Space", "Neo-Spacian" või "HERO" koletist, sealhulgas vähemalt 1 "Neos" või "Neo Space" koletist, 1 "Neo-Spacian" koletist ja 1 "HERO" koletist, ning seda ei saa Special Summoned muul viisil. Kord kord: Sa võid oma Hauakambrist pagendada 1 "Neos", "Neo Space", "Neo-Spacian" või "HERO" koletise; see kaart saab 500 ATK, ja kuni End Phase'ini saab see ka pagendatud koletise efektid.

source: Genex Controller
et: Genexi Kontroller

source: As a master of all powers and elements, this is one of the few Genex monsters that can communicate with its companions.
et: Kõigi jõudude ja elementide meistrina on see üks väheseid Genexi koletisi, kes suudab oma kaaslastega suhelda.

source: When this card is Normal Summoned, you can send 1 WATER monster from your Deck to your Graveyard to add 1 "<M7807>Genex Controller<M>" from your Deck to your hand.
et: Kui see kaart on Normaal-Kutsutud, saad sa saata 1 VEE koletise oma pakist oma Hauakambrisse, et lisada 1 "<M7807>Genex Controller<M>" oma pakist oma kätte.

source: Genex Power Planner
et: Genexi Võimuplaneerija

source: When this card is Normal Summoned, you can add 1 Level 3 "Genex" Effect Monster from your Deck to your hand.
et: Kui see kaart on Normaal-Kutsutud, saad lisada oma pakist oma kätte 1. taseme 3 "Genex" Efektikoletise.

source: Genex Searcher
et: Genexi Otsija

source: When this card is destroyed by battle and sent to the Graveyard, you can Special Summon 1 "Genex" monster with 1500 or less ATK from your Deck in face-up Attack Position.
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse, saad Sa eriliselt kutsuda 1 "Genex" koletise, mille ATK on 1500 või vähem, oma pakist avatud ründeasendisse.

source: Genex Worker
et: Genex Töötaja

source: You can Tribute this card to Special Summon 1 "Genex" monster from your hand.
et: Saate selle kaardi ohverdada, et kutsuda oma käest välja 1 "Genex" koletis.

source: Reese the Ice Mistress
et: Jääemand Reese

source: This card cannot be destroyed by battle with a Level 4 or higher monster.
et: Seda kaarti ei saa hävitada lahingus 4. või kõrgema tasemega koletisega.

source: Royal Knight of the Ice Barrier
et: Jääbarjääri Kuninglik Rüütel

source: When this card is Tribute Summoned, Special Summon 1 "<M3945>Ice Coffin Token<M>" (Aqua-Type/WATER/Level 1/ATK 1000/DEF 0) in Attack Position to your opponent's side of the field. This Token cannot be Tributed for a Tribute Summon.
et: Kui see kaart on ohverdamisega välja kutsutud, kutsu eriliselt välja 1 "<M3945>Jääkirstu Mängunupp<M>" (Aqua-tüüp/VEEL/1. tase/ATK 1000/DEF 0) rünnakupositsioonis oma vastase väljaku poolele. Seda mängunuppu ei saa ohverdada ohverdamisega välja kutsumiseks.

source: Numbing Grub in the Ice Barrier
et: Jääbarjääri tuimestav tõuk

source: When this card is Normal Summoned, select 1 unused Monster Card Zone. While this card is face-up on the field, that selected Monster Card Zone cannot be used.
et: Kui see kaart on Normaal-Kutsutud, vali 1 kasutamata Koletise Kaardi Tsoon. Kui see kaart on näoga ülespoole väljal, ei saa valitud Koletise Kaardi Tsooni kasutada.

source: Mist Valley Watcher
et: Uduorgu Vaatleja

source: Descendant of a family that has served as Mist Valley watchmen over the generations. Never missed a single thing that happened in the valley, no matter how minute.
et: Perekond, kes on põlvkondade jooksul teeninud Mist Valley valvuritena. Pole kunagi märkamata jätnud ühtegi asja, mis orus juhtus, ükskõik kui tühine see ka polnud.

source: Mist Condor
et: Udu Kondor

source: You can Special Summon this card from your hand by returning 1 face-up "Mist Valley" monster you control to the hand. If you do, this card's ATK becomes 1700.
et: Saad selle kaardi oma käest eriliselt välja kutsuda, tagastades 1 avatud "Mist Valley" koletise, mida sa kontrollid, kätte. Kui teed seda, muutub selle kaardi ATK 1700-ks.

source: Mist Valley Windmaster
et: Uduorg Mist Valley

source: Once per turn, if both players have 5 or more cards in their hand, you can activate this effect to make both players send cards from their hands to the Graveyards until they have 4 cards.
et: Korra ühe korra käigu jooksul, kui mõlemal mängijal on käes 5 või rohkem kaarti, saad aktiveerida selle efekti, et mõlemad mängijad saadaksid kaarte oma käest Hauakambrisse, kuni neil on käes 4 kaarti.

source: When this card is destroyed by battle and sent to the Graveyard, you can select and add 1 monster with 200 DEF from your Deck to your hand.
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse, saad valida ja lisada oma pakist oma kätte 1 koletise, mille DEF on 200.

source: Flamvell Archer
et: Flamvell'i Vibukütt

source: Once per turn, you can Tribute 1 face-up Pyro-Type monster you control to have all face-up "Flamvell" monsters on the field gain 800 ATK until the End Phase.
et: Korra ühe korra käigu jooksul, saad ohverdada 1 avatud Pyro-tüüpi koletise, mida sa kontrollid, et kõik avatud "Flamvell" koletised väljakul saaksid 800 ATK juurde kuni lõppfaasini.

source: Flamvell Fiend
et: Flamvell'i Deemon

source: When this card inflicts Battle Damage to your opponent, inflict 200 damage to your opponent for each Pyro-Type monster in your Graveyard.
et: Kui see kaart tekitab lahingukahju sinu vastasele, tekita 200 kahju oma vastasele iga Pyro-tüüpi koletise eest sinu Hauakambris.

source: A female X-Saber Warrior, known for her graceful attacks and calm decision making in battle. Her ambition is merciless, and strikes fear in the hearts of her enemies.
et: Naiss X-Saber sõdalane, tuntud oma graatsiliste rünnakute ja rahuliku otsustusvõime poolest lahingus. Tema ambitsioon on halastamatu ja külvab hirmu tema vaenlaste südamesse.

source: If this card attacks an opponent's monster, this card gains 300 ATK during the Damage Step only. If this card is attacked by an opponent's monster, this card loses 500 ATK during the Damage Step only. When this card is selected as an attack target, you can Tribute another "Saber" monster to negate the attack.
et: Kui see kaart ründab vastase koletist, saab see kaart ainult Kahjustuse Etapi ajal 300 ATK juurde. Kui vastase koletis ründab seda kaarti, kaotab see kaart ainult Kahjustuse Etapi ajal 500 ATK. Kui see kaart valitakse rünnaku sihtmärgiks, võid ohverdada teise "Saber" koletise, et rünnak tühistada.

source: When another "Saber" monster you control is destroyed by battle and sent to the Graveyard, you can pay 500 Life Points to Special Summon this card from the Graveyard.
et: Kui teine "Saber" koletis, mida sa kontrollid, hävitatakse lahingus ja saadetakse Hauakambrisse, võid maksta 500 Elupunkti, et eriliselt kutsuda see kaart Hauakambrist välja.

source: This card cannot be destroyed by battle. If this card is in face-up Defense Position, you take 1000 damage during each of your opponent's Standby Phases.
et: Seda kaarti ei saa lahingus hävitada. Kui see kaart on avatud kaitsepositsioonis, saad iga vastase ooteetapi ajal 1000 kahju.

source: Ally Salvo
et: Liitlane Salvo

source: When this card is destroyed by battle with a LIGHT monster and sent to the Graveyard, select 2 cards on the field and destroy them.
et: Kui see kaart hävitatakse lahingus VALGUSE koletisega ja saadetakse Hauakambrisse, vali 2 kaarti väljal ja hävita need.

source: Ally of Justice Thousand Arms
et: Õigluse Liitlane Tuhat Kätt

source: This card can attack all face-up LIGHT monsters your opponent controls once each. If this card battles a non-LIGHT monster, destroy this card before damage calculation.
et: See kaart võib rünnata kõiki vastase avatud VALGUS-monstreid üks kord igaüht. Kui see kaart võitleb mitte-VALGUS-monstriga, hävita see kaart enne kahju arvutamist.

source: Ally of Justice Unknown Crusher
et: Õigluse Liitlane Tundmatu Purustaja

source: When this card battles a LIGHT monster, remove that monster from play after damage calculation.
et: Kui see kaart võitleb VALGUSE koletisega, eemalda see koletis mängust pärast kahju arvutamist.

source: Worm Falco
et: Uss Falco

source: FLIP: Change all face-up Reptile-Type "Worm" monsters you control to face-down Defense Position, except this card.
et: FLIP: Muuda kõik ülespoole suunatud Reptiil-tüüpi "Worm" koletised, mida sa kontrollid, peale selle kaardi, allapoole Kaitsepositsiooni.

source: Worm Gulse
et: Uss Gulse

source: Each time a face-down Defense Position monster is flipped face-up, place 1 Worm Counter on this card. This card gains 300 ATK for each Worm Counter on it.
et: Iga kord, kui näoga allpool olev kaitsepositsioonis koletis pööratakse näoga ülespoole, pane sellele kaardile 1 Ussiloendur. See kaart saab iga Ussiloenduri eest 300 ATK juurde.

source: Worm Hope
et: Uss Lootus

source: FLIP: When this card is flipped face-up by an opponent's monster's attack, draw 1 card. When this card is sent from the field to the Graveyard, send 1 card from your hand to the Graveyard.
et: FLIP: Kui see kaart pööratakse vastase koletise rünnaku tõttu avatud asendisse, tõmba 1 kaart. Kui see kaart saadetakse väljakult Hauakambrisse, saada 1 kaart oma käest Hauakambrisse.

source: Worm Illidan
et: Uss Illidan

source: Each time a card is Set on your side of the field, place 1 Worm Counter on this card. You can remove 2 Worm Counters from this card to destroy 1 card your opponent controls.
et: Iga kord, kui sinu väljaku poolele asetatakse kaart, pane sellele kaardile 1 Ussiloendur. Sa saad eemaldada 2 Ussiloendurit sellelt kaardilt, et hävitada 1 kaart, mida sinu vastane kontrollib.

source: Worm Jetelikpse
et: Uss Jetelikpse

source: FLIP: When this card is destroyed and sent to the Graveyard this turn, Special Summon it in Defense Position.
et: FLIP: Kui see kaart sel käigul hävitatakse ja saadetakse Hauakambrisse, kutsu see eriliselt välja Kaitsepositsioonis.

source: Worm King
et: Ussikuningas

source: This card can be Tribute Summoned in face-up Attack Position by Tributing 1 Reptile-Type "Worm" monster. You can Tribute 1 Reptile-Type "Worm" monster to select 1 card your opponent controls, and destroy it.
et: Seda kaarti saab pakkuda ohverdusena näoga ülespoole Rünnakupositsioonis, ohverdades 1 Reptiil-tüüpi "Worm" koletise. Sa võid ohverdada 1 Reptiil-tüüpi "Worm" koletise, et valida 1 kaardi, mida sinu vastane kontrollib, ja hävitada see.

source: Hydro Genex
et: Hüdro Genex

source: "<M7807>Genex Controller<M>" + 1 or more Non-Tuner WATER Monsters<BR>When this card destroys an opponent's monster by battle and sends it to the Graveyard, gain Life Points equal to the ATK of the destroyed monster.
et: "<M7807>Genexi Kontroller<M>" + 1 või rohkem mittehäälestaja VEE koletist<BR>Kui see kaart hävitab lahingus vastase koletise ja saadab selle Hauakambrisse, saad Elupunkte, mis on võrdne hävitatud koletise rünnakuga.

source: 1 Tuner + 1 or more non-Tuner monsters<BR>When this card is Synchro Summoned, you can Special Summon 1 Level 4 or lower Warrior-Type monster from your hand.
et: 1 Tuner + 1 või rohkem mitte-Tuner koletist<BR>Kui see kaart on Sünkro Kutsutud, saad Sa eriliselt kutsuda 1 4. või madalama taseme Sõdalase-tüüpi koletise oma käest.

source: Ally of Justice Light Gazer
et: Õigluse Liitlase Valguse Pilk

source: 1 Tuner + 1 or more non-Tuner monsters<BR>This card gains 200 ATK for each LIGHT monster in your opponent's Graveyard.
et: 1 Tuner + 1 või rohkem mitte-Tuner koletist<BR>See kaart saab 200 ATK iga vastase surnuaias oleva LIGHT koletise eest.

source: Chaos-End Master
et: Kaose Lõpu Meister

source: If this card destroys an opponent's monster by battle and sends it to the Graveyard, you can Special Summon 1 Level 5 or higher monster with 1600 ATK or less from your Deck.
et: Kui see kaart hävitab lahingus vastase koletise ja saadab selle Hauakambrisse, saad Sa eriliselt kutsuda ühe taseme 5 või kõrgema koletise, millel on 1600 ATK või vähem, oma pakist.

source: Sphere of Chaos
et: Kaose sfäär

source: While this card is face-up on the field its Attribute is also treated as LIGHT. Once per turn, this card cannot be destroyed by battle. When this card is Tribute Summoned, you can add 1 Level 3 monster from your Deck to your hand.
et: Kui see kaart on lahinguväljal avatud, käsitletakse selle atribuuti ka kui VALGUST. Kord käigu jooksul ei saa seda kaarti lahingus hävitada. Kui see kaart on ohverdamisega kutsutud, saad lisada oma pakist ühe 3. taseme koletise oma kätte.

source: During the End Phase of the turn that this card was Normal Summoned, you can add 1 Machine-Type Tuner monster from your Deck to your hand.
et: End Phase'i ajal, mil see kaart oli Normaal-Summonitud, saad lisada oma Deck'ist 1 Machine-Type Tuner koletise oma kätte.

source: Ally of Justice Cyclone Creator
et: Õigluse Liitlane Tsükloni Looja

source: Once per turn, you can discard 1 card from your hand to return Spell/Trap Cards from the field to the hand equal to the number of face-up Tuner monsters on the field.
et: Korra ühe korra käigu jooksul saad sa oma käest ühe kaardi ära visata, et tagastada väljakult käele võrdne arv Püünis-/Loitsukaarte, kui palju on väljakul ülespoole pööratud Häälestaja koletisi.

source: Road Synchron
et: Teesünkron

source: If this card is used for the Synchro Summon of a monster other than "<M7679>Road Warrior<M>", its Level is decreased by 2. If this card attacks, at the end of the Damage Step, increase its Level by 1 until the End Phase.
et: Kui seda kaarti kasutatakse muu kui "<M7679>Road Warrior<M>" koletise Sünkrosummoniks, väheneb selle tase 2 võrra. Kui see kaart ründab, suurendatakse selle taset pärast Kahjustusetapi lõppu 1 võrra kuni Lõppfaasini.

source: Goblin Decoy Squad
et: Goblinite peibutusrühm

source: When this card inflicts Battle Damage to your opponent, you can draw 1 card. If this card attacks, it is changed to Defense Position at the end of the Battle Phase. This card's battle position cannot be changed until the end of your next turn, except with a card effect.
et: Kui see kaart tekitab lahingukahju sinu vastasele, saad tõmmata 1 kaardi. Kui see kaart ründab, muudetakse see lahingufaasi lõpus kaitsepositsiooniks. Selle kaardi lahingupositsiooni ei saa muuta enne sinu järgmise käigu lõppu, välja arvatud kaardi efekti abil.

source: Jade Knight
et: Jade Rüütel

source: Face-up Machine-Type monsters you control with 1200 or less ATK cannot be destroyed by the effects of Trap Cards. When this face-up card is destroyed by battle and sent to the Graveyard, you can add 1 Level 4 LIGHT Machine-Type monster from your Deck to your hand.
et: Avatud positsiooniga Masina-tüüpi koletisi, mida sa kontrollid ja millel on 1200 või vähem ATK, ei saa lõksukaartide efektide tõttu hävitada. Kui see avatud positsiooniga kaart hävitatakse lahingus ja saadetakse Hauakambrisse, saad lisada oma pakist ühe 4. taseme VALGUS Masina-tüüpi koletise oma kätte.

source: Tree Otter
et: Puu-saarmas

source: Once per turn, if you control another face-up Beast-Type monster, you can have 1 face-up monster you control gain 1000 ATK until the End Phase.
et: Kord ühe korra käigu jooksul, kui sa kontrollid teist avatud Nähtava Tüüpi koletist, saad sa ühe avatud koletise, mida sa kontrollid, ATK-d suurendada 1000 võrra kuni Lõppfaasini.

source: "<M7437>Sea Koala<M>" + "<M7844>Tree Otter<M>"<BR>You can send 1 Beast-Type monster from your hand to the Graveyard to select and destroy 1 monster your opponent controls.
et: "<M7437>Merekoala<M>" + "<M7844>Puu-saarm<M>"<BR>Saad saata 1 Beast-tüüpi koletise oma käest Hauakambrisse, et valida ja hävitada 1 koletis, mida sinu vastane kontrollib.

source: Zombie Mammoth
et: Zombi Mammut

source: Destroy this card if you do not have a Zombie-Type monster in your Graveyard. When this face-up card is destroyed, inflict damage to its controller equal to its original ATK.
et: Hävita see kaart, kui sul ei ole oma Hauakambris Zombi-tüüpi koletist. Kui see avatud kaart hävitatakse, põhjusta selle kontrollijale kahju, mis on võrdne selle algse rünnakuga (ATK).

source: "<M7849>Plaguespreader Zombie<M>" + 1 or more non-Tuner Zombie-Type monsters<BR>When this card is Special Summoned, you can select 1 Zombie-Type monster in your opponent's Graveyard and Special Summon it to your side of the field in Attack Position. Destroy it when this card is removed from the field.
et: "<M7849>Katkupandev Zombi<M>" + 1 või rohkem mittehäälestaja Zombi-tüüpi koletist<BR>Kui see kaart on eriliselt kutsutud, saad valida 1 Zombi-tüüpi koletise oma vastase hauakambris ja kutsuda see oma väljaku poolele rünnakupositsioonis. Hävita see, kui see kaart eemaldatakse väljalt.

source: Plaguespreader Zombie
et: Katkulevitaja Zombi

source: You can return 1 card from your hand to the top of the Deck to Special Summon this card from your Graveyard. If you do, remove this card from play when it is removed from the field.
et: Sa saad ühe kaardi oma käest tagasi panna paki peale, et eriliselt kutsuda see kaart oma hauast. Kui sa seda teed, eemalda see kaart mängust, kui see eemaldatakse väljakult.

source: The White Stone of Legend
et: Legendaarne Valge Kivi

source: When this card is sent to the Graveyard: Add 1 "<M4007>Blue-Eyes White Dragon<M>" from your Deck to your hand.
et: Kui see kaart saadetakse Hauakambrisse: Lisa 1 "<M4007>Sinisilmne Valge Draakon<M>" oma pakist oma kätte.

source: Revived King Ha Des
et: Elustatud Kuningas Ha Des

source: "<M7849>Plaguespreader Zombie<M>" + 1 or more non-Tuner Zombie-Type monsters.<BR>Negate the effects of Effect Monsters destroyed by battle with Zombie-Type monsters you control.
et: "<M7849>Katkulevitaja Zombi<M>" + 1 või rohkem mittehäälestaja Zombi-tüüpi koletisi.<BR>Tühista Zombi-tüüpi koletistega, mida sa kontrollid, lahingus hävitatud Efektkoletiste efektid.

source: Cyber Shark
et: Küberhai

source: If you control a WATER monster, you can Normal Summon this card without Tributing.
et: Kui sa kontrollid VEE koletist, saad selle kaardi Normaal-Kutsuda ilma ohverdamata.

source: Hand of the Six Samurai
et: Kuue samurai käsi

source: If you control another "Six Samurai" monster, you can Tribute 1 "Six Samurai" monster to select 1 monster on the field, and destroy it.
et: Kui sa kontrollid teist "Kuue Samuraid" koletist, võid ohverdada 1 "Kuue Samuraid" koletise, et valida 1 koletis väljal ja hävitada see.

source: Red-Eyes Zombie Dragon
et: Punasilmne Zombidraakon
