Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: Cannot be Special Summoned from the Deck. If you control no monsters, you can Normal Summon this card without Tributing. This card cannot be destroyed by battle or by card effects. You take no Battle Damage from battles involving this face-up Attack Position card. At the end of the Battle Phase in which this card battled: Return all other monsters on the field to the hand(s), then inflict 300 damage to your opponent for each monster returned. During your Standby Phase: Shuffle this face-up card into the Deck.
et: Ei saa eriliselt kutsuda pakist. Kui sul pole ühtegi koletist, saad selle kaardi normaalset kutsuda ilma ohverdamata. Seda kaarti ei saa hävitada lahingus ega kaardiefektidega. Sa ei saa lahingukahju lahingutest, milles osaleb see avatud rünnakupositsioonis kaart. Lahingufaasi lõpus, milles see kaart võitles: Tagasta kõik teised koletised väljakult kätte, seejärel tekita oma vastasele 300 kahju iga tagastatud koletise eest. Sinu ooteetapi ajal: Sega see avatud kaart pakki.

source: Temporal Machine God Sephylon
et: Ajutine Masinajumal Sephylon

source: Cannot be Normal Summoned or Set. Must be Special Summoned (from your hand) by having 10 or more monsters in your Graveyard, and cannot be Special Summoned by other ways. Once per turn: You can Special Summon 1 Level 8 or higher Fairy-Type monster from your hand or Graveyard. Its effect(s) are negated, and its ATK becomes 4000.
et: Ei saa normaalset kutsuda ega asetada. Peab olema eriliselt kutsutud (teie käest), kui teie hauas on 10 või rohkem koletisi, ja ei saa olla eriliselt kutsutud muul viisil. Kord käigu jooksul: saate eriliselt kutsuda 1. taseme 8 või kõrgema haldjatüüpi koletise oma käest või hauast. Selle mõju(d) on tühistatud ja selle rünnakujõud muutub 4000-ks.

source: Shooting Quasar Dragon
et: Laskemiskvasaari Draakon

source: 1 Tuner Synchro Monster + 2 or more non-Tuner Synchro Monsters<BR>Must be Synchro Summoned, and cannot be Special Summoned by other ways. This card's maximum number of attacks per turn equals the number of non-Tuner monsters used as its Synchro Material. Once per turn, when a card or effect is activated: You can negate the activation and destroy it. When this card leaves the field: You can Special Summon 1 "<M9117>Shooting Star Dragon<M>" from your Extra Deck.
et: 1 Tuner Sünkrokoletis + 2 või rohkem mitte-Tuner Sünkrokoletist<BR>Peab olema Sünkrokutsutud ja ei saa olla Erikutsega kutsutud muul viisil. Selle kaardi maksimaalne rünnakute arv käigu kohta võrdub mitte-Tuner koletiste arvuga, mida kasutati selle Sünkromaterjalina. Kord käigu jooksul, kui aktiveeritakse kaart või efekt: Sa võid aktiveerimise tühistada ja selle hävitada. Kui see kaart lahkub väljakult: Sa võid Erikutsega kutsuda 1 "<M9117>Shooting Star Dragon<M>" oma Ekstratekist.

source: Infernity Knight
et: Infernity Rüütel

source: When this card on the field is destroyed and sent to the Graveyard: You can discard 2 cards; Special Summon this card from your Graveyard.
et: Kui see kaart väljal hävitatakse ja saadetakse Hauakambrisse: Sa võid visata 2 kaarti; Kutsu see kaart Hauakambrist eriliselt välja.

source: Endless Decay
et: Lõputu Kõdunemine

source: If you have 2000 Life Points or less, you can Special Summon this card (from your hand). When this card is Normal or Special Summoned: This card's ATK becomes half the opponent's Life Points.
et: Kui sul on 2000 või vähem Elupunkte, saad selle kaardi (oma käest) Erikutsuda. Kui see kaart on Normaal- või Erikutsutud: Selle kaardi RÜN muutub pooleks vastase Elupunktidest.

source: Grapha, Dragon Lord of Dark World
et: Grapha, Tume Maailma Draakoniisand

source: You can Special Summon this card (from your Graveyard) by returning 1 face-up "Dark World" monster you control to the hand, except "<M9712>Grapha, Dragon Lord of Dark World<M>". If this card is discarded to the Graveyard by a card effect: Target 1 card your opponent controls; destroy that target, then, if this card was discarded from your hand to your Graveyard by an opponent's card effect, look at 1 random card in your opponent's hand, then, if it was a monster, you can Special Summon it to your side of the field.
et: Saad selle kaardi (oma Hauakambrist) eriliselt välja kutsuda, tagastades 1 ülespoole suunatud "Dark World" koletise, mida sa kontrollid, käele, välja arvatud "<M9712>Grapha, Dragon Lord of Dark World<M>". Kui see kaart visatakse kaardiefekti tõttu Hauakambrisse: Sihtmärk 1 kaart, mida sinu vastane kontrollib; hävita see sihtmärk, siis, kui see kaart visati sinu käest Hauakambrisse vastase kaardiefekti tõttu, vaata 1 juhuslikku kaarti oma vastase käes, siis, kui see oli koletis, saad selle eriliselt välja kutsuda oma väljale.

source: Snoww, Unlight of Dark World
et: Snoww, Pimeduse Maailma Valgus

source: If this card is discarded to the Graveyard by a card effect: If it was discarded from your hand to your Graveyard by an opponent's card effect, you can target 1 monster in your opponent's Graveyard; add 1 "Dark World" card from your Deck to your hand, then Special Summon that target (if any) in face-up Defense Position.
et: Kui see kaart saadetakse kaardiefekti tõttu Hauakambrisse: Kui see saadeti sinu käest Hauakambrisse vastase kaardiefekti tõttu, saad valida 1 koletise vastase Hauakambris; lisa 1 "Dark World" kaart oma pakist kätte, seejärel kutsu see valitud koletis (kui on olemas) eriliselt välja avatud kaitsepositsioonis.

source: Ceruli, Guru of Dark World
et: Ceruli, Tume Maailma Guru

source: If this card is discarded to the Graveyard by a card effect: Special Summon this card from the Graveyard to your opponent's side of the field in face-up Defense Position. When this card is Special Summoned by the effect of a "Dark World" card: Your opponent must discard 1 card.
et: Kui see kaart saadetakse kaardiefekti tõttu Hauakambrisse: Kutsu see kaart Hauakambrist eriliselt välja oma vastase väljaku poolele avatud kaitseasendis. Kui see kaart kutsutakse eriliselt välja "Pimeduse Maailma" kaardi efekti tõttu: Sinu vastane peab ühe kaardi ära viskama.

source: The Gates of Dark World
et: Pimeduse Maailma Väravad

source: All Fiend-Type monsters gain 300 ATK and DEF. Once per turn: You can banish 1 Fiend-Type monster from your Graveyard; discard 1 Fiend-Type monster, then draw 1 card.
et: Kõik Deemon-tüüpi koletised saavad 300 ATK ja DEF juurde. Kord käigu jooksul: Sa võid oma Hauakambrist eemaldada mängust 1 Deemon-tüüpi koletise; viska ära 1 Deemon-tüüpi koletis, seejärel tõmba 1 kaart.

source: Dark Scheme
et: Tume skeem

source: Your opponent can discard 1 card to negate this card's effect, otherwise both players discard 2 cards, then draw 2 cards.
et: Sinu vastane võib selle kaardi efekti tühistamiseks ühe kaardi ära visata, vastasel juhul viskavad mõlemad mängijad 2 kaarti ära ja tõmbavad seejärel 2 kaarti.

source: Phantom King Hyde Ride
et: Fantoomkuningas Hyde Ride

source: If this card is used as a Synchro Material Monster, the other monsters used for the Synchro Summon are treated as non-Tuner monsters.
et: Kui seda kaarti kasutatakse Sünkro Materjal Koletisena, käsitletakse teisi Sünkro Kutsumiseks kasutatud koletisi mitte-Häälestajatena.

source: Heavenly Wolf King Blue Sirius
et: Taevane Hundikuningas Sinine Sirius

source: 1 Tuner + 1 or more non-Tuner monsters<BR>When this card is destroyed and sent from the field to the Graveyard: You can target 1 face-up monster your opponent controls; that target loses 2400 ATK.
et: 1 Tuner + 1 või rohkem mitte-Tuner koletist<BR>Kui see kaart hävitatakse ja saadetakse väljakult Hauakambrisse: Sa saad valida 1 vastase kontrollitava avatud koletise; see sihtmärk kaotab 2400 ATK.

source: A candy-loving bunny with a major sweet tooth. It is said he is looking for the ultimate candy lover's carrot, while desiring to chew on carrots every single day.
et: Kommihuviline jänku, kellel on suur magusaisu. Öeldakse, et ta otsib ülimat kommihuvilise porgandit, soovides samal ajal iga päev porgandeid närida.

source: Rabidragon
et: Jänesedraakon

source: A mutated version of a dragon that lives in a snow field. Its prey can't escape it because of its big ears, which can catch sounds that are several kilometers away, and its extraordinary jumping ability.
et: Mutantne versioon draakonist, kes elab lumeväljal. Selle saakloomad ei pääse põgenema tänu tema suurtele kõrvadele, mis suudavad püüda helisid mitme kilomeetri kauguselt, ja erakordsele hüppevõimele.

source: Rai-Rider
et: Rai-Ratsanik

source: If this card battles an opponent's monster: That monster cannot declare an attack while it is face-up on the field.
et: Kui see kaart võitleb vastase koletisega: See koletis ei saa rünnakut kuulutada, kui see on väljaku peal avatud.

source: Needle Swordsman
et: Nõelamõõgamees

source: When this card inflicts Battle Damage to your opponent: Return all face-up Spell/Trap Cards your opponent controls to the hand.
et: Kui see kaart tekitab lahingukahju sinu vastasele: Tagasta kõik sinu vastase kontrollitavad avatud Võlu-/Lõksukaardid kätte.

source: Cannot be Normal Summoned or Set. When you Normal Summon a Level 4 monster: You can Special Summon this card from your hand. This card cannot be used as a Synchro Material Monster.
et: Ei saa normaalset kutsuda ega asetada. Kui sa kutsud normaalselt 4. taseme koletise: Sa võid selle kaardi oma käest eriliselt kutsuda. Seda kaarti ei saa kasutada sünkromaterjalina.

source: Fallen Cone
et: Langenud koonus

source: During your Main Phase: You can discard 1 "<M9725>Growing Pinecone<M>" from your hand and Special Summon this card from your hand.
et: Oma peafaasil: Sa võid oma käest ära visata 1 "<M9725>Kasvav Käbi<M>" ja kutsuda see kaart oma käest eriliselt välja.

source: Growing Pinecone
et: Kasvav Käbi

source: When this card is discarded to the Graveyard by the effect of "<M9724>Fallen Cone<M>": You can Special Summon it from your Graveyard.
et: Kui see kaart saadetakse surnuaeda "<M9724>Fallen Cone<M>" efekti tõttu: Saad selle oma surnuaiast eriliselt välja kutsuda.

source: Killer Frilled Shark
et: Tapja Frillhai

source: When a face-up Fish, Sea Serpent, or Aqua-Type monster you control is targeted for an attack: You can banish this card from your Graveyard; negate that attack, and that monster loses 500 ATK, until your next End Phase. The effect of "<M9726>Killer Frilled Shark<M>" can only be used once per turn.
et: Kui sinu juhitav avatud Kalade, Meremadude või Vee-eluka tüüpi koletis on rünnaku sihtmärk: Sa võid selle kaardi oma Hauakambrist pagendada; tühista see rünnak ja see koletis kaotab 500 ATK-d kuni sinu järgmise Lõppfaasini. "<M9726>Killer Frilled Shark<M>" efekti saab kasutada ainult üks kord käigu jooksul.

source: Shark Sucker
et: Hai-imur

source: When a Fish, Sea Serpent, or Aqua-Type monster is Normal or Special Summoned to your side of the field: You can Special Summon this card from your hand. This card cannot be used as a Synchro Material Monster.
et: Kui Kalade, Meremadude või Vee-olendi tüüpi koletis kutsutakse tavalise või erilise kutsumisega sinu väljale: Sa saad selle kaardi oma käest eriliselt kutsuda. Seda kaarti ei saa kasutada Sünkro Materjal Koletisena.

source: Spiked Sunfish
et: Ogalik päikesekala

source: When this card is sent to the Graveyard: Target 1 face-up monster your opponent controls; it loses 500 ATK.
et: Kui see kaart saadetakse Hauakambrisse: Sihtige 1 avatud koletis, mida teie vastane kontrollib; see kaotab 500 ATK.

source: Galaxy-Eyes Photon Dragon
et: Galaktika-Silmadega Foton Draakon

source: You can Special Summon this card (from your hand) by Tributing 2 monsters with 2000 or more ATK. During either player's Battle Step, when this card battles an opponent's monster: You can banish that monster and this card. Return the banished monsters to the field at the end of the Battle Phase. If the monster banished by this effect was an Xyz Monster: This card gains 500 ATK for each Xyz Material that monster had attached to it when it was banished.
et: Saad selle kaardi (oma käest) eriliselt välja kutsuda, ohverdades 2 koletist, kellel on 2000 või rohkem ATK. Mõlema mängija Lahinguetapi ajal, kui see kaart võitleb vastase koletisega: Saad selle koletise ja selle kaardi pagendada. Tagasta pagendatud koletised väljale Lahingufaasi lõpus. Kui selle efekti abil pagendatud koletis oli Xyz Koletis: See kaart saab 500 ATK iga Xyz Materjali eest, mis sellel koletisel oli küljes, kui see pagendati.

source: Daybreaker
et: Päevamurdja

source: When this card is Special Summoned: You can Special Summon 1 "<M9730>Daybreaker<M>" from your hand.
et: Kui see kaart on eriliselt kutsutud: Sa saad eriliselt kutsuda 1 "<M9730>Daybreaker<M>" oma käest.

source: Light Serpent
et: Valgus Madu

source: When this card is sent from the hand to the Graveyard: Special Summon this card from the Graveyard. This card cannot be used as a Synchro Material Monster.
et: Kui see kaart saadetakse käest Hauakambrisse: Kutsu see kaart Hauakambrist eriliselt välja. Seda kaarti ei saa kasutada Sünkro Materjal Koletisena.

source: Plasma Ball
et: Plasmakuul

source: This card can attack your opponent directly. When this card attacks your opponent directly and inflicts Battle Damage: Destroy this card.
et: See kaart võib rünnata sinu vastast otse. Kui see kaart ründab sinu vastast otse ja tekitab lahingukahju: hävita see kaart.

source: Photon Cerberus
et: Foton Kerberos

source: When this card is Normal Summoned: This turn, neither player can activate Trap Cards while this card is face-up.
et: Kui see kaart on normaal-summonitud: Sellel käigul ei saa kumbki mängija aktiveerida lõksukaarte, kui see kaart on avatud.

source: When this card is destroyed by battle: You can target 1 "Evolsaur" monster in your Graveyard; Special Summon that target.
et: Kui see kaart hävitatakse lahingus: Sa võid valida 1 "Evolsaur" koletise oma Hauakambris; Kutsu see sihtmärk eriliselt välja.

source: FLIP: Special Summon 1 "Evolsaur" monster from your Deck.
et: FLIP: Kutsu oma pakist välja 1 "Evolsaur" koletis.

source: Evoltile Odonto
et: Evoltiil Odonto

source: When this card is Normal Summoned: You can Special Summon 1 "Evolsaur" monster from your hand.
et: Kui see kaart on Normaal-Kutsutud: Sa saad Erilis-Kutsuda 1 "Evolsaur" koletise oma käest.

source: Evolsaur Vulcano
et: Evolsaurus Vulcano

source: When this card is Special Summoned by the effect of an "Evoltile" monster: You can target 1 "Evolsaur" monster in your Graveyard; Special Summon it that target. It cannot declare an attack.
et: Kui see kaart on eriliselt kutsutud "Evoltile" koletise efekti abil: Sa saad valida ühe "Evolsaur" koletise oma Hauakambris; Kutsu see sihtmärk eriliselt välja. See ei saa rünnakut kuulutada.

source: Evolsaur Cerato
et: Evolsaurus Cerato

source: When this card is Special Summoned by the effect of an "Evoltile" monster: This card gains 200 ATK. If this card was Special Summoned by the effect of an Evotile monster: Every time this card destroys an opponent's monster by battle; you can add 1 "Evoltile" monster from your Deck to your hand.
et: Kui see kaart kutsutakse eriliselt välja "Evoltile" koletise efekti abil: See kaart saab 200 ATK juurde. Kui see kaart kutsuti eriliselt välja Evotile koletise efekti abil: Iga kord, kui see kaart hävitab lahingus vastase koletise; saad lisada 1 "Evoltile" koletise oma pakist oma kätte.

source: Evolsaur Diplo
et: Evolsaurus Diplo

source: When this card is Special Summoned by the effect of an "Evoltile" monster: Target 1 Spell/Trap Card your opponent controls; destroy that target.
et: Kui see kaart on "Evoltile" koletise efekti abil eriliselt kutsutud: Sihtige 1 Loitsu/Lõksu kaart, mida teie vastane kontrollib; hävitage see sihtmärk.

source: Wind-Up Warrior
et: Tuulepüüdja Sõdalane

source: During your Main Phase: You can target 1 face-up "Wind-Up" monster you control; that target's Level increases by 1 and it gains 600 ATK, until the End Phase. This effect can only be activated once while this card is face-up on the field.
et: Oma peafaasia ajal: Sa saad valida ühe avatud "Wind-Up" koletise, mida sa kontrollid; selle taset suurendatakse 1 võrra ja see saab 600 ATK juurde kuni lõppfaasini. Seda efekti saab aktiveerida ainult üks kord, kui see kaart on väljakul avatud.

source: Wind-Up Knight
et: Mehaaniline Rüütel

source: When a face-up "Wind-Up" monster you control is targeted for an attack: You can negate that attack. This effect can only be activated once while this card is face-up on the field.
et: Kui sinu kontrollitav avatud "Wind-Up" koletis on rünnaku sihtmärk: Sa võid selle rünnaku tühistada. Seda efekti saab aktiveerida ainult üks kord, kui see kaart on avatud väljakul.

source: Wind-Up Hunter
et: Tuulepüüdja

source: During your Main Phase: You can Tribute 1 "Wind-Up" monster you control, except "<M9742>Wind-Up Hunter<M>"; send 1 random card from your opponent's hand to the Graveyard. This effect can only be activated once while this card is face-up on the field.
et: Oma peafaasia ajal: Sa võid ohverdada 1 "Wind-Up" koletise, mida sa kontrollid, välja arvatud "<M9742>Wind-Up Hunter<M>"; saada 1 juhuslik kaart oma vastase käest Hauakambrisse. Seda efekti saab aktiveerida ainult üks kord, kui see kaart on väljas väljakul.

source: Wind-Up Bat
et: Kerimees Nahkhiir

source: During your Main Phase: Target 1 "Wind-Up" monster in your Graveyard; change this face-up Attack Position card you control into face-up Defense Position and add that target to your hand. This effect can only be activated once while this card is face-up on the field.
et: Oma peafaasia ajal: sihi 1 "Wind-Up" koletis oma kalmistul; muuda see ülespööratud rünnakupositsioonis kaart, mida sa kontrollid, ülespööratud kaitsepositsiooniks ja lisa see sihtmärk oma kätte. Seda efekti saab aktiveerida ainult üks kord, kui see kaart on ülespööratud väljal.

source: Wind-Up Kitten
et: Vindi kassipoeg

source: During your Main Phase: You can target 1 monster your opponent controls; return the target to the hand. This effect can only be activated once while this card is face-up on the field.
et: Oma peafaasia ajal: Sa võid valida 1 koletise, mida sinu vastane kontrollib; tagasta valitud sihtmärk käele. Seda efekti saab aktiveerida ainult üks kord, kui see kaart on lahinguväljal avatud.

source: Telepon D.D.
et: Telefoni D.D.

source: If this face-up card you control is banished: You can banish 1 Psychic-Type monster with 1500 ATK or less from your Deck. During your next Standby Phase, Special Summon that monster.
et: Kui see avatud kaart, mida sa kontrollid, eemaldatakse mängust: Sa võid eemaldada mängust ühe Psüühika-tüüpi koletise, millel on 1500 ATK või vähem, oma pakist. Järgmise ootejärgu faasi ajal kutsu see koletis eriliselt välja.

source: Watt King Cobra
et: Watt Kuningkobra

source: This card can attack your opponent directly. When this card inflicts Battle Damage to your opponent by a direct attack: Add 1 "Watt" monster from your Deck to your hand.
et: See kaart võib rünnata sinu vastast otse. Kui see kaart tekitab sinu vastasele lahingukahju otsese rünnakuga: Lisa 1 "Watt" koletis oma pakist oma kätte.

source: When this card is Normal Summoned: You can send 1 "Naturia" monster from your Deck to the Graveyard. Once per turn: You can target 2 "Naturia" monsters in your Graveyard; shuffle them into your Deck, and then draw 1 card.
et: Kui see kaart on Normaal-Summonitud: Sa võid saata 1 "Naturia" koletise oma pakist Hauakambrisse. Kord käigu jooksul: Sa võid valida 2 "Naturia" koletist oma Hauakambris; sega need oma pakki tagasi ja seejärel tõmba 1 kaart.

source: Prior of The Ice Barrier
et: Jääbarjääri Prior

source: If you control a face-up "Ice Barrier" monster: You can Special Summon this card (from your hand). If you do, you cannot Special Summon Level 5 or higher monsters during this turn. During your Main Phase: You can Tribute this card to target 1 "Ice Barrier" monster in your Graveyard except "<M9748>Prior of The Ice Barrier<M>"; Special Summon that target.
et: Kui sa kontrollid avatud "Ice Barrier" koletist: Sa võid selle kaardi (oma käest) eriliselt kutsuda. Kui sa seda teed, ei saa sa sellel käigul eriliselt kutsuda 5. või kõrgema taseme koletisi. Oma peafaasis: Sa võid ohverdada selle kaardi, et sihtida 1 "Ice Barrier" koletist oma hauas, välja arvatud "<M9748>Prior of The Ice Barrier<M>"; kutsu see sihtmärk eriliselt välja.

source: Silver Ninja
et: Hõbeninja

source: When this card is flipped face-up: Special Summon any number of "Ninja" monster(s) from your hand or Graveyard in face-down Defense Position, except "<M9749>Silver Ninja<M>". There can only be 1 face-up "<M9749>Silver Ninja<M>" on the field.
et: Kui see kaart pööratakse avatud asendisse: Kutsu eriliselt välja ükskõik milline arv "Ninja" koletisi oma käest või Hauakambrist kinnises kaitseasendis, välja arvatud "<M9749>Silver Ninja<M>". Väljakul võib olla ainult 1 avatud "<M9749>Silver Ninja<M>".

source: Each time your opponent Special Summons a monster, place 1 Acorn Counter on this card. During your Main Phase: You can remove 1 Acorn Counter from this card to target 1 monster your opponent controls; destroy that target.
et: Iga kord, kui sinu vastane kutsub eriliselt välja koletise, pane sellele kaardile 1 Tõru Loendur. Oma peafaasis: Sa võid eemaldada sellelt kaardilt 1 Tõru Loenduri, et sihtida 1 koletist, mida sinu vastane kontrollib; hävita see sihtmärk.

source: Cannot be Special Summoned. During the End Phase of the turn that this card is Normal Summoned or flipped face-up: Return it to its owner's hand. When this card is Normal Summoned or flipped face-up: Destroy all Set Spell/Trap Cards your opponent controls.
et: Ei saa erikutsuda. Selle kaardi normaalset kutsumist või ülespoole pööramist sisaldava käigu lõppfaasis: Tagasta see omaniku kätte. Kui see kaart on normaalselt kutsutud või ülespoole pööratud: Hävita kõik vastase kontrollitavad seatud loitsu/lõksu kaardid.

source: Tribe-Shocking Virus
et: Hõimushokeeriv Viirus

source: Once per turn: You can banish 1 monster from your hand; destroy all face-up monsters with the same Type as the banished monster.
et: Korra ühe korra käigu jooksul: Sa võid eemaldada 1 koletise oma käest mängust; hävita kõik ülespööratud koletised, mille tüüp on sama, mis eemaldatud koletisel.

source: Goblin Construction Crew
et: Goblini ehitusmeeskond

source: Trap Cards cannot be activated when this card is Normal Summoned. "<M4836>Trap Hole<M>" Trap Cards, except "<M9157>Dark Trap Hole<M>", "<M8855>Chaos Trap Hole<M>", and1 "<M7472>Gemini Trap Hole<M>", cannot be activated when a monster(s) is Summoned.
et: Lõksukaartide aktiveerimine ei ole võimalik, kui see kaart on normaalset kutsutud. "<M4836>Trap Hole<M>" lõksukaartide, välja arvatud "<M9157>Dark Trap Hole<M>", "<M8855>Chaos Trap Hole<M>" ja "<M7472>Gemini Trap Hole<M>", aktiveerimine ei ole võimalik, kui koletis(t) kutsutakse.

source: Des Rabbit
et: Des Jänes

source: FLIP: Inflict 1000 damage to your opponent for each face-up non-Token Normal Monster you control.
et: FLIP: Põhjusta oma vastasele 1000 kahju iga ülespööratud mitte-Tokeni Tavalise Koletise eest, mida sa kontrollid.

source: Rescue Rabbit
et: Päästjänälg

source: This card cannot be Special Summoned from the Deck. You can banish this face-up card you control; Special Summon 2 Level 4 or lower Normal Monsters with the same name from your Deck. Destroy them during the End Phase. The effect of "<M9755>Rescue Rabbit<M>" can only be activated once per turn.
et: Seda kaarti ei saa eriliselt kutsuda pakist. Sa saad eemaldada mängust selle ülespoole suunatud kaardi, mida sa kontrollid; kutsu eriliselt 2 4. taseme või madalama taseme tavalist koletist sama nimega oma pakist. Hävita need lõppfaasis. "<M9755>Päästjänes<M>" efekti saab aktiveerida ainult üks kord käigu jooksul.

source: Baby Tiragon
et: Beebi Tiragon
