Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: "<M6313>Elemental HERO Sparkman<M>" + "<M6312>Elemental HERO Clayman<M>"<BR>Must be Special Summoned with "<M7262>Dark Fusion<M>" and cannot be Special Summoned by other ways. Once per turn: You can target 1 monster on the field; destroy that target.
et: "<M6313>Elementaalne Kangelane Sädemeinimene<M>" + "<M6312>Elementaalne Kangelane Saviga Mees<M>"<BR>Peab olema erilises kutses "<M7262>Tume Sulandumine<M>" ja ei saa olla erilises kutses muul viisil. Kord kord: Sa võid sihtida 1 koletist väljal; hävita see sihtmärk.

source: Evil HERO Dark Gaia
et: Kuriangli KANGEL Pime Gaia

source: 1 Fiend-Type monster + 1 Rock-Type monster<BR>Must be Special Summoned with "<M7262>Dark Fusion<M>" and cannot be Special Summoned by other ways. The original ATK of this card is equal to the combined original ATK of the Fusion Material Monsters used to Fusion Summon it. When this card declares an attack: You can change all Defense Position monsters your opponent controls to face-up Attack Position. (Flip Effects are not activated at this time.)
et: 1 Deemon-tüüpi koletis + 1 Kivi-tüüpi koletis<BR>Peab olema eriliselt kutsutud "<M7262>Dark Fusion<M>" abil ja ei saa olla eriliselt kutsutud muul viisil. Selle kaardi algne ATK on võrdne nende Fusion Materjal Koletiste algse ATK-ga, mida kasutati selle Fusion Summon'iks. Kui see kaart kuulutab välja rünnaku: Sa võid muuta kõik kaitsepositsioonis olevad vastase koletised rünnakupositsiooniks. (Flip-efektid ei aktiveeru sel ajal.)

source: Dark Fusion
et: Tume Sulandumine

source: Send, from your hand or your side of the field to the Graveyard, the Fusion Material Monsters that are listed on a Fiend-Type Fusion Monster Card, then Special Summon that Fusion Monster from your Extra Deck. (This Special Summon is treated as a Fusion Summon). The Special Summoned monster cannot be targeted by the opponent's Spells, Traps, or card effects this turn.
et: Saada oma käest või oma väljaku poolelt Hauakambrisse Fusion Material Monsters, mis on loetletud Fiend-Type Fusion Monster Card'il, seejärel Special Summon see Fusion Monster oma Extra Deck'ist. (See Special Summon käsitletakse kui Fusion Summon). Special Summoned monsterit ei saa sellel käigul vastase loitsud, lõksud ega kaardiefektid sihtida.

source: Fossil Dragon Skullgios
et: Fossiildraakon Koljugeos

source: 1 Rock-Type monster in your Graveyard + 1 Level 8 or higher monster in your opponent's Graveyard.<BR>This card cannot be Special Summoned except by the effect of "<M3748>Fossil Fusion<M>". When this card attacks, you can switch the ATK and DEF of the attack-target monster during the Damage Step only. During battle between that attacking card and a Defense Position monster whose DEF is lower than the ATK of that card, inflict piercing damage to your opponent's Life Points.
et: 1 Kalju-tüüpi koletis sinu Hauakambris + 1 Tase 8 või kõrgem koletis sinu vastase Hauakambris.<BR>Seda kaarti ei saa Eriliselt Kutsuda, välja arvatud "<M3748>Fossil Fusion<M>" efektiga. Kui see kaart ründab, saad Sa Kahjustuse Sammul vahetada rünnatava koletise ATK ja DEF. Kui see ründav kaart võitleb Kaitsepositsioonis oleva koletisega, kelle DEF on madalam kui selle kaardi ATK, põhjusta läbistavat kahju oma vastase Elupunktidele.

source: Cloudian - Eye of the Typhoon
et: Cloudian - Tormisilm

source: This card cannot be destroyed by battle. If this card is in face-up Defense Position, destroy it. When this card declares an attack, change the battle positions of all face-up monsters, except "Cloudian" monsters.
et: Seda kaarti ei saa lahingus hävitada. Kui see kaart on avatud kaitsepositsioonis, hävita see. Kui see kaart kuulutab välja rünnaku, muuda kõigi avatud koletiste lahingupositsioone, välja arvatud "Cloudian" koletised.

source: Cloudian - Ghost Fog
et: Pilveke - Kummitusudu

source: This card cannot be Special Summoned. All Battle Damage to either player from a battle involving this monster becomes 0. If this card is destroyed by battle, distribute new Fog Counters equal to the Level of the monster that destroyed it among face-up monsters.
et: Seda kaarti ei saa eriliselt kutsuda. Kogu lahingukahju, mis tekib selle koletisega seotud lahingust, muutub mõlemale mängijale 0-ks. Kui see kaart hävitatakse lahingus, jaotage uued Udu Loendurid, mis on võrdne selle koletise tasemega, mis selle hävitas, avatud koletiste vahel.

source: Cloudian - Nimbusman
et: Pilvian - Nimbusmees

source: This card cannot be destroyed by battle. If this card is in face-up Defense Position, destroy it. You can Tribute any number of WATER monsters for the Tribute Summon of this card. When this card is Tribute Summoned, place 1 Fog Counter on it for each WATER monster you Tributed. This card gains 500 ATK for each Fog Counter on the field.
et: Seda kaarti ei saa lahingus hävitada. Kui see kaart on avatud kaitsepositsioonis, hävita see. Selle kaardi ohverdussummonimiseks võid ohverdada suvalise arvu VEE koletisi. Kui see kaart on ohverdussummonitud, pane sellele iga ohverdatud VEE koletise eest 1 udu loendur. See kaart saab iga väljal oleva udu loenduri eest 500 ATK-d juurde.

source: Cloudian - Sheep Cloud
et: Pilveke - Lambapilv

source: When this card is destroyed by battle and sent to the Graveyard, Special Summon 2 "<M3933>Cloudian Token<M>" (Fairy-Type/WATER/Level 1/ATK 0/DEF 0) in Defense Position. These tokens cannot be Tributed for a Tribute Summon, unless it is for a "Cloudian" monster.
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse, kutsu eriliselt välja 2 "<M3933>Cloudian Token<M>" (Haldjatüüp/VEEL/Tase 1/ATK 0/DEF 0) kaitsepositsioonis. Neid žetoone ei saa kasutada ohverdussummoniks, välja arvatud juhul, kui see on "Cloudian" koletis.

source: Cloudian - Poison Cloud
et: Cloudian - Mürgipilv

source: If this face-up card attacks or is attacked, and is destroyed by battle and sent to the Graveyard, destroy the monster that destroyed it, and then inflict 800 damage to your opponent.
et: Kui see avatud kaart ründab või teda rünnatakse ning ta hävitatakse lahingus ja saadetakse Hauakambrisse, hävita koletis, kes selle hävitas, ja seejärel tekita oma vastasele 800 kahju.

source: Diamond-Dust Cyclone
et: Teemanttolmu Tsüklon

source: Activate only by selecting 1 monster on the field with at least 4 Fog Counters on it. Destroy the selected monster. Then, draw 1 card for every 4 Fog Counters that were on it.
et: Aktiveeri ainult, valides välja 1 koletise väljal, millel on vähemalt 4 udu loendurit. Hävita valitud koletis. Seejärel tõmba 1 kaart iga 4 udu loenduri kohta, mis sellel olid.

source: Summon Cloud
et: Kutsumispilv

source: Once per turn, during your Main Phase, if you don't control any monsters, you can Special Summon 1 Level 4 or lower "Cloudian" monster from your hand or from either player's Graveyard. If you Special Summon a monster from the Graveyard with this effect, destroy this card.
et: Kord ühe korra oma peafaasil, kui sul ei ole ühtegi koletist, saad eriliselt kutsuda 1. taseme 4 või madalama "Cloudian" koletise oma käest või mõlema mängija hauast. Kui sa kutsud selle efektiga koletise hauast, hävita see kaart.

source: Lucky Cloud
et: Õnnelik Pilv

source: During the End Phase, if you Summoned 2 or more "Cloudian" monsters with the same name this turn, draw 2 cards.
et: End Phase'i ajal, kui sa kutsusid sellel käigul välja 2 või rohkem sama nimega "Cloudian" koletist, tõmba 2 kaarti.

source: Natural Disaster
et: Looduskatastroof

source: Inflict 500 damage to your opponent each time a card(s) they control is destroyed and sent to the Graveyard by the effect of a "Cloudian" monster.
et: Iga kord, kui "Cloudian" koletise efekti tõttu hävitatakse ja saadetakse vastase kontrolli all olev kaart või kaardid Hauakambrisse, tekitage vastasele 500 kahju.

source: Rain Storm
et: Vihmavaling

source: Select 1 "Cloudian" monster you control. Reduce that monster's ATK by 1000 or 2000 and apply the appropriate effect:<BR>● 1000 points: Destroy 1 Spell or Trap Card your opponent controls.<BR>● 2000 points: Destroy 2 cards your opponent controls.
et: Vali 1 "Cloudian" koletis, mida sa kontrollid. Vähenda selle koletise ATK-d 1000 või 2000 võrra ja rakenda vastav efekt:<BR>● 1000 punkti: Hävita 1 loitsu- või lõksukaart, mida su vastane kontrollib.<BR>● 2000 punkti: Hävita 2 kaarti, mida su vastane kontrollib.

source: Elemental HERO Chaos Neos
et: Elementaalne KANGELANE Kaos Neos

source: "<M6653>Elemental Hero Neos<M>" + "<M6772>Neo-Spacian Dark Panther<M>" + "<M6771>Neo-Spacian Glow Moss<M>"<BR>Must be first Special Summoned (from your Extra Deck) by shuffling the above cards you control into the Deck. (You do not use "<M4837>Polymerization<M>"). During the End Phase: Shuffle this card into the Extra Deck, then Set all face-up monsters on the field. Once per turn, during your Main Phase 1: You can toss a coin 3 times.<BR>● 3 Heads: Destroy all monsters your opponent controls.<BR>● 2 Heads: For the rest of the turn, the effects of all face-up monsters your opponent controls are negated.<BR>● 1 Head: Return all monsters you control to the hand.
et: "<M6653>Elemental Hero Neos<M>" + "<M6772>Neo-Spacian Dark Panther<M>" + "<M6771>Neo-Spacian Glow Moss<M>"<BR>Peab olema esmakordselt eriliselt kutsutud (teie lisapakist), segades ülaltoodud kaardid, mida te kontrollite, pakki. (Te ei kasuta "<M4837>Polümerisatsioon<M>"). Lõppfaasi ajal: Segage see kaart lisapakki, seejärel asetage kõik avatud koletised väljal. Kord ühe käigu jooksul, oma peafaasi 1 ajal: Võite visata münti 3 korda.<BR>● 3 pead: Hävitage kõik koletised, mida teie vastane kontrollib.<BR>● 2 pead: Ülejäänud käigu jooksul on kõik teie vastase kontrollitavad avatud koletised ilma efektideta.<BR>● 1 pea: Tagastage kõik koletised, mida te kontrollite, kätte.

source: Chamberlain of the Six Samurai
et: Kuue Samuraikoja kammerhärra

source: The Six Samurai are supported from the shadows by this silent, mysterious warrior. His past is unknown to them, but his countless scars are proof of his experience.
et: Kuusamuraid toetab varjudest see vaikne, salapärane sõdalane. Tema minevik on neile teadmata, kuid tema lugematud armid on tõendiks tema kogemustest.

source: Cloudian - Smoke Ball
et: Cloudian - Suitsupall

source: Smoke Balls are newly born Cloudians. They fear being alone, and would rather swing and sway in the sky with their friends.
et: Suurepallid on äsja sündinud Pilveolendid. Nad kardavad üksindust ja eelistavad pigem taevas koos sõpradega kiikuda ja õõtsuda.

source: Cloudian - Acid Cloud
et: Pilveke - Happepilv

source: This card cannot be destroyed by battle. If this card is in face-up Defense Position, destroy it. When you Normal Summon this card, place 1 Fog Counter on it for each "Cloudian" monster on the field. You can remove 2 Fog Counters from this card to destroy 1 Spell or Trap Card.
et: Seda kaarti ei saa lahingus hävitada. Kui see kaart on avatud kaitsepositsioonis, hävita see. Kui sa kutsud selle kaardi normaalselt välja, aseta sellele 1 udu loendur iga "Cloudian" koletise kohta väljal. Sa saad eemaldada sellelt kaardilt 2 udu loendurit, et hävitada 1 loitsu- või lõksukaart.

source: Cloudian - Cirrostratus
et: Pilveke - Kiudpilv

source: This card cannot be destroyed by battle. If this card is in face-up Defense Position, destroy it. When you Normal Summon this card, place 1 Fog Counter on it for each "Cloudian" monster on the field. You can remove 2 Fog Counters from this card to destroy 1 monster on the field.
et: Seda kaarti ei saa lahingus hävitada. Kui see kaart on avatud kaitsepositsioonis, hävita see. Kui sa kutsud selle kaardi normaalselt välja, pane sellele 1 udu loendur iga "Cloudian" koletise kohta väljakul. Sa saad eemaldada 2 udu loendurit sellelt kaardilt, et hävitada 1 koletis väljakul.

source: Cloudian - Altus
et: Pilveolend - Altus

source: This card cannot be destroyed by battle. If this card is in face-up Defense Position, destroy it. When you Normal Summon this card, place 1 Fog Counter on it for each "Cloudian" monster on the field. You can remove 3 Fog Counters from anywhere on the field to discard 1 random card from your opponent's hand.
et: Seda kaarti ei saa lahingus hävitada. Kui see kaart on avatud kaitsepositsioonis, hävita see. Kui sa kutsud selle kaardi normaalselt välja, aseta sellele 1 udu loendur iga "Cloudian" koletise kohta väljal. Sa võid eemaldada 3 udu loendurit ükskõik kust väljal, et visata 1 juhuslik kaart oma vastase käest ära.

source: Cloudian - Turbulence
et: Pilveke - Turbulents

source: This card cannot be destroyed by battle. If this card is in face-up Defense Position, destroy it. When you Normal Summon this card, place 1 Fog Counter on it for each "Cloudian" monster on the field. You can remove 1 Fog Counter from this card to Special Summon 1 "<M7277>Cloudian - Smoke Ball<M>" from your Deck or from either player's Graveyard.
et: Seda kaarti ei saa lahingus hävitada. Kui see kaart on avatud kaitsepositsioonis, hävita see. Kui sa kutsud selle kaardi normaalselt välja, pane sellele üks udu loendur iga "Cloudian" koletise kohta väljakul. Sa saad eemaldada ühe udu loenduri sellelt kaardilt, et eriliselt välja kutsuda üks "<M7277>Cloudian - Smoke Ball<M>" oma pakist või mõlema mängija hauast.

source: Gladiator Beast Alexander
et: Gladiaatorikutsar Alexander

source: This card cannot be Special Summoned except by the effect of "<M7288>Gladiator Beast Dimacari<M>". When this card is Special Summoned, it is unaffected by the effects of Spell Cards. At the end of the Battle Phase, if this card attacked or was attacked, you can return it to the Deck to Special Summon 1 "Gladiator Beast" monster from your Deck, except1 "<M7282>Gladiator Beast Alexander<M>".
et: Seda kaarti ei saa eriliselt kutsuda, välja arvatud "<M7288>Gladiator Beast Dimacari<M>" efekti abil. Kui see kaart kutsutakse eriliselt, ei mõjuta seda Loitsukaartide efektid. Lahingu faasi lõpus, kui see kaart ründas või seda rünnati, võid selle tagasi paki segada, et eriliselt kutsuda 1 "Gladiator Beast" koletis oma pakist, välja arvatud "<M7282>Gladiator Beast Alexander<M>".

source: Gladiator Beast Spartacus
et: Gladiaatorikütt Spartacus

source: This card cannot be Special Summoned except by the effect of "<M7287>Gladiator Beast Hoplomus<M>". When this card is Special Summoned, add 1 "Gladiator Beast" Equip Spell Card from your Deck to your hand. At the end of the Battle Phase, if this card attacked or was attacked, you can return it to the Deck to Special Summon 1 "Gladiator Beast" monster from your Deck, except1 "<M7283>Gladiator Beast Spartacus<M>".
et: Seda kaarti ei saa eriliselt kutsuda, välja arvatud "<M7287>Gladiator Beast Hoplomus<M>" efekti abil. Kui see kaart kutsutakse eriliselt välja, lisa 1 "Gladiator Beast" Varustuse Loitsukaart oma pakist oma kätte. Lahingufaasi lõpus, kui see kaart ründas või teda rünnati, võid selle paki tagasi saata, et eriliselt kutsuda 1 "Gladiator Beast" koletis oma pakist, välja arvatud "<M7283>Gladiator Beast Spartacus<M>".

source: Gladiator Beast Murmillo
et: Gladiaatorikutsar Murmillo

source: When this card is Special Summoned by the effect of a "Gladiator Beast" monster: Target 1 face-up monster; destroy that target. At the end of the Battle Phase, if this card attacked or was attacked: You can shuffle it into the Deck; Special Summon 1 "Gladiator Beast" monster from your Deck, except1 "<M7284>Gladiator Beast Murmillo<M>".
et: Kui see kaart kutsutakse eriliselt välja "Gladiator Beast" koletise efekti abil: Sihtige 1 avatud koletis; hävitage see sihtmärk. Lahingufaasi lõpus, kui see kaart ründas või teda rünnati: Saate selle tagasi segada pakki; kutsuge eriliselt välja 1 "Gladiator Beast" koletis oma pakist, välja arvatud "<M7284>Gladiator Beast Murmillo<M>".

source: Gladiator Beast Bestiari
et: Gladiaatorikutsar Bestiari

source: When this card is Special Summoned by the effect of a "Gladiator Beast" monster: Target 1 Spell/Trap Card; destroy that target. At the end of the Battle Phase, if this card attacked or was attacked: You can shuffle it into the Deck; Special Summon 1 "Gladiator Beast" monster from your Deck, except1 "<M7285>Gladiator Beast Bestiari<M>".
et: Kui see kaart kutsutakse eriliselt välja "Gladiator Beast" koletise efekti abil: Sihtige 1 Loitsu/Lõksu Kaarti; hävitage see sihtmärk. Lahingufaasi lõpus, kui see kaart ründas või teda rünnati: Saate selle segada tagasi pakki; Kutsuge eriliselt välja 1 "Gladiator Beast" koletis oma pakist, välja arvatud "<M7285>Gladiator Beast Bestiari<M>".

source: Gladiator Beast Laquari
et: Gladiaatoribeast Laquari

source: If this card was Special Summoned by the effect of a "Gladiator Beast" monster, its original ATK becomes 2100. At the end of the Battle Phase, if this card attacked or was attacked: You can shuffle it into the Deck; Special Summon 1 "Gladiator Beast" monster from your Deck, except1 "<M7286>Gladiator Beast Laquari<M>".
et: Kui see kaart kutsuti eriliselt välja "Gladiator Beast" koletise efekti abil, muutub selle algne ATK 2100-ks. Lahingufaasi lõpus, kui see kaart ründas või teda rünnati: Sa võid selle segada tagasi pakki; Kutsu eriliselt välja 1 "Gladiator Beast" koletis oma pakist, välja arvatud "<M7286>Gladiator Beast Laquari<M>".

source: Gladiator Beast Hoplomus
et: Gladiaatorikutsar Hoplomus

source: If this card was Special Summoned by the effect of a "Gladiator Beast" monster, its original DEF becomes 2400. At the end of the Battle Phase, if this card attacked or was attacked: You can shuffle it into the Deck; Special Summon 1 "Gladiator Beast" monster from your Deck, except1 "<M7287>Gladiator Beast Hoplomus<M>".
et: Kui see kaart kutsuti eriliselt välja "Gladiator Beast" koletise efekti abil, muutub selle algne DEF 2400-ks. Lahingufaasi lõpus, kui see kaart ründas või teda rünnati: Sa võid selle segada tagasi pakki; Kutsu eriliselt välja 1 "Gladiator Beast" koletis oma pakist, välja arvatud1 "<M7287>Gladiator Beast Hoplomus<M>".

source: Gladiator Beast Dimacari
et: Gladiaatorikutsar Dimacari

source: If this card is Special Summoned by the effect of a "Gladiator Beast" monster, it can attack twice during the same Battle Phase. If this card battles, by returning it from the field to the Deck at the end of the Battle Phase, Special Summon 1 "Gladiator Beast" monster from your Deck, except1 "<M7288>Gladiator Beast Dimacari<M>".
et: Kui see kaart kutsutakse eriliselt välja "Gladiator Beast" koletise efekti abil, võib see rünnata kaks korda sama Lahingufaasi jooksul. Kui see kaart võitleb, siis Lahingufaasi lõpus, tagastades selle väljakult pakki, kutsu eriliselt välja 1 "Gladiator Beast" koletis oma pakist, välja arvatud "<M7288>Gladiator Beast Dimacari<M>".

source: Gladiator Beast Secutor
et: Gladiaatorikutsar Secutor

source: If this card was Special Summoned by the effect of a "Gladiator Beast" monster, then at the end of any Battle Phase in which this card attacked or was attacked: Special Summon 2 "Gladiator Beast" monsters from your Deck, except1 "<M7289>Gladiator Beast Secutor<M>".
et: Kui see kaart kutsuti eriliselt välja "Gladiator Beast" koletise efekti abil, siis iga Lahingufaasi lõpus, milles see kaart ründas või teda rünnati: Kutsu eriliselt välja 2 "Gladiator Beast" koletist oma pakist, välja arvatud1 "<M7289>Gladiator Beast Secutor<M>".

source: Test Ape
et: Testahv

source: When this card is destroyed by battle and sent to the Graveyard, you can Special Summon 1 Level 4 or lower "Gladiator Beast" monster from your Deck.
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse, saad oma pakist eriliselt kutsuda 1. taseme või madalama "Gladiaatoribeast" koletise.

source: Witch Doctor of Sparta
et: Sparta nõiamees

source: Inflict 500 damage to your opponent each time a monster(s) is Special Summoned from either player's Deck.
et: Tekita oma vastasele 500 kahju iga kord, kui mõni koletis(te) eriliselt kutsutakse kas mängija pakist.

source: Infinity Dark
et: Lõpmatus Tume

source: This card is treated as a Normal Monster while face-up on the field or in the Graveyard. While this card is face-up on the field, you can Normal Summon it to have it be treated as an Effect Monster with this effect:<BR>● When this card declares an attack, you can change the battle position of 1 face-up monster your opponent controls.
et: See kaart loetakse tavaliseks koletiseks, kui see on väljaku peal või hauas. Kui see kaart on väljaku peal, võid selle tavaliselt kutsuda, et seda käsitletaks efektkoletisena, millel on järgmine efekt:<BR>● Kui see kaart kuulutab välja rünnaku, võid muuta ühe vastase kontrollitava ülespoole suunatud koletise lahingupositsiooni.

source: Magical Reflect Slime
et: Maagiline Peegeldus Lima

source: This card is treated as a Normal Monster while face-up on the field or in the Graveyard. While this card is face-up on the field, you can Normal Summon it to have it be treated as an Effect Monster with this effect:<BR>● Your opponent takes all Battle Damage that you would have taken from a battle involving this card.
et: See kaart loetakse tavaliseks koletiseks, kui see on väljaku peal või hauas. Kui see kaart on väljaku peal, võid selle tavaliselt kutsuda, et seda käsitletaks efektikoletisena järgmise efektiga:<BR>● Sinu vastane saab kogu lahingukahju, mida sina oleksid saanud selle kaardiga seotud lahingust.

source: Ancient Gear Knight
et: Muinasvarustuse Rüütel

source: This card is treated as a Normal Monster while face-up on the field or in the Graveyard. While this card is face-up on the field, you can Normal Summon it to have it be treated as an Effect Monster with this effect:<BR>● If this card attacks, your opponent cannot activate Spell or Trap Cards until the end of the Damage Step.
et: See kaart loetakse tavaliseks koletiseks, kui see on väljaku peal või hauas. Kui see kaart on väljaku peal, võid selle normaalselt kutsuda, et seda käsitletaks efektkoletisena järgmise efektiga:<BR>● Kui see kaart ründab, ei saa sinu vastane aktiveerida loitsu- ega lõksukaarte kuni Kahjustuse Sammuni.

source: Goblin Black Ops
et: Goblin Mustaoperatsioonid

source: This card can attack your opponent directly. If this card attacks, it is changed to Defense Position at the end of the Battle Phase. This card's battle position cannot be changed until the end of your next turn, except with a card effect.
et: See kaart võib rünnata sinu vastast otse. Kui see kaart ründab, muudetakse see Lahingu Faasi lõpus Kaitsepositsiooniks. Selle kaardi lahingupositsiooni ei saa muuta enne sinu järgmise käigu lõppu, välja arvatud kaardi efekti abil.

source: Gambler of Legend
et: Legendide Mängur

source: Once per turn, you can toss a coin 3 times and apply the appropriate effect:<BR>● 3 Heads: Destroy all monsters your opponent controls.<BR>● 2 Heads: Discard 1 random card from your opponent's hand.<BR>● 1 Head: Destroy 1 card you control.<BR>● 3 Tails: Discard your entire hand.
et: Kord päevas võid visata münti 3 korda ja rakendada vastavat efekti:<BR>● 3 pead: Hävita kõik vastase kontrollitavad koletised.<BR>● 2 pead: Viska vastase käest juhuslikult 1 kaart ära.<BR>● 1 pea: Hävita 1 kaart, mida sa kontrollid.<BR>● 3 saba: Viska kogu oma käsi ära.

source: Enishi, Shien's Chancellor
et: Enishi, Shieni kantsler

source: Cannot be Normal Summoned or Set. Must be Special Summoned (from your hand) by banishing 2 "Six Samurai" monsters from your Graveyard, and cannot be Special Summoned by other ways. Once per turn: You can target 1 face-up monster; destroy that target. This card cannot declare an attack the turn you activate this effect.
et: Ei saa normaalset kutsuda ega asetada. Peab olema eriliselt kutsutud (teie käest), eemaldades oma kalmistult 2 "Kuue Samuraid" koletist, ja ei saa olla eriliselt kutsutud muul viisil. Kord käigu jooksul: Saate sihtida 1 avatud koletist; hävitage see sihtmärk. See kaart ei saa rünnakut kuulutada käigul, mil aktiveerite selle efekti.
