Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: Activate only when your opponent's monster declares a direct attack. Select 1 Synchro Monster in your Graveyard with a Level less than or equal to the attacking monster's. The Battle Damage you take from that attack is halved. At the end of the Damage Step, Special Summon the selected Synchro Monster from the Graveyard.
et: Aktiveeri ainult siis, kui sinu vastase koletis kuulutab välja otsese rünnaku. Vali 1 Sünkro Koletis oma Hauakambris, mille tase on väiksem või võrdne ründava koletise omaga. Selle rünnaku lahingukahju, mida sa saad, väheneb poole võrra. Kahjustuse sammu lõpus kutsu valitud Sünkro Koletis Hauakambrist eriliselt välja.

source: Barrier Wave
et: Barjääri Laine

source: Activate by Tributing 1 Synchro Monster when your opponent's monster declares an attack. Change all Attack Position monsters your opponent controls to Defense Position. Then, inflict damage to your opponent's Life Points equal to the attacking monster's DEF.
et: Aktiveeri, loovutades 1 Sünkro Koletise, kui sinu vastase koletis kuulutab välja rünnaku. Muuda kõik sinu vastase kontrollitavad Rünnakupositsioonis koletised Kaitsepositsiooni. Seejärel põhjusta oma vastase Elupunktidele kahju, mis on võrdne ründava koletise KAIT-ga.

source: Chain Whirlwind
et: Ahela keeristorm

source: Activate only when a card on the field is destroyed by a card effect. Select 2 Spell/Trap Cards on the field and destroy them.
et: Aktiveeri ainult siis, kui kaardiefekti tõttu hävitatakse väljal olev kaart. Vali 2 Väljal olevat Loitsu/Lõksu Kaarti ja hävita need.

source: Scrap Rage
et: Rämpsraev

source: Activate only during damage calculation, if a Defense Position "Scrap" monster on the field is being attacked. It gains 2000 DEF and is destroyed at the end of the Battle Phase.
et: Aktiveeri ainult kahju arvutamise ajal, kui väljal olevat kaitseasendis "Scrap" koletist rünnatakse. See saab 2000 DEF juurde ja hävitatakse lahingufaasi lõpus.

source: Wattcannon
et: Wattkahur

source: Once per turn, when a Level 4 or lower Thunder-Type monster is Normal or Special Summoned to the field, inflict 600 damage to your opponent.
et: Korra ühe korra käigu jooksul, kui Tase 4 või madalama tasemega Äikese-tüüpi koletis kutsutakse tavaliselt või eriliselt välja väljakule, põhjusta oma vastasele 600 kahju.

source: Amazoness Willpower
et: Amazoniite Tahe

source: Select 1 "Amazoness" monster in your Graveyard and Special Summon it in Attack Position. It cannot change its battle position and must attack if able. When this card is removed from the field, destroy that monster. When that monster is destroyed, destroy this card.
et: Vali 1 "Amazoness" koletis oma kalmistul ja Kutsu see erilisesse rünnakupositsiooni. See ei saa oma lahingupositsiooni muuta ja peab ründama, kui võimalik. Kui see kaart eemaldatakse väljakult, hävita see koletis. Kui see koletis hävitatakse, hävita see kaart.

source: Queen's Pawn
et: Kuninganna ettur

source: Activate only when an "Amazoness" monster you control destroys an opponent's monster by battle and sends it to the Graveyard. Special Summon 1 Level 4 or lower "Amazoness" monster from your Deck.
et: Aktiveeri ainult siis, kui sinu kontrollitav "Amazoness" koletis hävitab lahingus vastase koletise ja saadab selle Hauakambrisse. Kutsu eriliselt välja 1 4. taseme või madalam "Amazoness" koletis oma pakist.

source: Beast Rising
et: Loomade Tõus

source: Once per turn, you can remove from play 1 face-up Beast-Type or Beast-Warrior-Type monster you control to select 1 other face-up Beast-Type or Beast-Warrior-Type monster you control. The selected monster gains the original ATK of the monster removed from play for this effect.
et: Korra ühe korra käigu jooksul saad eemaldada mängust ühe ülespööratud Beast-tüüpi või Beast-Warrior-tüüpi koletise, mida sa kontrollid, et valida üks teine ülespööratud Beast-tüüpi või Beast-Warrior-tüüpi koletis, mida sa kontrollid. Valitud koletis saab eemaldatud koletise algse ATK selle efekti jaoks.

source: Horn of the Phantom Beast
et: Fantoomlooma sarv

source: Equip this card to a Beast-Type or Beast-Warrior-Type monster you control. It gains 800 ATK. When the equipped monster destroys an opponent's monster by battle and sends it to the Graveyard, draw 1 card.
et: Varusta see kaart oma kontrollitava Põhjuse- või Põhjuse-Sõdalase-tüüpi koletisega. See saab 800 ATK. Kui varustatud koletis hävitab lahingus vastase koletise ja saadab selle Hauakambrisse, tõmba 1 kaart.

source: Paradox Fusion
et: Paradoxi Fusioon

source: Activate by removing 1 face-up Fusion Monster you control from play. Negate the activation of a Spell or Trap Card, OR the Special Summon of a monster and destroy that card. During your 2nd End Phase, return the removed Fusion Monster to the field in face-up Attack Position.
et: Aktiveeri, eemaldades mängust 1 ülespööratud Fusion Monster, mida sa kontrollid. Tühista Loitsu või Lõksukaardi aktiveerimine VÕI koletise Eriline Kutsumine ja hävita see kaart. Teise lõppfaasi ajal too eemaldatud Fusion Monster tagasi väljakule ülespööratud Rünnakupositsioonis.

source: Solemn Warning
et: Pühalik Hoiatus

source: Pay 2000 Life Points. Negate the Summon of a monster OR the activation of a Spell Card, Trap Card, or Effect Monster's effect that includes an effect that Special Summons a monster(s), and destroy that card.
et: Maksa 2000 Elupunkti. Tühista koletise kutsumine VÕI Loitsukaardi, Lõksukaardi või Efektkoletise efekti aktiveerimine, mis sisaldab efekti, mis kutsub eriliselt koletise(id), ja hävita see kaart.

source: Anti-Magic Prism
et: Antimaagia Prisma

source: Activate only when your opponent activates a Quick-Play Spell Card. Select 1 card on the field and destroy it.
et: Aktiveeri ainult siis, kui sinu vastane aktiveerib Kiirmängu Võlukaarte. Vali 1 kaart väljal ja hävita see.

source: Chivalry
et: Rüütellikkus

source: Activate only during the Battle Phase, when the effect of an opponent's Effect Monster is activated. Negate the activation and destroy that card.
et: Aktiveeri ainult Lahingufaasis, kui vastase Efektikoletise efekt aktiveeritakse. Tühista aktiveerimine ja hävita see kaart.

source: Light of Destruction
et: Hävingu Valgus

source: When an opponent's card effect sends a card(s) from their Deck to the Graveyard, send the top 3 cards of their Deck to the Graveyard.
et: Kui vastase kaardi efekt saadab kaardi(d) nende pakist hauakambrisse, saada nende paki kolm ülemist kaarti hauakambrisse.

source: Dust Lord Ash Gash
et: Tuhahärra Ash Gash

source: When this card inflicts Battle Damage to your opponent, increase its Level by 1 (max. 12).
et: Kui see kaart tekitab vastasele lahingukahju, suurenda selle taset 1 võrra (maks. 12).

source: Junk Forward
et: Rämps Edasi

source: If you control no monsters, you can Special Summon this card from your hand.
et: Kui sul pole ühtegi koletist, saad selle kaardi oma käest eriliselt kutsuda.

source: Scarred Warrior
et: Armitud Sõdalane

source: 1 Tuner + 1 or more non-Tuner monsters<BR>While this card is face-up on the field, your opponent cannot select other Warrior-Type monsters as attack targets. Once per turn, if this card would be destroyed by battle, it is not destroyed.
et: 1 Tuner + 1 või rohkem mitte-Tuner koletist<BR>Kui see kaart on lahinguväljal avatud, ei saa sinu vastane valida teisi Sõdalase-tüüpi koletisi rünnaku sihtmärkideks. Kord ühe käigu jooksul, kui see kaart peaks lahingus hävima, siis see ei hävi.

source: Sergeant Electro
et: Seersant Elektro

source: Once per turn: You can target 1 Set Spell/Trap Card your opponent controls; while this card is face-up on the field, that card cannot be activated.
et: Kord korra: Sa võid valida 1 vastase seatud Võlu-/Lõksukaardi; kuni see kaart on lahinguväljal avatud, ei saa seda kaarti aktiveerida.

source: XX-Saber Boggart Knight
et: XX-Saber Boggart Rüütel

source: When this card is Normal Summoned, you can Special Summon 1 Level 4 or lower "X-Saber" monster from your hand. This card cannot be used as a Synchro Material Monster, except for the Synchro Summon of a "X-Saber" monster.
et: Kui see kaart on Normaal-Kutsutud, saad oma käest Erilis-Kutsuda 1 4. taseme või madalama "X-Saber" koletise. Seda kaarti ei saa kasutada Sünkro-Materjal Koletisena, välja arvatud "X-Saber" koletise Sünkro-Kutsumiseks.

source: XX-Saber Darksoul
et: XX-Saber Pimedahing

source: If this card you control is sent to the Graveyard, during the End Phase you can add 1 "X-Saber" monster from your Deck to your hand.
et: Kui see kaart, mida sa kontrollid, saadetakse Hauakambrisse, saad Sa Lõppfaasis lisada ühe "X-Saber" koletise oma pakist oma kätte.

source: Saber Vault
et: Mõõgakamber

source: Each face-up "X-Saber" monster on the field gains 100 ATK x its Level, and loses 100 DEF x its Level.
et: Iga ülespoole suunatud "X-Saber" koletis väljakul saab juurde 100 ATK x oma taseme kohta ja kaotab 100 DEF x oma taseme kohta.

source: Koa'ki Meiru Prototype
et: Koa'ki Meiru Prototüüp

source: If a face-up "Koa'ki Meiru" monster(s) on the field would be destroyed during the End Phase, you can destroy this card instead. When a face-up "Koa'ki Meiru" monster(s) on the field is destroyed during the End Phase, you can Special Summon 1 "<M3968>Koa'ki Meiru Token<M>" (Rock-Type/EARTH/Level 4/ATK 1800/DEF 1800)
et: Kui End Phase'i ajal hävitatakse väljaku peal olev(ad) avatud "Koa'ki Meiru" koletis(ed), võid selle kaardi hävitada selle asemel. Kui End Phase'i ajal hävitatakse väljaku peal olev(ad) avatud "Koa'ki Meiru" koletis(ed), võid Special Summon'ida 1 "<M3968>Koa'ki Meiru Token<M>" (Kiviliik/MAA/Tase 4/ATK 1800/DEF 1800)

source: Core Overclock
et: Tuuma Ülekiirendus

source: All face-up "Koa'ki Meiru" monsters you control gain 500 ATK. Once per turn, during your Main Phase, you can discard 1 "<M8207>Iron Core of Koa'ki Meiru<M>" to have all face-up "Koa'ki Meiru" monsters you control gain 1000 ATK until the End Phase.
et: Kõik sinu kontrolli all olevad avatud "Koa'ki Meiru" koletised saavad 500 ATK juurde. Kord ühe käigu jooksul, oma peafaasis, võid sa ühe "<M8207>Koa'ki Meiru Raudtuuma<M>" ära visata, et kõik sinu kontrolli all olevad avatud "Koa'ki Meiru" koletised saaksid 1000 ATK juurde kuni lõppfaasini.

source: Wave-Motion Inferno
et: Laine-liikumise Inferno

source: While you have no cards in your hand, face-up "Infernity" monsters you control gain 400 ATK and DEF. You can send this face-up card from the field to the Graveyard to send all cards from your hand to the Graveyard.
et: Kui sul pole kaarte käes, saavad sinu kontrollitavad avatud "Infernity" koletised 400 ATK ja DEF juurde. Sa saad saata selle avatud kaardi väljakult Hauakambrisse, et saata kõik kaardid oma käest Hauakambrisse.

source: Infernity Barrier
et: Infernity Tõke

source: Activate only when your opponent activates a Spell Card, Trap Card, or Effect Monster's effect, if you control a face-up Attack Position "Infernity" monster and have no cards in your hand. Negate the activation and destroy that card.
et: Aktiveeri ainult siis, kui sinu vastane aktiveerib Võlukaarte, Lõksukaarti või Efektkoletise efekti, kui sul on kontrolli all avatud Rünnakupositsioonis "Infernity" koletis ja sul pole kaarte käes. Tühista aktiveerimine ja hävita see kaart.

source: Once per turn, you can Tribute 1 Plant-Type monster to select and destroy 1 face-up card your opponent controls. When a Plant-Type monster(s) on the field is destroyed while this card is in the Graveyard, you can Special Summon this card from the Graveyard. If you do, it is removed from play when it is removed from the field.
et: Korra ühe korra käigu jooksul saad sa ohverdada 1 Taim-tüüpi koletise, et valida ja hävitada 1 avatud kaart, mida sinu vastane kontrollib. Kui Taim-tüüpi koletis(ed) väljakul hävitatakse, kui see kaart on Hauas, saad sa selle kaardi Hauast eriliselt kutsuda. Kui sa seda teed, eemaldatakse see mängust, kui see väljakult eemaldatakse.

source: Nimble Sunfish
et: Väle Päikesekala

source: When this card is destroyed by battle and sent to the Graveyard, send 1 Fish-Type monster from your Deck to the Graveyard. Then, you can Special Summon 1 "<M9038>Nimble Sunfish<M>" from your Deck.
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse, saada 1 Kalatüüpi koletis oma pakist Hauakambrisse. Seejärel saad oma pakist eriliselt välja kutsuda 1 "<M9038>Nimble Sunfish<M>".

source: Akz, the Pumer
et: Akz, Pumer

source: This card cannot be Normal Summoned or Set. This card can only be Special Summoned by removing from play 2 Beast-Warrior-Type monsters in your Graveyard. Once per turn, you can discard 1 Beast-Warrior-Type monster from your hand to activate 1 of the following effects: • Double this card's ATK until the End Phase. • This card can attack your opponent directly this turn.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti saab eriliselt kutsuda ainult eemaldades oma kalmistult mängust 2 Beast-Warrior-tüüpi koletist. Kord ühe käigu jooksul võid sa oma käest ära visata 1 Beast-Warrior-tüüpi koletise, et aktiveerida üks järgmistest efektidest: • Kahekordista selle kaardi ATK kuni lõppfaasini. • See kaart võib sel käigul rünnata otse sinu vastast.

source: Dark Highlander
et: Tume Mägisõdalane

source: 1 Fiend-Type Tuner + 1 or more non-Tuner Fiend-Type monsters<BR>Neither player can Synchro Summon. Once per turn, you can select 1 monster your opponent controls that is equipped with an Equip Card. Destroy all Equip Cards equipped to that monster and inflict 400 damage to your opponent for each card destroyed.
et: 1 Deemon-tüüpi Tuner + 1 või rohkem mitte-Tuner Deemon-tüüpi koletisi<BR>Kumbki mängija ei saa Sünkro Kutsuda. Kord käigu jooksul saad valida 1 koletise, mida sinu vastane kontrollib ja millele on varustatud Varustuskaart. Hävita kõik Varustuskaardid, mis on sellele koletisele varustatud, ja tekita oma vastasele 400 kahju iga hävitatud kaardi eest.

source: Malefic Cyber End Dragon
et: Kurja Küberlõpu Draakon

source: This card cannot be Normal Summoned or Set. This card cannot be Special Summoned except by removing from play 1 "<M6397>Cyber End Dragon<M>" from your Extra Deck. There can only be 1 face-up "Malefic" monster on the field. Other monsters you control cannot declare an attack. If there is no face-up Field Spell Card on the field, destroy this card.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti ei saa eriliselt kutsuda, välja arvatud eemaldades mängust 1 "<M6397>Cyber End Dragon<M>" oma lisapakist. Väljakul võib olla ainult 1 avatud "Malefic" koletis. Teised koletised, mida sa kontrollid, ei saa rünnakut kuulutada. Kui väljakul ei ole avatud väljaloitsukaarti, hävita see kaart.

source: Malefic Truth Dragon
et: Kurjuse Tõe Draakon

source: Cannot be Normal Summoned/Set. Must be Special Summoned by its own effect, and cannot be Special Summoned by other ways. If a face-up "Malefic" monster you control, except "<M9042>Malefic Truth Dragon<M>", is destroyed by battle or by card effect: You can pay half your Life Points; Special Summon this card from your hand or Graveyard. There can only be 1 face-up "Malefic" monster on the field. If there is no face-up Field Spell Card on the field, destroy this card. If this card destroys an opponent's monster by battle: Destroy all face-up monsters your opponent controls.
et: Ei saa normaalset kutsuda/paigutada. Peab olema eriliselt kutsutud omaenda efektiga ja ei saa olla eriliselt kutsutud muul viisil. Kui sinu kontrollitav avatud "Malefic" koletis, välja arvatud "<M9042>Malefic Truth Dragon<M>", hävitatakse lahingus või kaardi efektiga: Sa võid maksta poole oma Elupunktidest; Kutsu see kaart eriliselt oma käest või Hauakambrist. Väljal võib olla ainult 1 avatud "Malefic" koletis. Kui väljal ei ole avatud Väliloitsu Kaarti, hävita see kaart. Kui see kaart hävitab lahingus vastase koletise: Hävita kõik vastase kontrollitavad avatud koletised.

source: Malefic Parallel Gear
et: Kurjuse paralleelkäik

source: When using this card as a Synchro Material Monster, the other Synchro Material Monster is 1 "Malefic" monster in your hand.
et: Seda kaarti Sünkromaterjalina kasutades on teine Sünkromaterjal sinu käes olev "Malefic" koletis.

source: Malefic Rainbow Dragon
et: Pahaendeline Vikerkaaredraakon

source: This card cannot be Normal Summoned or Set. This card cannot be Special Summoned, except by removing from play 1 "<M7171>Rainbow Dragon<M>" from your hand or Deck. There can only be 1 face-up "Malefic" monster on the field. Other monsters you control cannot declare an attack. If there is no face-up Field Spell Card on the field, destroy this card.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti ei saa eriliselt kutsuda, välja arvatud juhul, kui eemaldate mängust 1 "<M7171>Vikerkaare Draakon<M>" oma käest või pakist. Väljakul võib olla ainult 1 avatud "Malefic" koletis. Teised koletised, mida te kontrollite, ei saa rünnakut kuulutada. Kui väljakul ei ole avatud väljaloitsu kaarti, hävitage see kaart.

source: Junk Gardna
et: Rämpsu Kaitsja

source: "<M7687>Junk Synchron<M>" + 1 or more non-Tuner Monsters<BR>Once per turn, you can select 1 monster your opponent controls, and change its battle position. This effect can be activated during either player's turn. If this card is sent from the field to the Graveyard, you can select 1 monster on the field and change its battle position.
et: "<M7687>Junk Synchron<M>" + 1 või rohkem mittehäälestuskoletist<BR>Korra käigu jooksul saad valida 1 vastase koletise ja muuta selle lahinguasendit. Seda efekti saab aktiveerida mõlema mängija käigu ajal. Kui see kaart saadetakse väljakult hauakambrisse, saad valida 1 koletise väljakul ja muuta selle lahinguasendit.

source: You can Special Summon this card from your hand or your Graveyard by removing from play 1 face-up monster you control equipped with a "Dragunity" card(s). When this card is Normal or Special Summoned, you can select 1 Dragon-Type monster in your Graveyard, except "<M9046>Dragunity Arma Leyvaten<M>", and equip it to this card. When this card is sent to the Graveyard by your opponent's card effect, you can select 1 of the monsters that were equipped to this card when it was sent to the Graveyard, and Special Summon that monster from the Graveyard.
et: Sa saad selle kaardi oma käest või Hauakambrist eriliselt välja kutsuda, eemaldades mängust 1 ülespööratud koletise, mida sa kontrollid ja mis on varustatud "Dragunity" kaardiga. Kui see kaart kutsutakse tavaliselt või eriliselt välja, saad valida 1 Draakoni-tüüpi koletise oma Hauakambris, välja arvatud "<M9046>Dragunity Arma Leyvaten<M>", ja varustada see kaart sellele kaardile. Kui see kaart saadetakse Hauakambrisse sinu vastase kaardi efekti tõttu, saad valida ühe koletise, mis oli sellele kaardile varustatud, kui see saadeti Hauakambrisse, ja kutsuda see koletis Hauakambrist eriliselt välja.

source: You can Special Summon this card from your hand by sending 1 face-up "Dragunity" monster you control to the Graveyard. When this card is Normal or Special Summoned from the hand, you can select 1 Dragon-Type "Dragunity" monster in your Graveyard, and equip it to this card.
et: Saad selle kaardi oma käest eriliselt välja kutsuda, saates 1 avatud "Dragunity" koletise, mida sa kontrollid, kalmistule. Kui see kaart kutsutakse tavaliselt või eriliselt välja käest, saad valida 1 Draakoni-tüüpi "Dragunity" koletise oma kalmistul ja kinnitada selle sellele kaardile.

source: When this card is Normal Summoned, you can Special Summon 1 "Dragunity" monster from your hand, then equip it with this card. When this card is sent to the Graveyard while equipped to a monster, select 1 card on the field, and destroy it.
et: Kui see kaart on Normaal-Kutsutud, saad Erilis-Kutsuda 1 "Dragunity" koletise oma käest, seejärel varusta see selle kaardiga. Kui see kaart saadetakse Hauakambrisse, kui see on koletisega varustatud, vali 1 kaart väljal ja hävita see.

source: Dragon Ravine
et: Draakoni Kuristik

source: Once per turn, during your Main Phase, you can discard 1 card to activate 1 of these effects:<BR>● Add 1 Level 4 or lower "Dragunity" monster from your Deck to your hand.<BR>● Send 1 Dragon-Type monster from your Deck to the Graveyard.
et: Kord ühe korra oma peafaasil võid sa ühe kaardi ära visata, et aktiveerida üks järgmistest efektidest:<BR>● Lisa 1. taseme 4 või madalam "Dragunity" koletis oma pakist oma kätte.<BR>● Saada 1 Draakoni-tüüpi koletis oma pakist hauakambrisse.

source: Dragon Mastery
et: Draakoni Meistrivõim

source: Each monster you control that is equipped with 1 or more "Dragunity" monster(s) gain 500 ATK. Once per turn, you can select 1 face-up monster you control, and equip it with 1 Dragon-Type "Dragunity" monster from your hand.
et: Iga koletis, mida sa kontrollid ja millel on varustusena 1 või rohkem "Dragunity" koletist, saab 500 ATK juurde. Kord ühe käigu jooksul saad valida 1 avatud koletise, mida sa kontrollid, ja varustada selle oma käest 1 Draakoni-tüüpi "Dragunity" koletisega.

source: Phantom Magician
et: Fantoom Maag

source: When this card is destroyed by battle and sent to the Graveyard: You can Special Summon 1 "HERO" monster with 1000 or less ATK from your Deck in face-up Defense Position.
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse: Sa võid eriliselt kutsuda 1 "HERO" koletise, mille ATK on 1000 või vähem, oma pakist näoga ülespoole kaitseasendisse.

source: Rose Witch
et: Roosinõid

source: If you Tribute Summon a Plant-Type monster, you can treat this 1 monster as 2 Tributes.
et: Kui sa kutsud ohverdades välja Taim-tüüpi koletise, võid seda ühte koletist käsitleda kui kahte ohverdust.

source: Queen Angel of Roses
et: Rooside Kuninganna Ingel

source: You can Tribute Summon this card in face-up Attack Position by Tributing 1 Plant-Type monster. Once per turn, during your Standby Phase, destroy 1 face-up monster on the field with the lowest ATK.
et: Sa saad selle kaardi ohverdussummonida avatud ründeasendis, ohverdades 1 Taim-tüüpi koletise. Kord ühe käigu jooksul, oma ootejärgus, hävita 1 avatud koletis väljakul, millel on madalaim rünnak.

source: Mask Change
et: Maski Muutus

source: Target 1 face-up "HERO" monster you control; send it to the Graveyard. Then Special Summon 1 "Masked HERO" monster from the Extra Deck with the same Attribute.
et: Vali 1 avatud "HERO" koletis, mida sa kontrollid; saada see Hauakambrisse. Seejärel kutsu eriliselt välja 1 "Masked HERO" koletis Ekstra Pakkist sama Atribuudiga.

source: Masked HERO Goka
et: Maskeeritud KANGELANE Goka

source: Must be Special Summoned with "<M9066>Mask Change<M>" and cannot be Special Summoned by other ways. This card gains 100 ATK for each "HERO" monster in your Graveyard.
et: Peab olema eriliselt kutsutud "<M9066>Mask Change<M>" abil ja ei saa olla eriliselt kutsutud muul viisil. See kaart saab 100 ATK iga sinu kalmistul oleva "HERO" koletise eest.

source: Masked HERO Vapor
et: Maskeeritud KANGELANE Aur

source: Must be Special Summoned with "<M9066>Mask Change<M>", and cannot be Special Summoned by other ways. This card cannot be destroyed by card effects.
et: Peab eriliselt kutsuda "<M9066>Mask Change<M>" abil ja ei saa eriliselt kutsuda muul viisil. Seda kaarti ei saa hävitada kaardi efektide abil.

source: Vision HERO Adoration
et: Visioni KANGEL Adoration

source: 2 "HERO" monsters<BR>Once per turn: You can target 1 face-up monster your opponent controls and 1 face-up "HERO" monster you control, except this card; the opponent's targeted monster loses ATK and DEF equal to the ATK of your targeted monster, until the End Phase.
et: 2 "HERO" koletist<BR>Korra ühe korra käigu jooksul: Sa võid valida 1 vastase avatud koletise ja 1 sinu avatud "HERO" koletise, välja arvatud see kaart; vastase valitud koletis kaotab ATK ja DEF, mis on võrdne sinu valitud koletise ATK-ga, kuni End Phase'ini.

source: Swift Scarecrow
et: Kiire Varikajakas
