Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: This card cannot be Special Summoned. To Tribute Summon this card you must Tribute 3 Fiend-Type monsters. If this card attacks your opponent directly and reduces their Life Points to 0, you win the Match.
et: Seda kaarti ei saa eriliselt kutsuda. Selle kaardi ohverduskutsumiseks pead ohverdama 3 deemonitüüpi koletist. Kui see kaart ründab sinu vastast otse ja vähendab nende Elupunktid nulli, võidad matši.

source: Skuna, the Leonine Rakan
et: Skuna, Lõvilaadne Rakan

source: This card cannot be Special Summoned. To Tribute Summon this card you must Tribute 3 Beast-Warrior-Type monsters. If this card attacks your opponent directly and reduces their Life Points to 0, you win the Match.
et: Seda kaarti ei saa eriliselt kutsuda. Selle kaardi ohverdamiseks pead ohverdama 3 metsalise-sõdalase tüüpi koletist. Kui see kaart ründab otse sinu vastast ja vähendab nende Elupunkte 0-ni, võidad matši.

source: Unicycular
et: Üherattaline

source: The third of the brothers, following Tricular and Bicular.
et: Kolmas vendadest, järgneb Tricularile ja Bicularile.

source: Bicular
et: Bikulaar

source: When this card is destroyed by battle, you can Special Summon "<M8612>Unicycular<M>" from your hand or Deck.
et: Kui see kaart hävitatakse lahingus, saad eriliselt kutsuda "<M8612>Unicycular<M>" oma käest või pakist.

source: Tricular
et: Trikular

source: When this card is destroyed by battle and sent to the Graveyard, you can Special Summon "<M8613>Bicular<M>" from your hand or Deck.
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse, saad sa eriliselt kutsuda "<M8613>Bicular<M>" oma käest või pakist.

source: Drill Synchron
et: Puurija Sünkron

source: While you control this face-up card, during each battle between a Warrior-Type attacking monster you control and a Defense Position monster whose DEF is lower than the ATK of the attacking monster, inflict the difference as Battle Damage to your opponent. Once per turn, when you inflict battle damage to your opponent with this effect, you can draw 1 card.
et: Kui sa kontrollid seda avatud kaarti, siis iga lahingu ajal, kus sinu kontrolli all olev ründav Sõdalase-tüüpi koletis ründab Kaitsepositsioonis koletist, mille DEF on madalam kui ründava koletise ATK, põhjusta vahe oma vastasele Lahingukahjuna. Kord ühe käigu jooksul, kui sa põhjustad selle efektiga oma vastasele lahingukahju, võid sa tõmmata 1 kaardi.

source: Ogre of the Scarlet Sorrow
et: Veripunase kurbuse Ogre

source: During your opponent's turn, when your opponent declares a second direct attack during the same Battle Phase, you can Special Summon this card from your hand. When you do, this card's ATK and DEF becomes equal to the ATK and DEF of the first monster that attacked directly this turn, if it is still face-up on the field. The turn this card is Special Summoned with this effect, your opponent cannot select monsters other than this card as an attack target while this card is face-up on the field.
et: Oma vastase käigu ajal, kui vastane kuulutab välja teise otsese rünnaku sama Lahingu Faasi jooksul, saad selle kaardi oma käest Erikutsuda. Kui sa seda teed, muutuvad selle kaardi ATK ja DEF võrdseks esimese koletise ATK ja DEF-iga, kes ründas otse sel käigul, kui see on endiselt väljakul näoga ülespoole. Käigul, mil see kaart on selle efektiga Erikutsutud, ei saa sinu vastane valida teisi koletisi peale selle kaardi rünnaku sihtmärgiks, kui see kaart on väljakul näoga ülespoole.

source: Battle Fader
et: Lahingukustutaja

source: When your opponent's monster declares a direct attack: You can Special Summon this card from your hand, then end the Battle Phase. If this card is Special Summoned with this effect, banish it when it leaves the field.
et: Kui sinu vastase koletis kuulutab välja otsese rünnaku: Sa võid selle kaardi oma käest eriliselt kutsuda, seejärel lõpetada Lahingufaasi. Kui see kaart kutsutakse selle efektiga eriliselt välja, siis eemalda see mängust, kui see lahkub väljakult.

source: Power Supplier
et: Võimu Tarnija

source: Once per turn, you can select 1 face-up monster you control. It gains 400 ATK while you control this face-up card. (A monster cannot gain more than 400 ATK from this card's effect.)
et: Korra ühe korra käigu jooksul saad valida 1 avatud koletise, mida sa kontrollid. See saab 400 ATK juurde, kuni sa kontrollid seda avatud kaarti. (Koletis ei saa selle kaardi efekti tõttu rohkem kui 400 ATK juurde.)

source: Magic Hole Golem
et: Maagiline Auku Golem

source: Once per turn, you can select 1 face-up monster you control. Its ATK is halved until the End Phase, and it can attack your opponent directly this turn. During the turn you activate this effect, only the selected monster can attack.
et: Korra ühe korra käigu jooksul saad valida 1 avatud koletise, mida sa kontrollid. Selle ATK väheneb poole võrra kuni lõppfaasini ja see võib sellel käigul rünnata otse sinu vastast. Käigu jooksul, mil sa selle efekti aktiveerid, saab rünnata ainult valitud koletis.

source: Power Invader
et: Võimu Sissetungija

source: If your opponent controls 2 or more monsters, you can Normal Summon this card without Tributing.
et: Kui sinu vastasel on 2 või rohkem koletist, saad selle kaardi tavalisel viisil välja kutsuda ilma ohverdusteta.

source: Dark Bug
et: Tume Putukas

source: When this card is Normal Summoned, select and Special Summon 1 Level 3 Tuner monster from your Graveyard. The effect(s) of that monster is negated.
et: Kui see kaart on Normaal-Kutsutud, vali ja Kutsu Eriliselt 1 Tase 3 Häälestaja koletis oma Hauakambrist. Selle koletise efekt(id) on tühistatud.

source: Sword Master
et: Mõõgameister

source: If a Warrior-Type monster you control attacks your opponent's monster, and the opponent's monster is not destroyed by battle, at the end of the Damage Step you can Special Summon this card from your hand. During battle between this attacking card and a Defense Position monster whose DEF is lower than the ATK of this card, inflict the difference as Battle Damage to your opponent.
et: Kui Sõdalase-tüüpi koletis, mida sa kontrollid, ründab sinu vastase koletist ja vastase koletist ei hävitata lahingus, siis Saamude Sammude lõpus saad selle kaardi oma käest Erikutsuda. Lahingu ajal selle ründava kaardi ja Kaitseasendis koletise vahel, mille DEF on madalam kui selle kaardi ATK, põhjusta vahe Lahingukahjuna oma vastasele.

source: Witch of the Black Rose
et: Musta Roosi Nõid

source: This card cannot be Special Summoned. When this card is Normal Summoned while you control no cards, draw 1 card and reveal it. If the card you drew is not a Monster Card, send it to the Graveyard and destroy this card.
et: Seda kaarti ei saa eriliselt kutsuda. Kui see kaart kutsutakse normaalselt, kui sul pole ühtegi kaarti, tõmba 1 kaart ja näita seda. Kui tõmmatud kaart ei ole koletisekaart, saada see hauakambrisse ja hävita see kaart.

source: Rose Fairy
et: Roosi haldjas

source: If this card is added from your Deck to your hand by the effect of a Spell, Trap, or Monster Card, you can Special Summon this card.
et: Kui see kaart lisatakse sinu pakist sinu kätte loitsu, lõksu või koletise kaardi efekti tõttu, saad selle kaardi eriliselt välja kutsuda.

source: Dragon Queen of Tragic Endings
et: Traagiliste Lõppude Draakonikuninganna

source: This card cannot be Normal Summoned or Set. This card can only be Special Summoned by controlling 3 or more face-up Continuous Spell Cards. When this attacking card inflicts Battle Damage to your opponent, your opponent selects and sends 1 card from their hand to the Graveyard, and you draw 1 card. During your Standby Phase, if this card is in your Graveyard and was sent there from the field, you can send 1 face-up Continuous Spell Card you control to the Graveyard to Special Summon this card from the Graveyard.
et: Seda kaarti ei saa tavaliselt kutsuda ega asetada. Seda kaarti saab eriliselt kutsuda ainult siis, kui kontrollid 3 või enamat avatud pidevat loitsukaarti. Kui see ründav kaart tekitab lahingukahju sinu vastasele, valib ja saadab sinu vastane ühe kaardi oma käest hauakambrisse ning sina tõmbad ühe kaardi. Sinu ootejärgus, kui see kaart on sinu hauakambris ja saadeti sinna väljakult, saad saata ühe avatud pideva loitsukaardi, mida sa kontrollid, hauakambrisse, et eriliselt kutsuda see kaart hauakambrist.

source: Reptilianne Servant
et: Reptilianne Teenija

source: Destroy this card if there are face-up monsters on the field other than this card. Destroy this card when it is targeted by the effect of a Spell or Trap Card. Neither player can Normal Summon a monster while this card is face-up on the field.
et: Hävita see kaart, kui väljal on teisi avatud koletisi peale selle kaardi. Hävita see kaart, kui selle sihtmärgiks on Loitsu või Lõksukaardi efekt. Kumbki mängija ei saa normaalset kutsuda koletist, kui see kaart on väljal avatud.

source: When this card you control is destroyed and sent to the Graveyard, add 1 "Reptilianne" monster from your Deck to your hand.
et: Kui see kaart, mida sa kontrollid, hävitatakse ja saadetakse Hauakambrisse, lisa 1 "Reptilianne" koletis oma pakist oma kätte.

source: This card cannot be destroyed by battle. The ATK of any monster that battles this card becomes 0 at the end of that Battle Phase. During your End Phase, change this face-up Defense Position card on the field to face-up Attack Position.
et: Seda kaarti ei saa lahingus hävitada. Selle kaardiga võitleva koletise ATK muutub selle Lahingufaasi lõpus 0-ks. Oma Lõppfaasis muuda see avatud Kaitseasendis kaart väljal avatud Rünnakuasendisse.

source: This card cannot be Normal Summoned or Set. This card cannot be Special Summoned except by Tributing 2 face-up monsters with 0 ATK from anywhere on the field. Once per turn, you can select and destroy 1 face-up monster your opponent controls. There can only be 1 face-up "<M8629>Reptilianne Vaskii<M>" on the field.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti ei saa eriliselt kutsuda, välja arvatud, kui ohverdatakse 2 ülespööratud 0 ATK-ga koletist ükskõik kust väljalt. Kord käigu jooksul saad valida ja hävitada 1 ülespööratud koletise, mida sinu vastane kontrollib. Väljal võib olla ainult 1 ülespööratud "<M8629>Reptilianne Vaskii<M>".

source: Oracle of the Sun
et: Päikese Oraakel

source: If your opponent controls a monster and you control no monsters, you can Special Summon this card from your hand. When this card on the field is destroyed and sent to the Graveyard, you can add to your hand 1 "<M8631>Fire Ant Ascator<M>" or 1 "Supay" from your Deck.
et: Kui sinu vastasel on koletis ja sul pole ühtegi koletist, saad selle kaardi oma käest eriliselt kutsuda. Kui see kaart väljakul hävitatakse ja saadetakse Hauakambrisse, saad oma kätte lisada 1 "<M8631>Fire Ant Ascator<M>" või 1 "Supay" oma pakist.

source: Fire Ant Ascator
et: Tulekahjur Ascator

source: When this card is destroyed by battle and sent to the Graveyard, you can select and Special Summon 1 Level 5 monster from your Graveyard. Its effect(s) is negated, and it is sent to the Graveyard during the End Phase of this turn.
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse, saad valida ja eriliselt kutsuda 1. taseme 5 koletise oma Hauakambrist. Selle mõju(d) on tühistatud ja see saadetakse selle käigu lõppfaasis Hauakambrisse.

source: Weeping Idol
et: Nuttev iidol

source: You can remove from play 1 Tuner monster in your Graveyard to Special Summon this card from your hand.
et: Saad oma kalmistul olevast mängust eemaldada 1 Tuner koletis, et eriliselt kutsuda see kaart oma käest välja.

source: While this card is face-up on the field, it is Level 5 if you control a face-up Tuner Monster. When this card on the field is destroyed and sent to the Graveyard, you can select and Special Summon 1 "<M8630>Oracle of the Sun<M>" from your Graveyard.
et: Kui see kaart on lahinguväljal avatud, on see 5. tasemel, kui sa kontrollid avatud Häälestaja Koletist. Kui see kaart lahinguväljal hävitatakse ja saadetakse Hauakambrisse, saad valida ja Eriliselt Kutsuda 1 "<M8630>Päikese Oraakel<M>" oma Hauakambrist.

source: When this card is sent from the field to the Graveyard by a card effect, you can Special Summon 1 "<M8630>Oracle of the Sun<M>" from your Deck. The ATK of that monster is doubled, and it returns to the owner's hand during the End Phase of that turn.
et: Kui see kaart saadetakse kaardiefekti tõttu väljakult hauakambrisse, saad eriliselt kutsuda 1 "<M8630>Päikese Oraakel<M>" oma pakist. Selle koletise ATK kahekordistub ja see naaseb selle omaniku kätte selle käigu lõppfaasis.

source: Informer Spider
et: Informeerija Ämblik

source: When this card is sent from the field to the Graveyard by a card effect, take control of 1 Defense Position monster your opponent controls.
et: Kui see kaart saadetakse kaardiefekti tõttu väljakult hauakambrisse, võta kontroll 1 kaitseasendis oleva koletise üle, mida sinu vastane kontrollib.

source: During each of your End Phases, destroy this card unless you send 1 "<M8207>Iron Core of Koa'ki Meiru<M>" from your hand to the Graveyard or reveal 1 Beast-Warrior-Type monster in your hand. Once per turn, you can reveal 1 "<M8207>Iron Core of Koa'ki Meiru<M>" in your hand to Special Summon 1 Level 4 or lower "Koa'ki Meiru" monster from your Deck, except "<M8636>Koa'ki Meiru Urnight<M>".
et: Iga oma lõppfaasis hävita see kaart, välja arvatud juhul, kui saadad 1 "<M8207>Iron Core of Koa'ki Meiru<M>" oma käest Hauakambrisse või paljastad 1 Beast-Warrior-tüüpi koletise oma käes. Kord ühe käigu jooksul võid paljastada 1 "<M8207>Iron Core of Koa'ki Meiru<M>" oma käes, et erilissummonida 1 4. taseme või madalama "Koa'ki Meiru" koletise oma pakist, välja arvatud "<M8636>Koa'ki Meiru Urnight<M>".

source: When this card on the field is destroyed and sent to the Graveyard by a card effect, add 1 "X-Saber" monster from your Deck to your hand. This card gains 200 ATK for each face-up "X-Saber" monster you control.
et: Kui see kaart väljal hävitatakse ja kaardiefekti tõttu Hauakambrisse saadetakse, lisa 1 "X-Saber" koletis oma pakist oma kätte. See kaart saab 200 ATK iga avatud "X-Saber" koletise eest, mida sa kontrollid.

source: Gravekeeper's Visionary
et: Haudavahtide Nägija

source: You can Normal Summon this card by Tributing 1 "Gravekeeper's" monster. This card gains 200 ATK for each "Gravekeeper's" monster in your Graveyard. If this face-up card on the field would be destroyed, you can discard 1 "Gravekeeper's" monster instead.
et: Sa saad selle kaardi tavaliselt välja kutsuda, ohverdades 1 "Hauavalvuri" koletise. See kaart saab 200 ATK juurde iga "Hauavalvuri" koletise eest sinu Hauas. Kui see avatud kaart väljakul hävitatakse, saad selle asemel ühe "Hauavalvuri" koletise ära visata.

source: Gravekeeper's Descendant
et: Hauakaevurite Järeltulija

source: You can Tribute 1 face-up "Gravekeeper's" monster you control, except this card, to destroy 1 card your opponent controls.
et: Sa võid ohverdada 1 avatud "Hauavalvuri" koletise, mida sa kontrollid, välja arvatud see kaart, et hävitada 1 kaart, mida su vastane kontrollib.

source: Black Potan
et: Must Potan

source: If you control a face-up Tuner monster, this card cannot be destroyed by battle. When a face-up Tuner monster(s) you control is removed from the field, gain 800 Life Points.
et: Kui sa kontrollid avatud Tuner koletist, ei saa seda kaarti lahingus hävitada. Kui sinu kontrolli all olev(ad) avatud Tuner koletis(ed) eemaldatakse väljakult, saad 800 Elupunkti juurde.

source: Shreddder
et: Purustaja

source: Once per turn, you can send 1 Machine-Type monster from your hand to the Graveyard to destroy 1 face-up monster your opponent controls whose Level is less than or equal to that monster's.
et: Korra ühe korra käigu jooksul saad saata 1 Masinatüüpi koletise oma käest Hauakambrisse, et hävitada 1 vastase kontrollitav avatud koletis, mille tase on väiksem või võrdne selle koletise tasemega.

source: When this card is destroyed by battle and sent to the Graveyard, you can pay 800 Life Points to Special Summon 1 Level 4 Psychic-Type monster from your Deck.
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse, võid maksta 800 Elupunkti, et Kutsuda Eriliselt 1 Tase 4 Psüühika-Tüüpi koletis oma Pakist.

source: You can send 1 face-up "<M4340>Umi<M>" you control to the Graveyard to select up to 2 cards your opponent controls and send them to the Graveyard.
et: Saadad 1 avatud "<M4340>Umi<M>" oma kontrolli all Hauakambrisse, et valida kuni 2 kaarti, mida su vastane kontrollib, ja saata need Hauakambrisse.

source: Consecrated Light
et: Pühitsetud Valgus

source: Neither player can Normal or Special Summon DARK monsters or declare an attack with a DARK monster. This card cannot be destroyed by battle with a DARK monster, and you take no Battle Damage from that battle.
et: Kumbki mängija ei saa Normaal- ega Erikutsuda PIMEDAID koletisi ega kuulutada välja rünnakut PIMEDA koletisega. Seda kaarti ei saa hävitada lahingus PIMEDA koletisega ja sa ei saa sellest lahingust lahingukahju.

source: This card cannot be Special Summoned. This card returns to the owner's hand during the End Phase of the turn it is Normal Summoned or flipped face-up. If this card battles a Synchro Monster, return both monsters to their owner's hands at the start of the Damage Step (without damage calculation).
et: Seda kaarti ei saa eriliselt kutsuda. See kaart naaseb omaniku kätte selle käigu lõppfaasis, mil see on tavakutsutud või ümber pööratud. Kui see kaart võitleb sünkroonkoletisega, naasevad mõlemad koletised omanike kätte Kahjustuse Arvutamise sammu alguses (ilma kahjustuse arvutamiseta).

source: Cyber Dragon Zwei
et: Küberdraakon Zwei

source: If this card attacks an opponent's monster, this card gains 300 ATK during the Damage Step only. Once per turn, you can reveal 1 Spell Card in your hand to treat this card's name as "<M6390>Cyber Dragon<M>" until the End Phase. This card's name is treated as "<M6390>Cyber Dragon<M>" while in the Graveyard.
et: Kui see kaart ründab vastase koletist, saab see kaart Damage Step'i ajal 300 ATK juurde. Kord ühe käigu jooksul võid paljastada ühe loitsukaardi oma käes, et käsitleda selle kaardi nime kui "<M6390>Cyber Dragon<M>" kuni End Phase'ini. Selle kaardi nime käsitletakse kui "<M6390>Cyber Dragon<M>" olles Hauas.

source: Oilman
et: Õlimees

source: Once per turn, during your Main Phase, you can equip this card to a Machine-Type monster you control as an Equip Card, OR unequip it to Special Summon this card in face-up Attack Position. While equipped to a monster by this effect, if the equipped monster destroys an opponent's monster by battle, draw 1 card. (A monster can only be equipped with 11 Union Monster at a time. If the equipped monster would be destroyed, destroy this card instead.)
et: Korra ühe korra oma peafaasil saad selle kaardi kinnitada oma kontrollitava Masina-tüüpi koletise külge kui Varustuskaart VÕI eemaldada selle kinnituse, et Kutsuda see kaart erilisel viisil Nähtavas Rünnakupositsioonis. Kui see kaart on selle efekti abil koletise külge kinnitatud ja kinnitatud koletis hävitab lahingus vastase koletise, tõmba 1 kaart. (Koletise külge saab korraga kinnitada ainult 1 Liitkoletis. Kui kinnitatud koletis hävitatakse, hävita selle asemel see kaart.)

source: Djinn Cursenchanter of Rituals
et: Rituaalide Neetudvõlur Džinn

source: When you Ritual Summon a Ritual Monster, you can remove from play this card from your Graveyard as 1 of the monsters required for the Ritual Summon. While the Ritual Monster this card was used in the Ritual Summon for is face-up on the field, negate the effect(s) of Synchro Monsters.
et: Kui sa Rituaal-Kutsud Rituaal-Koletise, võid eemaldada selle kaardi oma Hauakambrist mängust kui ühe koletise, mida on vaja Rituaal-Kutsumiseks. Kui Rituaal-Koletis, mida selle kaardiga Rituaal-Kutsumiseks kasutati, on näoga ülespoole väljakul, tühista Sünkro-Koletiste efekt(id).

source: Djinn Prognosticator of Rituals
et: Rituaalide Ennustaja Džinn

source: When you Ritual Summon a Ritual Monster, you can remove from play this card from your Graveyard as 1 of the monsters required for the Ritual Summon. When the monster Ritual Summoned using this card inflicts Battle Damage to your opponent, your opponent must select and discard 1 card.
et: Kui sa kutsud rituaalikoletise rituaalikutsumisega, võid eemaldada selle kaardi oma hauast kui ühe rituaalikutsumiseks vajaliku koletise. Kui selle kaardiga rituaalikutsutud koletis tekitab lahingukahju sinu vastasele, peab sinu vastane valima ja ära viskama ühe kaardi.

source: Garlandolf, King of Destruction
et: Garlandolf, Hävituse Kuningas

source: This card can only be Ritual Summoned with the Ritual Spell Card, "<M8669>Ritual of Destruction<M>". When this card is Ritual Summoned, destroy all other face-up monsters on the field with DEF less than or equal to this card's ATK. This card gains 100 ATK for each monster destroyed by this effect.
et: Seda kaarti saab Rituaali Kutsuda ainult Rituaali Loitsukaardiga, "<M8669>Hävitamise Rituaal<M>". Kui see kaart Rituaali Kutsutakse, hävita kõik teised avatud koletised väljal, mille DEF on väiksem või võrdne selle kaardi ATK-ga. See kaart saab 100 ATK-d iga selle efekti poolt hävitatud koletise eest.

source: Savior Demon Dragon
et: Päästja Deemon Draakon

source: "<M8436>Savior Dragon<M>" + "<M7735>Red Demon's Dragon<M>" + 1 non-Tuner monster<BR>This card cannot be destroyed by card effects. If this card attacks, destroy all Defense Position monsters on the field after damage calculation. Once per turn, you can negate the effect(s) of 1 face-up monster your opponent controls and have this card gain ATK equal to the negated monster's ATK, until the End Phase. During the End Phase, return this card from the field to the Extra Deck, and Special Summon 1 "<M7735>Red Demon's Dragon<M>" from your Graveyard.
et: "<M8436>Päästja Draakon<M>" + "<M7735>Punane Deemonite Draakon<M>" + 1 mitte-Tuuner koletis<BR>Seda kaarti ei saa hävitada kaardi efektidega. Kui see kaart ründab, hävita kõik Kaitseasendis koletised väljal pärast kahju arvutamist. Kord ühe käigu jooksul saad tühistada ühe vastase kontrollitava avatud koletise efekti(d) ja anda sellele kaardile ATK, mis on võrdne tühistatud koletise ATK-ga, kuni Käigu Lõpuni. Käigu Lõpus tagasta see kaart väljast Ekstra Paki ja Kutsu Eriliselt välja 1 "<M7735>Punane Deemonite Draakon<M>" oma Hauakambrist.

source: Drill Warrior
et: Puurisõdalane

source: "<M8615>Drill Synchron<M>" + 1 or more non-Tuner monsters.<BR>Once per turn, during your Main Phase, you can halve this card's ATK (permanently). If you do, it can attack your opponent directly this turn. Once per turn, during your Main Phase, you can discard 1 card and remove this card from play. During your next Standby Phase, Special Summon this card, if removed by this effect. Then, add 1 Monster Card from your Graveyard to your hand.
et: "<M8615>Puurpuur Sünkron<M>" + 1 või rohkem mittehäälestuskoletist.<BR>Kord ühe käigu jooksul, oma peafaasis, saad selle kaardi ATK pooleks jagada (püsivalt). Kui teed seda, võib see kaart rünnata otse sinu vastast sellel käigul. Kord ühe käigu jooksul, oma peafaasis, saad ühe kaardi ära visata ja selle kaardi mängust eemaldada. Järgmise ooteetapi ajal, kui see kaart on selle efekti tõttu eemaldatud, kutsu see kaart eriliselt välja. Seejärel lisa 1 koletisekaart oma hauakambrist oma kätte.

source: Sun Dragon Inti
et: Päikeselohe Inti
