Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: 1 DARK Tuner + 1 or more non-Tuner monsters<BR>While you have no cards in your hand, once per turn, you can destroy 1 monster your opponent controls and inflict damage equal to half of that monster's ATK to your opponent. This card cannot declare an attack the turn this effect is activated.
et: 1 PIMED Tuuner + 1 või rohkem mitte-Tuuner koletist<BR>Kui sul pole kaarte käes, saad kord ühe käigu jooksul hävitada 1 koletise, mida sinu vastane kontrollib, ja tekitada vastasele kahju, mis on võrdne poolega selle koletise rünnakust. Sellel kaardil ei ole lubatud rünnata käigul, mil see efekt aktiveeritakse.

source: Splendid Rose
et: Suurepärane Roos

source: 1 Tuner + 1 or more non-Tuner monsters<BR>Once per turn, you can remove from play 1 Plant-Type monster in your Graveyard to halve the ATK of 1 face-up monster your opponent controls, until the End Phase of this turn. If this card attacks, during the same Battle Phase you can remove from play 1 Plant-Type monster in your Graveyard to halve the ATK of this card (until the End Phase) and attack once again.
et: 1 Tuner + 1 või rohkem mitte-Tuner koletist<BR>Korra käigu jooksul saad eemaldada oma Hauakambrist mängust 1 Taimetüüpi koletise, et vähendada ühe vastase kontrollitava avatud koletise ATK-d poole võrra kuni selle käigu lõppfaasini. Kui see kaart ründab, saad sama Lahingufaasi jooksul eemaldada oma Hauakambrist mängust 1 Taimetüüpi koletise, et vähendada selle kaardi ATK-d poole võrra (kuni lõppfaasini) ja rünnata uuesti.

source: Chaos Goddess
et: Kaosejumalanna

source: 1 LIGHT Tuner + 2 or more non-Tuner DARK monsters<BR>Once per turn, you can send 1 LIGHT monster from your hand to the Graveyard to select 1 Level 5 or higher DARK monster in your Graveyard. Special Summon that monster. It cannot be used as a Synchro Material Monster.
et: 1 VALGUSTI Häälestaja + 2 või rohkem mitte-Häälestaja PIMEDUST koletist<BR>Kord ühe käigu jooksul saad saata 1 VALGUSTI koletise oma käest Hauakambrisse, et valida 1 Tase 5 või kõrgem PIMEDUST koletis oma Hauakambris. Kutsu see koletis eriliselt välja. Seda ei saa kasutada Sünkro Materjal Koletisena.

source: Black-Winged Strafe
et: Mustade Tiibade Rünnak

source: Send 1 "Blackwing" monster from your hand to the Graveyard to select 1 Defense Position monster your opponent controls. Send that monster to the Graveyard.
et: Saada 1 "Blackwing" koletis oma käest Hauakambrisse, et valida 1 Kaitseasendis koletis, mida sinu vastane kontrollib. Saada see koletis Hauakambrisse.

source: Cards for Black Feathers
et: Kaardid Mustadele Sulgedele

source: Remove from play 1 "Blackwing" monster in your hand to draw 2 cards. You cannot Special Summon during the same turn you activate this card. You can only activate 1 "<M8821>Cards for Black Feathers<M>" per turn.
et: Eemalda mängust 1 "Blackwing" koletis oma käest, et tõmmata 2 kaarti. Sa ei saa eriliselt kutsuda samal käigul, kui aktiveerid selle kaardi. Sa saad aktiveerida ainult 1 "<M8821>Cards for Black Feathers<M>" käigu kohta.

source: ZERO-MAX
et: NULL-MAX

source: Activate only if you have no cards in your hand. Select 1 "Infernity" monster in your Graveyard. Special Summon it, and destroy all face-up monsters on the field with ATK lower than the Special Summoned monster's ATK. You cannot conduct your Battle Phase the same turn you activate this card.
et: Aktiveeri ainult siis, kui sul pole käes ühtegi kaarti. Vali 1 "Infernity" koletis oma Hauakambris. Kutsu see eriliselt välja ja hävita kõik laual olevad avatud koletised, mille ATK on madalam kui eriliselt välja kutsutud koletise ATK. Sa ei saa oma Lahingufaasi läbi viia samal käigul, kui aktiveerid selle kaardi.

source: Infernity Launcher
et: Infernity Käivitaja

source: Once per turn, you can send 1 "Infernity" monster from your hand to the Graveyard. If there are no cards in your hand, you can send this card to the Graveyard to select up to 2 "Infernity" monster(s) in your Graveyard and Special Summon them.
et: Korra ühe korra käigu jooksul saad saata 1 "Infernity" koletise oma käest Hauakambrisse. Kui sul pole kaarte käes, saad saata selle kaardi Hauakambrisse, et valida kuni 2 "Infernity" koletist oma Hauakambris ja Kutsuda nad Eriliselt välja.

source: Into the Void
et: Tühjusesse

source: Activate only if you have 3 or more cards in your hand. Draw 1 card. During the End Phase of this turn, discard all the cards in your hand.
et: Aktiveeri ainult siis, kui sul on käes 3 või rohkem kaarti. Tõmba 1 kaart. Selle käigu lõppfaasis viska kõik kaardid oma käest ära.

source: Intercept Wave
et: Pealtkuulamislaine

source: All Synchro Monsters on the field are changed to Defense Position. And then, return all face-up Synchro Monsters to the Extra Deck during the End Phase.
et: Kõik sünkroonkoletised väljal muudetakse kaitsepositsiooni. Seejärel tagasta kõik avatud sünkroonkoletised lisapakki lõppfaasi ajal.

source: Pyramid of Wonders
et: Imede püramiid

source: All face-up Zombie-Type monsters you control gain 200 ATK for each monster your opponent controls. If (exactly) 1 face-up Zombie-Type monster you control would be destroyed, you can send this card to the Graveyard instead.
et: Kõik sinu kontrolli all olevad avatud Zombi-tüüpi koletised saavad 200 ATK-d iga vastase kontrolli all oleva koletise kohta. Kui (täpselt) 1 sinu kontrolli all olev avatud Zombi-tüüpi koletis hävitatakse, võid selle kaardi hoopis Hauakambrisse saata.

source: The Fountain in the Sky
et: Taevas asuv purskkaev

source: When a LIGHT monster is destroyed by battle and sent to your Graveyard, you can remove that monster from play to gain Life Points equal to its ATK.
et: Kui VALGUSE monster hävitatakse lahingus ja saadetakse sinu Hauakambrisse, võid selle monstera mängust eemaldada, et saada Elupunkte, mis on võrdsed selle ATK-ga.

source: Dragon Laser
et: Draakoni Laser

source: Send 1 "Trigon" equipped to a face-up "<M8806>Delta Tri<M>" you control to the Graveyard, and destroy all monsters your opponent controls.
et: Saada 1 "Trigon", mis on varustatud sinu kontrollitava avatud "<M8806>Delta Tri<M>" külge, kalmistule ja hävita kõik vastase kontrollitavad koletised.

source: Wattcube
et: Wattkuup

source: Equip only to a Thunder-Type monster. It gains 100 ATK for each Thunder-Type monster in your Graveyard. You can send this face-up card you control to the Graveyard to have 1 face-up Thunder-Type monster you control gain 1000 ATK.
et: Varusta ainult Äikese-tüüpi koletisele. See saab 100 ATK iga sinu Hauas oleva Äikese-tüüpi koletise kohta. Sa võid saata selle avatud kaardi, mida sa kontrollid, Hauale, et üks avatud Äikese-tüüpi koletis, mida sa kontrollid, saaks 1000 ATK.

source: Electromagnetic Shield
et: Elektromagnetiline Kilp

source: Level 3 or lower face-up Defense Position Thunder-Type monsters you control cannot be destroyed by battle. Destroy this card if you control a face-up Attack Position monster.
et: 3. või madalama taseme avatud kaitseasendis Äikese-tüüpi koletisi, mida sa kontrollid, ei saa lahingus hävitada. Hävita see kaart, kui sa kontrollid avatud rünnakuasendis koletist.

source: Worm Call
et: Ussikõne

source: Once per turn, if your opponent controls a monster and you control no monsters, you can Special Summon 1 Reptile-Type "Worm" monster from your hand in face-down Defense Position.
et: Korra ühe korra käigu jooksul, kui sinu vastane kontrollib koletist ja sina ei kontrolli ühtegi koletist, saad sa oma käest eriliselt kutsuda 1 Reptiili-tüüpi "Worm" koletise näoga allapoole kaitsepositsioonis.

source: Magic Triangle of the Ice Barrier
et: Jääbarjääri maagiline kolmnurk

source: Reveal 3 "Ice Barrier" monsters with different names in your hand to select 1 card your opponent controls. Destroy the opponent's card and Special Summon 1 "Ice Barrier" monster from your hand.
et: Paljasta oma käes 3 erineva nimega "Ice Barrier" koletist, et valida 1 kaart, mida sinu vastane kontrollib. Hävita vastase kaart ja Kutsu Eri Kutsumisega 1 "Ice Barrier" koletis oma käest.

source: Koa'ki Meiru Initialize!
et: Koa'ki Meiru Initsieerimine!

source: Tribute 1 "Koa'ki Meiru" monster to add 1 "<M8207>Iron Core of Koa'ki Meiru<M>" from your Deck or Graveyard to your hand.
et: Lohista 1 "Koa'ki Meiru" koletis, et lisage 1 "<M8207>Koa'ki Meiru Raudne Südamik<M>" oma pakist või hauast oma kätte.

source: Dawn of the Herald
et: Kuulutaja koidik

source: This card is used to Ritual Summon1 "<M7674>Herald of Perfection<M>". You must also Tribute monsters whose total Levels equal exactly 6 from the field or your hand. When1 "<M7674>Herald of Perfection<M>" is Ritual Summoned by this card's effect, you can remove from play this card in your Graveyard to select 1 of the monsters Tributed for that Ritual Summon, and return it from your Graveyard to your hand.
et: Seda kaarti kasutatakse rituaalsummonimiseks1 "<M7674>Täiuslikkuse Herold<M>". Sa pead ka ohverdama koletisi, kelle kogutasemed on täpselt 6, kas väljakult või oma käest. Kui1 "<M7674>Täiuslikkuse Herold<M>" on rituaalsummonitud selle kaardi efektiga, saad sa eemaldada mängust selle kaardi oma hauakambrist, et valida 1 koletis, mis ohverdati selle rituaalsummoni jaoks, ja tagastada see oma hauakambrist oma kätte.

source: Forbidden Graveyard
et: Keelatud Kalmistu

source: Activate by discarding 1 card. Effects that activate in the Graveyard this turn are negated.
et: Aktiveeri, kui saadad 1 kaardi käest ära. Sellel käigul Hauakambris aktiveeruvad efektid tühistatakse.

source: Leeching the Light
et: Valguse imemine

source: Select 1 face-up LIGHT monster your opponent controls. All face-up Attack Position monsters you control gain ATK equal to the ATK of the selected monster, until the End Phase.
et: Vali 1 vastase juhitav avatud LIGHT koletis. Kõik sinu juhitavad avatud Rünnakupositsioonis koletised saavad ATK-d, mis on võrdne valitud koletise ATK-ga, kuni Lõppfaasini.

source: Corridor of Agony
et: Agooniakoridor

source: Monsters that were Special Summoned from the Main Deck cannot activate their effects, their effects are negated, and they cannot declare an attack, as long as they remain face-up on the field.
et: Main Deckist eriliselt välja kutsutud koletised ei saa oma efekte aktiveerida, nende efektid on tühistatud ja nad ei saa rünnakut kuulutada, seni kuni nad jäävad väljale avatud olekus.

source: Power Frame
et: Jõuraam

source: Activate only when a face-up monster you control is selected as an attack target by an opponent's monster with a higher ATK. Negate that attack, and equip this card to your monster that was being attacked. The equipped monster gains ATK equal to the difference in ATK between the two monsters.
et: Aktiveeri ainult siis, kui vastase koletis, mille ATK on kõrgem, valib rünnaku sihtmärgiks sinu kontrollitava avatud koletise. Tühista see rünnak ja kinnita see kaart sinu rünnatavale koletisele. Varustatud koletis saab ATK-d juurde, mis on võrdne kahe koletise ATK erinevusega.

source: Blackwing - Backlash
et: Mustatiib - Tagasilöök

source: Activate only when your opponent declares a direct attack while you have 5 or more "Blackwing" monsters in your Graveyard. Destroy all monsters your opponent controls.
et: Aktiveeri ainult siis, kui sinu vastane kuulutab välja otsese rünnaku, kui sul on oma Hauakambris 5 või rohkem "Blackwing" koletist. Hävita kõik koletised, mida sinu vastane kontrollib.

source: Blackwing - Bombardment
et: Mustatiib - Pommitamine

source: Tribute 1 "Blackwing" monster to select 1 face-up Synchro Monster you control. That Synchro Monster gains ATK equal to the Tributed monster's ATK, until the End Phase.
et: Ohverda 1 "Blackwing" koletis, et valida 1 avatud Sünkro Koletis, mida sa kontrollid. See Sünkro Koletis saab ATK-d, mis on võrdne ohverdatud koletise ATK-ga, kuni End Phase'ini.

source: Black Thunder
et: Must Torm

source: Activate only when a "Blackwing" monster you control is destroyed by battle and sent to the Graveyard. Inflict 400 damage to your opponent for each card your opponent controls.
et: Aktiveeri ainult siis, kui sinu kontrollitav "Blackwing" koletis hävitatakse lahingus ja saadetakse Hauakambrisse. Tekita oma vastasele 400 kahju iga kaardi eest, mida su vastane kontrollib.

source: Guard Mines
et: Valvurid miinid

source: Activate only when a card is activated with an effect that would target and destroy 1 monster you control. Negate the effect and destroy that card. Then inflict 500 damage to your opponent.
et: Aktiveeri ainult siis, kui aktiveeritakse kaart, mille efekt sihib ja hävitab ühe sinu kontrollitava koletise. Tühista efekt ja hävita see kaart. Seejärel põhjusta oma vastasele 500 kahju.

source: Infernity Reflector
et: Infernity Peegeldaja

source: Activate only by discarding all the cards in your hand when an "Infernity" monster is destroyed by battle and sent to the Graveyard. Select and Special Summon that monster from your Graveyard and inflict 1000 damage to your opponent.
et: Aktiveeri ainult siis, kui viskad kõik kaardid oma käest ära, kui "Infernity" koletis hävitatakse lahingus ja saadetakse Hauakambrisse. Vali ja Kutsu see koletis Hauakambrist Eriliselt välja ning põhjusta oma vastasele 1000 kahju.

source: Infernity Break
et: Infernity Murdmine

source: Activate only if you have no cards in your hand. Select 1 "Infernity" card in your Graveyard and remove it from play. Select 1 card your opponent controls and destroy it.
et: Aktiveeri ainult siis, kui sul pole kaarte käes. Vali 1 "Infernity" kaart oma Hauakambris ja eemalda see mängust. Vali 1 kaart, mida sinu vastane kontrollib, ja hävita see.

source: Damage Gate
et: Kahjuvärav

source: Activate only when you take Battle Damage. Special Summon 1 monster from your Graveyard with ATK less than or equal to the amount of damage you took.
et: Aktiveeri ainult siis, kui saad lahingukahju. Kutsu eriliselt välja 1 koletis oma hauakambrist, mille rünnak on väiksem või võrdne saadud kahju suurusega.

source: Discard up to 2 cards and send the same number of "Infernity" cards from your Deck to the Graveyard.
et: Viska kuni 2 kaarti ja saada sama arv "Infernity" kaarte oma pakist hauakambrisse.

source: Phantom Hand
et: Fantoomkäsi

source: Once per turn, if you control a face-up "Infernity" monster(s), you can remove from play all cards in your hand (face-down) until your next Standby Phase.
et: Kord ühe korra käigu jooksul, kui sa kontrollid avatud "Infernity" koletist(eid), võid sa eemaldada mängust kõik kaardid oma käest (tagurpidi) kuni oma järgmise Ootefaasini.

source: Assault Spirits
et: Rünnakvaimud

source: After activation, this card becomes an Equip Card and is equipped to 1 monster you control. Once per turn, if the equipped monster attacks, during the Damage Step you can send 1 monster with 1000 or less ATK from your hand to the Graveyard to increase the equipped monster's ATK by the sent monster's ATK until the End Phase.
et: Pärast aktiveerimist muutub see kaart Varustuskaardiks ja on varustatud 1 sinu kontrollitava koletisega. Kord käigu jooksul, kui varustatud koletis ründab, võid Kahjustuse etapis saata 1 koletise, mille ATK on 1000 või vähem, oma käest Hauakambrisse, et suurendada varustatud koletise ATK-d saadetud koletise ATK võrra kuni Lõppfaasini.

source: Blossom Bombardment
et: Õite pommitamine

source: Activate only when a Plant-Type monster you control destroys an opponent's monster by battle and sends it to the Graveyard. Inflict damage to your opponent equal to the destroyed monster's original ATK.
et: Aktiveeri ainult siis, kui sinu kontrollitav Taimetüüpi koletis hävitab lahingus vastase koletise ja saadab selle Hauakambrisse. Tekita oma vastasele kahju, mis on võrdne hävitatud koletise algse rünnakujõuga.

source: Morphtronics, Scramble!
et: Morftronikud, Rünnak!

source: Activate only when your opponent declares a direct attack while you control no monsters. Negate the attack and Special Summon 1 "Morphtronic" monster from your hand.
et: Aktiveeri ainult siis, kui sinu vastane kuulutab välja otsese rünnaku, samal ajal kui sul pole ühtegi koletist. Tühista rünnak ja Kutsu Eriliselt välja 1 "Morphtronic" koletis oma käest.

source: Power Break
et: Võimu Murdmine

source: Activate only while you control a face-up "<M8137>Power Tool Dragon<M>". Select up to 3 Equip Cards on your side of the field and/or in your Graveyard and return them to the Deck, and inflict 500 damage to your opponent for each card returned.
et: Aktiveeri ainult siis, kui sa kontrollid avatud "<M8137>Power Tool Dragon<M>". Vali kuni 3 Varustuskaarti oma väljaku poolel ja/või oma Hauakambris ning tagasta need Paki, ja tee oma vastasele 500 kahju iga tagastatud kaardi eest.

source: Koa'ki Meiru Shield
et: Koa'ki Meiru Kilp

source: Activate only when your opponent's monster declares an attack if you have 2 or more "<M8207>Iron Core of Koa'ki Meiru<M>" in your Graveyard. Destroy all face-up Attack Position monsters your opponent controls.
et: Aktiveeri ainult siis, kui sinu vastase koletis kuulutab välja rünnaku ja sul on oma Hauakambris 2 või rohkem "<M8207>Koa'ki Meiru Raudtuum<M>". Hävita kõik sinu vastase kontrolli all olevad avatud Rünnakupositsioonis koletised.

source: Crevice Into the Different Dimension
et: Pragu erinevasse dimensiooni

source: Declare 1 Attribute and select a total of 2 monsters with that Attribute from both Graveyards. Remove those monsters from play.
et: Vali 1 Atribuut ja vali kokku 2 selle Atribuudiga koletist mõlemast Hauakambrist. Eemalda need koletised mängust.

source: Synchro Ejection
et: Sünkrooni Eemaldamine

source: Select 1 face-up Synchro Monster your opponent controls and remove it from play. Your opponent draws 1 card.
et: Vali 1 vastase kontrollitav avatud Sünkro Monster ja eemalda see mängust. Sinu vastane tõmbab 1 kaardi.

source: Chaos Trap Hole
et: Kaose lõksuauk

source: Pay 2000 Life Points. Negate the Summon of a LIGHT or DARK monster and remove it from play.
et: Makske 2000 Elupunkti. Tühista LIGHT või DARK koletise kutsumine ja eemalda see mängust.

source: When this card is destroyed by battle and sent to the Graveyard, you can add 1 Insect-Type monster with 1000 or less DEF from your Deck to your hand.
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse, saad lisada oma pakist oma kätte ühe putukaliigi koletise, mille DEF on 1000 või vähem.

source: Sweet Corn
et: Magus Mais

source: Once per turn, during your Main Phase 2 you can pay 500 Life Points to Special Summon 1 "<M3966>Grain Corn Token<M>" (Plant-Type/EARTH/Level 1/ATK 0/DEF 0).
et: Korra ühe korra oma Main Phase 2 jooksul võid maksta 500 Elupunkti, et Kutsuda Eriliselt välja 1 "<M3966>Grain Corn Token<M>" (Taim-Tüüp/MAA/Tase 1/ATK 0/DEF 0).

source: Vampire Koala
et: Vampiir Koala

source: When this card inflicts Battle Damage to your opponent, except by a direct attack, gain Life Points equal to the amount of Battle Damage inflicted.
et: Kui see kaart tekitab lahingukahju sinu vastasele, välja arvatud otsese rünnaku kaudu, saad Elupunkte juurde võrdse koguse lahingukahjuga, mis tekitati.

source: Wild Tornado
et: Metsik Tornado

source: Select 1 face-up card in the Spell & Trap Card Zones and destroy it. The controller of the destroyed card can then Set 1 Spell or Trap Card from their hand. If this Set card is destroyed and sent to the Graveyard, select and destroy 1 face-up card on the field.
et: Vali 1 avatud kaart Võlu- ja Lõksukaartide tsoonides ning hävita see. Hävitatud kaardi kontrollija võib seejärel oma käest 1 Võlu- või Lõksukaardi asetada. Kui see asetatud kaart hävitatakse ja saadetakse Hauakambrisse, vali ja hävita 1 avatud kaart väljal.

source: Junk Destroyer
et: Rämpsuhävitaja

source: "<M7687>Junk Synchron<M>" + 1 or more non-Tuner monsters<BR>When this card is Synchro Summoned, you can select and destroy cards on the field, up to the number of non-Tuner monsters used as Synchro Material Monsters for this card.
et: "<M7687>Junk Synchron<M>" + 1 või rohkem mittehäälestaja koletisi<BR>Kui see kaart on Sünkroonvälja kutsutud, saad valida ja hävitada kaarte väljal, kuni mittehäälestaja koletiste arvuni, mida kasutati selle kaardi Sünkroonmaterjalina.

source: Rapid Warrior
et: Kiire Sõdalane

source: During your Main Phase 1, you can activate this card's effect. If you do, it can attack your opponent directly this turn. Other monsters cannot attack during the turn you activate this effect.
et: Oma peafaas 1 ajal saad aktiveerida selle kaardi efekti. Kui sa seda teed, võib see sellel käigul rünnata otse sinu vastast. Teised koletised ei saa rünnata sellel käigul, mil sa selle efekti aktiveerid.

source: Synchron Explorer
et: Sünkroni Avastaja

source: When this card is Normal Summoned, you can select 1 "Synchron" monster in your Graveyard and Special Summon it. Its effects are negated.
et: Kui see kaart on Normaal-Kutsutud, saad valida 1 "Synchron" koletise oma Hauakambris ja Kutsuda see Eriliselt. Selle efektid on tühistatud.

source: Half Shut
et: Poolenisti kinni

source: Select 1 face-up monster on the field. That monster cannot be destroyed by battle this turn, and its ATK is halved until the End Phase of this turn.
et: Vali 1 avatud koletis väljal. Seda koletist ei saa sellel käigul lahingus hävitada ja selle ATK väheneb poole võrra kuni selle käigu lõppfaasini.

source: Malefic Blue-Eyes White Dragon
et: Kurjaku Sinisilmne Valgedraakon

source: This card cannot be Normal Summoned or Set. This card can only be Special Summoned by removing from play 1 "<M4007>Blue-Eyes White Dragon<M>" from your Deck. There can only be 1 face-up "Malefic" monster on the field. Other monsters you control cannot declare an attack. If there is no face-up Field Spell Card on the field, destroy this card.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti saab eriliselt kutsuda ainult eemaldades mängust 1 "<M4007>Sinisilmsed Valged Draakonid<M>" oma pakist. Väljakul võib olla ainult 1 avatud "Malefic" koletis. Teised koletised, mida sa kontrollid, ei saa rünnakut kuulutada. Kui väljakul ei ole avatud väljaloitsukaarti, hävita see kaart.

source: Malefic Stardust Dragon
et: Paha Stardust Dragon

source: This card cannot be Normal Summoned or Set. This card cannot be Special Summoned, except by removing from play1 "<M7734>Stardust Dragon<M>" from your Extra Deck. There can only be 1 face-up "Malefic" monster on the field. Field Spell Cards cannot be destroyed by effects. Other monsters you control cannot declare an attack. If there is no face-up Field Spell Card on the field, destroy this card.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti ei saa eriliselt kutsuda, välja arvatud eemaldades mängust 1 "<M7734>Stardust Dragon<M>" oma lisapakist. Väljakul võib olla ainult 1 avatud "Malefic" koletis. Väljakuloitsu kaarte ei saa efektide tõttu hävitada. Teised koletised, mida sa kontrollid, ei saa rünnakut kuulutada. Kui väljakul ei ole avatud väljakuloitsu kaarti, hävita see kaart.

source: Elemental HERO Neos Knight
et: Elementaalne KANGELANE Neos Rüütel

source: "<M6653>Elemental Hero Neos<M>" + 1 Warrior-Type monster<BR>This card cannot be Special Summoned except by Fusion Summon. This card gains ATK equal to half the ATK of the Warrior-Type Fusion Material Monster used to Fusion Summon this card, other than "<M6653>Elemental Hero Neos<M>". This card can attack twice during each Battle Phase. If this card attacks or is attacked, your opponent takes no Battle Damage.
et: "<M6653>Elementaalne Kangelane Neos<M>" + 1 Sõdalase-tüüpi koletis<BR>Seda kaarti ei saa Eriliselt Kutsuda, välja arvatud Fusion Summon'iga. See kaart saab ATK-d, mis on võrdne poolega Sõdalase-tüüpi Fusion Materjal Koletise ATK-st, mida kasutati selle kaardi Fusion Summon'iks, välja arvatud "<M6653>Elementaalne Kangelane Neos<M>". See kaart võib rünnata kaks korda iga Lahingu Faasi jooksul. Kui see kaart ründab või teda rünnatakse, ei saa sinu vastane Lahingu Kahju.
