Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: Declare 1 Monster Card name. If your opponent Normal Summons, Special Summons, or flips that monster(s) face-up, remove that monster(s) and this card from play.
et: Teata 1 koletise kaardi nimi. Kui sinu vastane kutsub selle koletise(d) tavakutsumise, erikutsumise või ümberpööramise teel lahinguväljale, eemalda see koletis(ed) ja see kaart mängust.

source: Pulling the Rug
et: Vaiba alt tõmbamine

source: Negate the activation and effect of an Effect Monster whose effect activated when a monster was Normal Summoned (even itself), and destroy that Effect Monster.
et: Tühista Efektikoletise aktiveerimine ja mõju, mille efekt aktiveerus, kui koletis kutsuti tavaliselt välja (isegi kui see oli ise), ja hävita see Efektikoletis.

source: Blizzard Dragon
et: Blizzard Draakon

source: Once per turn, you can select 1 monster your opponent controls. It cannot change its battle position or declare an attack until the end of your opponent's next turn.
et: Korra ühe käigu jooksul saad valida 1 koletise, mida su vastane kontrollib. See ei saa muuta oma lahinguasendit ega kuulutada rünnakut kuni su vastase järgmise käigu lõpuni.

source: Metal Shooter
et: Metallikütt

source: When this card is Normal Summoned, place 2 counters on it. This card gains 800 ATK for each of these counters on it. If this card would be destroyed by a card effect, remove 1 of this card's counters instead.
et: Kui see kaart on Normaal-Kutsutud, pane sellele 2 loendurit. See kaart saab 800 ATK iga sellel oleva loenduri kohta. Kui see kaart hävitatakse kaardi efekti tõttu, eemalda selle kaardi üks loenduritest.

source: Des Mosquito
et: Des Moskiito

source: When this card is Normal Summoned or Special Summoned, place 2 counters on it. This card gains 500 ATK for each of these counters on it. If this card would be destroyed by battle, remove 1 of this card's counters instead.
et: Kui see kaart on Normaal- või Erikutsutud, pane sellele 2 loendurit. See kaart saab 500 ATK iga sellel oleva loenduri eest. Kui see kaart hävitatakse lahingus, eemalda selle kaardi loenduritest 1.

source: Elemental Hero Lady Heat
et: Elementaalne Kangelanna Lady Heat

source: During each of your End Phases: Inflict 200 damage to your opponent for each face-up1 "Elemental HERO" monster you control.
et: Iga oma lõppfaasi ajal: Tekita oma vastasele 200 kahju iga avatud "Elemental HERO" koletise eest, mida sa kontrollid.

source: Ice Master
et: Jäämeister

source: You can Special Summon this card (from your hand) by Tributing 2 WATER monsters. Once per turn: You can target 1 face-up monster on the field; place an Ice Counter on that target. You can Tribute this card; destroy all monsters with an Ice Counter(s).
et: Saad selle kaardi (oma käest) eriliselt välja kutsuda, ohverdades 2 VEE koletist. Kord ühe käigu jooksul: Saad sihtida ühte avatud koletist väljakul; aseta sellele sihtmärgile Jääloendur. Saad selle kaardi ohverdada; hävita kõik koletised, millel on Jääloendur(id).

source: Elemental Hero Inferno
et: Elementaalne Kangelane Inferno

source: "<M6927>Elemental Hero Heat<M>" + "<M7024>Elemental Hero Lady Heat<M>"<BR>Must be Fusion Summoned and cannot be Special Summoned by other ways. If this card battles a WATER monster, this card gains 1000 ATK during the Damage Step only.
et: "<M6927>Elementaalne Kangelane Kuumus<M>" + "<M7024>Elementaalne Kangelane Daam Kuumus<M>"<BR>Peab olema Fusion Summoned ja ei saa olla Special Summoned muul viisil. Kui see kaart võitleb VEE koletisega, saab see kaart Damage Step ajal ainult 1000 ATK juurde.

source: Angel O7
et: Ingel O7

source: When this card is Tribute Summoned, it gains the following effect:<BR>● The effects of Effect Monsters cannot be activated.
et: Kui see kaart on ohverdamisega välja kutsutud, saab see järgmise efekti:<BR>● Efektikoletiste efekte ei saa aktiveerida.

source: Hunter Owl
et: Kütt Öökull

source: This card gains 500 ATK for each face-up WIND monster you control. While you control another face-up WIND monster, your opponent cannot select this card as an attack target.
et: See kaart saab 500 ATK iga avatud WIND koletise eest, mida sa kontrollid. Kui sa kontrollid teist avatud WIND koletist, ei saa sinu vastane valida seda kaarti rünnaku sihtmärgiks.

source: Masked Chopper
et: Maskeeritud Lõikur

source: If this card destroys an opponent's monster by battle, inflict 2000 damage to your opponent.
et: Kui see kaart hävitab lahingus vastase koletise, tekitage vastasele 2000 kahju.

source: Neo-Parshath, the Sky Paladin
et: Neo-Parshath, Taevasrüütel

source: You can Special Summon this card (from your hand) by Tributing 1 "<M5023>Airknight Parshath<M>" you control. If this card attacks a Defense Position monster, inflict piercing Battle Damage to your opponent. When this card inflicts Battle Damage to your opponent: Draw 1 card. While "<M5982>The Sanctuary in the Sky<M>" is on the field and your Life Points are higher than your opponent's, this card gains ATK and DEF equal to the difference in Life Points.
et: Saad selle kaardi (oma käest) eriliselt välja kutsuda, ohverdades 1 "<M5023>Airknight Parshath<M>", mida sa kontrollid. Kui see kaart ründab kaitsepositsioonis olevat koletist, tekitab see vastasele läbistavat lahingukahju. Kui see kaart tekitab vastasele lahingukahju: Tõmba 1 kaart. Kui "<M5982>The Sanctuary in the Sky<M>" on väljakul ja sinu Elupunktid on kõrgemad kui vastasel, saab see kaart ATK ja DEF võrdselt Elupunktide erinevusega.

source: Meltiel, Sage of the Sky
et: Meltiel, Taeva Tark

source: Each time a Counter Trap Card is activated, gain 1000 Life Points, and if "<M5982>The Sanctuary in the Sky<M>" is face-up on the field, destroy 1 card your opponent controls.
et: Iga kord, kui aktiveeritakse vastulõksukaart, saad 1000 elupunkti, ja kui "<M5982>The Sanctuary in the Sky<M>" on väljakul avatud, hävita 1 kaart, mida sinu vastane kontrollib.

source: Harvest Angel of Wisdom
et: Tarkuse Lõikuseingel

source: When this card is destroyed by battle and sent to the Graveyard, you can add 1 Counter Trap Card from your Graveyard to your hand.
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse, saad lisada 1 Vastulõksukaardi oma Hauakambrist oma kätte.

source: Freya, Spirit of Victory
et: Freya, Võiduhing

source: While you control a face-up Fairy-Type monster(s) other than <M7049>Freya, Spirit of Victory<M>", this card cannot be selected as an attack target. All Fairy-Type monsters you control gain 400 ATK and DEF.
et: Kui sa kontrollid mõnda avatud haldjatüüpi koletist peale <M7049>Freya, Võiduvaim<M>, ei saa seda kaarti valida rünnaku sihtmärgiks. Kõik sinu kontrollitavad haldjatüüpi koletised saavad 400 ATK ja DEF juurde.

source: Nova Summoner
et: Nova Kutsuja

source: When this card is destroyed by battle and sent to the Graveyard, you can Special Summon 1 LIGHT Fairy-Type monster with 1500 or less ATK from your Deck. If "<M5982>The Sanctuary in the Sky<M>" is face-up on the field, you can Special Summon 1 "<M5023>Airknight Parshath<M>" instead.
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse, saad Sa eriliselt kutsuda 1 VALGUS haldjatüüpi koletise, mille ATK on 1500 või vähem, oma pakist. Kui "<M5982>Taeva Pühamu<M>" on väljakul avatud, saad Sa selle asemel eriliselt kutsuda 1 "<M5023>Õhuöine Parshath<M>".

source: Radiant Jeral
et: Särav Jeral

source: When this card is sent to the Graveyard (except if destroyed by battle), gain 1000 Life Points if "<M5982>The Sanctuary in the Sky<M>" is on the field.
et: Kui see kaart saadetakse Hauakambrisse (välja arvatud lahingus hävitamise korral), saad 1000 Elupunkti, kui "<M5982>The Sanctuary in the Sky<M>" on väljakul.

source: This card cannot be destroyed by battle. When this card's controller takes any damage, destroy this face-up card. This card can be treated as 2 Tributes for the Tribute Summon of a LIGHT Fairy-Type monster.
et: Seda kaarti ei saa lahingus hävitada. Kui selle kaardi kontrollija saab kahju, hävita see avatud kaart. Seda kaarti võib käsitleda kui 2 ohverdust, kui ohverdussummonitakse VALGUS haldjatüüpi koletis.

source: Aegis of Gaia
et: Gaia kaitse

source: Gain 3000 Life Points. If this face-up card is removed from the field, take 3000 damage.
et: Saa 3000 Elupunkti. Kui see avatud kaart eemaldatakse väljakult, saa 3000 kahju.

source: Carrierroid
et: Kandurroid

source: When an opponent activates a card's effect that targets and destroys a Spell or Trap Card(s) you control, you can discard 1 card to negate its activation and destroy the card.
et: Kui vastane aktiveerib kaardi efekti, mis sihib ja hävitab sinu kontrolli all oleva Võlu- või Lõksukaardi(d), võid sa ühe kaardi ära visata, et selle aktiveerimine tühistada ja kaart hävitada.

source: When you Tribute Summon this card by Tributing at least 1 "roid" monster, remove from play all Spell and Trap Cards on the field.
et: Kui sa kutsud selle kaardi välja ohverdades vähemalt 1 "roid" koletise, eemalda mängust kõik Väljal olevad Loitsu- ja Lõksukaardid.

source: Elemental Hero Voltic
et: Elementaalne Kangelane Voltic

source: When this card inflicts Battle Damage to your opponent: You can target 1 of your banished "Elemental HERO" monsters; Special Summon that target.
et: Kui see kaart tekitab lahingukahju sinu vastasele: Sa võid valida ühe oma eemaldatud "Elemental HERO" koletise; Kutsu see sihtmärk eriliselt välja.

source: Mosaic Manticore
et: Mosaiikmantiikora

source: During the Standby Phase of your next turn after you Tribute Summon this card, Special Summon the monsters Tributed to Summon it from your Graveyard. They cannot declare an attack, and their effects are negated.
et: Järgmisel oma käigu Ootefaasil pärast selle kaardi ohverdamisega välja kutsumist, kutsu erilise kutsumisega oma Hauakambrist välja koletised, mis ohverdati selle välja kutsumiseks. Nad ei saa rünnata ja nende efektid on tühistatud.

source: Belial - Marquis of Darkness
et: Belial - Pimeduse markiis

source: Your opponent cannot target any face-up monster you control, except1 "<M7068>Belial - Marquis of Darkness<M>", for an attack, or with Spell/Trap effects.
et: Sinu vastane ei saa sihtida ühtegi sinu kontrollitavat avatud koletist, välja arvatud1 "<M7068>Belial - Pimeduse markiis<M>", rünnakuks ega loitsu/lõksu efektidega.

source: Crystal Beast Amethyst Cat
et: Kristallolend Ametüst Kass

source: This card can attack your opponent directly, but when it uses this effect, any Battle Damage it inflicts to your opponent is halved. If this face-up card is destroyed while it is in a Monster Card Zone, you can place it face-up in your Spell & Trap Card Zone as a Continuous Spell Card, instead of sending it to the Graveyard.
et: See kaart võib rünnata sinu vastast otse, kuid selle efekti kasutamisel vähendatakse vastasele tekitatud lahingukahju poole võrra. Kui see avatud kaart hävitatakse, kui see on koletise kaarditsoonis, võid selle asetada avatud kujul oma loitsu- ja lõksukaarditsooni pideva loitsukaardina, selle asemel et saata see hauakambrisse.

source: Crystal Beast Amber Mammoth
et: Kristallolend Merevaikmammut

source: When another face-up "Crystal Beast" monster you control is targeted for an attack: You can make this card the attack target instead. If this face-up card is destroyed while it is in a Monster Card Zone, you can place it face-up in your Spell & Trap Card Zone as a Continuous Spell Card, instead of sending it to the Graveyard.
et: Kui teine avatud "Crystal Beast" koletis, mida sa kontrollid, on rünnaku sihtmärk: Sa võid teha selle kaardi rünnaku sihtmärgiks. Kui see avatud kaart hävitatakse, kui see on koletise kaardi alas, võid selle asetada avatud kujul oma loitsu ja lõksu kaardi alasse pideva loitsukaardina, selle asemel et saata see hauakambrisse.

source: Crystal Beacon
et: Kristallmajakas

source: Special Summon 1 "Crystal Beast" monster from your Deck. You must have 2 or more "Crystal Beast" cards in your Spell & Trap Card Zone to activate and to resolve this effect.
et: Erikutsuge oma pakist 1 "Kristallkoletis" koletis. Selle efekti aktiveerimiseks ja lahendamiseks peab sul olema 2 või rohkem "Kristallkoletis" kaarti oma Võlu- ja Lõksukaartide alas.

source: Crystal Beast Ruby Carbuncle
et: Kristallloom Rubiin-Karunkel

source: When this card is Special Summoned: You can Special Summon as many "Crystal Beast" cards as possible from your Spell & Trap Card Zone. If this face-up card is destroyed while it is in a Monster Card Zone, you can place it face-up in your Spell & Trap Card Zone as a Continuous Spell Card, instead of sending it to the Graveyard.
et: Kui see kaart on eriliselt kutsutud: Sa võid eriliselt kutsuda nii palju "Kristallibeast" kaarte kui võimalik oma Loitsu & Lõksu Kaardi Tsoonist. Kui see avatud kaart hävitatakse, kui see on Monster Kaardi Tsoonis, võid selle asetada avatud kujul oma Loitsu & Lõksu Kaardi Tsooni Pideva Loitsukaardina, selle asemel et saata see Hauakambrisse.

source: Crystal Beast Emerald Tortoise
et: Kristallolend Smaragdkilpkonn

source: Once per turn: You can target 1 monster you control that attacked this turn; change that target to Defense Position. If this face-up card is destroyed while it is in a Monster Card Zone, you can place it face-up in your Spell & Trap Card Zone as a Continuous Spell Card, instead of sending it to the Graveyard.
et: Kord korra: Saad valida ühe koletise, mida sa kontrollid ja mis ründas sel käigul; muuda see sihtmärk Kaitsepositsiooniks. Kui see avatud kaart hävitatakse, kui see on Koletise Kaardi Tsoonis, saad selle asetada avatud kujul oma Loitsu & Lõksu Kaardi Tsooni Pideva Loitsukaardina, selle asemel et saata see Hauakambrisse.

source: Crystal Beast Topaz Tiger
et: Kristallbeast Topaastiiger

source: If this card attacks an opponent's monster, it gains 400 ATK during the Damage Step only. If this face-up card is destroyed while it is in a Monster Card Zone, you can place it face-up in your Spell & Trap Card Zone as a Continuous Spell Card, instead of sending it to the Graveyard.
et: Kui see kaart ründab vastase koletist, saab see ainult Kahjustuse Sammul 400 ATK juurde. Kui see avatud kaart hävitatakse, kui see on Koletise Kaardi Tsoonis, võid selle asetada avatud kujul oma Loitsu & Lõksu Kaardi Tsooni Pideva Loitsukaardina, selle asemel et saata see Hauakambrisse.

source: Crystal Beast Cobalt Eagle
et: Kristallolend Koobaltkotkas

source: Once per turn: You can target 1 face-up "Crystal Beast" card you control; return that target to the top of the Deck. If this face-up card is destroyed while it is in a Monster Card Zone, you can place it face-up in your Spell & Trap Card Zone as a Continuous Spell Card, instead of sending it to the Graveyard.
et: Kord korra: Saad valida ühe avatud "Crystal Beast" kaardi, mida sa kontrollid; tagasta see sihtmärk paki tippu. Kui see avatud kaart hävitatakse, kui see on Monster Card Zone'is, saad selle paigutada avatud kujul oma Spell & Trap Card Zone'i pideva loitsukaardina, selle asemel et saata see hauakambrisse.

source: Crystal Beast Sapphire Pegasus
et: Kristallolend Safiir-Pegasus

source: When this card is Summoned: You can place 1 "Crystal Beast" monster from your hand, Deck, or Graveyard face-up in your Spell & Trap Card Zone as a Continuous Spell Card. If this face-up card is destroyed while it is in a Monster Card Zone, you can place it face-up in your Spell & Trap Card Zone as a Continuous Spell Card, instead of sending it to the Graveyard.
et: Kui see kaart kutsutakse välja: Sa võid asetada ühe "Kristallkoletise" koletise oma käest, pakist või hauast oma Võlu- ja Lõksukaartide tsooni näoga ülespoole pideva võlukaardina. Kui see näoga ülespoole kaart hävitatakse, kui see on koletise kaarditsoonis, võid selle asetada oma Võlu- ja Lõksukaartide tsooni näoga ülespoole pideva võlukaardina, selle asemel et saata see hauale.

source: Ancient City - Rainbow Ruins
et: Muistne Linn - Vikerkaare Varemed

source: You must have this many "Crystal Beast" cards in your Spell & Trap Card Zone to activate and resolve these effects:<BR>● 1+: This card cannot be destroyed by a card effects.<BR>● 2+: Once per turn, you can halve the Battle Damage you take.<BR>● 3+: When a Spell/Trap Card is activated: You can send 1 "Crystal Beast" monster you control to the Graveyard; negate the activation and destroy it.<BR>● 4+: Once per turn, during your Main Phase: You can draw 1 card.<BR>● 5+: Once per turn, during your Main Phase: You can target 1 "Crystal Beast" card in your Spell & Trap Card Zone; Special Summon that target.
et: Sul on vaja nii palju "Crystal Beast" kaarte oma Võlu- ja Lõksukaartide alas, et aktiveerida ja lahendada neid efekte:<BR>● 1+: Seda kaarti ei saa hävitada kaardi efektidega.<BR>● 2+: Kord ühe käigu jooksul, saad vähendada võitlusvigastusi poole võrra.<BR>● 3+: Kui aktiveeritakse Võlu- või Lõksukaart: Saad saata ühe "Crystal Beast" koletise, mida sa kontrollid, Hauakambrisse; tühista aktiveerimine ja hävita see.<BR>● 4+: Kord ühe käigu jooksul, oma põhiperioodi ajal: Saad tõmmata ühe kaardi.<BR>● 5+: Kord ühe käigu jooksul, oma põhiperioodi ajal: Saad valida ühe "Crystal Beast" kaardi oma Võlu- ja Lõksukaartide alas; Kutsu see sihtmärk eriliselt välja.

source: Rare Value
et: Haruldane Väärtus

source: If there are 2 or more face-up "Crystal Beast" cards in your Spell & Trap Card Zone: Your opponent chooses 1 "Crystal Beast" card in your Spell & Trap Card Zone and sends it to the Graveyard, then you draw 2 cards.
et: Kui sinu Püünis- ja Võlukaartide alas on 2 või rohkem avatud "Kristallkoletise" kaarti: Sinu vastane valib ühe "Kristallkoletise" kaardi sinu Püünis- ja Võlukaartide alas ja saadab selle Hauakambrisse, seejärel tõmbad sa 2 kaarti.

source: Last Resort
et: Viimane abinõu

source: Activate only when your opponent's monster declares an attack. You can select 11 "<M7079>Ancient City - Rainbow Ruins<M>" from your Deck and activate it. If your opponent had an active Field Spell Card when this card was activated, they can draw 1 card.
et: Aktiveeri ainult siis, kui sinu vastase koletis kuulutab välja rünnaku. Sa saad valida 11 "<M7079>Ancient City - Rainbow Ruins<M>" oma pakist ja aktiveerida selle. Kui sinu vastasel oli selle kaardi aktiveerimise ajal aktiivne Väljaloitsu kaart, võivad nad tõmmata 1 kaardi.

source: Volcanic Shell
et: Vulkaanikarp

source: Once per turn, while this card is in the Graveyard you can pay 500 Life Points to add 1 "<M7082>Volcanic Shell<M>" from your Deck to your hand.
et: Kord ühe korra käigu jooksul, kui see kaart on Hauakambris, võid maksta 500 Elupunkti, et lisada 1 "<M7082>Volcanic Shell<M>" oma pakist kätte.

source: Volcanic Scattershot
et: Vulkaani Hajutaja

source: When this card is sent to the Graveyard, inflict 500 damage to your opponent. If this card is sent to the Graveyard for the effect of a1 "<M7086>Blaze Accelerator<M>" card, you can send 21 "<M7083>Volcanic Scattershot<M>" from your hand / Deck to the Graveyard to destroy all monsters your opponent controls.
et: Kui see kaart saadetakse Hauakambrisse, tekitage oma vastasele 500 kahju. Kui see kaart saadetakse Hauakambrisse "<M7086>Blaze Accelerator<M>" kaardi efekti tõttu, võite saata 21 "<M7083>Volcanic Scattershot<M>" oma käest / pakist Hauakambrisse, et hävitada kõik koletised, mida teie vastane kontrollib.

source: Triggered Summon
et: Käivitatud Kutsumine

source: Activate only when a monster is Special Summoned to your opponent's side of the field. Each player can Special Summon 1 Level 4 or lower monster from their hand.
et: Aktiveeri ainult siis, kui koletis kutsutakse eriliselt sinu vastase väljale. Iga mängija võib oma käest eriliselt kutsuda 1 4. või madalama taseme koletise.

source: Volcanic Doomfire
et: Vulkaani Hukutuli

source: This card cannot be Normal Summoned or Set. This card can only be Special Summoned by sending a face-up1 "<M7088>Tri-Blaze Accelerator<M>" you control to the Graveyard. During your opponent's Battle Phase, your opponent must attack this monster with any Attack Position monsters they control. When this card destroys a monster and sends it to the Graveyard, destroy all monsters your opponent controls and inflict 500 damage to your opponent for each monster destroyed by this effect.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti saab eriliselt kutsuda ainult siis, kui saadad oma kontrolli all oleva ülespoole suunatud "<M7088>Tri-Blaze Accelerator<M>" kalmistule. Sinu vastase lahingufaasis peab vastane ründama seda koletist kõigi oma rünnakupositsioonis olevate koletistega. Kui see kaart hävitab koletise ja saadab selle kalmistule, hävita kõik koletised, mida sinu vastane kontrollib, ja tekita oma vastasele 500 kahju iga selle efekti poolt hävitatud koletise eest.

source: Blaze Accelerator
et: Põlemiskiirendi

source: You can send 1 Pyro-Type monster with 500 or less ATK from your hand to the Graveyard to destroy 1 monster your opponent controls, but you cannot declare an attack during this turn if you do.
et: Saad oma käest ühe Pyro-tüüpi koletise, mille ATK on 500 või vähem, Hauakambrisse, et hävitada üks koletis, mida sinu vastane kontrollib, kuid sa ei saa sellel käigul rünnakut kuulutada, kui sa seda teed.

source: Soul of Fire
et: Tule hing

source: Your opponent draws 1 card. Then, select 1 Pyro-Type monster from your Deck and remove it from play. Inflict damage to your opponent equal to half the ATK of the removed monster. If you activate this card you cannot declare an attack this turn.
et: Sinu vastane tõmbab 1 kaardi. Seejärel vali oma pakist 1 Pyro-tüüpi koletis ja eemalda see mängust. Tekita oma vastasele kahju, mis on võrdne eemaldatud koletise poole rünnakujõuga. Kui aktiveerid selle kaardi, ei saa sa sel käigul rünnakut kuulutada.

source: Tri-Blaze Accelerator
et: Kolme Leegi Kiirendi

source: Activate only by sending 1 face-up1 "<M7086>Blaze Accelerator<M>" on your side of the field to the Graveyard. You can send 1 Pyro-Type monster from your hand to the Graveyard to destroy 1 monster your opponent controls and inflict 500 damage to your opponent, but you cannot declare an attack during this turn if you do.
et: Aktiveeri ainult, saates 1 avatud "<M7086>Blaze Accelerator<M>" oma väljaku poolelt Hauakambrisse. Sa võid saata 1 Pyro-tüüpi koletise oma käest Hauakambrisse, et hävitada 1 koletis, mida sinu vastane kontrollib, ja tekitada oma vastasele 500 kahju, kuid sa ei saa sellel käigul rünnakut kuulutada, kui sa seda teed.

source: Wild Fire
et: Metsik Tuli

source: Pay 500 Life Points. Destroy a face-up1 "<M7086>Blaze Accelerator<M>" card you control and destroy all monsters on the field. Then, Special Summon 1 "<M3932>Wild Fire Token<M>" (Pyro-Type/FIRE/Level 3/ATK 1000/DEF 1000) in Attack Position. Also, you cannot declare an attack this turn.
et: Makske 500 Elupunkti. Hävita 1 avatud "<M7086>Blaze Accelerator<M>" kaart, mida sa kontrollid, ja hävita kõik koletised väljal. Seejärel, Kutsu Eriliselt välja 1 "<M3932>Wild Fire Token<M>" (Püro-Tüüp/TULI/Tase 3/RÜNNAK 1000/KAITSE 1000) Rünnakupositsioonis. Samuti, sa ei saa sellel käigul rünnakut kuulutada.

source: Firewall
et: Tulemüür

source: When your opponent declares a direct attack, you can negate that monster's attack by removing from play 1 Pyro-Type monster in your Graveyard. Pay 500 Life Points during each of your Standby Phases. If you do not, destroy this card.
et: Kui sinu vastane kuulutab välja otsese rünnaku, saad selle koletise rünnaku tühistada, eemaldades mängust ühe Pyro-tüüpi koletise oma Hauakambrist. Maksa 500 Elupunkti iga oma Ootefaaside ajal. Kui sa seda ei tee, hävita see kaart.

source: The Wicked Avatar
et: Kuri Kurat
