Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: "<M4747>Lord of D.<M>" + "<M6233>Divine Dragon Ragnarok<M>"<BR>Your opponent cannot select any Dragon-Type monsters as the target(s) of Spell, Trap, or Monster Card effects. Once per turn, you can Special Summon 1 Dragon-Type monster from your hand.
et: "<M4747>D. Isand<M>" + "<M6233>Jumalik Draakon Ragnarok<M>"<BR>Sinu vastane ei saa valida ühtegi Draakoni-tüüpi koletist Loitsu, Lõksu või Koletise Kaardi efektide sihtmärgiks. Kord ühe käigu jooksul saad Sa eriliselt kutsuda ühe Draakoni-tüüpi koletise oma käest.

source: A Feather of the Phoenix
et: Fööniksi Sulg

source: Discard 1 card. Select 1 card from your Graveyard and return it to the top of your Deck.
et: Viska 1 kaart. Vali 1 kaart oma Hauakambrist ja pane see oma Paki peale tagasi.

source: Poison Fangs
et: Mürgised kihvad

source: Each time a Beast-Type monster inflicts Battle Damage to your opponent, inflict 500 damage to your opponent.
et: Iga kord, kui Looma-tüüpi koletis tekitab lahingukahju sinu vastasele, tekita oma vastasele 500 kahju.

source: Swords of Concealing Light
et: Varjatud Valguse Mõõgad

source: When you activate this card, change all monsters on your opponent's side of the field to face-down Defense Position. Monsters on your opponent's side of the field cannot change their Battle Positions. Destroy this card during your 2nd Standby Phase after activation.
et: Kui aktiveerid selle kaardi, muuda kõik vastase poolel olevad koletised tagurpidi kaitsepositsiooni. Vastase poolel olevad koletised ei saa muuta oma lahingupositsioone. Hävita see kaart oma teise ootejärgu faasi ajal pärast aktiveerimist.

source: Spiral Spear Strike
et: Spiraalne Oda Löök

source: When a "Gaia the Fierce Knight", "Swift Gaia the Fierce Knight" or "Gaia the Dragon Champion" you control attacks a Defense Position monster, if the ATK of that card is higher than the DEF of the Defense Position monster, inflict the difference as Battle Damage to your opponent. If "Gaia the Dragon Champion" inflicts Battle Damage with this effect, draw 2 cards and discard 1 card.
et: Kui sinu kontrollitav "Raevukas Rüütel Gaia", "Kiire Raevukas Rüütel Gaia" või "Draakonimeister Gaia" ründab kaitseasendis olevat koletist ja selle kaardi rünnakupunktid (ATK) on suuremad kui kaitseasendis oleva koletise kaitsepunktid (DEF), tekitatakse vastasele lahingukahju, mis on võrdne nende punktide vahega. Kui "Draakonimeister Gaia" tekitab selle efektiga lahingukahju, tõmba 2 kaarti ja viska 1 kaart ära.

source: Release Restraint
et: Vabasta Piirang

source: Tribute 1 "Gearfried the Iron Knight" to Special Summon 1 "Gearfried the Swordmaster" from your hand or Deck.
et: Lohista 1 "Gearfried the Iron Knight", et Kutsu eriliselt välja 1 "Gearfried the Swordmaster" oma käest või pakist.

source: Centrifugal Field
et: Tsentrifugaalväli

source: When a Fusion Monster is destroyed and sent to the Graveyard by a card effect, select 1 of the Fusion Material Monsters written in the card text of that Fusion Monster from your Graveyard and Special Summon it to your side of the field.
et: Kui Fusion Monster hävitatakse ja saadetakse kaardi efekti tõttu Hauakambrisse, vali 1 Fusion Material Monster, mis on kirjutatud selle Fusion Monsteri kaarditeksti, oma Hauakambrist ja Special Summon see oma väljaku poolele.

source: Fulfillment of the Contract
et: Lepingu Täitmine

source: Pay 800 Life Points. Select 1 Ritual Monster from your Graveyard, Special Summon it, and equip it with this card. When this card is destroyed, remove the equipped monster from play.
et: Makske 800 Elupunkti. Vali 1 Rituaalikoletis oma Hauakambrist, Kutsu see Eriliselt välja ja varusta see selle kaardiga. Kui see kaart hävitatakse, eemalda varustatud koletis mängust.

source: Re-Fusion
et: Taassulandumine

source: Pay 800 Life Points. Select 1 Fusion Monster from your Graveyard, Special Summon it, and equip it with this card. When this card is destroyed, remove the equipped monster from play.
et: Makske 800 Elupunkti. Vali 1 Fusion Monster oma Hauakambrist, Kutsu see Eriliselt välja ja varusta see selle kaardiga. Kui see kaart hävitatakse, eemalda varustatud koletis mängust.

source: The Big March of Animals
et: Loomade suur marss

source: Until the end of this turn, all face-up Beast-Type monsters on your side of the field gain 200 ATK for each Beast-Type monster on your side of the field.
et: Kuni selle käigu lõpuni saavad kõik sinu väljaku avatud Beast-tüüpi koletised 200 ATK juurde iga sinu väljaku Beast-tüüpi koletise kohta.

source: Cross Counter
et: Ristlöök

source: If the DEF of an attacked Defense Position monster is higher than the ATK of your opponent's attacking monster, the Battle Damage inflicted to your opponent is doubled. Destroy the attacking monster after damage calculation.
et: Kui rünnatava kaitseasendis oleva koletise DEF on kõrgem kui sinu vastase ründava koletise ATK, siis sinu vastasele tekitatud lahingukahju kahekordistub. Hävita ründav koletis pärast kahju arvutamist.

source: Penalty Game!
et: Karistusmäng!

source: When your opponent has 4 cards in their hand, select and activate 1 of these effects:<BR>● Your opponent cannot draw during their next Draw Phase.<BR>● Your opponent cannot activate any Spell or Trap Cards this turn.
et: Kui sinu vastasel on käes 4 kaarti, vali ja aktiveeri üks järgmistest efektidest:<BR>● Sinu vastane ei saa oma järgmise Tõmbefaasi ajal kaarte tõmmata.<BR>● Sinu vastane ei saa sellel käigul ühtegi Loitsu- ega Lõksukaarti aktiveerida.

source: Threatening Roar
et: Hirmutav möire

source: Your opponent cannot declare an attack this turn.
et: Sinu vastane ei saa sellel käigul rünnakut kuulutada.

source: Phoenix Wing Wind Blast
et: Phoenixi Tiiva Tuulepuhang

source: Discard 1 card to select 1 card your opponent controls. Return the selected card to the top of it's owner's Deck.
et: Viska 1 kaart, et valida 1 kaart, mida sinu vastane kontrollib. Tagasta valitud kaart selle omaniku paki tippu.

source: Good Goblin Housekeeping
et: Hea Goblini Majapidamine

source: Draw cards equal to the number of "Good Goblin Housekeeping" cards in your Graveyard +1, then select 1 card from your hand and return it to the bottom of your Deck.
et: Tõmba kaarte, mis on võrdne sinu Hauakambris olevate "Hea Goblini Majapidamine" kaartide arvuga +1, seejärel vali 1 kaart oma käest ja pane see oma Paki põhja.

source: Beast Soul Swap
et: Metshinge vahetus

source: Return to the owner's hand 1 face-up Beast-Type monster on your side of the field, then the owner of that card Special Summons 1 Beast-Type monster from their hand with the same Level as the monster you returned.
et: Tagasta omaniku kätte 1 ülespoole pööratud Beast-tüüpi koletis oma väljaku poolelt, seejärel kutsub selle kaardi omanik eriliselt välja 1 Beast-tüüpi koletise oma käest, mille tase on sama, mis tagastatud koletisel.

source: Assault on GHQ
et: Rünnak GHQ-le

source: Select 1 monster on your side of the field to activate this card. Destroy the selected card and send 2 cards from the top of your opponent's Deck to the Graveyard.
et: Vali 1 koletis oma väljaku poolelt, et aktiveerida see kaart. Hävita valitud kaart ja saada 2 kaarti oma vastase paki pealt Hauakambrisse.

source: D.D. Dynamite
et: D.D. Dünamiiit

source: Inflict 300 damage to your opponent for each of their removed from play cards.
et: Tekita oma vastasele 300 kahju iga tema mängust eemaldatud kaardi eest.

source: Deck Devastation Virus
et: Paki hävitamise viirus

source: Tribute 1 DARK monster with 2000 or more ATK; check your opponent's hand, all monsters they control, and all cards they draw until the end of their 3rd turn after this card's activation, and destroy all those monsters with 1500 or less ATK.
et: Ohverda 1 PIMEDUS koletis, mille ATK on 2000 või rohkem; kontrolli oma vastase kätt, kõiki koletisi, mida nad kontrollivad, ja kõiki kaarte, mida nad tõmbavad kuni nende 3. käigu lõpuni pärast selle kaardi aktiveerimist, ja hävita kõik need koletised, mille ATK on 1500 või vähem.

source: Elemental Burst
et: Elementaalne Purse

source: Tribute 1 each of WIND, WATER, FIRE, and EARTH monsters to activate this card. Destroy all cards on your opponent's side of the field.
et: Ohverda 1 tuule, vee, tule ja maa koletis, et aktiveerida see kaart. Hävita kõik kaardid vastase väljaku poolel.

source: Forced Ceasefire
et: Sunnitud vaherahu

source: Discard 1 card from your hand. No Trap Cards can be activated until the end of this turn.
et: Viska 1 kaart oma käest. Lõpuni ei saa aktiveerida ühtegi lõksukaarti.

source: Vampire's Curse
et: Vampiiri needus

source: When this card is destroyed by battle and sent to the Graveyard, you can pay 500 Life Points. If you do, Special Summon it during the next turn's Standby Phase. When this card is Special Summoned this way, it gains 500 ATK.
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse, võid maksta 500 Elupunkti. Kui teed seda, kutsu see järgmisel käigu Ootefaasil eriliselt välja. Kui see kaart kutsutakse sel viisil eriliselt välja, saab see 500 ATK juurde.

source: Union Attack
et: Ühendusrünnak

source: Select 1 face-up monster you control. During the Battle Phase this turn, that monster gains ATK equal to the total ATK of all other face-up Attack Position monsters you control. This turn, that monster inflicts no Battle Damage to your opponent, and other face-up Attack Position monsters cannot attack.
et: Vali 1 avatud näoga koletis, mida sa kontrollid. Selle käigu Lahingu Faasis saab see koletis ATK-d, mis on võrdne kõigi teiste avatud näoga Rünnakupositsioonis olevate koletiste kogutud ATK-ga, mida sa kontrollid. Sellel käigul see koletis ei põhjusta lahingukahju sinu vastasele ja teised avatud näoga Rünnakupositsioonis olevad koletised ei saa rünnata.

source: Blood Sucker
et: Veresõber

source: When this card inflicts Battle Damage to your opponent, send the top card of your opponent's Deck to the Graveyard.
et: Kui see kaart tekitab lahingukahju sinu vastasele, saada sinu vastase paki ülemine kaart hauakambrisse.

source: Overpowering Eye
et: Ülekaalukas Silm

source: Select 1 Zombie-Type monster you control with 2000 or less ATK. It can attack your opponent directly this turn.
et: Vali 1 Zombie-tüüpi koletis, mida sa kontrollid ja millel on 2000 või vähem ATK. See võib sellel käigul rünnata sinu vastast otse.

source: Red-Eyes Darkness Dragon
et: Punasilmne Pimeduse Draakon

source: This card cannot be Normal Summoned or Set. This card cannot be Special Summoned except by Tributing 1 "<M4088>Red Eyes B. Dragon<M>". This card gains 300 ATK for each Dragon-Type monster in your Graveyard.
et: Seda kaarti ei saa tavaliselt kutsuda ega asetada. Seda kaarti ei saa eriliselt kutsuda, välja arvatud, kui ohverdatakse 1 "<M4088>Red Eyes B. Dragon<M>". See kaart saab 300 ATK iga sinu hauas oleva Draakoni-tüüpi koletise eest.

source: Vampire Genesis
et: Vampiir Genesis

source: This card cannot be Normal Summoned or Set. This card cannot be Special Summoned except by removing from play 1 "Vampire Lord" you control. Once per turn, you can discard 1 Zombie-Type monster to the Graveyard to select 1 Zombie-Type monster in your Graveyard with a Level less than the discarded Zombie-Type monster's, and Special Summon it.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti ei saa eriliselt kutsuda, välja arvatud juhul, kui eemaldate mängust ühe "Vampiirilordi", mida te kontrollite. Kord ühe käigu jooksul võite saata ühe zombitüüpi koletise kalmistule, et valida oma kalmistult üks zombitüüpi koletis, mille tase on madalam kui saadetud zombitüüpi koletisel, ja kutsuda see eriliselt välja.

source: You can Tribute this card to Special Summon 1 "<M4007>Blue-Eyes White Dragon<M>" from your hand.
et: Saad selle kaardi ohverdada, et erikutsuda 1 "<M4007>Sinisilmne Valge Draakon<M>" oma käest.

source: Machina Soldier
et: Machina Sõdur

source: When this card is Normal Summoned while you control no monsters, you can Special Summon 1 "Machina" monster from your hand, except "Machina Soldier".
et: Kui see kaart on Normaal-Kutsutud, kui sa ei kontrolli ühtegi koletist, saad sa Eriliselt Kutsuda 1 "Machina" koletise oma käest, välja arvatud "Machina Soldier".

source: Machina Defender
et: Machina Kaitsja

source: FLIP: Add 1 "Commander Covington" from your Deck to your hand.
et: FLIP: Lisa oma pakist 1 "Commander Covington" oma kätte.

source: "Machina" monsters cannot be attacked, except "Machina Sniper".
et: "Machina" koletisi ei saa rünnata, välja arvatud "Machina Sniper".

source: Commander Covington
et: Komandör Covington

source: You can send one face-up "Machina Soldier", "Machina Sniper", and "Machina Defender" you control to the Graveyard to Special Summon 1 "Machina Force" from your hand or your Deck.
et: Saad ühe oma kontrollitava avatud "Machina Soldier", "Machina Sniper" ja "Machina Defender" kalmistule, et eriliselt kutsuda 1 "Machina Force" oma käest või pakist.

source: Machina Force
et: Machina Jõud

source: This card cannot be Normal Summoned or Set. This card cannot be Special Summoned except with "Commander Covington". This card cannot declare an attack unless you pay 1000 Life Points. You can send this card from the field to the Graveyard to select and Special Summon one each of "Machina Soldier", "Machina Sniper", and "Machina Defender" from your Graveyard.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti ei saa eriliselt kutsuda, välja arvatud "Commander Covingtoni" abil. See kaart ei saa rünnakut kuulutada, kui te ei maksa 1000 elupunkti. Saate saata selle kaardi väljakult hauakambrisse, et valida ja eriliselt kutsuda üks "Machina Soldier", "Machina Sniper" ja "Machina Defender" oma hauakambrist.

source: Elemental HERO Avian
et: Elementaalne KANGELANE Avian

source: A winged Elemental HERO who wheels through the sky and manipulates the wind. His signature move, Featherbreak, gives villainy a blow from sky-high.
et: Tiivulistega Elemental HERO, kes lendab läbi taeva ja manipuleerib tuulega. Tema tunnusliigutus, Featherbreak, annab kurjusele löögi taevast.

source: Elemental HERO Burstinatrix
et: Elementaalne KANGELANE Burstinatrix

source: A flame manipulator who was the first Elemental HERO woman. Her Burstfire burns away villainy.
et: Leegimanipulaator, kes oli esimene Elemental HERO naine. Tema Burstfire põletab kurjuse.

source: Elemental HERO Clayman
et: Elementaalne KANGELANE Savi-mees

source: An Elemental HERO with a clay body built-to-last. He'll preserve his Elemental HERO colleagues at any cost.
et: Elemental HERO, kellel on vastupidav savikeha. Ta kaitseb oma Elemental HERO kolleege iga hinna eest.

source: Elemental HERO Sparkman
et: Elementaalne KANGELANE Sädememees

source: An Elemental HERO and a warrior of light who proficiently wields many kinds of armaments. His Static Shockwave cuts off the path of villainy.
et: Elementaalne KANGELANE ja valguse sõdalane, kes oskuslikult käsitseb mitmesuguseid relvi. Tema Staatiline Lööklaine katkestab kurjuse tee.

source: Winged Kuriboh
et: Tiivuline Kuriboh

source: If this card on the field is destroyed and sent to the Graveyard: Any further Battle Damage you take this turn become 0.
et: Kui see kaart väljal hävitatakse ja saadetakse Hauakambrisse: kogu edasine Lahingukahju, mida sa sel käigul saad, muutub 0-ks.

source: Ancient Gear Golem
et: Muinasvarustuse Golem

source: This card cannot be Special Summoned. If this card attacks a Defense Position monster, inflict Piercing Battle Damage to your opponent. If this card attacks, your opponent cannot activate any Spell or Trap Cards until the end of the Damage Step.
et: Seda kaarti ei saa eriliselt kutsuda. Kui see kaart ründab kaitsepositsioonis olevat koletist, tekitab see vastasele läbistavat lahingukahju. Kui see kaart ründab, ei saa vastane aktiveerida ühtegi loitsu- ega lõksukaarti kuni Kahjustuse Etapi lõpuni.

source: Ancient Gear Beast
et: Muinasvarustuse Elajas

source: This card cannot be Special Summoned. The effects of your opponent's monsters that this card destroys by battle are negated. If this card attacks, your opponent cannot activate any Spell or Trap Cards until the end of the Damage Step.
et: Seda kaarti ei saa eriliselt kutsuda. Selle kaardi lahingus hävitatud vastase koletiste efektid on tühistatud. Kui see kaart ründab, ei saa vastane aktiveerida ühtegi Loitsu ega Lõksukaarti kuni Kahjustuse Etapi lõpuni.

source: Ancient Gear Soldier
et: Muinasvarustuse Sõdur

source: If this card attacks, your opponent cannot activate any Spell or Trap Cards until the end of the Damage Step.
et: Kui see kaart ründab, ei saa sinu vastane aktiveerida ühtegi Võlu- ega Lõksukaarti kuni Kahjustuse Etapi lõpuni.

source: Millennium Scorpion
et: Millennium Skorpion

source: Each time this card destroys 1 monster on your opponent's side of the field by battle and sends it to the Graveyard, this card gains 500 ATK.
et: Iga kord, kui see kaart hävitab lahingus ühe koletise sinu vastase väljaku poolel ja saadab selle Hauakambrisse, saab see kaart 500 ATK juurde.

source: Ultimate Insect LV7
et: Ülim Putukas LV7

source: If this card was Special Summoned by the effect of "Ultimate Insect LV5", while it remains on the field all your opponent's monsters lose 700 ATK and DEF.
et: Kui see kaart kutsuti eriliselt välja "Ultimate Insect LV5" efekti abil, kaotavad kõik sinu vastase koletised, kuni see jääb väljale, 700 ATK ja DEF.

source: Lost Guardian
et: Kadunud Kaitsja

source: The original DEF of this card becomes the number of your Rock-Type monsters that are removed from play x 700.
et: Selle kaardi algne DEF muutub sinu mängust eemaldatud Kalju-tüüpi koletiste arvu x 700 võrra.

source: Hieracosphinx
et: Hierakosfinks

source: Your opponent cannot select a face-down Defense Position monster as an attack target.
et: Sinu vastane ei saa valida rünnaku sihtmärgiks allapoole suunatud kaitseasendis olevat koletist.

source: Criosphinx
et: Kriosphinks

source: When a monster is returned from the field to the owner's hand, the owner of the returned monster selects and sends 1 card in their hand to the Graveyard.
et: Kui koletis tagastatakse väljakult omaniku kätte, valib tagastatud koletise omanik ühe kaardi oma käest ja saadab selle Hauakambrisse.

source: Moai Interceptor Cannons
et: Moai püüdurkahurid

source: Once per turn, you can flip this card into face-down Defense Position.
et: Korra ühe korra käigu jooksul saad selle kaardi pöörata näoga allapoole kaitsepositsiooni.

source: Megarock Dragon
et: Megarock Draakon

source: This card cannot be Normal Summoned or Set. This card cannot be Special Summoned except by removing from play a Rock-Type monster(s) in your Graveyard. The original ATK and DEF of this card become the number of Rock-Type monsters you removed from play when you Special Summoned this card x 700.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti ei saa eriliselt kutsuda, välja arvatud eemaldades oma kalmistult mängust Kiviliigi koletise(d). Selle kaardi algne ATK ja DEF muutuvad võrdseks nende Kiviliigi koletiste arvuga, mille sa mängust eemaldasid, kui sa selle kaardi eriliselt kutsusid, korrutatuna 700-ga.

source: Dummy Golem
et: Nuku Golem

source: FLIP: Your opponent selects 1 monster that they control. Switch control of the selected monster and this card.
et: FLIP: Sinu vastane valib ühe koletise, mida nad kontrollivad. Vaheta valitud koletise ja selle kaardi kontrolli.

source: Grave Ohja
et: Hauakambri Ohja

source: While there is a face-down Defense Position monster(s) on your side of the field, no player can select this card as an attack target. Each time a monster on your side of the field is Flip Summoned, inflict 300 damage to your opponent.
et: Kui sinu väljaku poolel on näoga allapoole kaitseasendis koletis(ed), ei saa ükski mängija valida seda kaarti rünnaku sihtmärgiks. Iga kord, kui sinu väljaku poolel olev koletis pööratakse ümber, tekitab see sinu vastasele 300 kahju.

source: Mine Golem
et: Kaevanduse Golem

source: When this card is destroyed by battle and sent to the Graveyard, inflict 500 damage to your opponent.
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse, tekitage oma vastasele 500 kahju.

source: Monk Fighter
et: Munkvõitleja

source: Battle Damage to this card's controller from a battle involving this card becomes 0.
et: Lahingukahju selle kaardi kontrollijale lahingus, mis hõlmab seda kaarti, muutub 0-ks.

source: Master Monk
et: Meistermunk

source: This card cannot be Normal Summoned or Set. This card cannot be Special Summoned except by Tributing 1 "Monk Fighter". This card can attack twice during the same turn.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti ei saa eriliselt kutsuda, välja arvatud 1 "Monk Fighter" ohverdamise teel. See kaart võib rünnata kaks korda sama käigu jooksul.

source: Guardian Statue
et: Valvurkuju

source: Once per turn, you can flip this card into face-down Defense Position. When this card is Flip Summoned, return 1 monster on your opponent's side of the field to its owner's hand.
et: Korra ühe korra käigu jooksul saad selle kaardi pöörata näoga allapoole kaitsepositsiooni. Kui see kaart on ümber pööratud, tagasta 1 koletis vastase väljalt selle omaniku kätte.

source: Medusa Worm
et: Meduusa Uss

source: Once per turn, you can flip this card into face-down Defense Position. When this card is Flip Summoned, destroy 1 monster on your opponent's side of the field.
et: Korra ühe korra käigu jooksul saad selle kaardi pöörata näoga allapoole kaitsepositsiooni. Kui see kaart on ümber pööratud, hävita 1 koletis oma vastase väljaku poolel.

source: D.D. Survivor
et: D.D. Ellujääja

source: During the End Phase, if this card was banished while face-up, on your side of the field, this turn: Special Summon this banished card. This effect can only activate once per turn.
et: End Phase'i ajal, kui see kaart oli selle käigu ajal sinu väljaku poolel näoga ülespoole eemaldatud mängust: Kutsu see eemaldatud kaart eriliselt välja. Seda efekti saab aktiveerida ainult üks kord käigu jooksul.

source: Mid Shield Gardna
et: Keskkilbi Gardna

source: Once per turn, you can flip this card into face-down Defense Position. Negate the activation of a Spell Card that targets this 1 face-down monster. At that time, flip this card into face-up Defense Position.
et: Korra ühe korra käigu jooksul saad selle kaardi pöörata näoga allapoole kaitseasendisse. Tühista loitsukaardi aktiveerimine, mis sihib seda ühte näoga allapoole olevat koletist. Sel hetkel pööra see kaart näoga ülespoole kaitseasendisse.

source: White Ninja
et: Valge Ninja

source: FLIP: Destroy 1 Defense Position monster.
et: FLIP: Hävita 1 kaitseasendis olev koletis.

source: Aussa the Earth Charmer
et: Aussa, Maa Võluritüdruk

source: FLIP: While this card is face-up on the field, take control of 1 EARTH monster your opponent controls.
et: FLIP: Kui see kaart on lahinguväljal avatud, võta kontroll 1 EARTH koletise üle, mida sinu vastane kontrollib.

source: Eria the Water Charmer
et: Eria, Veeloidur

source: FLIP: Take control of 1 WATER monster on your opponent's side of the field for as long as this card remains face-up on the field.
et: FLIP: Võta kontroll 1 VEE koletise üle, mis on sinu vastase väljaku poolel, seni kuni see kaart jääb väljale avatud olekusse.

source: Hiita the Fire Charmer
et: Hiita, Tule Võlur

source: FLIP: Take control of 1 FIRE monster on your opponent's side of the field for as long as this card remains face-up on the field.
et: FLIP: Võta kontroll 1 FIRE koletise üle, mis on sinu vastase väljaku poolel, nii kaua kui see kaart jääb väljale avatud olekusse.

source: Wynn the Wind Charmer
et: Tuulevõlur Wynn
