Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: Once per turn, you can change this face-up Attack Position card you control to face-up Defense Position and place 1 Spell Counter on a face-up card you control that you can place a Spell Counter on.
et: Korra ühe korra käigu jooksul saad muuta selle avatud Rünnakupositsioonis oleva kaardi, mida sa kontrollid, avatud Kaitsepositsiooniks ja asetada 1 Loitsuloendur avatud kaardile, mida sa kontrollid ja millele saab asetada Loitsuloenduri.

source: FLIP: You can Special Summon 1 Level 3 or lower Beast-Type monster from your Deck in face-down Defense Position.
et: FLIP: Saad spetsiaalset kutsuda 1. taseme 3 või madalama Tüüpi Koletis oma pakist näoga allapoole kaitseasendisse.

source: Cactus Bouncer
et: Kaktusembaja

source: This card cannot be Special Summoned. While a Plant-Type monster other than this card is face-up on the field, neither player can Special Summon monsters.
et: Seda kaarti ei saa eriliselt kutsuda. Kui väljakul on selle kaardi kõrval mõni teine taim-tüüpi koletis, ei saa kumbki mängija eriliselt koletisi kutsuda.

source: Dragonic Guard
et: Draakoni Valvur

source: Each time a monster is Normal Summoned or Set, place 1 Dragonic Counter on this card. You can send this face-up card to the Graveyard to Special Summon 1 Dragon-Type monster from your Deck whose Level is less than or equal to the number of Dragonic Counters on this card.
et: Iga kord, kui koletis kutsutakse tavaliselt või asetatakse, pane sellele kaardile 1 draakoniloendur. Sa saad saata selle avatud kaardi Hauakambrisse, et eriliselt kutsuda oma pakist 1 draakonitüüpi koletis, mille tase on väiksem või võrdne sellel kaardil olevate draakoniloendurite arvuga.

source: The Dragon Dwelling in the Deep
et: Sügavustes elav Draakon

source: Place 1 Ocean Counter on this card during each player's Standby Phases. When this card is removed from the field, all Fish-Type and Sea Serpent-Type monsters you control gain 200 ATK for each Ocean Counter on this card, until the End Phase.
et: Aseta sellele kaardile 1 Ookeani Loendur iga mängija Ootefaaside ajal. Kui see kaart eemaldatakse väljakult, saavad kõik Kalatüüpi ja Meremadu-tüüpi koletised, mida sa kontrollid, 200 ATK-d iga sellel kaardil oleva Ookeani Loenduri eest kuni Lõppfaasini.

source: Djinn Disserere of Rituals
et: Rituaalide Djinn Disserere

source: When you Ritual Summon a Ritual Monster, you can remove from play this card from your Graveyard as 1 of the monsters required for the Ritual Summon. The monster Ritual Summoned using this card is not affected by Trap Cards.
et: Kui sa kutsud rituaalikoletise rituaali abil, võid selle kaardi oma hauast mängust eemaldada ühe rituaalikutsumiseks vajaliku koletisena. Selle kaardi abil rituaalikutsutud koletist ei mõjuta lõksukaardid.

source: Earthbound Linewalker
et: Maa-seotud Rändur

source: "Earthbound Immortal" monsters cannot be destroyed by their own effects.
et: "Earthbound Immortal" koletisi ei saa hävitada nende enda efektidega.

source: Gravekeeper's Priestess
et: Haudavahtide Preestrinna

source: The field is treated as "<M5533>Necrovalley<M>". If there is a face-up Field Spell Card, this effect is not applied. All face-up "Gravekeeper's" Monsters gain 200 ATK and DEF.
et: Väli käsitletakse kui "<M5533>Necrovalley<M>". Kui on avatud Väliloitsu kaart, siis see efekt ei rakendu. Kõik avatud "Gravekeeper's" koletised saavad 200 ATK ja DEF juurde.

source: Core Transport Unit
et: Tuuma transpordiüksus

source: Once per turn, you can discard 1 card to add 1 "<M8207>Iron Core of Koa'ki Meiru<M>" from your Deck to your hand.
et: Korra ühe korra käigu jooksul saad sa ühe kaardi ära visata, et lisada üks "<M8207>Iron Core of Koa'ki Meiru<M>" oma pakist oma kätte.

source: Genex Ally Axel
et: Genexi liitlane Axel

source: 1 "Genex" Tuner + 1 or more non-Tuner monsters<BR>Once per turn, you can discard 1 card to select 1 Level 4 or lower Machine-Type monster from your Graveyard, and Special Summon it. The ATK of that monster is doubled until the End Phase, but it cannot attack your opponent directly. Remove that monster from play during your End Phase.
et: 1 "Genex" Tuner + 1 või rohkem mitte-Tuner koletist<BR>Kord ühe käigu jooksul saad sa ühe kaardi ära visata, et valida oma Hauakambrist üks 4. või madalama taseme Masinatüüpi koletis ja see eriliselt välja kutsuda. Selle koletise ATK kahekordistub kuni Lõppfaasini, kuid see ei saa sinu vastast otse rünnata. Eemalda see koletis oma Lõppfaasi ajal mängust.

source: Blackwing - Ghibli the Searing Wind
et: Mustatiib - Ghibli, Põletav Tuul

source: When your opponent declares a direct attack, you can Special Summon this card from your hand. Once per turn, you can switch the original ATK and DEF of this card, until the End Phase.
et: Kui sinu vastane kuulutab välja otsese rünnaku, saad selle kaardi oma käest eriliselt välja kutsuda. Kord ühe käigu jooksul saad selle kaardi algse ATK ja DEF vahetada kuni Lõppfaasini.

source: Blackwing - Gust the Backblast
et: Mustatiib - Gust the Backblast

source: If you control no cards, you can Special Summon this card from your hand. While this card is face-up on the field, if your opponent's monster attacks a "Blackwing" monster you control, the attacking monster loses 300 ATK during the Damage Step only.
et: Kui sul pole ühtegi kaarti, saad selle kaardi oma käest eriliselt välja kutsuda. Kui see kaart on väljakul avatud, kaotab ründav koletis 300 rünnakupunkti ainult kahjuarvestuse ajal, kui sinu vastase koletis ründab sinu kontrollitavat "Musttiiva" koletist.

source: Blackwing - Breeze the Zephyr
et: Mustatiib - Briis Zephyr

source: If this card is added from your Deck to your hand by the effect of a Spell, Trap, or Monster Card, you can Special Summon this card. This card cannot be used as a Synchro Material Monster, except for the Synchro Summon of a "Blackwing" monster.
et: Kui see kaart lisatakse sinu pakist sinu kätte loitsu, lõksu või koletise kaardi efekti abil, saad selle kaardi eriliselt välja kutsuda. Seda kaarti ei saa kasutada sünkromaterjalina, välja arvatud "Blackwing" koletise sünkrokutsumiseks.

source: Changer Synchron
et: Muundaja Sünkroon

source: If this card is sent to the Graveyard for a Synchro Summon, select 1 monster your opponent controls and change its battle position.
et: Kui see kaart saadetakse Sünkrosummoni jaoks Hauakambrisse, vali 1 koletis, mida sinu vastane kontrollib, ja muuda selle lahinguasendit.

source: Card Breaker
et: Kaardipurustaja

source: This card cannot be Normal Summoned or Set. This card can only be Special Summoned, in face-up Attack Position, by sending 1 card from your Spell & Trap Card Zone to the Graveyard.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti saab eriliselt kutsuda ainult rünnakupositsioonis, saates ühe kaardi oma loitsu- ja lõksukaartide tsoonist hauakambrisse.

source: Second Booster
et: Teine Tugevdaja

source: You can Tribute this card to select 1 face-up Attack Position monster you control. The selected monster gains 1500 ATK until the End Phase.
et: Saad selle kaardi ohverdada, et valida 1 avatud ründeasendis koletis, mida sa kontrollid. Valitud koletis saab 1500 ATK kuni lõppfaasini.

source: Archfiend Interceptor
et: Kuradikaitse interceptor

source: While you control this face-up Attack Position card, when an opponent's monster declares an attack, inflict 500 damage to your opponent.
et: Kui sa kontrollid seda avatud Rünnakupositsioonis kaarti ja vastase koletis kuulutab välja rünnaku, tekitab see vastasele 500 kahju.

source: Dread Dragon
et: Kartlik Draakon

source: When this card is destroyed by battle and sent to the Graveyard, you can add 1 Level 3 or lower Dragon-Type monster from your Deck to your hand.
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse, saad lisada oma pakist oma kätte ühe 3. taseme või madalama Draakoni-tüüpi koletise.

source: Trust Guardian
et: Usaldusväärne Kaitsja

source: This card cannot be used as a Synchro Material Monster, except for the Synchro Summon of a Level 7 or higher Synchro Monster. Once per turn, that Synchro Monster cannot be destroyed by battle. Each time this effect is applied, that Synchro Monster loses 400 ATK and DEF at the end of the Damage Step.
et: Seda kaarti ei saa kasutada Sünkro Materjal Koletisena, välja arvatud 7. või kõrgema taseme Sünkro Koletise Sünkro Kutsumiseks. Kord käigu jooksul ei saa seda Sünkro Koletist lahingus hävitada. Iga kord, kui seda efekti rakendatakse, kaotab see Sünkro Koletis 400 ATK ja DEF-i Kahjustuse Etapi lõpus.

source: Flare Resonator
et: Leekresonaator

source: The Synchro Monster that used this card as a Synchro Material Monster gains 300 ATK.
et: Sünkroonkoletis, mis kasutas seda kaarti sünkroonmaterjalina, saab 300 ATK juurde.

source: Synchro Magnet
et: Sünkromagnet

source: This card cannot be Normal Summoned or Set. When you Synchro Summon a Synchro Monster, you can Special Summon this card from your hand.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Kui sa kutsud sünkrokoletise, saad selle kaardi oma käest eriliselt kutsuda.

source: This card cannot be Special Summoned from the Graveyard. If you have no cards in your hand, you can Tribute this card to select 2 "Infernity" monsters in your Graveyard. Special Summon those monsters.
et: Seda kaarti ei saa eriliselt kutsuda hauakambrist. Kui sul pole kaarte käes, võid selle kaardi ohverdada, et valida 2 "Infernity" koletist oma hauakambrist. Kutsu need koletised eriliselt välja.

source: Infernity Randomizer
et: Infernity Randomiseerija

source: Once per turn, while you have no cards in your hand, you can draw 1 card and reveal it. For a Monster Card drawn with this effect, inflict damage to your opponent equal to the Level of that monster x 200. For a Spell or Trap Card, you take 500 damage.
et: Kord päevas, kui sul pole käes ühtegi kaarti, võid tõmmata 1 kaardi ja selle paljastada. Kui selle efektiga tõmmatakse Koletisekaart, tekitatakse vastasele kahju, mis on võrdne selle koletise tasemega x 200. Kui tõmmatakse Loitsu- või Lõksukaart, saad sina 500 kahju.

source: Infernity Beetle
et: Infernity Põrnikas

source: While you have no cards in your hand, you can Tribute this card to Special Summon up to 2 "<M8790>Infernity Beetle<M>" from your Deck.
et: Kui sul pole kaarte käes, võid selle kaardi ohverdada, et Kutsuda Eriliselt kuni 2 "<M8790>Infernity Beetle<M>" oma pakist.

source: Infernity Avenger
et: Infernity Kättemaksja

source: When a monster you control, except "<M8791>Infernity Avenger<M>", is destroyed by battle with an opponent's monster and sent to the Graveyard, while you have no cards in your hand, you can Special Summon this card from your Graveyard. In that case, the Level of this card is equal to the Level of your destroyed monster.
et: Kui sinu kontrollitav koletis, välja arvatud "<M8791>Infernity Avenger<M>", hävitatakse lahingus vastase koletisega ja saadetakse Hauakambrisse, samal ajal kui sul pole kaarte käes, võid selle kaardi oma Hauakambrist eriliselt kutsuda. Sel juhul on selle kaardi tase võrdne sinu hävitatud koletise tasemega.

source: Revival Rose
et: Elustav Roos

source: If a Level 5 or higher Plant-type monster you control is destroyed, you can Special Summon this card from your Graveyard.
et: Kui sinu kontrolli all olev 5. taseme või kõrgem Taim-tüüpi koletis hävitatakse, saad selle kaardi oma Hauakambrist eriliselt välja kutsuda.

source: Morphtronic Vacuumen
et: Morftronik Tolmuimeja

source: ● While in Attack Position: Once per turn, you can send 1 card equipped to this card to the Graveyard to inflict 500 damage to your opponent.<BR>● While in Defense Position: Once per turn, you can equip 1 face-up Attack Position monster your opponent controls to this card. (You can only equip 1 monster at a time to this card.)
et: ● Rünnakupositsioonis olles: Kord ühe käigu jooksul võid saata ühe selle kaardiga varustatud kaardi Hauakambrisse, et tekitada oma vastasele 500 kahju.<BR>● Kaitsepositsioonis olles: Kord ühe käigu jooksul võid varustada ühe vastase kontrollitava rünnakupositsioonis oleva avatud koletise selle kaardiga. (Sa saad korraga varustada selle kaardiga ainult ühe koletise.)

source: Bird of Roses
et: Roosilind

source: When this face-up Attack Position card is destroyed by battle with an opponent's attacking monster and sent to the Graveyard, you can Special Summon 2 Plant-Type Tuner monsters from your Deck in face-up Defense Position.
et: Kui see avatud ründepositsioonis kaart hävitatakse lahingus vastase ründava koletisega ja saadetakse Hauakambrisse, saad oma pakist spetsiaalselt kutsuda 2 Taimetüüpi Häälestuskoletist avatud kaitsepositsioonis.

source: Spore
et: Eospora

source: If this card is in your Graveyard: You can banish 1 other Plant-Type monster from your Graveyard; Special Summon this card from your Graveyard and increase its Level by the Level of that banished monster. Each player can only activate the effect of "Spore" once per Duel.
et: Kui see kaart on sinu Hauakambris: Sa võid eemaldada mängust 1 teise Taimetüüpi koletise oma Hauakambrist; Kutsu see kaart oma Hauakambrist Eriliselt välja ja suurenda selle Tase eemaldatud koletise Taseme võrra. Iga mängija saab aktiveerida "Spoore" efekti ainult üks kord Duelli jooksul.

source: Fairy Archer
et: Haldjas Kaarik

source: During your Main Phase, you can inflict 400 damage to your opponent for each face-up LIGHT monster you control. This card cannot attack during the same turn you activate this effect. Only one "<M8796>Fairy Archer<M>" can have its effect activated per turn.
et: Oma peafaasia ajal saad sa oma vastasele tekitada 400 kahju iga ülespööratud VALGUSE koletise eest, mida sa kontrollid. See kaart ei saa rünnata samal käigul, kui sa selle efekti aktiveerid. Ainult ühel "<M8796>Fairy Archer<M>"-il saab selle efekti aktiveerida käigu jooksul.

source: Biofalcon
et: Biofalkon

source: When a Machine-Type monster you control is destroyed by battle and sent to the Graveyard while this card is face-up on the field, you can add 1 Machine-Type monster with 1000 or less ATK from your Deck to your hand.
et: Kui Masina-tüüpi koletis, mida sa kontrollid, hävitatakse lahingus ja saadetakse Hauakambrisse, kui see kaart on väljas lahinguväljal, saad sa lisada oma pakist oma kätte ühe Masina-tüüpi koletise, mille ATK on 1000 või vähem.

source: Cherry Inmato
et: Kirsimato

source: When this card is destroyed by battle and sent to the Graveyard, you can Special Summon up to 2 "Inmato" monsters from your Deck. The monster(s) Special Summoned by this effect cannot be used as Synchro Material Monsters this turn.
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse, saad oma pakist eriliselt kutsuda kuni 2 "Inmato" koletist. Selle efekti abil eriliselt kutsutud koletisi ei saa sel käigul kasutada Sünkro Materjal Koletistena.

source: Magidog
et: Maagikutsikas

source: If this card is sent to the Graveyard for the Synchro Summon of a Spellcaster-Type Synchro Monster, you can add 1 Field Spell Card from your Graveyard to your hand.
et: Kui see kaart saadetakse kalmistule loitsija-tüüpi sünkromonsteri sünkrokutsumiseks, saad lisada ühe väljaloitsukaardi oma kalmistult oma kätte.

source: Lyna the Light Charmer
et: Lyna, Valguse Võlur

source: FLIP: Take control of 1 LIGHT monster your opponent controls, while this card is face-up on the field.
et: FLIP: Võta kontroll 1 VASTASE VALGUSE koletise üle, kui see kaart on lahinguväljal avatud.

source: Wattgiraffe
et: Wattkaelkirjak

source: This card can attack your opponent directly. When this card inflicts Battle Damage to your opponent as a result of a direct attack, your opponent cannot activate the effects of any Spell, Trap, or Effect Monster Cards until the End Phase of this turn.
et: See kaart võib rünnata sinu vastast otse. Kui see kaart tekitab sinu vastasele lahingukahju otsese rünnaku tulemusena, ei saa sinu vastane aktiveerida ühegi Loitsu, Lõksu ega Efektikoletise kaardi efekte kuni selle käigu lõppfaasini.

source: Wattfox
et: Wattrebane

source: If this card is destroyed by your opponent's card (either by battle or by card effect), your opponent cannot Special Summon a monster, or activate Spells, Traps, Spell/Trap card effects, or Monster Card effects, for the rest of this turn.
et: Kui see kaart hävitatakse sinu vastase kaardi poolt (kas lahingus või kaardi efekti tõttu), ei saa sinu vastane selle käigu lõpuni erilisi kutsumisi teha ega aktiveerida loitse, lõkse, loitsu/lõksu kaardi efekte ega koletise kaardi efekte.

source: Wattwoodpecker
et: Watt-rähn

source: This card can attack twice during the same Battle Phase. Monsters that battled with this card cannot change their Battle Position.
et: See kaart saab rünnata kaks korda sama Lahingu Faasi jooksul. Koletised, kes võitlesid selle kaardiga, ei saa muuta oma Lahingu Positsiooni.

source: Koa'ki Meiru Sandman
et: Koa'ki Meiru Liivamees

source: During each of your End Phases, destroy this card unless you send 1 "<M8207>Iron Core of Koa'ki Meiru<M>" from your hand to the Graveyard or reveal 1 Rock-Type monster in your hand. You can Tribute this card to negate the activation of an opponent's Trap Card and destroy that card.
et: Iga lõpuetapi ajal hävita see kaart, kui sa ei saada 1 "<M8207>Koa'ki Meiru Raudtuum<M>" oma käest Hauakambrisse või ei näita 1 Kiviliigi koletist oma käes. Sa võid ohverdada selle kaardi, et tühistada vastase Lõksukaardi aktiveerimine ja hävitada see kaart.

source: Memory Crush King
et: Mälestuste Purustaja Kuningas

source: When this card inflicts Battle Damage to your opponent's Life Points by attacking directly, remove from play all Synchro Monsters in your opponent's Graveyard and inflict 1000 damage for each card removed that way.
et: Kui see kaart tekitab otsese rünnakuga lahingukahju sinu vastase elupunktidele, eemalda mängust kõik Sünkro Koletised sinu vastase Hauakambris ja tekita 1000 kahju iga eemaldatud kaardi eest.

source: If this card destroys an opponent's monster by battle, select and activate 1 of these effects:<BR>● Select 1 appropriate1 Union monster in your Graveyard and equip it to this card.<BR>● Select 1 face-up LIGHT Machine-Type monster you control, and return it to the Deck. Then draw 1 card.
et: Kui see kaart hävitab lahingus vastase koletise, vali ja aktiveeri 1 nendest efektidest:<BR>● Vali 1 sobiv Union koletis oma Hauakambris ja kinnita see sellele kaardile.<BR>● Vali 1 ülespoole LIGHT Masina-Tüüpi koletis, mida sa kontrollid, ja tagasta see Paki. Seejärel tõmba 1 kaart.

source: Once per turn, during your Main Phase, you can equip this card to a Machine-Type monster you control, OR unequip it to Special Summon this card in face-up Attack Position. While equipped to a monster by this effect, if the equipped monster destroys an opponent's monster by battle, select and Special Summon 1 Level 4 or lower LIGHT Machine-Type monster from your Graveyard. (A monster can only be equipped with 11 Union Monster at a time. If the equipped monster would be destroyed, destroy this card instead.)
et: Korra ühe korra oma peafaasil, saad selle kaardi kinnitada oma juhitavale Masinatüüpi koletisele VÕI eemaldada selle kinnituse, et Kutsuda see kaart eriliselt esile rünnakupositsioonis. Kui see kaart on selle efekti abil koletisele kinnitatud ja kinnitatud koletis hävitab lahingus vastase koletise, vali ja Kutsu eriliselt esile 1 4. taseme või madalama VALGUSE Masinatüüpi koletis oma Hauakambrist. (Koletisele saab korraga kinnitada ainult 1 Liidu Koletis. Kui kinnitatud koletis hävitatakse, hävita selle asemel see kaart.)

source: Neither player can Special Summon monsters with 1800 or more ATK.
et: Kumbki mängija ei saa erilist kutsuda koletisi, kellel on 1800 või rohkem ATK.

source: This card's name is treated as "<M6424>Des Frog<M>" while face-up on the field. You can remove from play 1 "Frog" monster in your Graveyard, except "<M4555>Frog the Jam<M>", to Special Summon this card from your Graveyard. This card cannot be used as a Synchro Material Monster.
et: Selle kaardi nimeks loetakse "<M6424>Des Frog<M>", kui see on väljaku peal avatud. Sa võid eemaldada mängust ühe "Frog" koletise oma kalmistul, välja arvatud "<M4555>Frog the Jam<M>", et eriliselt kutsuda see kaart oma kalmistult. Seda kaarti ei saa kasutada Sünkro Materjal Koletisena.

source: Batteryman AAA
et: Patareimees AAA

source: When this card is Normal Summoned or flipped face-up, you can Special Summon 1 "<M8810>Batteryman AAA<M>" from your hand or Graveyard.
et: Kui see kaart on Normaal-Kutsutud või ümber pööratud, saad Sa Eriliselt Kutsuda 1 "<M8810>Batteryman AAA<M>" oma käest või Hauast.

source: Batteryman Fuel Cell
et: Patareimehe Kütuseelement

source: If you control 2 or more face-up "Batteryman" monsters, you can Special Summon this card from your hand. Once per turn, you can Tribute 1 other "Batteryman" monster to return 1 card your opponent controls to the owner's hand.
et: Kui sul on kontrolli all 2 või rohkem avatud "Batteryman" koletist, saad selle kaardi oma käest eriliselt kutsuda. Kord ühe käigu jooksul saad ohverdada 1 teise "Batteryman" koletise, et tagastada 1 kaart, mida su vastane kontrollib, omaniku kätte.

source: Key Mouse
et: Võtmehiir

source: When this card is destroyed by battle and sent to the Graveyard, you can add 1 Level 3 or lower Beast-Type monster from your deck to your hand.
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse, saad lisada oma pakist oma kätte 1 3. taseme või madalama Loom-Tüüpi koletise.

source: Ally of Justice Core Destroyer
et: Õigluse Liitlase Tuuma Hävitaja

source: If this card attacks or is attacked by a LIGHT monster, destroy that monster at the start of the Damage Step (without damage calculation).
et: Kui see kaart ründab või teda ründab VALGUSE koletis, hävita see koletis Kahjustuse Etapi alguses (ilma kahjustuse arvutamiseta).

source: Hunter of Black Feathers
et: Mustade Sulgede Kütt

source: While your opponent controls 2 or more face-up monsters, all of the same Type, you can send 1 card from your hand to the Graveyard to select and destroy 1 face-up monster your opponent controls.
et: Kui sinu vastasel on 2 või rohkem sama tüüpi avatud koletist, saad sa saata ühe kaardi oma käest Hauakambrisse, et valida ja hävitada üks sinu vastase avatud koletis.

source: Black-Winged Dragon
et: Musttiib-Draakon

source: 1 Tuner + 1 or more non-Tuner monsters<BR>Whenever you would take damage from a card effect, place 1 Black Feather Counter on this card instead. This card loses 700 ATK for each Black Feather Counter on it. Once per turn, you can remove all Black Feather Counters on this card to have 1 face-up monster your opponent controls lose 700 ATK for each Black Feather Counter, and inflict damage to your opponent equal to the ATK lost by that monster because of this effect.
et: 1 Häälestaja + 1 või rohkem mitte-Häälestaja koletist<BR>Iga kord, kui sa peaksid saama kahju kaardi efekti tõttu, aseta 1 Musta Sulge loendur sellele kaardile selle asemel. See kaart kaotab 700 ATK iga Musta Sulge loenduri kohta, mis sellel on. Kord ühe käigu jooksul saad eemaldada kõik Musta Sulge loendurid sellelt kaardilt, et panna 1 vastase kontrollitav avatud koletis kaotama 700 ATK iga Musta Sulge loenduri kohta ja tekitada vastasele kahju, mis võrdub selle koletise kaotatud ATK-ga selle efekti tõttu.

source: Chaos King Archfiend
et: Kaose Kuningas Kuradivürst

source: 1 Fiend-Type Tuner + 1 or more non-Tuner monsters<BR>When this card declares an attack, you can switch the ATK and DEF of all face-up monsters your opponent controls, until the end of the Battle Phase.
et: 1 Deemon-tüüpi Tuner + 1 või rohkem mitte-Tuner koletisi<BR>Kui see kaart kuulutab välja rünnaku, saad vahetada kõigi vastase kontrollitavate avatud koletiste ATK ja DEF väärtused kuni Lahingufaasi lõpuni.

source: Infernity Doom Dragon
et: Infernity Hukatuse Draakon
