Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: Increase the DEF of a monster equipped with this card by 800 points. When this card is sent from the field to the Graveyard, if you pay 500 Life Points, this card returns to the top of your Deck.
et: Suurenda selle kaardiga varustatud koletise DEF-i 800 punkti võrra. Kui see kaart saadetakse väljakult Hauakambrisse, siis kui maksad 500 Elupunkti, naaseb see kaart sinu paki tippu.

source: Horn of The Unicorn
et: Ükssarviku Sarv

source: A monster equipped with this card increases its ATK and DEF by 700 points. When this card is sent from the field to the Graveyard, it returns to the top of your Deck.
et: Koletis, millele see kaart on varustatud, suureneb selle ATK ja DEF 700 punkti võrra. Kui see kaart saadetakse väljakult Hauakambrisse, naaseb see sinu paki tippu.

source: Dragon Treasure
et: Draakoni Aare

source: A Dragon-Type monster equipped with this card increases its ATK and DEF by 300 points.
et: Draakoni-tüüpi koletis, kellele see kaart on varustatud, suurendab oma ATK ja DEF 300 punkti võrra.

source: Electro-Whip
et: Elektropiits

source: Increase the ATK and DEF of a Thunder-Type monster equipped with this card by 300 points.
et: Suurenda selle kaardiga varustatud Äikese-tüüpi koletise ATK ja DEF 300 punkti võrra.

source: Cyber Shield
et: Küberkilp

source: Equip only to "<M4068>Harpie Lady<M>" or "<M4069>Harpie Lady sisters<M>". It gains 500 ATK.
et: Varusta ainult kaardile "<M4068>Harpie Lady<M>" või "<M4069>Harpie Lady sisters<M>". See saab 500 ATK juurde.

source: Elegant Egotist
et: Elegantne Egotist

source: Activate only while there is a face-up "<M4068>Harpie Lady<M>" on the field. Special Summon 1 "<M4068>Harpie Lady<M>" or "<M4069>Harpie Lady sisters<M>" from your hand or your Deck.
et: Aktiveeri ainult siis, kui väljakul on avatud "<M4068>Harpie Lady<M>". Kutsu eriliselt välja 1 "<M4068>Harpie Lady<M>" või "<M4069>Harpie Lady sisters<M>" oma käest või pakist.

source: Mystical Moon
et: Müstiline Kuu

source: Increase the ATK and DEF of a Beast-Warrior-Type monster equipped with this card by 300 points.
et: Suurenda selle kaardiga varustatud Metssõdalase-tüüpi koletise ATK ja DEF 300 punkti võrra.

source: Stop Defense
et: Peata Kaitse

source: Select 1 Defense Position monster on your opponent's side of the field and change it to Attack Position.
et: Vali oma vastase väljaku poolelt 1 kaitseasendis olev koletis ja muuda see rünnakuasendisse.

source: Malevolent Nuzzler
et: Pahatahtlik Nunnu

source: The equipped monster gains 700 ATK. When this card is sent from the field to the Graveyard, you can pay 500 Life Points to return this card to the top of your Deck.
et: Varustatud koletis saab 700 ATK juurde. Kui see kaart saadetakse väljakult Hauakambrisse, võid maksta 500 Elupunkti, et see kaart oma paki tippu tagasi panna.

source: Violet Crystal
et: Lilla kristall

source: A Zombie-Type monster equipped with this card increases its ATK and DEF by 300 points.
et: Zombi-tüüpi koletis, kellele see kaart on varustatud, suurendab oma ATK ja DEF 300 punkti võrra.

source: Book of Secret Arts
et: Salajaste Kunstide Raamat

source: A Spellcaster-Type monster equipped with this card increases its ATK and DEF by 300 points.
et: Loitsija-tüüpi koletis, kellele see kaart on varustatud, suurendab oma ATK ja DEF 300 punkti võrra.

source: Invigoration
et: Elavus

source: An EARTH monster equipped with this card increases its ATK by 400 points and decreases its DEF by 200 points.
et: Maakaardi külge kinnitatud EARTH koletis suurendab oma ATK-d 400 punkti võrra ja vähendab oma DEF-i 200 punkti võrra.

source: Machine Conversion Factory
et: Masinate Ümberkujundamise Tehas

source: A Machine-Type monster equipped with this card increases its ATK and DEF by 300 points.
et: Masina-tüüpi koletis, kellele see kaart on varustatud, suurendab oma ATK ja DEF 300 punkti võrra.

source: Raise Body Heat
et: Kehatemperatuuri tõstmine

source: Increase the ATK and DEF of a Dinosaur-Type monster equipped with this card by 300 points.
et: Suurenda selle kaardiga varustatud Dinosauruse-tüüpi koletise ATK ja DEF 300 punkti võrra.

source: Follow Wind
et: Jälgi Tuult

source: Increase the ATK and DEF of a Winged-Beast-Type monster equipped with this card by 300 points.
et: Suurenda selle kaardiga varustatud Tiivulise-Beast-Tüüpi koletise ATK ja DEF 300 punkti võrra.

source: Power of Kaishin
et: Kaishini jõud

source: An Aqua-Type monster equipped with this card increases its ATK and DEF by 300 points.
et: Vee-tüüpi koletis, kellele see kaart on varustatud, suurendab oma ATK ja DEF 300 punkti võrra.

source: Dragon Capture Jar
et: Draakoni Püüdja Pott

source: As long as this card remains face-up on the field, all face-up Dragon-Type monsters are changed to Defense Position and cannot change their Battle Position.
et: Niikaua kui see kaart jääb väljale avatud olekus, muudetakse kõik avatud Draakoni-tüüpi koletised Kaitsepositsiooni ja nad ei saa oma Võitluspositsiooni muuta.

source: Forest
et: Mets

source: Increases the ATK and DEF of all Insect, Beast, Plant, and Beast-Warrior-Type monsters by 200 points.
et: Suurendab kõigi Putukate, Metssigade, Taimede ja Metssiga-Sõdalase tüüpi koletiste ATK ja DEF 200 punkti võrra.

source: Wasteland
et: Tühermaa

source: Increases the ATK and DEF of all Dinosaur, Zombie, and Rock-Type monsters by 200 points.
et: Suurendab kõigi Dinosaurus-, Zombi- ja Kiviliikide koletiste ATK ja DEF 200 punkti võrra.

source: Mountain
et: Mägi

source: Increase the ATK and DEF of all Dragon, Winged Beast, and Thunder-Type monsters by 200 points.
et: Suurenda kõigi Draakoni, Tiivulise Olendi ja Äikese-tüüpi koletiste ATK ja DEF 200 punkti võrra.

source: ncrease the ATK and DEF of all Beast-Warrior and Warrior-Type monsters by 200 points.
et: Suurenda kõigi Metssõdalase ja Sõdalase-tüüpi koletiste ATK ja DEF 200 punkti võrra.

source: Increase the ATK and DEF of all Fish, Sea Serpent, Thunder and Aqua-Type monsters by 200 points. Decrease the ATK and DEF of all Machine and Pyro-Type monsters by 200 points.
et: Suurenda kõigi Kala, Meremao, Äikese ja Vee tüüpi koletiste ATK ja DEF 200 punkti võrra. Vähenda kõigi Masina ja Tule tüüpi koletiste ATK ja DEF 200 punkti võrra.

source: Increases the ATK and DEF of all Fiend and Spellcaster-Type monsters by 200 points. Decreases the ATK and DEF of all Fairy-Type monsters by 200 points.
et: Suurendab kõigi Deemon- ja Võluri-tüüpi koletiste ATK ja DEF 200 punkti võrra. Vähendab kõigi Haldja-tüüpi koletiste ATK ja DEF 200 punkti võrra.

source: Dark Hole
et: Tume Auk

source: Destroy all monsters on the field.
et: Hävita kõik koletised väljal.

source: Destroy all monsters on your opponent's side of the field.
et: Hävita kõik koletised oma vastase väljaku poolel.

source: Choose 1 player; that player gains 200 Life Points.
et: Vali 1 mängija; see mängija saab 200 Elupunkti juurde.

source: Red Medicine
et: Punane ravim

source: Increase your Life Points by 500 points.
et: Suurenda oma Elupunkte 500 punkti võrra.

source: Goblin's Secret Remedy
et: Goblini salajane ravim

source: Increase a selected player's Life Points by 600 points.
et: Suurenda valitud mängija Elupunkte 600 punkti võrra.

source: Soul of the Pure
et: Puhas hing

source: Increases your Life Points by 800 points.
et: Suurendab sinu Elupunkte 800 punkti võrra.

source: Dian Keto the Cure Master
et: Dian Keto, Ravitseja Meister

source: Increase your Life Points by 1000 points.
et: Suurenda oma Elupunkte 1000 punkti võrra.

source: Sparks
et: Sädemed

source: Inflict 200 points of Direct Damage to your opponent's Life Points.
et: Tekita oma vastase Elupunktidele 200 punkti otsekahju.

source: Inflict 500 points of Direct Damage to your opponent's Life Points.
et: Tekita oma vastase Elupunktidele 500 punkti otsekahju.

source: Final Flame
et: Lõplik Leek

source: Inflict 600 points of damage to your opponent's Life Points.
et: Tekita oma vastase Elupunktidele 600 punkti kahju.

source: Inflict 800 damage to your opponent.
et: Tekita oma vastasele 800 kahju.

source: Tremendous Fire
et: Võimas Tuli

source: Inflict 1000 points of damage to your opponent's Life Points and 500 points of damage to your Life Points.
et: Tekita oma vastase Elupunktidele 1000 punkti kahju ja oma Elupunktidele 500 punkti kahju.

source: Swords of Revealing Light
et: Paljastava valguse mõõgad

source: Flip all monsters your opponent controls face-up. This card remains on the field for 3 of your opponent's turns. While this card is face-up on the field, monsters your opponent controls cannot declare an attack.
et: Pööra kõik sinu vastase kontrollitavad koletised avatud asendisse. See kaart jääb väljakule sinu vastase kolme käigu ajaks. Kui see kaart on väljakul avatud asendis, ei saa sinu vastase kontrollitavad koletised rünnakut kuulutada.

source: Spellbinding Circle
et: Loitsuring

source: Select 1 monster. It cannot attack or change its Battle position. When that monster is destroyed, destroy this card.
et: Vali 1 koletis. See ei saa rünnata ega muuta oma lahinguasendit. Kui see koletis hävitatakse, hävita see kaart.

source: Dark-piercing Light
et: Pimedust läbistav valgus

source: Flip all face-down monster on your opponent's of the field face-up.
et: Pööra kõik vastase väljaku allapoole pööratud koletised ülespoole.

source: A treasure box containing a monster that attacks any unwary bandit.
et: Aardekast, mis sisaldab koletist, kes ründab iga ettevaatamatut bandiiti.

source: Kanan the Swordmistress
et: Kanan, Mõõgameister

source: A lady warrior armed with sword and shield, she floats lightly and stings sharply.
et: Naissõdalane, kes on relvastatud mõõga ja kilbiga, hõljub kergelt ja torkab teravalt.

source: A member of a race of sea serpents that freely travels through the sea.
et: Meremadude rassi liige, kes liigub vabalt läbi mere.

source: Stuffed Animal
et: Topisloom

source: t may look like a harmless stuffed animal, but its zipper mouth deals a deadly bite.
et: See võib tunduda kahjutu pehme mänguasjana, kuid selle tõmblukuga suu annab surmava hammustuse.

source: Megasonic Eye
et: Megasoniline Silm

source: Made of mysterious metal, this monster is a doomsday machine from the edge of the universe.
et: See on salapärasest metallist valmistatud koletis, mis on maailmalõpu masin universumi äärest.

source: Super War-Lion
et: Super Sõjalõvi

source: This monster can only be Ritual Summoned with the Ritual Spell Card, "<M4679>War-Lion Ritual<M>".
et: Seda koletist saab Rituaali Kutsuda ainult Rituaali Loitsukaardiga, "<M4679>War-Lion Ritual<M>".

source: This monster has three fire-breathing heads and can form a sea of blazing flames.
et: Sellel koletisel on kolm tuld purskavat pead ja see suudab moodustada leegitsevate leekide mere.

source: A mystical dragon that burns away the unworthy with its mystic flames.
et: Müstiline draakon, kes põletab oma müstiliste leekidega ära vääritud.

source: Three-Legged Zombies
et: Kolmejalgsed zombid

source: A pair of friendly skeletons, lean and fat, that travel with extreme difficulty.
et: Sõbralik paar kõhnast ja paksust luukerest, kes reisivad äärmise raskusega.

source: Zera the Mant
et: Zera Mant

source: This card can only be Ritual Summoned with the Ritual Spell Card, "<M4677>Zera Ritual<M>".
et: Seda kaarti saab rituaalsummonida ainult rituaaliloitsukaardiga, "<M4677>Zera Ritual<M>".

source: Flying Penguin
et: Lendav Pingviin

source: A very rare penguin that takes to the air with ears shaped like wings.
et: Väga haruldane pingviin, kes tõuseb õhku tiibade kujuliste kõrvadega.

source: Millennium Shield
et: Millenniumi Kilp

source: A Millennium Item, it's rumored to block any strong attack.
et: Millenniumi ese, mille kohta levivad kuulujutud, et see blokeerib iga tugeva rünnaku.

source: Fairy's Gift
et: Haldja kingitus

source: This flying monster is known for delivering happiness to all.
et: See lendav koletis on tuntud selle poolest, et toob kõigile õnne.

source: Black Luster Soldier
et: Musta Luster Sõdur

source: This monster can only be Ritual Summoned with the Ritual Spell Card, "<M4676>Black Luster Ritual<M>".
et: Seda koletist saab Rituaali Kutsuda ainult Rituaal Loitsukaardiga, "<M4676>Must Luster Rituaal<M>".

source: Fiend's Mirror
et: Deemoni peegel

source: This card can only be Ritual Summoned with the Ritual Spell Card, "<M4680>Beastly Mirror Ritual<M>".
et: Seda kaarti saab Rituaali Kutsuda ainult Rituaali Loitsukaardiga, "<M4680>Beastly Mirror Ritual<M>".

source: Labyrinth Wall
et: Labürindi Sein

source: These walls form a labyrinth with no exit for enemies.
et: Need seinad moodustavad labürindi, millest vaenlastel pole väljapääsu.

source: When this card declare an attack, toss a coin and call it. If you call it right, attack normally. If you call it wrong, lose half of your Life Points before attacking.
et: Kui see kaart kuulutab rünnaku, viska münti ja ütle, kummale poole see jääb. Kui arvad õigesti, ründa tavaliselt. Kui arvad valesti, kaota enne rünnakut pool oma Elupunktidest.

source: Shadow Ghoul
et: Varju Ghoul

source: Increase the ATK of this monster by 100 points for each monster in your Graveyard.
et: Suurenda selle koletise ATK-d 100 punkti võrra iga sinu Hauakambris oleva koletise kohta.

source: Wall Shadow
et: Seinavari

source: This card cannot be Normal Summoned or Set. This card can only be Special Summoned by the effect of "<M4658>Magical Labyrinth<M>".
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti saab eriliselt kutsuda ainult "<M4658>Magical Labyrinth<M>" efekti abil.

source: Labyrinth Tank
et: Labürindi Tank

source: "<M4418>Giga-Tech Wolf<M>" + "<M4518>Cannon Soldier<M>"
et: "<M4418>Giga-Tech Hunt<M>" + "<M4518>Kahuriväelane<M>"

source: Sanga of the Thunder
et: Äikese Sanga

source: During your opponent's damage calculation, you can reduce the ATK of a monster attacking this card to 0. This effect can only be used once while this card remains face-up on the field.
et: Oma vastase kahjuarvutuse ajal saad selle kaarti ründava koletise ATK vähendada nullini. Seda efekti saab kasutada ainult üks kord, kui see kaart jääb väljale avatud olekusse.

source: During your opponent's damage calculation, you can reduce the ATK of a monster attacking this card to 0. This effect can only be used while this card remains face-up on the field.
et: Oma vastase kahjukalkulatsiooni ajal saad selle kaarti ründava koletise ATK vähendada nullini. Seda efekti saab kasutada ainult siis, kui see kaart jääb väljale avatud olekusse.

source: Gate Guardian
et: Väravavalvur

source: This card cannot be Normal Summoned or Set. This card can only be Special Summoned by Tributing "<M4377>Sanga of the Thunder<M>", "<M4378>Kazejin<M>", and "<M4379>Suijin<M>".
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti saab eriliselt kutsuda ainult ohverdades "<M4377>Sanga of the Thunder<M>", "<M4378>Kazejin<M>" ja "<M4379>Suijin<M>".

source: Dungeon Worm
et: Koopaoja uss

source: Hidden under the floors of a labyrinth, it swallows any who pass above.
et: Peidetud labürindi põrandate alla, neelab see alla kõik, kes sellest üle lähevad.

source: Monster Tamer
et: Koletise Taltsutaja

source: A master of monsters that exercises control over several creatures.
et: Koletiste meister, kes juhib mitmeid olendeid.

source: Ryu-Kishin Powered
et: Ryu-Kishin Võimendatud

source: A gargoyle enhanced by the powers of darkness. Very sharp talons make it a worthy opponent.
et: Pimeduse jõududega tugevdatud gargoyle. Väga teravad küünised teevad sellest väärt vastase.

source: Swordstalker
et: Mõõgakütt

source: A monster formed by the vengeful souls of those who passed away in battle.
et: Koletis, mis on moodustatud lahingus hukkunute kättemaksuhimulistest hingedest.

source: La Jinn the Mystical Genie of the Lamp
et: La Jinn, Lambi Müstiline Džinn

source: A genie of the lamp that's at the beck and call of its master.
et: Lampi džinn, kes on oma peremehe käsutuses.

source: Blue-Eyes Ultimate Dragon
et: Sinisilmne Ülim Draakon

source: 3 × "<M4007>Blue-Eyes White Dragon<M>"
et: 3 × "<M4007>Sinisilmne Valge Draakon<M>"

source: Toon Alligator
et: Multikrokodill

source: An alligator monster straight from the cartoons.
et: Krokodillikoletis otse multifilmidest.

source: Rude Kaiser
et: Jõhker Kaiser

source: With an axe in each hand, this monster delivers heavy damage.
et: Kirves kummaski käes, see koletis tekitab rasket kahju.

source: Parrot Dragon
et: Papagoi Draakon

source: A dragon from the cartoons that's more dangerous than it appears to be.
et: Multikate draakon, kes on ohtlikum, kui ta paistab.

source: Dark Rabbit
et: Tume Jänes

source: He leaps up, down, and all around! Nobody can lay a hand on this funny bunny.
et: Ta hüppab üles, alla ja igale poole! Keegi ei saa sellele naljakale jänesele kätt külge panna.

source: "<M4101>Crass Clown<M>" + "<M4126>Dream Clown<M>"
et: "<M4101>Jäme Kloun<M>" + "<M4126>Unenäo Kloun<M>"

source: Harpie's Pet Dragon
et: Harpyia lemmikdraakon

source: This card gains 300 ATK and DEF for each "<M4068>Harpie Lady<M>" on the field.
et: See kaart saab 300 ATK ja DEF iga "<M4068>Harpie Lady<M>" eest väljakul.

source: Mystic Lamp
et: Müstiline Lamp

source: This monster can attack your opponent's Life Points directly.
et: See koletis võib rünnata sinu vastase Elupunkte otse.

source: Pendulum Machine
et: Pendelmasin

source: A horrible torture machine with a large pendulum blade.
et: Kohutav piinamisaparaat suure pendelteraga.

source: Giltia The D. Knight
et: Giltia D. Rüütel

source: "<M4242>Guardian of The Labyrinth<M>" + "<M4286>Protector of The Throne<M>"
et: "<M4242>Labürindi Kaitsja<M>" + "<M4286>Trooni Kaitsja<M>"

source: Launcher Spider
et: Käivitaja Ämblik

source: A mechanical spider with rocket launchers capable of random fire.
et: Mehaaniline ämblik raketiheitjatega, mis on võimeline juhuslikuks tulistamiseks.

source: A monster whose full potential can be achieved when outfitted with "<M4664>Metalmorph<M>".
et: Koletis, kelle täielik potentsiaal avaldub, kui ta on varustatud kaardiga "<M4664>Metalmorph<M>".

source: Metalzoa
et: Metallzoa

source: Cannot be Normal Summoned or Set. Must first be Special Summoned (from your Deck) by Tributing "Zoa" equipped with "<M4664>Metalmorph<M>".
et: Ei saa normaalset kutsuda ega asetada. Esmalt tuleb eriliselt kutsuda (oma pakist) ohverdades "Zoa", millele on varustatud "<M4664>Metalmorph<M>".

source: Zone Eater
et: Tsooni Sööja

source: A monster attacked by this card will be destroyed during the End Phase of the 5th turn after the attack.
et: Selle kaardi poolt rünnatud koletis hävitatakse rünnaku järgselt 5. käigu lõppfaasis.

source: Steel Scorpion
et: Terasskorpion

source: A non Machine-Type Monster attacking "<M4400>Steel Scorpion<M>" will be destroyed at the End Phase of your opponent's 2nd turn after the attack.
et: Masin-tüüpi mittekuuluv koletis, kes ründab "<M4400>Terasskorpion<M>", hävitatakse sinu vastase teise käigu lõppfaasis pärast rünnakut.

source: Dancing Elf
et: Tantsiv haldjas

source: An elf that dances across the sky with wings of razor-sharp blades.
et: Haldjas, kes tantsib taevas teravate terade tiibadega.

source: Frightening in appearance, this creature uses its large eyes and ears to keep track of any movement.
et: Hirmutava välimusega olend kasutab oma suuri silmi ja kõrvu, et jälgida igasugust liikumist.

source: This monster may attack your opponent's Life Points directly.
et: See koletis võib rünnata sinu vastase Elupunkte otse.

source: Swordsman from a Foreign Land
et: Mees võõralt maalt

source: Emperor of the Land and Sea
et: Maa ja mere keiser

source: A reptilian monster that sprays fire in every direction.
et: Roomaja koletis, mis pritsib tuld igas suunas.

source: A bull fiend restored by the dark arts, this monster appears out of a jar.
et: Pimedate kunstide abil taastatud pullideemon, see koletis ilmub purgist.

source: Monster Eye
et: Koletisesilm

source: You can pay 1000 Life Points; add 1 "<M4837>Polymerization<M>" from your Graveyard to your hand.
et: Saad maksta 1000 Elupunkti; lisa 1 "<M4837>Polümerisatsioon<M>" oma Hauakambrist oma kätte.

source: Huge monster with a lion's mane similar to the King of Beasts.
et: Hiiglaslik koletis, kellel on lõvi lakk, sarnane metsaliste kuningale.

source: A bizarre monster with the torso of a horse and a fish's tail. It gallops through the sea as if it were the wind.
et: Kummaline koletis, kellel on hobuse torso ja kala saba. See kappab läbi mere, justkui oleks see tuul.

source: Saber Slasher
et: Mõõgaviilija

source: A lethal engine of destruction that wields a well-honed blade.
et: Hävituslik masin, mis kasutab hästi teritatud tera.

source: A cubical machine equipped with cutting blades for shredding an opponent to mincemeat.
et: Kuubikujuline masin, mis on varustatud lõiketeradega, et vastast hakklihaks purustada.

source: Machine King
et: Masinakuningas

source: Increase the ATK of this card by 100 points for each face-up Machine-Type monster on the field.
et: Suurenda selle kaardi ATK-d 100 punkti võrra iga väljal oleva avatud Masinatüüpi koletise kohta.

source: Giant Mech-Soldier
et: Hiiglaslik mehhaaniline sõdur

source: This monster swings an earth-shaking axe that cannot be blocked by a common sword.
et: See koletis vehib maad raputava kirvega, mida tavaline mõõk ei suuda peatada.

source: Metal Dragon
et: Metallist Draakon

source: "<M4563>Steel Ogre Grotto #1<M>" + "<M4567>Lesser Dragon<M>"
et: "<M4563>Terassõjagrot #1<M>" + "<M4567>Väike Draakon<M>"

source: Karakuri Spider
et: Karakuri Ämblik

source: If this card attacks a DARK monster, destroy the attack target after damage calculation.
et: Kui see kaart ründab PIMEDUST koletist, hävita rünnaku sihtmärk pärast kahju arvutamist.

source: Bat
et: Nahkhiir

source: A mechanical bat that drops blasts from its wings.
et: Mehaaniline nahkhiir, mis laseb tiibadest plahvatusi.

source: Giga-Tech Wolf
et: Giga-Techi Hunt

source: An iron wolf with razor-sharp fangs that can penetrate any armor.
et: Raudne hunt, kellel on teravad kihvad, mis suudavad läbistada igasuguse soomuse.

source: Cyber Soldier
et: Küber Sõdur

source: Guardian of the Machine King, it crushes opposition by rolling.
et: Masinakuningas Valvur, see purustab vastaseid veeremisega.

source: Shovel Crusher
et: Labidopurustaja

source: Armed with a pair of shovels, this monster will destroy anything that stands in its way.
et: Relvaks kahe labidaga, hävitab see koletis kõik, mis talle teele jääb.

source: Mechanicalchaser
et: Mehaaniline Jälitaja

source: A hunter that relentlessly pursues its target by order of the Machine King.
et: Kütt, kes jälitab oma sihtmärki halastamatult Masinakuningas käsul.

source: Blocker
et: Blokeerija

source: Constructed from several components, this monster can launch them in a pincer attack.
et: Koosneb mitmest komponendist, see koletis suudab neid käivitada tangirünnakus.

source: Blast Juggler
et: Plahvatusžonglöör

source: You can only activate this effect during your Standby Phase. Tribute this face-up card to select and destroy 2 face-up monsters with an ATK 1000 or less.
et: Seda efekti saad aktiveerida ainult oma Ootefaasil. Ohverda see avatud kaart, et valida ja hävitada 2 avatud koletist, mille ATK on 1000 või vähem.

source: An iron giant that appears from a dimensional rift.
et: Raudne hiiglane, kes ilmub dimensioonipraost.

source: A massive monster that swings a huge steel ball to destroy anything in its path.
et: Massiivne koletis, kes kõigutab suurt teraskuuli, et hävitada kõik oma teel.

source: Cyber-Stein
et: Küberstein

source: Pay 5000 Life Points. Special Summon 1 Fusion Monster from your Fusion Deck to the field in Attack Position.
et: Makske 5000 Elupunkti. Kutsu eriliselt välja 1 Fusion Monster oma Fusion Deckist väljakule Rünnakupositsioonis.

source: Commander
et: Komandör
