Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: When this card is Normal Summoned, if your opponent controls a monster(s) and you control no other monsters, you can select 1 Set Spell or Trap Card and destroy it.
et: Kui see kaart on Normaal-Kutsutud ja kui sinu vastane kontrollib koletist(e) ning sul ei ole teisi koletisi, saad valida 1 Seatud Loitsu või Lõksukaardi ja hävitada selle.

source: Scrap Chimera
et: Rämekameeleon

source: This card cannot be used as a Synchro Material Monster, except for the Synchro Summon of a "Scrap" monster and all the other Synchro Material Monsters must also be "Scrap" monsters. When this card is Normal Summoned, you can select 1 "Scrap" Tuner monster in your Graveyard and Special Summon it.
et: Seda kaarti ei saa kasutada Sünkro Materjal Koletisena, välja arvatud "Scrap" koletise Sünkro Kutsumiseks ja kõik teised Sünkro Materjal Koletised peavad samuti olema "Scrap" koletised. Kui see kaart on Normaal Kutsutud, saad valida 1 "Scrap" Häälestaja koletise oma Hauakambris ja Kutsuda see Eriliselt.

source: Scrap Goblin
et: Kõrvaldamise Goblin

source: This card cannot be destroyed by battle. If this face-up Defense Position card is selected as an attack target, destroy this card at the end of the Battle Phase. If this card is destroyed by the effect of a "Scrap" card and sent to the Graveyard, you can select 1 "Scrap" monster in your Graveyard, except "<M8951>Scrap Goblin<M>" and add it to your hand.
et: Seda kaarti ei saa lahingus hävitada. Kui see avatud Kaitseasendis kaart valitakse rünnaku sihtmärgiks, hävita see kaart Lahingufaasi lõpus. Kui see kaart hävitatakse "Scrap" kaardi efekti tõttu ja saadetakse Hauakambrisse, saad valida 1 "Scrap" koletise oma Hauakambris, välja arvatud "<M8951>Scrap Goblin<M>" ja lisada see oma kätte.

source: Scrap Beast
et: <translated Raibeast

source: If this face-up Defense Position card is selected as an attack target, destroy this card at the end of the Battle Phase. If this card is destroyed by the effect of a "Scrap" card and sent to the Graveyard, you can select 1 "Scrap" monster in your Graveyard, except "<M8952>Scrap Beast<M>" and add it to your hand.
et: Kui see avatud Kaitseasendis kaart valitakse rünnaku sihtmärgiks, hävita see kaart Lahingufaasi lõpus. Kui see kaart hävitatakse "Scrap" kaardi efekti tõttu ja saadetakse Hauakambrisse, võid valida 1 "Scrap" koletise oma Hauakambris, välja arvatud "<M8952>Scrap Beast<M>", ja lisada see oma kätte.

source: Scrap Hunter
et: Rämekütt

source: Once per turn, you can select 1 face-up "Scrap" monster you control, except this card. Destroy it and send 1 Tuner monster from your Deck to your Graveyard.
et: Korra ühe korra käigu jooksul saad valida ühe avatud "Scrap" koletise, mida sa kontrollid, välja arvatud see kaart. Hävita see ja saada üks Tuner koletis oma pakist hauakambrisse.

source: Scrap Golem
et: Kõrvaldamise Golem

source: Once per turn, you can select 1 Level 4 or lower "Scrap" monster in your Graveyard and Special Summon it to either player's side of the field.
et: Korra ühe korra käigu jooksul saad valida oma kalmistul oleva 1. taseme 4 või madalama "Scrap" koletise ja kutsuda see eriliselt esile kas enda või vastase väljale.

source: When this card inflicts Battle Damage to your opponent by a direct attack, your opponent discards 1 card of their choice.
et: Kui see kaart tekitab sinu vastasele lahingukahju otsese rünnakuga, siis sinu vastane viskab oma valikul ühe kaardi ära.

source: If this card is destroyed by your opponent's card (either by battle or by card effect), they cannot conduct their Battle Phase during their next turn.
et: Kui see kaart hävitatakse sinu vastase kaardi poolt (kas lahingus või kaardi efekti tõttu), ei saa nad oma järgmisel käigul lahingufaasi läbi viia.

source: Wattpheasant
et: Wattfaasan

source: This card can attack your opponent directly. When this card inflicts Battle Damage to your opponent by a direct attack, select 1 face-up monster on the field and remove it from play until the End Phase of this turn.
et: See kaart võib rünnata sinu vastast otse. Kui see kaart tekitab sinu vastasele lahingukahju otsese rünnakuga, vali 1 avatud koletis väljal ja eemalda see mängust kuni selle käigu lõppfaasini.

source: Naturia Mosquito
et: Naturia Sääsk

source: While you control another face-up "Naturia" monster(s), your opponent cannot select this card as an attack target. Your opponent takes any Battle Damage you would have taken from battles involving a face-up "Naturia" monster you control, except this card.
et: Kui sa kontrollid teist avatud "Naturia" koletist, ei saa sinu vastane valida seda kaarti rünnaku sihtmärgiks. Sinu vastane saab kogu Lahingukahju, mida sa oleksid saanud lahingutest, milles osaleb sinu kontrollitav avatud "Naturia" koletis, välja arvatud see kaart.

source: Naturia Beans
et: Naturia Oad

source: Once per turn, this card cannot be destroyed by battle. When this face-up card is selected as an attack target, inflict 500 damage to your opponent.
et: Kord ühe käigu jooksul ei saa seda kaarti lahingus hävitada. Kui see avatud kaart valitakse rünnaku sihtmärgiks, põhjusta oma vastasele 500 kahju.

source: Naturia Bamboo Shoot
et: Naturia Bambusvõrse

source: If this card is Tribute Summoned by Tributing a "Naturia" monster, while this card remains face-up on the field, your opponent cannot activate Spell or Trap Cards.
et: Kui see kaart kutsutakse välja ohverdades "Naturia" koletise, siis seni, kuni see kaart jääb lahinguväljale avatud olekusse, ei saa sinu vastane aktiveerida Loitsu- ega Lõksukaarte.

source: Amazoness Sage
et: Amazoonlanna Tark

source: If this card attacks, select 1 Spell or Trap Card your opponent controls and destroy it at the end of the Damage Step.
et: Kui see kaart ründab, vali 1 Loitsu- või Lõksukaart, mida sinu vastane kontrollib, ja hävita see Kahjustuse Etapi lõpus.

source: Amazoness Trainee
et: Amazonesside Õpilane

source: Monsters destroyed by battle with this card are returned to the bottom of the owner's Deck instead of going to the Graveyard. If this card destroys an opponent's monster by battle, this card gains 200 ATK.
et: Selle kaardiga lahingus hävitatud koletised saadetakse omaniku paki põhja, mitte ei lähe Hauakambrisse. Kui see kaart hävitab lahingus vastase koletise, saab see kaart 200 ATK juurde.

source: Amazoness Queen
et: Amazoonia kuninganna

source: "Amazoness" monsters you control cannot be destroyed by battle.
et: "Amazoness" koletisi, mida sa kontrollid, ei saa lahingus hävitatud.

source: Lock Cat
et: Lukukass

source: When this card is Normal Summoned, you can select 1 Level 1 Beast-Type monster in your Graveyard and Special Summon it in face-up Defense Position. Its effects are negated.
et: Kui see kaart on Normaal-Kutsutud, saad valida 1. taseme Loom-Tüüpi koletise oma Hauakambris ja Kutsuda see Eriliselt Näoga Üles Kaitsepositsioonis. Selle efektid on tühistatud.

source: When this card is destroyed by battle and sent to the Graveyard, you can select 1 of your Level 3 or lower Beast-Type, Beast-Warrior-Type or Winged Beast-Type monsters that is removed from play, and add it to your hand.
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse, saad valida ühe oma 3. taseme või madalama Tüüpi Koletise, Tüüpi Sõdalase või Tüüpi Tiivulise Koletise, mis on mängust eemaldatud, ja lisada selle oma kätte.

source: Synchro Fusionist
et: Sünkrofusionist

source: If this card is sent to the Graveyard as a Synchro Material Monster, you can add 1 Spell Card from your Deck to your hand with "<M4837>Polymerization<M>" or "Fusion" in the card name, except "<M5631>Diffusion Wave-Motion<M>".
et: Kui see kaart saadetakse Sünkromaterjalina Hauakambrisse, saad lisada oma pakist ühe Loitsukaardi oma kätte, mille nimes on "<M4837>Polümerisatsioon<M>" või "Fusion", välja arvatud "<M5631>Diffusion Wave-Motion<M>".

source: Ambitious Gofer
et: Ambitsioonikas Gofer

source: Once per turn, you select up to 2 monsters your opponent controls. Your opponent can reveal 1 monster in their hand to negate this card's effect. If they do not, destroy the selected monsters.
et: Korra ühe korra käigu jooksul saad valida kuni 2 koletist, mida sinu vastane kontrollib. Sinu vastane võib paljastada ühe koletise oma käes, et selle kaardi efekti tühistada. Kui nad seda ei tee, hävita valitud koletised.

source: Final Psychic Ogre
et: Viimane Psüühiline Ogre

source: If this card destroys an opponent's monster by battle, you can pay 800 Life Points to select 1 Psychic-Type monster in your Graveyard, and add it to your hand.
et: Kui see kaart hävitab lahingus vastase koletise, võid maksta 800 Elupunkti, et valida 1 Psüühika-tüüpi koletis oma Hauakambris ja lisada see oma kätte.

source: Dragon Knight Draco-Equiste
et: Draakonirüütel Draco-Equiste

source: 1 Dragon-Type Synchro Monster + 1 Warrior-Type Monster.<BR>This monster can only be Special Summoned by Fusion Summon (from the Extra Deck). Once per turn, you can select 1 Dragon-Type Synchro Monster in the Graveyard. Remove it from play, treat this card's name as that monster's name, and give this card the same effects as that monster, until the End Phase. While this card is in face-up Attack Position, any effect damage you would take from an opponent's card effect is inflicted to your opponent instead.
et: 1 Draakoni-tüüpi Sünkro Monster + 1 Sõdalase-tüüpi Monster.<BR>Seda monsterit saab eriliselt kutsuda ainult Fusion Summon'iga (lisapakist). Kord ühe käigu jooksul saad valida 1 Draakoni-tüüpi Sünkro Monsteri hauas. Eemalda see mängust, käsitle selle kaardi nime kui selle monsteri nime ja anna sellele kaardile samad efektid nagu sellel monsteril kuni End Phase'ini. Kui see kaart on näoga ülespoole Rünnaku Positsioonis, siis iga kord, kui sa peaksid saama efektikahju vastase kaardi efektist, kantakse see kahju hoopis vastasele.

source: Ultimate Axon Kicker
et: Ülim Axon Kicker

source: 1 Psychic-Type Synchro Monster + 1 Psychic-Type monster.<BR>This monster can only be Special Summoned by Fusion Summon (from the Extra Deck). This card cannot be destroyed by card effects. During battle between this attacking card and a Defense Position monster whose DEF is lower than the ATK of this card, inflict the difference as Battle Damage to your opponent. When this card destroys an opponent's monster by battle and sends it to the Graveyard, you gain Life Points equal to the destroyed monster's ATK.
et: 1 Psüühika-tüüpi Sünkrokoletis + 1 Psüühika-tüüpi koletis.<BR>Seda koletist saab eriliselt kutsuda ainult Fusion Summon'iga (lisapakist). Seda kaarti ei saa hävitada kaartide efektidega. Lahingu ajal selle ründava kaardi ja kaitsepositsioonis oleva koletise vahel, mille DEF on madalam kui selle kaardi ATK, põhjusta vahe vastasele lahingukahjuna. Kui see kaart hävitab lahingus vastase koletise ja saadab selle Hauakambrisse, saad Sa elu punkte võrdse hävitatud koletise ATK-ga.

source: Thunder Unicorn
et: Äikese Ükssarvik

source: 1 Beast-Type Tuner + 1 or more non-Tuner monsters<BR>Once per turn, during your Main Phase, you can select 1 face-up monster your opponent controls. It loses 500 ATK for each monster you control, until the End Phase. During the turn this effect is activated, no other monsters can attack, except this card.
et: 1 Beast-Tüüpi Tuner + 1 või rohkem mitte-Tuner koletist<BR>Kord käigu jooksul, oma peafaasis, saad valida 1 vastase kontrollitava avatud koletise. See kaotab 500 ATK iga sinu kontrollitava koletise kohta kuni lõppfaasini. Käigu jooksul, mil see efekt aktiveeritakse, ei saa rünnata ükski teine koletis peale selle kaardi.

source: Voltic Bicorn
et: Voltiline Bikorn

source: 1 Beast-Type Tuner + 1 or more non-Tuner monsters<BR>If this card is destroyed by your opponent's card (either by battle or by card effect), both players send the top 7 cards of their Deck to the Graveyard.
et: 1 Beast-Tüüpi Tuner + 1 või rohkem mitte-Tuner koletist<BR>Kui see kaart hävitatakse sinu vastase kaardi poolt (kas lahingus või kaardi efekti tõttu), saadavad mõlemad mängijad oma paki 7 ülemist kaarti Hauakambrisse.

source: Lightning Tricorn
et: Välgu Trikorn

source: 1 Tuner + 1 or more non-Tuner Beast-Type monsters<BR>If this card is destroyed by your opponent's card (either by battle or by card effect), you can select 1 "<M8971>Thunder Unicorn<M>" or "<M8972>Voltic Bicorn<M>" in your Graveyard and Special Summon it.
et: 1 Tuner + 1 või rohkem mitte-Tuner Loomatüüpi koletist<BR>Kui see kaart hävitatakse sinu vastase kaardi poolt (kas lahingus või kaardi efekti tõttu), saad valida 1 "<M8971>Thunder Unicorn<M>" või "<M8972>Voltic Bicorn<M>" oma Hauakambris ja Kutsuda see Eriliselt välja.

source: Scrap Dragon
et: Rämekoll Draakon

source: 1 Tuner + 1 or more non-Tuner monsters<BR>Once per turn, you can select 1 card you control and 1 card your opponent controls. Destroy them. When this card is destroyed by your opponent's card (either by battle or by card effect) and sent to the Graveyard, select 1 non-Synchro "Scrap" monster in your Graveyard and Special Summon it.
et: 1 Tuner + 1 või rohkem mitte-Tuner koletist<BR>Korra käigu jooksul saad valida 1 kaardi, mida sa kontrollid, ja 1 kaardi, mida su vastane kontrollib. Hävita need. Kui see kaart hävitatakse su vastase kaardi poolt (kas lahingus või kaardi efekti tõttu) ja saadetakse Hauakambrisse, vali 1 mitte-Synchro "Scrap" koletis oma Hauakambris ja Kutsu see Eriliselt välja.

source: Wattchimera
et: Wattkimäär

source: 1 "Watt" Tuner + 1 or more non-Tuner Thunder-Type monsters.<BR>This card can attack your opponent directly. When this card inflicts Battle Damage to your opponent by a direct attack, place 1 random card from your opponent's hand on top of their Deck.
et: 1 "Watt" Tuner + 1 või rohkem mitte-Tuner Tüüpi Thunder koletist.<BR>See kaart võib rünnata sinu vastast otse. Kui see kaart tekitab sinu vastasele otsese rünnakuga lahingukahju, aseta 1 juhuslik kaart sinu vastase käest nende paki peale.

source: Blind Spot Strike
et: Pimeala rünnak

source: Select 1 face-up Defense Position monster your opponent controls and 1 face-up Attack Position monster you control. The monster you control gains ATK equal to the opponent's monster's DEF, until the End Phase.
et: Vali 1 avatud kaitseasendis olev koletis, mida sinu vastane kontrollib, ja 1 avatud ründeasendis olev koletis, mida sina kontrollid. Sinu koletis saab ATK-d juurde vastase koletise DEF-i võrra kuni lõppfaasini.

source: Double Cyclone
et: Kahekordne Tsüklon

source: Select 1 Spell/Trap Card you control and 1 Spell/Trap Card your opponent controls. Destroy the selected card(s).
et: Vali 1 Püünis-/Võlukaar, mida sa kontrollid, ja 1 Püünis-/Võlukaar, mida su vastane kontrollib. Hävita valitud kaart(id).

source: Scrapyard
et: Rämpsuhoov

source: Add 1 "Scrap" Tuner Monster from your Deck to your hand.
et: Lisa oma pakist 1 "Scrap" Tuner Monster oma kätte.

source: Scrapstorm
et: Kõrvaldamistorm

source: Select 1 face-up "Scrap" monster you control. Send 1 "Scrap" monster from your Deck to the Graveyard, then draw 1 card. Then, destroy the selected monster.
et: Vali 1 avatud "Scrap" koletis, mida sa kontrollid. Saada 1 "Scrap" koletis oma pakist hauakambrisse, seejärel tõmba 1 kaart. Seejärel hävita valitud koletis.

source: Scrap Sheen
et: Rämpsäil

source: Select 1 face-up "Scrap" monster you control and destroy it. All face-up "Scrap" monsters you control gain 1000 ATK until the End Phase.
et: Vali 1 avatud "Scrap" koletis, mida sa kontrollid, ja hävita see. Kõik avatud "Scrap" koletised, mida sa kontrollid, saavad 1000 ATK juurde kuni End Phase'ini.

source: Wattcine
et: Wattkine

source: When a Thunder-Type monster you control inflicts Battle Damage to your opponent, gain Life Points equal to the damage inflicted.
et: Kui sinu kontrolli all olev Äikese-tüüpi koletis tekitab lahingukahju sinu vastasele, saad Elupunkte võrdse tekitatud kahjuga.

source: Naturia Forest
et: Naturia Mets

source: If you negate the activation of a card your opponent controls, you can add 1 Level 3 or lower "Naturia" monster from your Deck to your hand.
et: Kui tühistad vastase kaardi aktiveerimise, saad lisada oma pakist oma kätte ühe 3. taseme või madalama "Naturia" koletise.

source: Landoise's Luminous Moss
et: Landoise'i helendav sammal

source: Activate only if you control a face-up "Naturia" monster. The opponent's Effect Monsters cannot activate their effects this turn.
et: Aktiveeri ainult siis, kui sa kontrollid avatud "Naturia" koletist. Vastase Efektikoletised ei saa sellel käigul oma efekte aktiveerida.

source: Amazoness Village
et: Amazoonlaste Küla

source: All "Amazoness" monsters gain 200 ATK. Once per turn, when an "Amazoness" monster is destroyed by battle or by a card effect, and is sent to the Graveyard, you can Special Summon 1 "Amazoness" monster from your Deck with a Level equal to or lower than that of the destroyed "Amazoness".
et: Kõik "Amazoness" koletised saavad 200 ATK juurde. Kord käigu jooksul, kui "Amazoness" koletis hävitatakse lahingus või kaardi efekti tõttu ja saadetakse Hauakambrisse, saad sa eriliselt kutsuda ühe "Amazoness" koletise oma pakist, mille tase on võrdne või madalam hävitatud "Amazoness" koletise tasemest.

source: Amazoness Fighting Spirit
et: Amazoniite Võitlusvaim

source: If an "Amazoness" monster attacks a monster with higher ATK, the attacking monster gains 1000 ATK during damage calculation only.
et: Kui "Amazoness" koletis ründab koletist, mille ATK on suurem, saab ründav koletis ainult kahju arvutamise ajal 1000 ATK juurde.

source: Unicorn Beacon
et: Ükssarviku Majakas

source: Select 1 removed from play Level 5 or lower Beast-Type or Winged Beast-Type monster. Remove from play 1 card in your hand and Special Summon the selected monster in Attack Position.
et: Vali 1 mängust eemaldatud 5. taseme või madalama Tüüpi Metssiga või Tüüpi Tiivuline Metssiga koletis. Eemalda mängust 1 kaart oma käest ja Kutsu valitud koletis Eriliselt Välja Rünnakupositsioonis.

source: Beast Rage
et: Metshull

source: All monsters you control gain 200 ATK for each of your removed from play Beast-Type and Winged Beast-Type monsters.
et: Kõik sinu kontrollitavad koletised saavad 200 ATK iga sinu mängust eemaldatud Metstüüpi ja Tiivulise Metstüüpi koletise kohta.

source: Miracle Synchro Fusion
et: Imesünteesi imefusioon

source: Remove from play, from your side of the field or your Graveyard, the Fusion Material Monsters listed on a Fusion Monster Card that lists a Synchro Monster as a Fusion Material Monster, and Special Summon that Fusion Monster from the Extra Deck. (This Special Summon is treated as a Fusion Summon.) If this Set card is destroyed by an opponent's card effect and sent to the Graveyard, draw 1 card.
et: Eemalda mängust oma väljakult või oma Hauakambrist Fusion Materjal Koletised, mis on loetletud Fusion Koletise Kaardil, mis loetleb Synchro Koletise Fusion Materjal Koletisena, ja Kutsu see Fusion Koletis eriliselt Extra Deckist. (See Eriline Kutsumine käsitletakse kui Fusion Kutsumist.) Kui see Seatud kaart hävitatakse vastase kaardi efekti tõttu ja saadetakse Hauakambrisse, tõmba 1 kaart.

source: Pestilence
et: Katk

source: Equip only to a Warrior, Beast-Warrior, or Spellcaster-Type monster. Its ATK becomes 0. During each of your Standby Phases, inflict 500 damage to the controller of the equipped monster.
et: Varusta ainult Sõdalasele, Metssõdalasele või Loitsija-tüüpi koletisele. Selle ATK muutub 0-ks. Iga sinu Ooteetapi ajal põhjusta 500 kahju varustatud koletise kontrollijale.

source: Cursed Armaments
et: Neetud Relvad

source: The equipped monster loses 600 ATK for each monster you control. When this card is sent from the field to the Graveyard, you can select 1 face-up monster your opponent controls and equip it with this card.
et: Varustatud koletis kaotab 600 ATK iga koletise kohta, mida sa kontrollid. Kui see kaart saadetakse väljakult Hauakambrisse, saad valida 1 vastase kontrollitava avatud koletise ja varustada see selle kaardiga.

source: Wiseman's Chalice
et: Targa Chalice

source: If you control no monsters, Select 1 monster in your opponent's Graveyard. Special Summon it. During the End Phase of this turn, give control of that Special Summoned monster to your opponent. The monster cannot be Tributed, or used as a Synchro Material Monster, while it is face-up on the field.
et: Kui sul pole ühtegi koletist, vali 1 koletis oma vastase kalmistul. Kutsu see eriliselt välja. Selle käigu lõppfaasis anna selle eriliselt välja kutsutud koletise kontroll oma vastasele. Koletist ei saa ohverdada ega kasutada sünkromaterjalina, kui see on väljaku peal avatud olekus.

source: Summoning Curse
et: Kutsumuseed

source: When a monster is Special Summoned, the controller of that monster chooses 1 card in their hand and removes it from play. During each of your End Phases, pay 500 Life Points or destroy this card.
et: Kui koletis kutsutakse eriliselt välja, valib selle koletise juht 1 kaardi oma käest ja eemaldab selle mängust. Iga oma lõppfaasi ajal maksa 500 elupunkti või hävita see kaart.

source: Pot of Duality
et: Kaksikuse Pott

source: Reveal the top 3 cards of your Deck, add 1 of them to your hand, then shuffle the rest back into your Deck. You can only activate 1 "<M8993>Pot of Duality<M>" per turn. You cannot Special Summon a monster(s) during the turn you activate this card.
et: Paljasta oma pakist 3 ülemist kaarti, lisa neist 1 oma kätte, seejärel sega ülejäänud tagasi oma pakki. Sa saad aktiveerida ainult 1 "<M8993>Dualiteedi Pott<M>" ühe käigu jooksul. Sa ei saa sellel käigul, mil sa selle kaardi aktiveerid, eriliselt kutsuda koletist(e).

source: Desperate Tag
et: Meeleheitlik Silt

source: If a face-up Attack Position monster you control is destroyed by battle, during damage calculation, you can reduce the Battle Damage from this battle to 0 and Special Summon 1 Level 4 or lower Warrior-Type monster from your hand at the end of the Damage Step.
et: Kui sinu kontrolli all olev ründepositsioonis olev avatud koletis hävitatakse lahingus, saad sa lahingukahjude arvutamise ajal vähendada selle lahingu lahingukahju 0-ni ja eriliselt kutsuda oma käest välja 1 4. taseme või madalama Sõdalase-tüüpi koletise lahingukahju lõpusammul.

source: Battle Instinct
et: Lahinguvaist

source: Activate only when your opponent declares a direct attack and you control no monsters. Special Summon 1 Level 4 or lower Beast-Type monster from your hand in face-up Attack Position.
et: Aktiveeri ainult siis, kui sinu vastane kuulutab välja otsese rünnaku ja sul ei ole kontrolli all ühtegi koletist. Kutsu eriliselt välja 1. taseme 4 või madalama Tüüpi Koletis oma käest avatud Rünnakupositsioonis.

source: Howl of the Wild
et: Metsiku ulgumine

source: When a monster you control destroys an opponent's monster by battle and sends it to the Graveyard, inflict 300 damage to your opponent for each face-up Beast-Type monster you control.
et: Kui sinu kontrollitav koletis hävitab lahingus vastase koletise ja saadab selle Hauakambrisse, põhjusta vastasele 300 kahju iga sinu kontrollitava avatud Beast-tüüpi koletise eest.

source: Parallel Selection
et: Paralleelne Valik

source: Activate only when a Synchro Monster you control is destroyed by your opponent (either by battle or by card effect) and sent to the Graveyard. Select 1 of your removed from play Spell Cards and add it to your hand.
et: Aktiveeri ainult siis, kui Sünkrokoletis, mida sa kontrollid, hävitatakse sinu vastase poolt (kas lahingus või kaardi efekti tõttu) ja saadetakse Hauakambrisse. Vali 1 oma mängust eemaldatud Loitsukaart ja lisa see oma kätte.

source: Reanimation Wave
et: Reanimatsiooni Laine
