Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: Once per turn, by Tributing 1 WIND monster on your side of the field (except this card), Special Summon 1 WIND monster from your hand. The monster Special Summoned by this effect is destroyed if "<M6702>Storming Wynn<M>" is removed from your side of the field.
et: Korra ühe korra käigu jooksul, ohverdades 1 WIND koletise oma väljaku poolel (välja arvatud see kaart), kutsu eriliselt välja 1 WIND koletis oma käest. Selle efekti abil eriliselt välja kutsutud koletis hävitatakse, kui "<M6702>Storming Wynn<M>" eemaldatakse sinu väljaku poolelt.

source: Batteryman D
et: Patareimees D

source: Your opponent cannot select a Thunder-Type monster you control as an attack target (except "<M6703>Batteryman D<M>").
et: Sinu vastane ei saa valida sinu kontrolli all olevat Äikese-tüüpi koletist rünnaku sihtmärgiks (välja arvatud "<M6703>Batteryman D<M>").

source: Swift Birdman Joe
et: Kiire Lindmees Joe

source: If you Tribute Summon this card by Tributing a WIND monster, return all Spell and Trap Cards on the field to the owners' hands.
et: Kui sa kutsud selle kaardi välja ohverdades TUULE koletise, siis tagasta kõik Väljal olevad Loitsu- ja Lõksukaardid omanike kätte.

source: Celestial Transformation
et: Taevane Muundumine

source: Special Summon 1 Fairy-Type monster from your hand. That monster's ATK is halved, and it is destroyed during the End Phase.
et: Erikutsuge oma käest 1 haldjatüüpi koletis. Selle koletise ATK on poole väiksem ja see hävitatakse lõppfaasis.

source: Power Capsule
et: Võimukapsel

source: Select 1 face-up "<M6684>Victory Viper XX03<M>" on your side of the field to activate this card. Select 1 effect of "<M6684>Victory Viper XX03<M>", and apply the effect as this card's effect.
et: Vali 1 avatud "<M6684>Victory Viper XX03<M>" oma väljaku poolel, et aktiveerida see kaart. Vali 1 "<M6684>Victory Viper XX03<M>" efekt ja rakenda see efekt selle kaardi efektina.

source: Dimensional Fissure
et: Dimensioonilõhe

source: Any monster sent to the Graveyard is banished instead.
et: Iga koletis, mis saadetakse Hauakambrisse, pagendatakse selle asemel.

source: Life Equalizer
et: Eluvõrdustaja

source: Activate this card when the difference between both players' Life Points is 8000 or more. Both players' Life Points become 3000.
et: Aktiveeri see kaart, kui mõlema mängija Elupunktide vahe on 8000 või rohkem. Mõlema mängija Elupunktid muutuvad 3000-ks.

source: Icarus Attack
et: Ikaruse rünnak

source: Tribute 1 Winged Beast-Type monster to select 2 cards on the field. Destroy them.
et: Ohverda 1 Tiivulise Koletise-tüüpi koletis, et valida 2 kaarti väljal. Hävita need.

source: Miraculous Descent
et: Imeilus Laskumine

source: Select 1 of your Fairy-Type monsters that is removed from play and Special Summon it. When this card is removed from the field, destroy that monster. When the monster is destroyed, destroy this card.
et: Vali 1 oma mängust eemaldatud haldjatüüpi koletis ja kutsu see eriliselt välja. Kui see kaart eemaldatakse väljakult, hävita see koletis. Kui koletis hävitatakse, hävita see kaart.

source: Synthetic Seraphim
et: Sünteetiline Seraf

source: Each time a Counter Trap Card is activated, Special Summon 1 "<M3928>Synthetic Seraphim Token <M>" (Fairy-Type/LIGHT/Level 1/ATK 300/DEF 300).
et: Iga kord, kui aktiveeritakse vastulõksukaart, kutsu eriliselt välja 1 "<M3928>Sünteetiline Serafimi Mängunupp <M>" (Haldjatüüp/VALGUS/Tase 1/ATK 300/DEF 300).

source: Forced Back
et: Tagasi sunnitud

source: Negate the Normal Summon or Flip Summon of a monster and return the monster to its owner's hand.
et: Tühista koletise normaal- või ümberpööratud kutsumine ja tagasta koletis selle omaniku kätte.

source: Simorgh, Bird of Divinity
et: Simorgh, Jumalikkuse Lind

source: This card cannot be Special Summoned. If you Tribute Summon this card, all Tributes must be WIND. Each player takes 1000 damage during each of their End Phases, while this card remains face-up on the field. This damage is decreased by 500 for each Spell/Trap Card the player controls.
et: Seda kaarti ei saa eriliselt kutsuda. Kui sa ohverdad selle kaardi kutsumiseks, peavad kõik ohverdused olema TUUL. Iga mängija saab 1000 kahju iga oma lõppfaasi ajal, kui see kaart jääb väljale avatud olekus. See kahju väheneb 500 võrra iga loitsu/lõksukaardi kohta, mida mängija kontrollib.

source: If there are no cards in your opponent's Spell & Trap Card Zones, this card can attack your opponent's Life Points directly. When it does, any Battle Damage this card inflicts to your opponent's Life Points becomes the original ATK of this card.
et: Kui sinu vastase Püünis- ja Võlukaartide aladel pole kaarte, võib see kaart rünnata sinu vastase Elupunkte otse. Kui see nii teeb, muutub selle kaardi tekitatud Lahingukahju sinu vastase Elupunktidele selle kaardi algseks RÜN-iks.

source: Hysteric Party
et: Hüsteeriline pidu

source: Discard 1 card from your hand. Special Summon as many "<M4068>Harpie Lady<M>" cards as possible from your Graveyard. When this card is removed from the field, destroy all the monsters that were Special Summoned by this card's effect.
et: Viska 1 kaart oma käest. Kutsu eriliselt välja nii palju "<M4068>Harpie Lady<M>" kaarte kui võimalik oma Hauakambrist. Kui see kaart eemaldatakse väljakult, hävita kõik koletised, mis kutsuti eriliselt välja selle kaardi efekti abil.

source: Puppet King
et: Nukukuningas

source: When your opponent adds a Monster Card(s) to their hand, except by drawing, you can Special Summon this card from your hand. If you do, destroy it during your next turn's End Phase.
et: Kui sinu vastane lisab oma kätte Koletise Kaardi(d), välja arvatud tõmbamise teel, saad selle kaardi oma käest eriliselt välja kutsuda. Kui sa seda teed, hävita see oma järgmise käigu lõppfaasis.

source: Cyber Dinosaur
et: Küberdinosaurus

source: When your opponent Special Summons a monster from their hand, you can Special Summon this card from your hand.
et: Kui sinu vastane kutsub oma käest eriliselt välja koletise, saad selle kaardi oma käest eriliselt välja kutsuda.

source: Elemental Hero Woodsman
et: Elementaalne Kangelane Metsamees

source: Once per turn, during your Standby Phase: You can add 1 "<M4837>Polymerization<M>" from your Deck or Graveyard to your hand.
et: Kord ühe korra käigu jooksul, oma Ootefaasil: Sa võid lisada ühe "<M4837>Polümerisatsioon<M>" oma pakist või hauast oma kätte.

source: Elemental Hero Terra Firma
et: Elementaalne Kangelane Terra Firma

source: "<M6733>Elemental Hero Ocean<M>" + "<M6390>Cyber Dragon<M>" + "<M6728>Elemental Hero Woodsman<M>"<BR>Must be Fusion Summoned and cannot be Special Summoned by other ways. You can Tribute 1 face-up "Elemental HERO" monster; this card gains ATK equal to the Tributed monster's ATK, until the End Phase.
et: "<M6733>Elementaalne Kangelane Ookean<M>" + "<M6390>Küberdraakon<M>" + "<M6728>Elementaalne Kangelane Metsamees<M>"<BR>Peab olema Fusion Summoned ja ei saa olla Special Summoned muul viisil. Sa võid ohverdada 1 avatud "Elemental HERO" koletise; see kaart saab ATK-d, mis on võrdne ohverdatud koletise ATK-ga, kuni End Phase'ini.

source: Elemental Hero Ocean
et: Elementaalne Kangelane Ookean

source: Once per turn, during your Standby Phase: You can target 1 "HERO" monster you control or in your Graveyard; return that target to the hand.
et: Kord ühe korra oma ootejärgus: Sa võid valida ühe "HERO" koletise, mida sa kontrollid või mis on sinu Hauas; tagasta see sihtmärk käele.

source: Chimeratech Overdragon
et: Chimeratech Üledraakon

source: "<M6390>Cyber Dragon<M>" + 1 or more Machine-Type monsters<BR>Must be Fusion Summoned and cannot be Special Summoned by other ways. When this card is Fusion Summoned: Send all other cards you control to the Graveyard. The original ATK and DEF of this card each become 800 x the number of Fusion Material Monsters used for its Fusion Summon. Each turn, this card can attack your opponent's monsters a number of times equal to the number of Fusion Material Monsters used for its Fusion Summon.
et: "<M6390>Küberdraakon<M>" + 1 või rohkem Masinatüüpi koletisi<BR>Peab olema Fusion Summoned ja ei saa olla Special Summoned muul viisil. Kui see kaart on Fusion Summoned: Saada kõik teised kaardid, mida sa kontrollid, Hauakambrisse. Selle kaardi algne ATK ja DEF muutuvad iga Fusion Material Monsteri arvu järgi, mida kasutati selle Fusion Summoni jaoks, 800 x. Igal käigul võib see kaart rünnata sinu vastase koletisi nii mitu korda, kui mitu Fusion Material Monsterit kasutati selle Fusion Summoni jaoks.

source: Expressroid
et: Ekspressroid

source: When you Summon this card, you can add 2 "roid" monsters from your Graveyard to your hand, except "<M6735>Expressroid<M>".
et: Kui sa kutsud selle kaardi välja, saad lisada oma käest 2 "roid" koletist oma Hauakambrist, välja arvatud "<M6735>Expressroid<M>".

source: Ambulanceroid
et: Ambulantsõiduk

source: When a "roid" monster is added from your Graveyard to your hand, you can Special Summon that monster.
et: Kui "roid" koletis lisatakse sinu kalmistult sinu kätte, saad selle koletise eriliselt kutsuda.

source: Cyber Summon Blaster
et: Küberkutse Plahvataja

source: Each time a Machine-Type monster(s) is Special Summoned, inflict 300 damage to your opponent.
et: Iga kord, kui Masinatüüpi koletis(ed) kutsutakse eriliselt välja, põhjusta oma vastasele 300 kahju.

source: Submarineroid
et: Allveelaevroid

source: This card can attack your opponent directly. If it does, any Battle Damage this card inflicts to your opponent becomes the original ATK of this card. You may switch this card to Defense Position at the end of the Damage Step.
et: See kaart võib rünnata sinu vastast otse. Kui see nii teeb, muutub selle kaardi tekitatud lahingukahju sinu vastasele selle kaardi algseks rünnakujõuks. Sa võid selle kaardi muuta kaitsepositsiooni lahingusammu lõpus.

source: "<M6386>Steamroid<M>" + "<M6387>Drillroid<M>" + "<M6738>Submarineroid<M>"<BR>A Fusion Summon of this card can only be conducted with the above Fusion Material Monsters. During battle between this attacking card and a Defense Position monster whose DEF is lower than the ATK of this card, inflict the difference as Battle Damage to your opponent.
et: "<M6386>Aururobot<M>" + "<M6387>Puururobot<M>" + "<M6738>Sukelrobot<M>"<BR>Selle kaardi sulandumise kutse saab läbi viia ainult ülaltoodud sulandumismaterjalide koletistega. Lahingu ajal selle ründava kaardi ja kaitsepositsioonis oleva koletise vahel, mille DEF on madalam kui selle kaardi ATK, põhjusta vahe vastasele lahingukahjuna.

source: If this card attacks, destroy 1 Spell or Trap Card at the end of the Battle Phase if you control another "roid" monster.
et: Kui see kaart ründab, hävita 1 Võlu- või Lõksukaart Lahingufaasi lõpus, kui sa kontrollid teist "roid" koletist.

source: Decoyroid
et: Peibot

source: While this card is face-up on your side of the field, your opponent cannot select a face-up monster as an attack target except "<M6742>Decoyroid<M>".
et: Kui see kaart on sinu väljaku poolel avatud, ei saa sinu vastane valida avatud koletist rünnaku sihtmärgiks, välja arvatud "<M6742>Decoyroid<M>".

source: Truckroid
et: Veokroid

source: When this card destroys a monster your opponent controls by battle and sends it to the Graveyard, equip it to this card. This card gains ATK equal to the combined ATK of the equipped card(s).
et: Kui see kaart hävitab lahingus vastase kontrollitava koletise ja saadab selle Hauakambrisse, varusta see selle kaardiga. See kaart saab ATK-d, mis on võrdne varustatud kaardi(te) kombineeritud ATK-ga.

source: Ambulance Rescueroid
et: Kiirabi Päästeroid

source: "<M6745>Rescueroid<M>" + "<M6736>Ambulanceroid<M>"<BR>This monster cannot be Special Summoned except by Fusion Summon. Once per turn, when a monster on your side of the field is destroyed by battle and sent to the Graveyard, you can Special Summon that monster in Defense Position.
et: "<M6745>Rescueroid<M>" + "<M6736>Ambulanceroid<M>"<BR>Seda koletist ei saa eriliselt kutsuda, välja arvatud Fusion Summoniga. Kord ühe käigu jooksul, kui sinu väljaku poolne koletis hävitatakse lahingus ja saadetakse Hauakambrisse, saad selle koletise eriliselt kutsuda Kaitsepositsioonis.

source: Rescueroid
et: Päästeroid

source: When a "roid" monster you control is destroyed by battle and sent to the Graveyard, you can return that monster to its owner's hand.
et: Kui lahingus hävitatakse ja Hauakambrisse saadetakse sinu kontrolli all olev "roid" koletis, saad selle koletise omaniku kätte tagasi tuua.

source: No Entry!!
et: Sissepääs keelatud!!

source: Change all Attack Position monsters to Defense Position.
et: Muuda kõik Rünnakupositsioonis olevad koletised Kaitsepositsiooni.

source: Supercharge
et: Superlaadimine

source: Activate only when your opponent declares an attack while the only monsters you control are Machine-Type "roid" monster(s). Draw 2 cards.
et: Aktiveeri ainult siis, kui sinu vastane kuulutab välja rünnaku, kui ainsad koletised, mida sa kontrollid, on Masina-tüüpi "roid" koletised. Tõmba 2 kaarti.

source: Vehicroid Connection Zone
et: Vehicroidi Ühendustsoon

source: Send to the Graveyard, from your side of the field or your hand, Fusion Material Monsters that are listed on a "Vehicroid" Fusion Monster Card, and Special Summon that Fusion Monster from your Fusion Deck. (This Special Summon is treated as a Fusion Summon.) The Fusion Monster Special Summoned by this card cannot be destroyed by the effects of Spells, Traps, and Effect Monsters, and its effects cannot be negated.
et: Saada oma väljalt või käest Hauakambrisse Fusion Material Monsters, mis on loetletud "Vehicroid" Fusion Monster Card'il, ja Special Summon see Fusion Monster oma Fusion Deck'ist. (See Special Summon käsitletakse kui Fusion Summon.) Selle kaardi poolt Special Summonitud Fusion Monsterit ei saa hävitada Spellide, Trapide ja Effect Monsterite efektide poolt ning selle efekte ei saa tühistada.

source: Wonder Garage
et: Imede Garaaž

source: When this face-down card is sent to the Graveyard, you can Special Summon 1 Level 4 or lower Machine-Type "roid" monster from your hand.
et: Kui see kaardi tagurpidi külg saadetakse Hauakambrisse, saad oma käest eriliselt kutsuda 1. taseme või madalama Masina-tüüpi "roid" koletise.

source: Destiny Hero - Blade Master
et: Saatuskangelane - Terameister

source: During your opponent's Battle Phase: You can discard this card; all face-up "Destiny HERO" monsters you control gain 800 ATK until the End Phase.
et: Oma vastase Lahingufaasis: Sa võid selle kaardi ära visata; kõik sinu kontrolli all olevad avatud "Destiny HERO" koletised saavad 800 ATK juurde kuni Lõppfaasini.

source: Destiny Hero - Dasher
et: Saatuskangel - Dasher

source: Once per turn: You can Tribute 1 other monster; this card gains 1000 ATK until the End Phase. If this card attacks, change it to Defense Position at the end of the Battle Phase. One time only, when you draw a Monster Card during your Draw Phase while this card is in your Graveyard: You can reveal it; Special Summon it. This card must be in the Graveyard to activate and to resolve this effect.
et: Korra ühe korra käigu jooksul: Sa võid ohverdada 1 teise koletise; see kaart saab 1000 ATK-d kuni Lõppfaasini. Kui see kaart ründab, muuda see Lahingufaasi lõpus Kaitsepositsiooni. Ainult üks kord, kui sa tõmbad Koletisekaardi oma Tõmbefaasis, kui see kaart on sinu Hauas: Sa võid selle paljastada; Kutsu see Eriliselt välja. See kaart peab olema Hauas, et aktiveerida ja lahendada see efekt.

source: Destiny Hero - Double Dude
et: Saatuskangelane - Kahekordne Kutt

source: Cannot be Special Summoned. This card can attack twice during each Battle Phase. During your Standby Phase, if this card was destroyed since your last Standby Phase: You can Special Summon 2 "<M3929>Double Dude Token<M>" (Warrior-Type/DARK/Level 4/ATK 1000/DEF 1000). This card must be in your Graveyard to activate and to resolve this effect.
et: Ei saa erikutsuda. See kaart võib rünnata kaks korda iga Lahingu Faasi jooksul. Sinu Ootefaasil, kui see kaart hävitati alates sinu viimasest Ootefaasist: Sa saad erikutsuda 2 "<M3929>Double Dude Token<M>" (Sõdalane-Tüüp/PIMEDUS/Tase 4/RÜN 1000/KAITSE 1000). See kaart peab olema sinu Hauakambris, et aktiveerida ja lahendada see efekt.

source: Destiny Hero - Defender
et: Saatuskangelane - Kaitsja

source: During each of your opponent's Standby Phase: Your opponent draws 1 card. This card must be in face-up Defense Position to activate and to resolve this effect.
et: Iga sinu vastase Ootefaas: Sinu vastane tõmbab 1 kaardi. Selle kaardi efekt aktiveerub ja lahendatakse ainult siis, kui see on avatud Kaitsepositsioonis.

source: Destiny Hero - Fear Monger
et: Saatuskangelane - Hirmutaja

source: During your Standby Phase, if this card is in your Graveyard because it was destroyed by battle and sent there since your last Standby Phase: Target 1 "Destiny HERO" monster in your Graveyard, except a "<M6756>Destiny Hero - Fear Monger<M>"; Special Summon that target.
et: Oma ooteaja faasis, kui see kaart on sinu hauas, kuna see hävitati lahingus ja saadeti sinna pärast sinu viimast ooteaja faasi: sihi 1 "Saatuse KANGELANE" koletis oma hauas, välja arvatud "<M6756>Destiny Hero - Fear Monger<M>"; kutsu see sihtmärk eriliselt välja.

source: Destiny Hero - Dogma
et: Saatuskangelane - Dogma

source: Cannot be Normal Summoned or Set. Must be Special Summoned (from your hand) by Tributing 3 monsters, including at least 1 "Destiny HERO" monster, and cannot be Special Summoned by other ways. If you still control this face-up card during your opponent's next Standby Phase after you Special Summoned it: Halve your opponent's Life Points.
et: Ei saa normaalset kutsuda ega asetada. Peab olema erikutsutud (teie käest) ohverdades 3 koletist, sealhulgas vähemalt 1 "Destiny HERO" koletis, ja ei saa olla erikutsutud muul viisil. Kui te kontrollite seda avatud kaarti oma vastase järgmisel ootejärgul pärast selle erikutsumist: Vähendage oma vastase Elupunkte poole võrra.

source: Dark City
et: Tume Linn

source: When a "Destiny HERO" monster attacks, if its ATK is lower than the ATK of the attack target, the attacking monster gains 1000 ATK during damage calculation only.
et: Kui "Destiny HERO" koletis ründab ja selle ATK on madalam kui rünnatava sihtmärgi ATK, saab ründav koletis ainult kahjuarvutuse ajal 1000 ATK juurde.

source: Mausoleum of the Emperor
et: Keisri mausoleum

source: Both players can Normal Summon or Set monsters without Tributing, by paying 1000 Life Points x the number of monsters needed for the Tribute Summon.
et: Mõlemad mängijad saavad normaalset kutsuda või asetada koletisi ilma ohverdamata, makstes 1000 elupunkti x ohverdamiseks vajalike koletiste arvu.

source: D - Chain
et: D - Kett

source: Target a "Destiny HERO" monster you control; equip this card to that target. It gains 500 ATK. When it destroys a monster your opponent controls by battle and sends it to the Graveyard: Inflict 500 damage to your opponent.
et: Vali "Destiny HERO" koletis, mida sa kontrollid; kinnita see kaart sellele sihtmärgile. See saab 500 ATK juurde. Kui see hävitab lahingus koletise, mida su vastane kontrollib, ja saadab selle Hauakambrisse: Tekita oma vastasele 500 kahju.

source: D - Spirit
et: D - Vaim

source: Special Summon 1 Level 4 or lower "Destiny HERO" monster from your hand. You must not control any face-up "Destiny HERO" monsters to activate and to resolve this effect.
et: Erikutsuge 1 tase 4 või madalama "Destiny HERO" koletis oma käest. Selle efekti aktiveerimiseks ja lahendamiseks ei tohi sul olla ühtegi avatud "Destiny HERO" koletist.

source: Destiny Mirage
et: Saatusmiraaž

source: When a "Destiny HERO" monster you control is destroyed and sent to the Graveyard by an opponent's card effect: Special Summon, to your side of the field, all "Destiny HERO" monsters that were destroyed and sent to either Graveyard this turn.
et: Kui vastase kaardi efekti tõttu hävitatakse ja saadetakse Hauakambrisse sinu kontrolli all olev "Destiny HERO" koletis: Kutsu eriliselt välja oma väljale kõik "Destiny HERO" koletised, mis sel käigul hävitati ja saadeti ükskõik millisesse Hauakambrisse.

source: Chrysalis Dolphin
et: Krisalliline Delfiin

source: By Tributing this card while "<M6775>Neo Space<M>" is on the field, Special Summon 1 "<M6768>Neo-Spacian Aqua Dolphin<M>" from your hand or Deck.
et: Ohverdades selle kaardi, kui "<M6775>Neo Space<M>" on väljakul, kutsu eriliselt välja 1 "<M6768>Neo-Spacian Aqua Dolphin<M>" oma käest või pakist.

source: Elemental Hero Dark Neos
et: Elementaalne Kangelane Tume Neos

source: "<M6653>Elemental Hero Neos<M>" + "<M6772>Neo-Spacian Dark Panther<M>"<BR>Must first be Special Summoned (from your Extra Deck) by shuffling the above cards you control into the Deck. (You do not use "<M4837>Polymerization<M>".) If this card is not already targeting a monster with its effect: You can target 1 face-up Effect Monster on the field; while you control this face-up card, that target's effect on the field is negated. During the End Phase: Shuffle this card into the Extra Deck.
et: "<M6653>Elemental Hero Neos<M>" + "<M6772>Neo-Spacian Dark Panther<M>"<BR>Esmaltada tuleb see kõigepealt eriliselt kutsuda (oma lisapakist), segades ülaltoodud kaardid, mida sa kontrollid, pakki. (Sa ei kasuta "<M4837>Polymerization<M>".) Kui see kaart ei sihi juba oma efektiga ühte koletist: Sa saad sihtida ühte avatud Efektkoletist väljal; kuni sa kontrollid seda avatud kaarti, on selle sihtmärgi efekt väljal tühistatud. Lõppfaasi ajal: Sega see kaart lisapakki.

source: Elemental Hero Aqua Neos
et: Elementaalne Kangelane Aqua Neos

source: "<M6653>Elemental Hero Neos<M>" + "<M6768>Neo-Spacian Aqua Dolphin<M>"<BR>Must first be Special Summoned (from your Extra Deck) by shuffling the above cards you control into the Deck. (You do not use "<M4837>Polymerization<M>".) Once per turn: You can discard 1 card; destroy 1 random card in your opponent's hand. During the End Phase: Shuffle this card into the Extra Deck.
et: "<M6653>Elemental Hero Neos<M>" + "<M6768>Neo-Spacian Aqua Dolphin<M>"<BR>Esmaltada saab esmalt eriliselt kutsuda (oma lisapakist), segades ülaltoodud kaardid, mida sa kontrollid, tagasi pakki. (Sa ei kasuta "<M4837>Polymerization<M>".) Kord käigu jooksul: Sa võid ühe kaardi ära visata; hävita 1 juhuslik kaart oma vastase käes. Lõppfaasi ajal: Sega see kaart tagasi lisapakki.

source: Elemental Hero Flare Neos
et: Elementaalne Kangelane Leek Neos

source: "<M6653>Elemental Hero Neos<M>" + "<M6773>Neo-Spacian Flare Scarab<M>"<BR>Must first be Special Summoned (from your Extra Deck) by shuffling the above cards you control into the Deck. (You do not use "<M4837>Polymerization<M>".) This card gains 400 ATK for each Spell/Trap Card on the field. During the End Phase: Shuffle this card into the Extra Deck.
et: "<M6653>Elemental Hero Neos<M>" + "<M6773>Neo-Spacian Flare Scarab<M>"<BR>Esmaltada tuleb kõigepealt eriliselt kutsuda (oma lisapakist), segades ülaltoodud kaardid, mida sa kontrollid, pakki. (Sa ei kasuta "<M4837>Polymerization<M>".) See kaart saab 400 ATK iga väljal oleva loitsu/lõksukaardi eest. Lõppfaasi ajal: sega see kaart lisapakki.

source: Neo-Spacian Aqua Dolphin
et: Neo-Spacian Aqua Delfiin

source: Once per turn: You can discard 1 card; look at your opponent's hand and choose 1 Monster Card in it. If you control a monster with ATK greater than or equal to the ATK of the chosen card, destroy the chosen card and inflict 500 damage to your opponent. Otherwise, take 500 damage.
et: Kord korra: Sa võid ühe kaardi ära visata; vaata oma vastase kätt ja vali sealt üks Koletisekaart. Kui sa kontrollid koletist, mille ATK on suurem või võrdne valitud kaardi ATK-ga, hävita valitud kaart ja tee oma vastasele 500 kahju. Vastasel juhul saad 500 kahju.

source: Neo-Spacian Air Hummingbird
et: Neo-Spacian Õhuhummingbird
