Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: If your opponent has 2 or more cards in their hand than you do, you can reveal 1 "Fabled" monster in your hand and Tribute this face-up card to select 2 Spell or Trap Cards your opponent controls, and destroy them.
et: Kui sinu vastasel on käes 2 või rohkem kaarti kui sinul, saad sa paljastada 1 "Fabled" koletise oma käes ja ohverdada selle avatud kaardi, et valida 2 Loitsu- või Lõksukaarti, mida sinu vastane kontrollib, ja hävitada need.

source: Fabled Soulkius
et: Muinasjutuline Soulkius

source: You can send 2 cards, except "<M8236>Fabled Soulkius<M>", from your hand to the Graveyard to Special Summon this card from the Graveyard.
et: Saad oma käest 2 kaarti, välja arvatud "<M8236>Fabled Soulkius<M>", Hauakambrisse, et eriliselt kutsuda see kaart Hauakambrist välja.

source: Fabled Miztoji
et: Muinasjutuline Miztoji

source: You can send this card from your hand to the Graveyard to select 1 face-up "Fabled" monster you control. The selected monster is treated as a Tuner monster while face-up on the field.
et: Saad selle kaardi oma käest Hauakambrisse, et valida 1 avatud "Fabled" koletis, mida sa kontrollid. Valitud koletist käsitletakse Tuner-koletisena, kui see on väljal avatud.

source: If this card is attacked, return the attacking monster to the hand after damage calculation and this card gains DEF equal to the returned monster's Level x 100.
et: Kui seda kaarti rünnatakse, tagasta ründav koletis peale kahju arvutamist kätte ja see kaart saab DEF-i, mis on võrdne tagastatud koletise tasemega x 100.

source: If this card destroys an opponent's monster by battle, you can select 1 Set card your opponent controls, and return it to the hand.
et: Kui see kaart hävitab lahingus vastase koletise, saad valida 1 vastase kontrollitava seatud kaardi ja tagastada selle kätte.

source: While another face-up "Jurrac" monster is on the field, this card cannot be destroyed by battle.
et: Kui väljakul on teine avatud "Jurrac" koletis, ei saa seda kaarti lahingus hävitada.

source: When this card destroys an opponent's monster by battle and sends it to the Graveyard, Special Summon 1 "<M3954>Spinos Token<M>" (Dinosaur/FIRE/Level 1/ATK 300/DEF 0) in Attack Position to your opponent's side of the field.
et: Kui see kaart hävitab lahingus vastase koletise ja saadab selle Hauakambrisse, kutsu eriliselt esile 1 "<M3954>Spinos Token<M>" (Dinosaur/TULI/Tase 1/ATK 300/DEF 0) rünnakupositsioonis vastase väljaku poolele.

source: Naturia Dragonfly
et: Naturia Kiil

source: This card cannot be destroyed by battle with a monster that has 2000 or more ATK. This card gains 200 ATK for each "Naturia" monster in your Graveyard.
et: Seda kaarti ei saa hävitada lahingus koletisega, kellel on 2000 või rohkem ATK. See kaart saab 200 ATK iga sinu Hauas oleva "Naturia" koletise eest.

source: Naturia Sunflower
et: Naturia Päevalill

source: You can Tribute this card and 1 "Naturia" monster to negate the activation of an effect of an Effect Monster your opponent controls, and destroy it.
et: Saad selle kaardi ja 1 "Naturia" koletise, et tühistada vastase juhitava Efektikoletise efekti aktiveerimine ja hävitada see.

source: Naturia Cliff
et: Naturia Kalju

source: When this card is sent from the field to the Graveyard, you can Special Summon 1 Level 4 or lower "Naturia" monster from your Deck to your side of the field in face-up Attack Position.
et: Kui see kaart saadetakse väljakult hauakambrisse, saad eriliselt kutsuda 1. taseme 4 või madalama "Naturia" koletise oma pakist oma väljakupoolele avatud rünnakupositsioonis.

source: Naturia Tulip
et: Naturia Tulp

source: Each time your opponent activates a Spell or Trap Card, all face-up "Naturia" monster(s) you control gain 500 ATK until the End Phase.
et: Iga kord, kui sinu vastane aktiveerib Võlu- või Lõksukaardi, saavad kõik sinu kontrolli all olevad avatud "Naturia" koletised 500 ATK juurde kuni Lõppfaasini.

source: When this card is Normal Summoned, you can add 1 Level 1 "Genex" monster from your Deck to your hand.
et: Kui see kaart on normaal-summonitud, saad lisada 1. taseme "Genex" koletise oma pakist oma kätte.

source: R-Genex Overseer
et: R-Genex Järelevalvaja

source: When this card is Normal or Special Summoned, you can Special Summon 1 Level 3 or lower "Genex" monster from your hand.
et: Kui see kaart on Normaal- või Erikutsutud, saad oma käest Erikutsuda 1. taseme või madalama "Genex" koletise.

source: R-Genex Crusher
et: R-Genex Purustaja

source: When this card is Normal Summoned, you can add 1 Level 4 "R-Genex" monster from your deck to your hand.
et: Kui see kaart on normaalvälja kutsutud, saad lisada oma pakist oma kätte ühe 4. taseme "R-Genex" koletise.

source: Shock Troops of the Ice Barrier
et: Jääbarjääri šokiväed

source: You can Tribute this card to destroy 1 face-up WATER monster on the field, and add 1 "Ice Barrier" monster from your Deck to your hand.
et: Saad selle kaardi ohverdada, et hävitada 1 avatud VEE koletis väljal ja lisada 1 "Jääbarjääri" koletis oma pakist oma kätte.

source: Samurai of the Ice Barrier
et: Jääbarjääri samurai

source: When this card on the field is changed from face-up Attack Position to face-up Defense Position, destroy it and draw 1 card.
et: Kui see kaart väljakul muudetakse rünnakupositsioonilt kaitsepositsioonile, hävita see ja tõmba 1 kaart.

source: Dewdark of the Ice Barrier
et: Jääbarjääri Kastepimedus

source: If the only face-up monsters you control are Level 2 or lower monsters, this card can attack your opponent directly.
et: Kui ainsad avatud näoga koletised, mida sa kontrollid, on 2. taseme või madalama taseme koletised, võib see kaart rünnata sinu vastast otse.

source: Caravan of the Ice Barrier
et: Jääbarjääri karavan

source: Once per turn, you can select 2 "Ice Barrier" monsters in your Graveyard. Return the selected monsters to the Deck and each player draws 1 card.
et: Korra ühe korra käigu jooksul saad valida 2 "Jääbarjääri" koletist oma Hauakambris. Tagasta valitud koletised pakki ja iga mängija tõmbab 1 kaardi.

source: Worm Solid
et: Uss Kõva

source: This card gains 100 DEF for each Reptile-Type "Worm" monster in your Graveyard. If your opponent takes Battle Damage by attacking this card, select and destroy 1 Spell or Trap Card your opponent controls at the end of the Damage Step.
et: See kaart saab 100 DEF iga Reptiili-tüüpi "Uss" koletise eest sinu Hauakambris. Kui sinu vastane saab lahingukahju, rünnates seda kaarti, vali ja hävita 1 Loitsu- või Lõksukaart, mida sinu vastane kontrollib Kahjustuse etapi lõpus.

source: Worm Tentacles
et: Ussikeste kombitsad

source: Once per turn, you can remove from play 1 Reptile-Type "Worm" monster from your Graveyard. If you do, this card can attack twice during this turn's Battle Phase.
et: Korra ühe korra käigu jooksul saad eemaldada oma kalmistult mängust ühe Reptiil-tüüpi "Uss" koletise. Kui teed seda, võib see kaart rünnata kaks korda selle käigu Lahingu faasis.

source: Worm Ugly
et: Inetu Kole

source: If you use this card to Tribute Summon a Reptile-Type "Worm" monster, you can Special Summon this card from your Graveyard to your opponent's side of the field in face-up Attack Position.
et: Kui kasutad seda kaarti Reptiil-tüüpi "Worm" koletise ohverdamiseks, saad selle kaardi oma Hauakambrist eriliselt kutsuda vastase väljaku poolele avatud rünnakupositsioonis.

source: Worm Victory
et: Uss Võit

source: FLIP: Destroy all face-up monsters on the field, except Reptile-Type "Worm" monsters. This card gains 500 ATK for each Reptile-Type "Worm" monster in your Graveyard.
et: FLIP: Hävita kõik avatud positsioonis olevad koletised väljal, välja arvatud Reptiil-Tüüpi "Worm" koletised. See kaart saab 500 ATK iga sinu Hauakambris oleva Reptiil-Tüüpi "Worm" koletise eest.

source: Fabled Leviathan
et: Müütide Leviathan

source: 1 "Fabled" Tuner + 1 or more non-Tuner monster.<BR>When this card on the field is destroyed and sent to the Graveyard, you can select up to 3 "Fabled" monsters in your Graveyard. Add them to your hand.
et: 1 "Fabled" Tuner + 1 või rohkem mitte-Tuner koletist.<BR>Kui see kaart väljal hävitatakse ja saadetakse Hauakambrisse, saad valida kuni 3 "Fabled" koletist oma Hauakambris. Lisa need oma kätte.

source: 1 Tuner + 1 or more non-Tuner Dinosaur-Type monsters<BR>This card's ATK and DEF are equal to the total original ATK of the Synchro Material Monsters used for its Synchro Summon. If this card attacks a face-down Defense Position monster, you can destroy the monster immediately with this card's effect without flipping it face-up or applying damage calculation.
et: 1 Tuner + 1 või rohkem mitte-Tuner Dinosauruse-tüüpi koletist<BR>Selle kaardi ATK ja DEF on võrdsed Sünkro Materjal Koletiste algse ATK kogusummaga, mida kasutati selle Sünkro Kutsumiseks. Kui see kaart ründab allapoole suunatud Kaitseasendis koletist, võid selle kaardi efektiga koletise kohe hävitada ilma seda püstiasendisse pööramata või kahju arvutust rakendamata.

source: 1 EARTH Tuner + 1 or more non-Tuner EARTH monsters<BR>While this card is face-up on the field, you can remove from play 2 cards in your Graveyard to negate the activation of a Trap Card and destroy it.
et: 1 MAA Tüüner + 1 või rohkem mitte-Tüüner MAA koletist<BR>Kui see kaart on lahinguväljal avatud, saad eemaldada oma Hauakambrist mängust 2 kaarti, et tühistada Lõksukaardi aktiveerimine ja see hävitada.

source: Locomotion R-Genex
et: Lokomotsioon R-Genex

source: 1 "Genex" Tuner + 1 or more non-Tuner DARK monsters<BR>When this card is Synchro Summoned, take control of the face-up monster your opponent controls with the highest Level. (If it's a tie, you get to choose.)
et: 1 "Genex" Tuner + 1 või rohkem mitte-Tuner PIMEDUS koletist<BR>Kui see kaart on Sünkro Kutsutud, võta kontroll oma vastase kõrgeima tasemega avatud koletise üle. (Kui on viik, saad valida.)

source: Gungnir, Dragon of the Ice Barrier
et: Gungnir, Jääbarjääri Draakon

source: 1 Tuner + 1 or more WATER non-Tuner Monster.<BR>Once per turn, you can discard up to 2 cards to the Graveyard to select the same number of cards your opponent controls. Destroy the selected cards.
et: 1 Tuner + 1 või rohkem WATER mitte-Tuner koletist.<BR>Kord ühe käigu jooksul võid saata kuni 2 kaarti Hauakambrisse, et valida sama arv kaarte, mida sinu vastane kontrollib. Hävita valitud kaardid.

source: Snowman Eater
et: Lumememme Sööja

source: When this card is flipped face-up, select 1 face-up monster on the field and destroy it.
et: Kui see kaart pööratakse näoga ülespoole, vali 1 näoga ülespoole olev koletis väljal ja hävita see.

source: Ojama Red
et: Ojama Punane

source: When this card is Normal Summoned, you can Special Summon up to 4 "Ojama" monsters from your hand in Attack Position.
et: Kui see kaart on Normaal-Kutsutud, saad oma käest Kutsuda kuni 4 "Ojama" koletist Eriliselt Rünnakupositsioonis.

source: Ojama Blue
et: Ojama Sinine

source: When this card is destroyed by battle and sent to the Graveyard, you can add 2 "Ojama" cards from your Deck to your hand (this can include "<M6469>Ojamuscle<M>").
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse, võid lisada oma pakist 2 "Ojama" kaarti oma kätte (see võib sisaldada "<M6469>Ojamuscle<M>").

source: Ojama Country
et: Ojama Riik

source: Once per turn, you can send 1 "Ojama" card from your hand to the Graveyard to Special Summon 1 "Ojama" monster from your Graveyard. While you control a face-up "Ojama" monster, switch the original ATK and DEF of all monsters on the field.
et: Korra ühe korra käigu jooksul saad saata 1 "Ojama" kaardi oma käest Hauakambrisse, et Kutsuda Eriliselt välja 1 "Ojama" koletis oma Hauakambrist. Kui sa kontrollid avatud "Ojama" koletist, vaheta kõigi koletiste algne RÜN ja KAIT väljal.

source: Shiba-Warrior Taro
et: Shiba-sõdalane Taro

source: This card cannot be destroyed by battle. When a card on the field is destroyed by battle or by a card effect, return this face-up card to its owner's hand.
et: Seda kaarti ei saa lahingus hävitada. Kui lahingus või kaardi efekti tõttu hävitatakse mõni kaart väljal, tagasta see avatud kaart omaniku kätte.

source: Supersonic Skull Flame
et: Ülikiire Koljuleek

source: This card cannot be Normal Summoned or Set. This card can only be Special Summoned by removing 1 "<M8269>Skull Flame<M>" in your Graveyard from play. Once per turn, you can inflict 400 damage to your opponent for each "<M8270>Burning Skull Head<M>" in your Graveyard. When this card is sent from the field to the Graveyard, you can Special Summon 1 "<M8269>Skull Flame<M>" from your Graveyard.
et: Seda kaarti ei saa normaalset kutsuda ega asetada. Seda kaarti saab eriliselt kutsuda ainult eemaldades oma kalmistult mängust 1 "<M8269>Skull Flame<M>". Kord ühe käigu jooksul võid sa teha oma vastasele 400 kahju iga oma kalmistul oleva "<M8270>Burning Skull Head<M>" eest. Kui see kaart saadetakse väljakult kalmistule, võid sa eriliselt kutsuda 1 "<M8269>Skull Flame<M>" oma kalmistult.

source: Skull Flame
et: Koljaluuleek

source: Once per turn, you can Special Summon 1 "<M8270>Burning Skull Head<M>" from your hand. You cannot conduct your Battle Phase the turn you activate this effect. You can add 1 "<M8270>Burning Skull Head<M>" from your Graveyard to your hand instead of conducting a normal draw in your Draw Phase.
et: Korra ühe korra käigu jooksul saad eriliselt kutsuda 1 "<M8270>Burning Skull Head<M>" oma käest. Sa ei saa läbi viia oma lahingufaasi sellel käigul, kui aktiveerid selle efekti. Sa saad lisada 1 "<M8270>Burning Skull Head<M>" oma hauakambrist oma kätte tavalise tõmbamise asemel oma tõmbefaasis.

source: Burning Skull Head
et: Põlev Koljupea

source: When this card is Special Summoned from your hand, inflict 1000 damage to your opponent. You can remove from play this face-up card you control to return 1 removed from play "<M8269>Skull Flame<M>" to its owner's Graveyard.
et: Kui see kaart kutsutakse eriliselt välja sinu käest, põhjusta oma vastasele 1000 kahju. Sa saad eemaldada mängust selle ülespoole suunatud kaardi, mida sa kontrollid, et tagastada 1 mängust eemaldatud "<M8269>Skull Flame<M>" selle omaniku Hauakambrisse.

source: Skull Conductor
et: Kolju Dirigent

source: If this card is face-up on the field at the end of the Battle Phase, destroy it. You can send this card from your hand to the Graveyard to Special Summon up to 2 Zombie-Type monsters from your hand whose combined ATK is exactly 2000.
et: Kui see kaart on lahingufaasi lõpus väljal avatud, hävita see. Sa võid saata selle kaardi oma käest Hauakambrisse, et Kutsuda Eriliselt kuni 2 Zombi-Tüüpi koletist oma käest, kelle kombineeritud RÜN on täpselt 2000.

source: When you have no cards in your hand and draw this card, you can reveal it to Special Summon it. When this card is Special Summoned, if you have no cards in your hand, you can add 1 "Infernity" card from your Deck to your hand.
et: Kui sul pole kaarte käes ja sa tõmbad selle kaardi, võid selle paljastada, et see eriliselt välja kutsuda. Kui see kaart kutsutakse eriliselt välja ja sul pole kaarte käes, võid oma pakist lisada ühe "Infernity" kaardi oma kätte.

source: Infernity Dwarf
et: Infernity Pöialpoiss

source: While you have no cards in your hand, during battle between an attacking monster you control and a Defense Position monster whose DEF is lower than the ATK of the attacking monster inflict the difference as Battle Damage to your opponent.
et: Kui sul pole kaarte käes, siis lahingu ajal sinu kontrollitava ründava koletise ja kaitseasendis koletise vahel, mille DEF on madalam kui ründava koletise ATK, põhjusta vahe vastasele lahingukahjuna.

source: Infernity Guardian
et: Infernity Kaitsja

source: While you have no cards in your hand, this face-up card cannot be destroyed by battle or by card effects.
et: Kui sul pole kaarte käes, ei saa seda avatud kaarti hävitada lahingus ega kaardiefektide abil.

source: Infernity Destroyer
et: Infernity Hävija

source: While you have no cards in your hand, when this card destroys an opponent's monster by battle and sends it to the Graveyard, inflict 1600 damage to your opponent.
et: Kui sul pole kaarte käes, siis kui see kaart hävitab lahingus vastase koletise ja saadab selle Hauakambrisse, tekitab see vastasele 1600 kahju.

source: Court of Justice
et: Õiguse Kohus

source: Once per turn: You can Special Summon 1 Fairy-Type monster from your hand. You must control a face-up Level 1 Fairy-Type monster to activate and to resolve this effect. You can activate the effect of one "<M8276>Court of Justice<M>" per turn.
et: Kord päevas: Sa võid eriliselt kutsuda ühe haldjatüüpi koletise oma käest. Selle efekti aktiveerimiseks ja lahendamiseks pead kontrollima ühte avatud taseme 1 haldjatüüpi koletist. Sa võid aktiveerida ühe "<M8276>Õigluse Kohus<M>" efekti kord päevas.

source: Powered Tuner
et: Võimas Häälestaja

source: This card gains 500 ATK for each face-up Tuner monster on the field.
et: See kaart saab 500 ATK iga lahinguväljal oleva avatud Tuner koletise eest.

source: Pride of the Weak
et: Nõrkade Uhkus

source: When a Level 2 or lower monster you control destroys an opponent's monster by battle and sends it to the Graveyard, if you have no cards in your hand, draw 2 cards.
et: Kui sinu kontrollitav 2. taseme või madalama tasemega koletis hävitab lahingus vastase koletise ja saadab selle Hauakambrisse, tõmba 2 kaarti, kui sul pole kaarte käes.

source: Gottoms' Emergency Call
et: Gottomsi hädaabikõne

source: Activate only if there is a face-up "X-Saber" monster(s) on the field. Select 2 "X-Saber" monsters in either player's Graveyard(s). Special Summon those monsters to your side of the field.
et: Aktiveeri ainult siis, kui väljakul on avatud "X-Saber" koletis(ed). Vali 2 "X-Saber" koletist kas enda või vastase kalmistult. Kutsu need koletised eriliselt oma väljaku poolele.

source: Archlord Kristya
et: Ülemvalitseja Kristya

source: If you have exactly 4 Fairy-Type monsters in your Graveyard, you can Special Summon this card (from your hand). When you do: Target 1 Fairy-Type monster in your Graveyard; add that target to your hand. Neither player can Special Summon monsters. If this face-up card would be sent from the field to the Graveyard, it returns to the top of the Deck, instead.
et: Kui sul on täpselt 4 haldjatüüpi koletist oma Hauas, saad selle kaardi (oma käest) eriliselt kutsuda. Kui sa seda teed: sihi 1 haldjatüüpi koletist oma Hauas; lisa see sihtmärk oma kätte. Kumbki mängija ei saa koletisi eriliselt kutsuda. Kui see avatud kaart saadetakse väljakult Hauale, naaseb see selle asemel paki tippu.

source: Darklord Asmodeus
et: Pimeduseisand Asmodeus

source: Cannot be Special Summoned from the Deck or Graveyard. Once per turn: You can send 1 Fairy-Type monster from your Deck to the Graveyard. When this card you control is destroyed and sent to your Graveyard: Special Summon 1 "<M3956>Asmo Token<M>" (Fairy-Type/DARK/Level 5/ATK 1800/DEF 1300) and 1 "<M3957>Deus Token<M>" (Fairy-Type/DARK/Level 3/ATK 1200/DEF 1200). "<M3956>Asmo Token<M>" cannot be destroyed by card effects. "<M3957>Deus Token<M>" cannot be destroyed by battle.
et: Ei saa eriliselt kutsuda pakist ega hauast. Kord kord: Sa saad saata 1 haldjatüüpi koletise oma pakist hauale. Kui see kaart, mida sa kontrollid, hävitatakse ja saadetakse sinu hauale: Kutsu eriliselt 1 "<M3956>Asmo Token<M>" (Haldjatüüp/PIMEDUS/Tase 5/ATK 1800/DEF 1300) ja 1 "<M3957>Deus Token<M>" (Haldjatüüp/PIMEDUS/Tase 3/ATK 1200/DEF 1200). "<M3956>Asmo Token<M>" ei saa hävitatud olla kaardiefektide poolt. "<M3957>Deus Token<M>" ei saa hävitatud olla lahingus.

source: Darklord Superbia
et: Pimeduseisand Superbia

source: When this card is Special Summoned from the Graveyard: You can target 1 Fairy-Type monster in your Graveyard, except "<M8288>Darklord Superbia<M>"; Special Summon that target.
et: Kui see kaart on eriliselt välja kutsutud Hauakambrist: Sa võid sihtida 1 Haldjatüüpi koletist oma Hauakambris, välja arvatud "<M8288>Darklord Superbia<M>"; Kutsu see sihtmärk eriliselt välja.

source: Darklord Edeh Arae
et: Pimeduseisand Edeh Arae

source: If this card is Special Summoned from the Graveyard, it gains the following effect.<BR>● If this card attacks a Defense Position monster, inflict piercing Battle Damage to your opponent.
et: Kui see kaart on eriliselt kutsutud Hauakambrist, saab see järgmise efekti.<BR>● Kui see kaart ründab Kaitseasendis koletist, põhjustab see vastasele läbistavat Lahingukahju.

source: If this card was selected as an attack target by your opponent's monster, you can activate this effect during damage calculation. You take no Battle Damage from this battle, your opponent gains Life Points equal to the attacking monster's ATK, and then you return this card to your hand.
et: Kui see kaart valiti sinu vastase koletise rünnaku sihtmärgiks, saad selle efekti aktiveerida kahju arvutamise ajal. Sa ei saa sellest lahingust lahingukahju, sinu vastane saab Elupunkte, mis on võrdne ründava koletise ATK-ga, ja seejärel tagastad selle kaardi oma kätte.

source: If this card is sent to the Graveyard for the Synchro Summon of a LIGHT Synchro Monster, gain 1000 Life Points.
et: Kui see kaart saadetakse Hauakambrisse LIGHT Sünkrokoletise Sünkrokutsumiseks, saad 1000 Elupunkti.

source: Sunlight Unicorn
et: Päikesevalguse Ükssarvik

source: Once per turn, during your Main Phase, you can reveal the top card of your Deck. If it is an Equip Spell Card, add it to your hand. If it is not, place it on the bottom of your Deck.
et: Kord päevas, oma peafaasi ajal, saad paljastada oma pakist ülemise kaardi. Kui see on Varustuse Võlukaart, lisa see oma kätte. Kui see ei ole, aseta see oma paki alla.

source: Blackwing - Mistral the Silver Shield
et: Mustatiib - Hõbekilp Mistral

source: If this card on the field is destroyed and sent to the Graveyard, reduce the battle damage you take from the next attack this turn to 0.
et: Kui see kaart väljal hävitatakse ja saadetakse Hauakambrisse, vähenda sellel käigul järgmise rünnaku lahingukahju 0-ni.

source: Blackwing - Vayu the Emblem of Honor
et: Mustatiib - Vayu, Auhinna Embleem

source: If this card is face-up on the field, you cannot use it for a Synchro Summon. If this card is in your Graveyard, you can remove from play this card plus 1 non-Tuner "Blackwing" monster in your Graveyard, and Special Summon 1 "Blackwing" Synchro Monster from your Extra Deck whose Level equals the total Levels of the removed monsters. The effect(s) of that Synchro Monster is negated.
et: Kui see kaart on lahinguväljal avatud, ei saa seda kasutada Sünkroonkutsumiseks. Kui see kaart on sinu Hauakambris, saad selle kaardi ja 1 mitte-Tuuner "Musttiib" koletise oma Hauakambrist mängust eemaldada ning eriliselt kutsuda 1 "Musttiib" Sünkroonkoletis oma Lisapakist, mille tase on võrdne eemaldatud koletiste tasemete summaga. Selle Sünkroonkoletise mõju(d) on tühistatud.

source: Blackwing - Fane the Steel Chain
et: Mustatiib - Fane, Terasahel

source: This card can attack your opponent directly. When this card attacks your opponent directly and inflicts Battle Damage to your opponent, you can change 1 Attack Position monster your opponent controls to Defense Position.
et: See kaart võib rünnata sinu vastast otse. Kui see kaart ründab sinu vastast otse ja tekitab lahingukahju sinu vastasele, saad muuta ühe sinu vastase kontrollitava rünnakupositsioonis oleva koletise kaitsepositsiooni.

source: Morphtronic Magnen Bar
et: Morftroniline Magnen Baar
