Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: "<M7807>Genex Controller<M>" + 1 or more FIRE non-Tuner Monsters<BR>This card gains 200 ATK for each FIRE monster in your Graveyard. If this card destroys an opponent's monster by battle, inflict damage to your opponent equal to the number of "Genex" monsters in your Graveyard x 200.
et: "<M7807>Genexi Kontroller<M>" + 1 või rohkem MITTE-HÄÄLESTAJAST TULEMONSTRIT<BR>See kaart saab 200 ATK iga sinu Hauakambris oleva TULEmonstri eest. Kui see kaart hävitab lahingus vastase monstri, tekitab see vastasele kahju, mis on võrdne sinu Hauakambris olevate "Genexi" monstrite arvuga x 200.

source: 1 "<M7807>Genex Controller<M>" + 1 or more non-Tuner EARTH Monsters<BR>Once per turn, if you control a face-up Level 4 or lower "Genex" monster(s), you can switch the original ATK and DEF of this card until the End Phase, for as long as you control a face-up Level 4 or lower "Genex" monster(s).
et: 1 "<M7807>Genex Controller<M>" + 1 või rohkem mittehäälestaja MAA koletist<BR>Kord korduses, kui sa kontrollid avatud 4. või madalama taseme "Genex" koletist(eid), saad sa vahetada selle kaardi algse ATK ja DEF kuni lõppfaasini, nii kaua kui sa kontrollid avatud 4. või madalama taseme "Genex" koletist(eid).

source: Ally of Justice Field Marshal
et: Õigluse Liitlane Välimarssal

source: 1 Tuner + 2 or more non-Tuner monsters<BR>This card cannot be Special Summoned except by Synchro Summon. When this card destroys a face-down Defense Position monster by battle and sends it to the Graveyard, draw 1 card.
et: 1 Tuner + 2 või rohkem mitte-Tuner koletist<BR>Seda kaarti ei saa eriliselt kutsuda, välja arvatud Sünkrokutsumise teel. Kui see kaart hävitab lahingus näoga allapoole kaitseasendis oleva koletise ja saadab selle Hauakambrisse, tõmba 1 kaart.

source: Genesis Dragon
et: Genesis Draakon

source: Once per turn, you can send 1 Dragon-Type monster from your hand to the Graveyard to add 1 Dragon-Type monster from your Graveyard to your hand. When this card is sent from the field to the Graveyard, you can return all Dragon-Type monsters from your Graveyard to your Deck.
et: Korra ühe korra käigu jooksul saad saata 1 Draakoni-tüüpi koletise oma käest Hauakambrisse, et lisada 1 Draakoni-tüüpi koletis oma Hauakambrist oma kätte. Kui see kaart saadetakse väljakult Hauakambrisse, saad saata kõik Draakoni-tüüpi koletised oma Hauakambrist oma Pakki tagasi.

source: Gallis the Star Beast
et: Gallis, Tähtelukas

source: You can reveal this card in your hand; send the top card of your Deck to the Graveyard, then, if it was a monster, inflict damage to your opponent equal to its Level x 200 and Special Summon this card from your hand, otherwise destroy this card.
et: Saate selle kaardi oma käes paljastada; saatke oma paki ülemine kaart Hauakambrisse, siis, kui see oli koletis, tekitage oma vastasele kahju, mis on võrdne selle tasemega x 200 ja kutsuge see kaart oma käest eriliselt välja, vastasel juhul hävitage see kaart.

source: Red-Eyes Wyvern
et: Punasilmne Wyvern

source: During your End Phase, if you did not Normal Summon or Set a monster this turn, you can remove from play this card from your Graveyard to Special Summon 1 "Red-Eyes" monster from your Graveyard, except "<M6109>Red-Eyes B. Chick<M>".
et: End Phase'i ajal, kui sa ei teinud sellel käigul normaalset kutsumist ega seadnud koletist, võid sa eemaldada selle kaardi oma kalmistult mängust, et eriliselt kutsuda 1 "Red-Eyes" koletis oma kalmistult, välja arvatud "<M6109>Red-Eyes B. Chick<M>".

source: Darkness Destroyer
et: Pimeduse Hävitaja

source: Cannot be Special Summoned. This card can attack twice during each Battle Phase. If this attacks a Defense Position monster, inflict piercing Battle Damage to your opponent.
et: Ei saa erikutsuda. See kaart võib rünnata kaks korda iga Lahingu Faasi jooksul. Kui see ründab Kaitseasendis koletist, tekitab see vastasele läbistavat Lahingukahju.

source: White Night Queen
et: Valge Öö Kuninganna

source: This card cannot be Special Summoned. Once per turn, you can destroy 1 face-down card on the field.
et: Seda kaarti ei saa eriliselt kutsuda. Kord käigu jooksul saad hävitada ühe allapoole suunatud kaardi väljal.

source: Fortress Warrior
et: Kindlus Sõdalane

source: You take no battle damage from battles involving this card. Once per turn, if this card would be destroyed by battle, it is not destroyed. (Damage calculation is applied normally.)
et: Sa ei saa lahingukahju lahingutest, mis hõlmavad seda kaarti. Kord käigu jooksul, kui see kaart hävitatakse lahingus, siis seda ei hävitata. (Kahju arvutamine toimub tavapäraselt.)

source: Tuningware
et: Häälestusvarustus

source: If this card is used for a Synchro Summon, you can treat it as a Level 2 monster. If this card is sent to the Graveyard for a Synchro Summon, draw 1 card.
et: Kui seda kaarti kasutatakse Sünkrosummoniks, võid seda käsitleda kui 2. taseme koletist. Kui see kaart saadetakse Sünkrosummoni jaoks Hauakambrisse, tõmba 1 kaart.

source: Armory Arm
et: Relvade Käsi

source: 1 Tuner + 1 or more non-Tuner monsters<BR>Once per turn, you can either: Target 1 monster on the field; equip this card to that target, OR: Unequip this card and Special Summon it in face-up Attack Position. While equipped by this effect, that target gains 1000 ATK. When that target destroys a monster by battle and sends it to the Graveyard: Inflict damage to your opponent equal to the ATK of the destroyed monster in the Graveyard.
et: 1 Tuner + 1 või rohkem mitte-Tuner koletist<BR>Kord kord, saad kas: Märkida 1 koletis väljakul; kinnita see kaart sellele sihtmärgile, VÕI: Eemalda see kaart ja Kutsu see erilisesse rünnakupositsiooni. Kui see on selle efekti abil kinnitatud, saab see sihtmärk 1000 ATK. Kui see sihtmärk hävitab lahingus koletise ja saadab selle Hauakambrisse: Tekita oma vastasele kahju, mis on võrdne Hauakambris oleva hävitatud koletise ATK-ga.

source: Give and Take
et: Anna ja Võta

source: Special Summon 1 monster from your Graveyard to your opponent's side of the field in Defense Position, and increase the Level of 1 monster you control by the Level of the Special Summoned monster, until the End Phase.
et: Erikutsuge oma kalmistult 1 koletis oma vastase väljaku poolele kaitseasendis ja suurenda 1 sinu kontrolli all oleva koletise taset spetsiaalselt kutsutud koletise taseme võrra kuni lõppfaasini.

source: Limiter Overload
et: Piiraja Ülekoormus

source: When this card is sent to your Graveyard, Special Summon 1 "<M7688>Speed Warrior<M>" from your hand, Deck, or Graveyard.
et: Kui see kaart saadetakse sinu Hauakambrisse, kutsu eriliselt välja 1 "<M7688>Kiirus Sõdalane<M>" oma käest, pakist või Hauakambrist.

source: Shield Wing
et: Kilbitiib

source: Up to twice per turn, if this card would be destroyed by battle, it is not destroyed.
et: Kuni kaks korda käigu jooksul, kui see kaart peaks lahingus hävima, siis seda ei hävitata.

source: Vice Dragon
et: Asemdraakon

source: If your opponent controls a monster and you control no monsters, you can Special Summon this card from your hand. If you do, its original ATK and DEF are halved.
et: Kui sinu vastasel on koletis ja sul ei ole ühtegi koletist, saad selle kaardi oma käest eriliselt välja kutsuda. Kui sa seda teed, vähenevad selle algne ATK ja DEF poole võrra.

source: Tyr, the Vanquishing Warlord
et: Tyr, Võidukas Sõjapealik

source: This card cannot be Special Summoned. To Tribute Summon this card, you must Tribute 3 Fairy-Type monsters. If this card attacks your opponent directly and reduces their Life Points to 0, you win the Match.
et: Seda kaarti ei saa eriliselt kutsuda. Selle kaardi ohverdamiseks pead ohverdama 3 haldjatüüpi koletist. Kui see kaart ründab sinu vastast otse ja vähendab nende Elupunktid nulli, võidad matši.

source: Lorelei, the Symphonic Arsenal
et: Lorelei, Sümfooniline Arsenal

source: This card cannot be Special Summoned. To Tribute Summon this card, you must Tribute 3 Machine-Type monsters. If this card attacks your opponent directly and reduces their Life Points to 0, you win the Match.
et: Seda kaarti ei saa eriliselt kutsuda. Selle kaardi ohverdamiseks pead ohverdama 3 masinatüüpi koletist. Kui see kaart ründab otse sinu vastast ja vähendab nende Elupunktid 0-ni, võidad matši.

source: Summon Reactor・SK
et: Kutsumismasin・SK

source: The first time a monster(s) is Summoned to your opponent's side of the field each turn, inflict 800 damage to your opponent. During the Battle Phase of the turn this effect is activated, you can negate the attack of 1 monster your opponent controls. You can send 1 face-up "<M8000>Trap Reactor・Y FI<M>", 1 face-up "<M8002>Spell Reactor・RE<M>" and this face-up card you control to the Graveyard to Special Summon 1 "<M7999>Giant Bomber Air Raid<M>" from your hand, Deck, or Graveyard.
et: Esimest korda, kui koletis(ed) kutsutakse iga käigu jooksul sinu vastase väljale, tekitab see sinu vastasele 800 kahju. Selle käigu Lahingu Faasis, mil see efekt aktiveeritakse, saad tühistada ühe sinu vastase kontrollitava koletise rünnaku. Sa saad saata 1 avatud "<M8000>Trap Reactor・Y FI<M>", 1 avatud "<M8002>Spell Reactor・RE<M>" ja selle avatud kaardi, mida sa kontrollid, Hauakambrisse, et Eriliselt Kutsuda 1 "<M7999>Giant Bomber Air Raid<M>" oma käest, Pakkist või Hauakambrist.

source: Giant Bomber Air Raid
et: Hiiglaslik pommirünnak

source: This card cannot be Normal Summoned or Set. This card cannot be Special Summoned except with the effect of "<M7998>Summon Reactor・SK<M>". Once per turn, you can send 1 card from your hand to the Graveyard to destroy 1 card your opponent controls. Once during each of your opponent's turns, you can activate 1 of the following effects:<BR>● When your opponent Normal Summons or Special Summons a monster, destroy it and inflict 800 damage to your opponent.<BR>● When your opponent Sets a card, destroy it and inflict 800 damage to your opponent.
et: Seda kaarti ei saa normaalmängu kutsuda ega asetada. Seda kaarti ei saa erikutsuda, välja arvatud "<M7998>Summon Reactor・SK<M>" efektiga. Kord ühe käigu jooksul võid saata 1 kaardi oma käest hauakambrisse, et hävitada 1 kaart, mida sinu vastane kontrollib. Kord iga sinu vastase käigu jooksul võid aktiveerida ühe järgmistest efektidest:<BR>● Kui sinu vastane kutsub normaalmängu või erikutsumisega koletise, hävita see ja tekita oma vastasele 800 kahju.<BR>● Kui sinu vastane asetab kaardi, hävita see ja tekita oma vastasele 800 kahju.

source: Trap Reactor・Y FI
et: Lõksureaktor・Y FI

source: Once per turn, when your opponent activates a Trap Card, you can destroy the Trap Card and inflict 800 damage to your opponent.
et: Korra ühe käigu jooksul, kui sinu vastane aktiveerib Lõksukaardi, saad sa Lõksukaardi hävitada ja tekitada vastasele 800 kahju.

source: Black Salvo
et: Must Salvo

source: When this card is Normal Summoned, you can select 1 Level 4 DARK Machine-Type monster from your Graveyard, and Special Summon it in face-up Defense Position. Its effect(s) is negated.
et: Kui see kaart on normaalvälja kutsutud, saad valida oma hauakambrist ühe 4. taseme PIMEDA Masinatüüpi koletise ja kutsuda see erivälja ülespööratud kaitseasendisse. Selle mõju(d) on tühistatud.

source: Spell Reactor・RE
et: Loitsureaktor・RE

source: Once per turn, when your opponent activates a Spell Card, you can destroy the Spell Card and inflict 800 damage to your opponent.
et: Korra ühe käigu jooksul, kui sinu vastane aktiveerib Võlukaarte, saad sa Võlukaardi hävitada ja tekitada vastasele 800 kahju.

source: Rose Tentacles
et: Roosi Kombitsad

source: This card cannot be Special Summoned. At the beginning of your Battle Phase, this card gains 1 additional attack this turn for each face-up Plant-Type monster your opponent controls. Each time this card destroys a Plant-Type monster by battle, inflict 300 damage to your opponent.
et: Seda kaarti ei saa eriliselt kutsuda. Sinu lahingufaasi alguses saab see kaart sellel käigul ühe lisarünnaku iga vastase kontrollitava avatud Taimetüüpi koletise kohta. Iga kord, kui see kaart hävitab lahingus Taimetüüpi koletise, tekitab see vastasele 300 kahju.

source: Turret Warrior
et: Tornisõdalane

source: You can Tribute 1 Warrior-Type monster to Special Summon this card from your hand. If you do, it gains ATK equal to the Tributed monster's original ATK.
et: Saad ühe Sõdalase-tüüpi koletise ohverdada, et see kaart oma käest eriliselt välja kutsuda. Kui teed seda, saab see ATK-d, mis on võrdne ohverdatud koletise algse ATK-ga.

source: Debris Dragon
et: Prahilohe Draakon

source: When this card is Normal Summoned, you can Special Summon 1 monster with 500 or less ATK from your Graveyard in Attack Position. That monster's effect(s) is negated. This card cannot be used as a Synchro Material Monster, except for the Synchro Summon of a Dragon-Type Synchro Monster. The other Synchro Material Monster(s) cannot be Level 4.
et: Kui see kaart on Normaal-Kutsutud, saad Sa Eriliselt Kutsuda 1 koletise, millel on 500 või vähem ATK-d, oma Hauakambrist Rünnakupositsioonis. Selle koletise efekt(id) on tühistatud. Seda kaarti ei saa kasutada Sünkro Materjal Koletisena, välja arvatud Draakonitüüpi Sünkro Koletise Sünkro Kutsumiseks. Teised Sünkro Materjal Koletised ei tohi olla 4. tasemel.

source: Hyper Synchron
et: Hüper Sünkron

source: If this card is sent to the Graveyard for the Synchro Summon of a Dragon-Type Synchro Monster, that monster gains 800 ATK. Remove it from play during the End Phase.
et: Kui see kaart saadetakse Hauakambrisse Draakoni-tüüpi Sünkro Koletise Sünkro Kutsumiseks, saab see koletis 800 ATK juurde. Eemalda see mängust Lõppfaasi ajal.

source: Red Demon's Dragon/Assault Mode
et: Punase Deemoni Draakon/Rünnakurežiim

source: This card cannot be Normal Summoned or Set. This card cannot be Special Summoned except with "<M8058>Assault Mode Activate<M>". If this card attacks, destroy all other monsters after damage calculation. When this card on the field is destroyed, you can Special Summon 1 "<M7735>Red Demon's Dragon<M>" from your Graveyard.
et: Seda kaarti ei saa normaalset kutsuda ega asetada. Seda kaarti ei saa eriliselt kutsuda, välja arvatud "<M8058>Rünnakurežiimi aktiveerimine<M>". Kui see kaart ründab, hävita kõik teised koletised pärast kahju arvutamist. Kui see kaart väljal hävitatakse, saad eriliselt kutsuda 1 "<M7735>Punase deemoni draakon<M>" oma hauakambrist.

source: Trap Eater
et: Lõksusööja

source: This card cannot be Normal Summoned or Set. This card cannot be Special Summoned except by sending 1 face-up Trap Card your opponent controls to the Graveyard.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti ei saa eriliselt kutsuda, välja arvatud juhul, kui saadate ühe vastase kontrollitava avatud lõksukaardi hauakambrisse.

source: Twin-Sword Marauder
et: Kaksikmõõga Marodöör

source: Once per turn, if this card attacks a Defense Position monster, it can attack once more. During battle between this attacking card and a Defense Position monster whose DEF is lower than the ATK of this card, inflict the difference as Battle Damage to your opponent.
et: Kord korra käigu jooksul, kui see kaart ründab kaitseasendis olevat koletist, võib see rünnata veel kord. Lahingu ajal selle ründava kaardi ja kaitseasendis oleva koletise vahel, mille DEF on madalam kui selle kaardi ATK, põhjusta erinevus lahingukahjuna oma vastasele.

source: Dark Tinker
et: Tume Tinkija

source: When this card you control is sent to the Graveyard, look at the top card of your Deck. Return that card to either the top or the bottom of the Deck.
et: Kui see sinu kontrollitav kaart saadetakse Hauakambrisse, vaata oma paki ülemist kaarti. Pane see kaart tagasi kas paki ülemisele või alumisele osale.

source: Blackwing - Gale the Whirlwind
et: Mustatiib - Tormituul Gale

source: If you control a "Blackwing" monster other than "<M8011>Blackwing - Gale the Whirlwind<M>", you can Special Summon this card from your hand. Once per turn, you can halve the ATK and DEF of 1 face-up monster your opponent controls.
et: Kui sa kontrollid mõnda "Blackwing" koletist peale "<M8011>Blackwing - Gale the Whirlwind<M>", saad selle kaardi oma käest eriliselt kutsuda. Kord ühe käigu jooksul saad sa vähendada ühe vastase kontrollitava avatud koletise ATK ja DEF poole võrra.

source: Blackwing - Bora the Spear
et: Mustatiib - Odaoda Bora

source: If you control a "Blackwing" monster other than "<M8012>Blackwing - Bora the Spear<M>", you can Special Summon this card from your hand. During battle between this attacking card and a Defense Position monster whose DEF is lower than the ATK of this card, inflict the difference as Battle Damage to your opponent.
et: Kui sa kontrollid mõnda teist "Blackwing" koletist peale "<M8012>Blackwing - Bora the Spear<M>", saad selle kaardi oma käest eriliselt kutsuda. Lahingu ajal, kui see ründav kaart võitleb kaitseasendis koletisega, mille DEF on madalam kui selle kaardi ATK, põhjusta vahe oma vastasele lahingukahjuna.

source: Blackwing - Sirocco the Dawn
et: Musta Tiib - Sirocco Koidik

source: If your opponent controls a monster and you control no monsters, you can Normal Summon or Set this card without Tributing. Once per turn, you can select 1 face-up "Blackwing" monster you control. It gains ATK equal to the total ATK of all face-up "Blackwing" monsters on the field except itself. Monsters other than the selected monster cannot attack the turn you activate this effect.
et: Kui sinu vastasel on koletis ja sul ei ole koletisi, saad selle kaardi normaalset kutsuda või asetada ilma ohverdamata. Kord ühe käigu jooksul saad valida ühe avatud "Blackwing" koletise, mida sa kontrollid. See saab ATK-d, mis on võrdne kõigi väljal olevate avatud "Blackwing" koletiste kogutud ATK-ga, välja arvatud see ise. Teised koletised peale valitud koletise ei saa rünnata selle käigu jooksul, mil sa selle efekti aktiveerid.

source: Twilight Rose Knight
et: Videviku Roosirüütel

source: Your opponent cannot select a Plant-Type monster as an attack target. When this card is Normal Summoned, you can Special Summon 1 Level 4 or lower Plant-Type monster from your hand.
et: Sinu vastane ei saa valida Taim-tüüpi koletist rünnaku sihtmärgiks. Kui see kaart on Normaal-Kutsutud, saad sa oma käest Erilis-Kutsuda 1 4. taseme või madalama Taim-tüüpi koletise.

source: Morphtronic Boarden
et: Morftronik Boarden

source: ● While in Attack Position: "Morphtronic" monsters you control can attack your opponent directly.<BR>● While in Defense Position: Other "Morphtronic" monsters you control cannot be destroyed by battle.
et: ● Rünnakupositsioonis olles: "Morphtronic" koletised, mida sa kontrollid, võivad rünnata otse sinu vastast.<BR>● Kaitsepositsioonis olles: Teisi "Morphtronic" koletisi, mida sa kontrollid, ei saa lahingus hävitada.

source: Morphtronic Slingen
et: Morftronik Slingen

source: ● While in Attack Position: Once per turn, you can Tribute 1 "Morphtronic" monster, except "<M8016>Morphtronic Slingen<M>", to destroy 1 card on the field.<BR>● While in Defense Position: If this card would be destroyed, you can destroy another "Morphtronic" monster you control instead.
et: ● Rünnakupositsioonis olles: Kord ühe käigu jooksul võid ohverdada 1 "Morphtronic" koletise, välja arvatud "<M8016>Morphtronic Slingen<M>", et hävitada 1 kaart väljal.<BR>● Kaitsepositsioonis olles: Kui see kaart hävitatakse, võid selle asemel hävitada teise "Morphtronic" koletise, mida sa kontrollid.

source: This card cannot be Normal Summoned or Set. This card cannot be Special Summoned except with "<M8058>Assault Mode Activate<M>". When this card is Special Summoned, Special Summon any number of Zombie-Type monsters from either player's Graveyard(s) to your side of the field. Those monsters' effects are negated, and they are destroyed during the End Phase this turn. When this card on the field is destroyed, you can Special Summon 1 "<M7848>Doomkaiser Dragon<M>" from your Graveyard.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti ei saa eriliselt kutsuda, välja arvatud "<M8058>Assault Mode Activate<M>". Kui see kaart on eriliselt kutsutud, kutsu eriliselt välja suvaline arv zombitüüpi koletisi kas enda või vastase hauast oma väljale. Nende koletiste efektid on tühistatud ja nad hävitatakse selle käigu lõppfaasis. Kui see kaart väljal hävitatakse, saad eriliselt kutsuda 1 "<M7848>Doomkaiser Dragon<M>" oma hauast.

source: Hyper Psychic Blaster/Assault Mode
et: Hüper Psüühiline Laskur/Rünnakurežiim

source: This card cannot be Normal Summoned or Set. This card cannot be Special Summoned except with "<M8058>Assault Mode Activate<M>". If this card battles a monster, at the end of the Damage Step, inflict damage to your opponent equal to that monster's DEF and gain Life Points equal to its ATK. When this card on the field is destroyed, you can Special Summon 1 "<M8037>Hyper Psychic Blaster<M>" from your Graveyard.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti ei saa eriliselt kutsuda, välja arvatud "<M8058>Assault Mode Activate<M>". Kui see kaart võitleb koletisega, tekitage Kahjustuse sammu lõpus oma vastasele kahju, mis on võrdne selle koletise DEF-iga, ja saate Elupunkte, mis on võrdne selle ATK-ga. Kui see kaart väljal hävitatakse, saate oma Hauakambrist eriliselt kutsuda 1 "<M8037>Hyper Psychic Blaster<M>".

source: Arcanite Magician/Assault Mode
et: Arkanit Maag/Assault Mode

source: This card cannot be Normal Summoned or Set. This card cannot be Special Summoned except with "<M8058>Assault Mode Activate<M>". When this card is Special Summoned, place 2 Spell Counters on it. This card gains 1000 ATK for each Spell Counter on it. You can remove 2 Spell Counters from this card to destroy all cards your opponent controls. When this card on the field is destroyed, you can Special Summon 1 "<M8038>Arcanite Magician<M>" from your Graveyard.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti ei saa eriliselt kutsuda, välja arvatud "<M8058>Assault Mode Activate<M>". Kui see kaart kutsutakse eriliselt, pane sellele 2 loitsuloendurit. See kaart saab 1000 ATK iga loitsuloenduri kohta, mis sellel on. Sa saad eemaldada 2 loitsuloendurit sellelt kaardilt, et hävitada kõik kaardid, mida sinu vastane kontrollib. Kui see kaart väljal hävitatakse, saad sa eriliselt kutsuda 1 "<M8038>Arcanite Magician<M>" oma hauakambrist.

source: Arcane Apprentice
et: Arkaani Õpilane

source: If this card is sent to the Graveyard for a Synchro Summon, you can add 1 "<M8058>Assault Mode Activate<M>" from your Deck to your hand.
et: Kui see kaart saadetakse Sünkrosummonimiseks Hauakambrisse, saad lisada oma pakist ühe "<M8058>Rünnakurežiimi aktiveerimine<M>" oma kätte.

source: Assault Mercenary
et: Rünnak Palgasõdur

source: Once per turn, you can return 1 "<M8058>Assault Mode Activate<M>" from your hand or Graveyard to the Deck to destroy 1 Spell or Trap Card your opponent controls.
et: Korra ühe korra käigu jooksul saad sa oma käest või hauast ühe "<M8058>Assault Mode Activate<M>" tagasi paki sisse panna, et hävitada üks loitsu- või lõksukaart, mida sinu vastane kontrollib.

source: Assault Beast
et: Rünnakuloom

source: You can discard this card to the Graveyard to add 1 "<M8058>Assault Mode Activate<M>" from your Deck to your hand.
et: Saad selle kaardi Hauakambrisse saata, et lisada oma pakist 1 "<M8058>Assault Mode Activate<M>" oma kätte.

source: Night Wing Sorceress
et: Öötiiva Nõid

source: You can activate "<M8058>Assault Mode Activate<M>" the turn it is Set.
et: Sa saad aktiveerida "<M8058>Assault Mode Activate<M>" sellel käigul, kui see on seatud.

source: Lifeforce Harmonizer
et: Elujõu Harmoniseerija
