Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: When this card is Summoned: Change it to Defense Position. When a face-up monster you control is targeted for an attack: You can change the target to this card. When this card is targeted for an attack: You can choose a number from 1 to 3, then send that many cards from the top of your Deck to the Graveyard; this card gains 500 DEF for each card sent, until the End Phase.
et: Kui see kaart kutsutakse välja: Muuda see kaitsepositsiooniks. Kui sinu kontrollitavat avatud koletist rünnatakse: Sa võid muuta rünnaku sihtmärgiks selle kaardi. Kui seda kaarti rünnatakse: Sa võid valida numbri 1 kuni 3, seejärel saata nii palju kaarte oma paki pealt hauakambrisse; see kaart saab 500 DEF iga saadetud kaardi kohta kuni lõppfaasini.

source: Beast King Barbaros
et: Metallikuningas Barbaros

source: You can Normal Summon or Set this card without Tributing, but its original ATK will becomes 1900. You can Tribute 3 monsters to Tribute Summon this card. If you do: Destroy all cards your opponent controls.
et: Saad selle kaardi normaalmängu või asetada ilma ohverdamata, kuid selle algne ATK muutub 1900-ks. Saad ohverdada 3 koletist, et ohverdada ja kutsuda see kaart. Kui teed seda: Hävita kõik kaardid, mida su vastane kontrollib.

source: Splendid Venus
et: Suurepärane Veenus

source: All non-Fairy-Type monsters lose 500 ATK and DEF. The activation and effects of your Spell and Trap Cards cannot be negated.
et: Kõik mitte-haldjatüüpi koletised kaotavad 500 ATK ja DEF. Sinu Loitsu- ja Lõksukaartide aktiveerimist ja efekte ei saa tühistada.

source: Mad Reloader
et: Hullumeelne Laadija

source: When this card is destroyed by battle and sent to the Graveyard, send 2 cards from your hand to the Graveyard to draw 2 cards.
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse, saada 2 kaarti oma käest Hauakambrisse, et tõmmata 2 kaarti.

source: Dark Bribe
et: Tume altkäemaks

source: When an opponent's Spell or Trap Card is activated: Negate the activation, destroy it, and your opponent draws 1 card.
et: Kui vastase Püünis- või Võlukaar aktiveeritakse: Tühista aktiveerimine, hävita see ja vastane tõmbab 1 kaardi.

source: Chaos Burst
et: Kaose Purse

source: Activate only by Tributing 1 monster when your opponent's monster declares an attack. Destroy the attacking monster. Then inflict 1000 damage to your opponent.
et: Aktiveeri ainult 1 koletist ohverdades, kui sinu vastase koletis kuulutab välja rünnaku. Hävita ründav koletis. Seejärel tekita oma vastasele 1000 kahju.

source: Phantom of Chaos
et: Kaose Fantoom

source: ny Battle Damage your opponent takes from battles involving this card becomes 0. Once per turn: You can target 1 Effect Monster in your Graveyard; banish that target, then, until the End Phase, this card's name and ATK become that monster's name and ATK, and it gains that monster's effects. You must control this face-up card to activate and to resolve this effect.
et: Sinu vastasele selle kaardiga seotud lahingutest saadav lahingukahju muutub 0-ks. Kord ühe käigu jooksul: Sa võid valida ühe Efektikoletise oma Hauakambris; pagenda see sihtmärk, siis kuni Lõppfaasini muutuvad selle kaardi nimi ja ATK selle koletise nimeks ja ATK-ks ning see omandab selle koletise efektid. Selle efekti aktiveerimiseks ja lahendamiseks pead sa kontrollima seda avatud kaarti.

source: Nurse Reficule the Fallen One
et: Langenu Reficule, Õde

source: Any effect that would cause your opponent to gain Life Points instead inflicts the same amount of damage to your opponent.
et: Mis tahes efekt, mis põhjustaks sinu vastasel Elupunktide saamise, tekitab selle asemel sinu vastasele sama palju kahju.

source: Dark Cure
et: Tume Ravi

source: When your opponent Summons a monster(s), they gain Life Points equal to half the ATK of 1 of the Summoned monsters of your choice.
et: Kui sinu vastane kutsub välja koletise(d), saavad nad Elupunkte, mis on võrdne poolega ühe sinu valitud välja kutsutud koletise rünnakust (ATK).

source: Brutal Potion
et: Brutaalne Jook

source: This card becomes an Equip Card, and equips to 1 monster you control. Once per turn, when you inflict damage to your opponent with a card effect, the equipped monster gains 1000 ATK until the End Phase.
et: See kaart muutub Varustuskaardiks ja varustab 1 sinu kontrollitava koletise. Kord ühe käigu jooksul, kui sa tekitad oma vastasele kahju kaardi efektiga, saab varustatud koletis 1000 ATK juurde kuni Lõppfaasini.

source: Once per turn, you can activate 1 of these effects.<BR>●Banish 2 Zombie-Type monsters from your Graveyard; draw 1 card.<BR>●Target 1 of your banished Zombie-Type monsters; return that target to the top of your Deck.
et: Korra ühe korra käigu jooksul aktiveerida ühe neist efektidest.<BR>● Eemalda oma kalmistult mängust 2 Zombi-tüüpi koletist; tõmba 1 kaart.<BR>● Sihti ühte oma eemaldatud Zombi-tüüpi koletist; pane see sihtmärk oma paki peale tagasi.

source: You can banish this card from your Graveyard to target 1 Zombie-Type monster in your Graveyard; Special Summon that target.
et: Saad selle kaardi oma Hauakambrist eemaldada, et sihtida 1 Zombi-tüüpi koletist oma Hauakambris; Kutsu see sihtmärk eriliselt välja.

source: Gladiator Beast Andal
et: Gladiaatorikutsar Andal

source: This one-eyed warrior bear is an aggressive hunter that strikes down its prey with the powerful swipes of its claws. No one can bear the brunt of his tremendously fast and heavy blows.
et: See ühesilmne sõdalaskarhu on agressiivne jahimees, kes lööb oma saagi maha oma võimsate küüniste löökidega. Keegi ei suuda taluda tema tohutult kiireid ja raskeid lööke.

source: Atlantean Pikeman
et: Atlanteani piigimees

source: The Great Ocean Lord, who reigns over the depths, is served by these lancers. Deep-sea creatures exist in fear of facing the stream of attacks their lances are capable of.
et: Suur Ookeani Isand, kes valitseb sügavuste üle, on nende lansseerijate teenistuses. Süvamere olendid kardavad nende lantide rünnakute voogu.

source: Earth Effigy
et: Maa Effigy

source: This card can be treated as 2 Tributes for the Tribute Summon of an EARTH Normal Monster.
et: Seda kaarti saab käsitleda kui 2 ohverdust EARTH tavalise koletise ohverdusrituaaliks.

source: Wind Effigy
et: Tuule Effigy

source: This card can be treated as 2 Tributes for the Tribute Summon of a WIND Normal Monster.
et: Seda kaarti võib kasutada 2 ohvrina, kui ohverdussummonitakse WIND tavaline koletis.

source: Gemini Lancer
et: Kaksikute Lantseerija

source: This card is treated as a Normal Monster while face-up on the field or in the Graveyard. While this card is face-up on the field, you can Normal Summon it to have it be treated as an Effect Monster with this effect:<BR>● During battle between this attacking card and a Defense Position monster whose DEF is lower than the ATK of this card, inflict the difference as Battle Damage to your opponent.
et: See kaart käsitletakse Tavalise Koletisena, kui see on näoga ülespoole väljakul või Hauakambris. Kui see kaart on näoga ülespoole väljakul, võid selle Normaal-Kutsuda, et seda käsitletaks Efekt-Koletisena järgmise efektiga:<BR>● Lahingu ajal selle ründava kaardi ja Kaitseasendis koletise vahel, mille DEF on madalam kui selle kaardi ATK, põhjusta vahe vastasele Lahingukahjuna.

source: Imprisoned Queen Archfiend
et: Vangistatud Kuninganna Kurivaim

source: This card's controller pays 1000 Life Points during each of their Standby Phases (this is not optional). During your Standby Phase, if "<M5791>Pandemonium<M>" is on the field and this card is in your Graveyard, 1 Level 4 or lower Fiend-Type monster gains 1000 ATK until the End Phase.
et: Selle kaardi kontrollija maksab iga oma Ootefaaside ajal 1000 Elupunkti (see ei ole valikuline). Sinu Ootefaaside ajal, kui "<M5791>Pandemonium<M>" on väljal ja see kaart on sinu Hauakambris, saab üks 4. taseme või madalama Tüüp-Deemon koletis 1000 ATK kuni Lõppfaasini.

source: Dark End Dragon
et: Pimeotsa Draakon

source: 1 Tuner + 1 or more non-Tuner DARK monsters<BR>Once per turn: You can target 1 monster your opponent controls; this card loses 500 ATK and DEF, and you send that target to the Graveyard.
et: 1 Tuner + 1 või rohkem mitte-Tuner PIMEDUS koletist<BR>Kord kord: Sa võid sihtida 1 koletist, mida sinu vastane kontrollib; see kaart kaotab 500 ATK ja DEF, ja sa saadad selle sihtmärgi Hauakambrisse.

source: Light End Dragon
et: Valguse Lõpu Draakon

source: 1 Tuner + 1 or more non-Tuner LIGHT monsters<BR>At attack declaration, if this card battles another monster: You can have this card lose 500 ATK and DEF (permanently), and the monster this card is battling loses 1500 ATK and DEF until the End Phase.
et: 1 Tuner + 1 või rohkem mitte-Tuner LIGHT koletist<BR>Rünnaku deklaratsiooni ajal, kui see kaart võitleb teise koletisega: Sa võid lasta sellel kaardil kaotada 500 ATK ja DEF (püsivalt), ning koletis, millega see kaart võitleb, kaotab 1500 ATK ja DEF kuni End Phase'ini.

source: Chimaera, the Master of Beasts
et: Chimaera, metsaliste meister

source: This card cannot be Special Summoned. To Tribute Summon this card, you must Tribute 3 Beast-Type monsters. If this card attacks your opponent directly and reduces their Life Points to 0, you win the Match.
et: Seda kaarti ei saa eriliselt kutsuda. Selle kaardi ohverdamiseks pead ohverdama 3 metsalise tüüpi koletist. Kui see kaart ründab sinu vastast otse ja vähendab nende Elupunktid nulli, võidad matši.

source: Emperor of Lightning
et: Välgu Keiser

source: This card cannot be Special Summoned. This card must be Tribute Summoned by Tributing 3 Thunder-Type monsters on your side of the field. If this card attacks your opponent's Life Points directly and makes them 0, the controller of this card wins the Match.
et: Seda kaarti ei saa eriliselt kutsuda. See kaart tuleb kutsuda ohverdades 3 välgu-tüüpi koletist oma väljaku poolel. Kui see kaart ründab otse sinu vastase Elupunkte ja viib need nulli, siis selle kaardi kontrollija võidab matši.

source: Evil HERO Infernal Prodigy
et: Kuriangli KANGEL Põrgulik Prodigy

source: If you control no monsters, you can Special Summon this card (from your hand) in face-up Attack Position. During the End Phase, if you Tributed this card this turn to Tribute Summon a "HERO" monster: Draw 1 card.
et: Kui sul pole ühtegi koletist, saad selle kaardi (oma käest) eriliselt kutsuda avatud rünnakupositsioonis. Lõpuetapis, kui sa ohverdasid selle kaardi sel käigul, et ohverduskutsuda "HERO" koletis: Tõmba 1 kaart.

source: Once per turn, you can equip this card to a Warrior-Type monster you control, OR unequip it to Special Summon this card in face-up Attack Position. While equipped to a monster by this effect, when that monster inflicts Battle Damage to your opponent, destroy 1 card on the field. (A monster can only be equipped with 11 Union Monster at a time. If the equipped monster would be destroyed by battle, this card is destroyed instead.)
et: Korra ühe korra käigu jooksul saad selle kaardi kinnitada ühe Sõdalase-tüüpi koletise külge, mida sa kontrollid, VÕI eemaldada selle kinnituse, et eriliselt kutsuda see kaart näoga ülespoole Rünnakupositsioonis. Kui see on kinnitatud koletise külge selle efekti abil, siis kui see koletis tekitab lahingukahju sinu vastasele, hävita 1 kaart väljal. (Koletis saab korraga olla kinnitatud ainult 1 Liidu Koletisega. Kui kinnitatud koletis hävitatakse lahingus, hävitatakse selle asemel see kaart.)

source: Evil HERO Wild Cyclone
et: Kurianglase Wild Cyclone

source: "<M6310>Elemental HERO Avian<M>" + "<M6478>Elemental Hero Wildheart<M>"<BR>Must be Special Summoned with "<M7262>Dark Fusion<M>" and cannot be Special Summoned by other ways. If this card attacks, your opponent cannot activate any Spell/Trap Cards until the end of the Damage Step. When this card inflicts Battle Damage to your opponent: Destroy all face-down Spell and Trap Cards your opponent controls.
et: "<M6310>Elemental HERO Avian<M>" + "<M6478>Elemental Hero Wildheart<M>"<BR>Peab olema eriliselt kutsutud "<M7262>Dark Fusion<M>" abil ja seda ei saa kutsuda teistel viisidel. Kui see kaart ründab, ei saa sinu vastane aktiveerida ühtegi Loitsu/Lõksu kaarti kuni Kahjustuse Etapi lõpuni. Kui see kaart tekitab sinu vastasele Lahingu Kahjustusi: Hävita kõik sinu vastase kontrollitavad tagurpidi Loitsu ja Lõksu kaardid.

source: Evil HERO Infernal Sniper
et: Kuri Kangelas Põrgulik Laskur

source: "<M6312>Elemental HERO Clayman<M>" + "<M6311>Elemental HERO Burstinatrix<M>"<BR>Must be Special Summoned with "<M7262>Dark Fusion<M>" and cannot be Special Summoned by other ways. This card cannot be destroyed by Spell Cards. During each of your Standby Phase: Inflict 1000 damage to your opponent. This card must be in face-up Defense Position to activate and to resolve this effect.
et: "<M6312>Elemental HERO Clayman<M>" + "<M6311>Elemental HERO Burstinatrix<M>"<BR>Peab olema eriliselt kutsutud "<M7262>Dark Fusion<M>" abil ja ei saa olla eriliselt kutsutud muul viisil. Seda kaarti ei saa hävitada loitsukaartidega. Iga sinu standby-faasi ajal: Tekita oma vastasele 1000 kahju. Selle efekti aktiveerimiseks ja lahendamiseks peab see kaart olema avatud kaitsepositsioonis.

source: Evil HERO Malicious Fiend
et: Kuri Kangelas Malicious Fiend

source: "<M7258>Evil HERO Malicious Edge<M>" + 1 Level 6 or higher Fiend-Type monster<BR>Must be Special Summoned with "<M7262>Dark Fusion<M>" and cannot be Special Summoned by other ways. During your opponent's Battle Phase, all monsters they control are changed to face-up Attack Position, and each monster they control must attack this card, if able.
et: "<M7258>Paha KANGEL Malicious Edge<M>" + 1. taseme 6 või kõrgem deemonitüüpi koletis<BR>Peab olema spetsiaalselt kutsutud "<M7262>Tume Sulandumine<M>" abil ja ei saa olla spetsiaalselt kutsutud muul viisil. Sinu vastase lahingufaasi ajal muudetakse kõik nende kontrollitavad koletised ründepositsiooniks ja iga nende kontrollitav koletis peab ründama seda kaarti, kui võimalik.

source: Dark Calling
et: Pimekutsung

source: Banish, from your hand or your Graveyard, the Fusion Material Monsters listed on a Fusion Monster Card that can only be Special Summoned with "<M7262>Dark Fusion<M>", then Special Summon that monster from your Extra Deck. (This Special Summon is treated as a Fusion Summon with "<M7262>Dark Fusion<M>".)
et: Eemalda oma käest või oma Hauakambrist Fusion Materjal Koletised, mis on loetletud Fusion Koletise Kaardil, mida saab eriliselt kutsuda ainult "<M7262>Dark Fusion<M>" abil, seejärel kutsu see koletis oma Lisapakist. (See eriline kutsumine käsitletakse kui Fusion Kutsumine "<M7262>Dark Fusion<M>" abil.)

source: Revoke Fusion
et: Fusioni Tühistamine

source: Discard 1 "<M4837>Polymerization<M>" to the Graveyard. Send 1 Fusion Monster from your Extra Deck to your Graveyard and Special Summon 1 monster from your hand that is listed as a Fusion Material Monster on that card. The Special Summoned monster is sent to the Graveyard during the End Phase of this turn.
et: Viska 1 "<M4837>Polümerisatsioon<M>" hauakambrisse. Saada 1 Fusion Monster oma Extra Deckist hauakambrisse ja Special Summon 1 koletis oma käest, mis on loetletud selle kaardi Fusion Material Monsterina. Special Summoned koletis saadetakse selle käigu lõppfaasis hauakambrisse.

source: Hero's Rule 2
et: Kangelase Reegel 2

source: Negate the activation of a Spell, Trap, or Effect Monster's effect that targets a card(s) in the Graveyard, and destroy it.
et: Tühista loitsu, lõksu või efektikoletise efekti aktiveerimine, mis sihib kaarti või kaarte hauas, ja hävita see.

source: Phantom Skyblaster
et: Fantoomne Taevaplahvataja

source: When this card is Normal or Flip Summoned: You can Special Summon any number of "<M3935>Skyblaster Token<M>"s (Fiend-Type/DARK/Level 4/ATK 500/DEF 500), up to the number of monsters you control. During your Standby Phase: You can inflict 300 damage to your opponent for each "Skyblaster" monster you control. If you activate this effect, "Skyblaster" monsters cannot declares an attack this turn.
et: Kui see kaart on Normaal- või Pöördkutsutud: Sa võid Erikutse teha ükskõik kui palju "<M3935>Skyblaster Token<M>"-eid (Deemonitüüp/PIMEDUS/Tase 4/RÜN 500/KAIT 500), kuni nende koletiste arvuni, mida sa kontrollid. Sinu Ootefaasil: Sa võid oma vastasele tekitada 300 kahju iga "Skyblaster" koletise eest, mida sa kontrollid. Kui sa aktiveerid selle efekti, ei saa "Skyblaster" koletised sel käigul rünnata.

source: Grave Squirmer
et: Hauakääbik

source: When this card is destroyed by battle and sent to the Graveyard: Target 1 card on the field; destroy that target.
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse: Sihtige 1 kaart väljal; hävitage see sihtmärk.

source: Grinder Golem
et: Purustaja Golem

source: Cannot be Normal Summoned or Set. Must first be Special Summoned (from your hand) to your opponent's side of the field by Special Summoning 2 "<M3936>Grinder Token<M>"s (Fiend-Type/DARK/Level 1/ATK 0/DEF 0) in face-up Attack Position on your side of the field. If you Special Summon this monster, you cannot Normal Summon or Set a monster during the same turn.
et: Ei saa olla normaalkutsutud ega seatud. Esmalt tuleb see erikutsuda (oma käest) vastase väljaku poolele, kutsudes erikutsumise teel oma väljaku poolele 2 "<M3936>Grinder Token<M>"-it (Deemonitüüp/PIMEDUS/Tase 1/RÜNNAK 0/KAITSE 0) avatud rünnakupositsioonis. Kui sa kutsud selle koletise erikutsumise teel, ei saa sa samal käigul normaalset kutsumist ega seadmist teha.

source: Crystal Counter
et: Kristallloendur

source: Send all cards in your Spell & Trap Card Zone to the Graveyard. Place as many "Crystal Beast" monsters as possible from your Graveyard in your Spell & Trap Card Zone, face-up, as Continuous Spell Cards. During the End Phase, destroy all face-up "Crystal Beast" cards you control.
et: Saada kõik kaardid oma Võlu- ja Lõksukaartide alalt Hauakambrisse. Aseta nii palju "Kristallkoletis" koletisi kui võimalik oma Hauakambrist oma Võlu- ja Lõksukaartide alale, avatud, Pidevate Võlukaartidena. Lõppfaasis hävita kõik avatud "Kristallkoletis" kaardid, mida sa kontrollid.

source: Crystal Pair
et: Kristallpaar

source: When a "Crystal Beast" monster you control is destroyed by battle and sent to the Graveyard: Place 1 "Crystal Beast" monster from your Deck face-up in your Spell & Trap Card Zone as a Continuous Spell Card, then you take no Battle Damage for the rest of this turn.
et: Kui sinu kontrollitav "Crystal Beast" koletis hävitatakse lahingus ja saadetakse Hauakambrisse: Aseta 1 "Crystal Beast" koletis oma pakist näoga ülespoole oma Loitsu ja Lõksu Kaardi Tsooni pideva loitsukaardina, siis sa ei saa selle käigu ülejäänud osa jooksul lahingukahju.

source: Hand Destruction
et: Käe hävitamine

source: Each player sends 2 cards from their hand to the Graveyard and draws 2 cards.
et: Iga mängija saadab 2 kaarti oma käest Hauakambrisse ja tõmbab 2 kaarti.

source: Crystal Release
et: Kristalli Vabastamine

source: Equip only to a "Crystal Beast" monster. It gains 800 ATK. When this card is sent from the field to the Graveyard: You can place 1 "Crystal Beast" monster from your Deck face-up in your Spell & Trap Card Zone as a Continuous Spell Card.
et: Varusta ainult "Kristallkoletis" koletisega. See saab 800 ATK. Kui see kaart saadetakse väljakult Hauakambrisse: Sa võid asetada 1 "Kristallkoletis" koletise oma pakist näoga ülespoole oma Loitsu ja Lõksu kaarditsooni pideva loitsukaardina.

source: Crystal Tree
et: Kristallipuu

source: Each time a "Crystal Beast" monster(s) is placed in either player's Spell & Trap Card Zone: Place 1 Crystal Counter on this card. You can send this card to the Graveyard; take a number of "Crystal Beast" monsters from your Deck equal to the number of Crystal Counters that were on this card, then place those monsters face-up in your Spell & Trap Card Zone as Continuous Spell Cards.
et: Iga kord, kui "Crystal Beast" koletis(ed) asetatakse kas mängija Loitsu & Lõksu kaarditsooni: Aseta sellele kaardile 1 Kristalliloendur. Sa võid saata selle kaardi Hauakambrisse; võta oma pakist "Crystal Beast" koletisi, mille arv on võrdne sellel kaardil olnud Kristalliloendurite arvuga, ja aseta need koletised oma Loitsu & Lõksu kaarditsooni ülespoole pööratuna Pidevate Loitsukaartidena.

source: Exodius the Ultimate Forbidden Lord
et: Exodius, Kõige Viimne Keelatud Isand

source: This card cannot be Normal Summoned or Set. This card cannot be Special Summoned except by returning all monsters from your Graveyard to your Deck. When this card declares an attack, send 1 monster from your hand or Deck to the Graveyard. This card gain 1000 ATK for each Normal Monster in your Graveyard. When this card is removed from the field, remove it from play. If there are 5 different "Forbidden One" cards in your Graveyard that were sent there by this card's effect, you win the Duel.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti ei saa eriliselt kutsuda, välja arvatud juhul, kui kõik koletised sinu hauakambrist oma pakki tagasi saadetakse. Kui see kaart kuulutab välja rünnaku, saada 1 koletis oma käest või pakist hauakambrisse. See kaart saab 1000 ATK iga tavalise koletise eest sinu hauakambris. Kui see kaart eemaldatakse väljakult, eemalda see mängust. Kui sinu hauakambris on 5 erinevat "Keelatud Üks" kaarti, mis on sinna saadetud selle kaardi efektiga, võidad duelli.

source: Thunder King Rai-Oh
et: Äikese Kuningas Rai-Oh

source: Neither player can add cards from their Deck to their hand except by drawing them. During either player's turn, when your opponent would Special Summon a monster: You can send this face-up card to the Graveyard; negate the Special Summon and destroy it.
et: Kumbki mängija ei saa oma pakist kaarte kätte võtta, välja arvatud nende tõmbamise teel. Mõlema mängija käigu ajal, kui sinu vastane püüab eriliselt kutsuda koletist: Sa võid saata selle avatud kaardi Hauakambrisse; tühista eriline kutsumine ja hävita see.

source: Deep Diver
et: Sügavussukelduja

source: If this card is destroyed by battle and sent to the Graveyard, at the end of the Battle Phase select 1 Monster Card from your Deck, and place it on top of your Deck.
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse, vali Lahingufaasi lõpus oma pakist 1 Koletisekaart ja aseta see oma paki peale.

source: Burden of the Mighty
et: Võimsa Koorem

source: Each face-up monster your opponent controls loses 100 ATK × its own Level.
et: Iga sinu vastase avatud koletis kaotab 100 ATK × oma taseme.

source: Dimensional Prison
et: Dimensioonide Vangla

source: When an opponent declares an attack: Target that monster; banish that target.
et: Kui vastane kuulutab välja rünnaku: Sihtige seda koletist; pagendage see sihtmärk.

source: Vortex Trooper
et: Vortexi Sõdur

source: When this card is Normal Summoned, you can shuffle 2 cards from your hand into your Deck, then draw 2 cards. After this card is destroyed, draw 1 card.
et: Kui see kaart on normaalvälja kutsutud, võid segada 2 kaarti oma käest tagasi oma pakki, seejärel tõmmata 2 kaarti. Pärast selle kaardi hävitamist tõmba 1 kaart.
