Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: "<M6390>Cyber Dragon<M>" + 1 or more Machine-Type monsters.<BR>This monster cannot be used as a Fusion Material Monster. You can only Special Summon this card from your Extra Deck by sending the above cards from either side of the field to the Graveyard. (You do not use "<M4837>Polymerization<M>".) The original ATK of this card is equal to 1000 x the number of Fusion Material Monsters used to Special Summon it.
et: "<M6390>Küberdraakon<M>" + 1 või rohkem Masinatüüpi koletisi.<BR>Seda koletist ei saa kasutada Fusion Material Monster'ina. Sa saad selle kaardi oma Extra Deck'ist eriliselt välja kutsuda, saates ülaltoodud kaardid mõlemalt poolelt väljakult Hauakambrisse. (Sa ei kasuta "<M4837>Polümerisatsioon<M>".) Selle kaardi algne ATK on võrdne 1000 x kasutatud Fusion Material Monster'ite arvuga, et see eriliselt välja kutsuda.

source: Fog King
et: Udukuningas

source: You can Normal Summon this card with 1 Tribute, or without a Tribute. The ATK of this card is equal to the combined original ATK of the monsters Tributed to Summon it. Neither player can Tribute monsters.
et: Seda kaarti saab Normaal-Kutsuda ühe ohverdusega või ilma ohverduseta. Selle kaardi ATK on võrdne ohverdatud koletiste algse ATK kogusummaga, et see välja kutsuda. Kumbki mängija ei saa koletisi ohverdada.

source: Fossil Dyna Pachycephalo
et: Fossiilne Dyna Pachycephalo

source: Neither player can Special Summon monsters. When this card is flipped face-up, destroy all Special Summoned monsters on the field.
et: Kumbki mängija ei saa eriliselt kutsuda koletisi. Kui see kaart pööratakse ülespoole, hävita kõik eriliselt kutsutud koletised väljal.

source: Rainbow Dark Dragon
et: Vikerkaare Tume Draakon

source: Cannot be Normal Summoned or Set. Must be Special Summoned (from your hand) by banishing 7 DARK monsters with different names from your Graveyard, and cannot be Special Summoned by other ways. You can banish all other DARK monsters you control and from your Graveyard; this card gains 500 ATK for each card banished this way.
et: Ei saa normaalset kutsuda ega asetada. Peab olema erikutsutud (teie käest), eemaldades oma kalmistult 7 erineva nimega PIMEDUST koletist, ja ei saa olla erikutsutud muul viisil. Saate eemaldada kõik teised PIMEDUST koletised, mida kontrollite ja mis on teie kalmistul; see kaart saab iga sel viisil eemaldatud kaardi eest 500 ATK juurde.

source: Samsara Lotus
et: Samsara Lootos

source: During your End Phase, if you control no Spell or Trap Cards, you can Special Summon this card from your Graveyard in face-up Attack Position. This card's controller takes 1000 damage during each of their Standby Phases.
et: Oma lõpuetapi ajal, kui sul ei ole kontrolli all ühtegi loitsu- ega lõksukaarti, saad selle kaardi oma hauakambrist spetsiaalselt kutsuda avatud rünnakupositsioonis. Selle kaardi kontrollija saab iga oma ooteetapi ajal 1000 kahju.

source: Regenerating Rose
et: Taastuv Roos

source: When this card is destroyed by battle and sent to the Graveyard, you can Special Summon 2 "<M3937>Regenerating Rose Token<M>"s (Plant-Type/DARK/Level 3/ATK 1200/DEF 1200).
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse, saad Sa eriliselt kutsuda 2 "<M3937>Regenerating Rose Token<M>"-i (Taim-Tüüp/PIMEDUS/Tase 3/RÜNNAK 1200/KAITSE 1200).

source: This card cannot be destroyed by battle. You take no Battle Damage from battles involving this card. Before damage calculation, when this face-up Attack Position card is attacked by your opponent's monster: Inflict damage to your opponent equal to that monster's ATK. During your End Phase: Tribute 1 other monster or destroy this card. When this card is destroyed, except by its own effect: Its owner can Special Summon 1 "<M7410>Yubel - Terror Incarnate<M>" from their hand, Deck or Graveyard.
et: Seda kaarti ei saa lahingus hävitada. Sa ei saa lahingukahju lahingutest, milles see kaart osaleb. Enne kahju arvutamist, kui sinu vastase koletis ründab seda avatud rünnakupositsioonis kaarti: Tekita oma vastasele kahju, mis on võrdne selle koletise rünnakuga. Sinu lõppfaasis: Ohverda 1 teine koletis või hävita see kaart. Kui see kaart hävitatakse, välja arvatud oma efekti tõttu: Selle omanik võib eriliselt kutsuda 1 "<M7410>Yubel - Terror Incarnate<M>" oma käest, pakist või hauast.

source: Yubel - Terror Incarnate
et: Yubel - Terrori kehastus

source: Cannot be Normal Summoned or Set. Must be Special Summoned by1 "<M7409>Yubel<M>", and cannot be Special Summoned other ways. This card cannot be destroyed by battle. You take no Battle Damage from battles involving this card. Before damage calculation, when this face-up Attack Position card is attacked by an opponent's monster: Inflict damage to your opponent equal to that monster's ATK. During your End Phase: Destroy all other monsters on the field. When this face-up card leaves the field: You can Special Summon 1 "<M7411>Yubel - The Ultimate Nightmare<M>" from your hand, Deck or Graveyard.
et: Ei saa olla normaalkutsutud ega seatud. Peab olema eriliselt kutsutud "<M7409>Yubel<M>" poolt ja ei saa olla eriliselt kutsutud muul viisil. Seda kaarti ei saa lahingus hävitada. Sa ei saa lahingukahju lahingutest, milles see kaart osaleb. Enne kahjukalkulatsiooni, kui see avatud rünnakupositsioonis kaart ründab vastase koletis: Tekita oma vastasele kahju, mis on võrdne selle koletise ATK-ga. Sinu lõppfaasi ajal: Hävita kõik teised koletised väljal. Kui see avatud kaart lahkub väljast: Sa võid eriliselt kutsuda 1 "<M7411>Yubel - The Ultimate Nightmare<M>" oma käest, pakist või hauast.

source: Yubel - The Ultimate Nightmare
et: Yubel - Ülim Õudusunenägu

source: Cannot be Normal Summoned or Set. Must be Special Summoned by1 "<M7410>Yubel - Terror Incarnate<M>", and cannot be Special Summoned by other ways. This card cannot be destroyed by battle. You take no Battle Damage from battles involving this card. At the end of the Damage Step, if this face-up Attack Position card battles with an opponent's monster: Inflict damage equal to that monster's ATK to your opponent, also destroy that monster.
et: Ei saa normaalset kutsuda ega asetada. Peab olema eriliselt kutsutud "<M7410>Yubel - Terror Incarnate<M>" poolt ja ei saa olla eriliselt kutsutud muul viisil. Seda kaarti ei saa lahingus hävitada. Sa ei saa lahingukahju lahingutest, mis hõlmavad seda kaarti. Kahjustusetapi lõpus, kui see avatud rünnakupositsioonis kaart võitleb vastase koletisega: Tekita kahju, mis on võrdne selle koletise rünnakuga, oma vastasele, samuti hävita see koletis.

source: Armored Cybern
et: Soomustatud Kübern

source: Once per turn, during your Main Phase, you can equip this card to a "<M6390>Cyber Dragon<M>" you control, or to a Fusion Monster you control that lists "<M6390>Cyber Dragon<M>" as a Fusion Material Monster, OR unequip it to Special Summon this card in face-up Attack Position. Once per turn, while equipped to a monster by this effect, you can decrease the equipped monster's ATK by 1000 and destroy 1 face-up monster. (A monster can only by equipped with 11 Union Monster at a time. If the equipped monster would be destroyed, destroy this card instead.)
et: Korra ühe korra oma peafaasil saad selle kaardi kinnitada "<M6390>Cyber Dragon<M>"-ile, mida sa kontrollid, või Fusion Monsterile, mida sa kontrollid ja mis loetleb "<M6390>Cyber Dragon<M>"-i kui Fusion Material Monsterit, VÕI eemaldada see kinnitamine, et kutsuda see kaart eriliselt esile rünnakupositsioonis. Korra ühe korra, kui see on kinnitatud koletisele selle efekti abil, saad vähendada kinnitatud koletise ATK-d 1000 võrra ja hävitada 1 avatud koletis. (Koletis saab olla kinnitatud ainult 1 Union Monsteriga korraga. Kui kinnitatud koletis hävitatakse, hävita selle asemel see kaart.)

source: Cyber Valley
et: Küberorg

source: You can use 1 of these effects.<BR>● When this card is targeted for an attack by an opponent's monster: You can banish this card; draw 1 card, then end the Battle Phase.<BR>● You can target 1 face-up monster you control and this card; banish both that target and this card, then draw 2 cards.<BR>● You can target 1 card in your Graveyard; banish this card and 1 card from your hand, then place that target on top of the Deck.
et: Saad kasutada ühte neist efektidest.<BR>● Kui vastase koletis sihib seda kaarti rünnakuks: Saad selle kaardi eemaldada mängust; tõmba 1 kaart, seejärel lõpeta Lahingufaas.<BR>● Saad sihtida 1 avatud koletist, mida kontrollid, ja seda kaarti; eemalda mõlemad sihtmärgid mängust, seejärel tõmba 2 kaarti.<BR>● Saad sihtida 1 kaarti oma Hauakambris; eemalda see kaart ja 1 kaart oma käest mängust, seejärel aseta sihtmärk Paki peale.

source: Cyber Ouroboros
et: Küberne Ouroboros

source: When this card is removed from play, you can send 1 card from your hand to the Graveyard to draw 1 card.
et: Kui see kaart mängust eemaldatakse, võid saata 1 kaardi oma käest Hauakambrisse, et tõmmata 1 kaart.

source: Volcanic Counter
et: Vulkaani Vasturünnak

source: When you take Battle Damage while this card is in your Graveyard, remove it from play. Then, if there is a FIRE monster other than "<M7415>Volcanic Counter<M>" in your Graveyard, inflict damage to your opponent equal to the amount of Battle Damage you took.
et: Kui sa saad lahingukahju, kui see kaart on sinu hauas, eemalda see mängust. Seejärel, kui sinu hauas on mõni muu TULEMONSTER peale "<M7415>Volcanic Counter<M>", tekita oma vastasele kahju, mis on võrdne saadud lahingukahjuga.

source: Destiny Hero - Dunker
et: Saatuskangelane - Dunker

source: You can send 1 "Destiny HERO" card from your hand to the Graveyard; inflict 500 damage to your opponent.
et: Saad oma käest ühe "Destiny HERO" kaardi Hauakambrisse; tekitage oma vastasele 500 kahju.

source: Destiny Hero - Departed
et: Saatuskangelane - Lahkunud

source: During your Standby Phase, if this card is in your Graveyard: Special Summon it in face-up Attack Position to your opponent's side of the field. If this card is destroyed by battle, banish it instead of sending it to the Graveyard. If a card effect would send this card to the Graveyard from the hand or Deck, banish it instead.
et: Oma Standby Phase'i ajal, kui see kaart on sinu Hauakambris: Kutsu see eriliselt vastase väljaku avatud rünnakupositsioonile. Kui see kaart hävitatakse lahingus, siis selle asemel, et see Hauakambrisse saata, eemalda see mängust. Kui kaardi efekt saadaks selle kaardi käest või pakist Hauakambrisse, eemalda see mängust.

source: Dark Horus
et: Tume Horus

source: Once per turn, when a Spell Card is activated during your opponent's Main Phase, you can Special Summon 1 Level 4 DARK monster from your Graveyard.
et: Korra ühe käigu jooksul, kui sinu vastase peafaasil aktiveeritakse loitsukaart, saad sa eriliselt kutsuda 1. taseme 4 PIMEDUSE koletise oma hauakambrist.

source: The Dark Creator
et: Pimeuse Looja

source: This card cannot be Normal Summoned or Set. This card can only be Special Summoned, by having 5 or more DARK monsters in your Graveyard while you control no monsters. Once per turn, you can remove from play 1 DARK monster in your Graveyard to Special Summon 1 DARK monster from your Graveyard.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti saab eriliselt kutsuda ainult siis, kui sinu hauakambris on 5 või rohkem PIMEDUST koletist ja sa ei kontrolli ühtegi koletist. Kord käigu jooksul saad eemaldada oma hauakambrist mängust 1 PIMEDUST koletise, et eriliselt kutsuda 1 PIMEDUST koletise oma hauakambrist.

source: Dark Nephthys
et: Tume Nephthys

source: If this card is in your hand and there are 3 or more DARK monsters in your Graveyard, you can remove from play 2 of them to send it to the Graveyard. If this card is sent to the Graveyard by this effect, Special Summon it during your next Standby Phase. When this card is Special Summoned, destroy 1 Spell or Trap Card.
et: Kui see kaart on sinu käes ja sinu Hauakambris on 3 või rohkem PIMEDUS koletist, saad neist 2 mängust eemaldada, et see Hauakambrisse saata. Kui see kaart saadetakse selle efekti tõttu Hauakambrisse, kutsu see oma järgmise Ootefaasiga eriliselt välja. Kui see kaart kutsutakse eriliselt välja, hävita 1 Loitsu- või Lõksukaart.

source: Dark Armed Dragon
et: Pime Relvastatud Draakon

source: Cannot be Normal Summoned or Set. Must be Special Summoned (from your hand) by having exactly 3 DARK monsters in your Graveyard and cannot be Special Summoned by other ways. You can banish 1 DARK monster from your Graveyard to target 1 card on the field; destroy that target.
et: Ei saa normaalset kutsuda ega asetada. Peab olema eriliselt kutsutud (teie käest), kui teie hauakambris on täpselt 3 PIMEDUST koletist, ja ei saa olla eriliselt kutsutud muul viisil. Saate oma hauakambrist eemaldada 1 PIMEDUST koletise, et sihtida 1 kaarti väljal; hävitage see sihtmärk.

source: Dark Crusader
et: Tume Ristirüütel

source: You can send 1 DARK monster from your hand to the Graveyard to have this card gain 400 ATK.
et: Saad 1 PIMEDAS koletis oma käest Hauakambrisse, et see kaart saaks 400 ATK juurde.

source: Armageddon Knight
et: Armageddoni Rüütel

source: When this card is Summoned, you can send 1 DARK monster from your Deck to the Graveyard.
et: Kui see kaart kutsutakse välja, saad sa saata 1 PIMEDA koletise oma pakist hauakambrisse.

source: Doomsday Horror
et: Hukatuspäeva Õudus

source: The ATK and DEF of this card are each equal to the number of removed from play DARK monsters x 300. When this card is destroyed and sent to the Graveyard, return all removed from play DARK monsters to their owners' Graveyards.
et: Selle kaardi ATK ja DEF on võrdsed mängust eemaldatud PIMEDATE koletiste arvuga x 300. Kui see kaart hävitatakse ja saadetakse Hauakambrisse, tagasta kõik mängust eemaldatud PIMEDAD koletised nende omanike Hauakambritesse.

source: Obsidian Dragon
et: Obsidiaandraakon

source: Negate the effects of Spell and Trap Cards that target only 1 face-up DARK monster you control, and destroy them.
et: Negateeri ühe sinu kontrollitava avatud PIMEDA koletise sihtmärgiks olevate Loitsu- ja Lõksukaartide efektid ning hävita need.

source: Shadowpriestess of Ohm
et: Ohmi varjupreestrinna

source: You can Tribute 1 face-up DARK monster you control to inflict 800 damage to your opponent.
et: Sa saad ohverdada 1 avatud pimeduse koletise, mida sa kontrollid, et tekitada oma vastasele 800 kahju.

source: Gigaplant
et: Gigataim

source: This card is treated as a Normal Monster while face-up on the field or in the Graveyard. While this card is face-up on the field, you can Normal Summon it to have it be treated as an Effect Monster with this effect:<BR>● Once per turn, you can Special Summon 1 Insect-Type or Plant-Type monster from your hand or Graveyard.
et: See kaart loetakse tavaliseks koletiseks, kui see on väljaku peal või hauas. Kui see kaart on väljaku peal, võid selle normaalselt kutsuda, et seda loetaks efektikoletiseks järgmise efektiga:<BR>● Kord käigu jooksul võid eriliselt kutsuda ühe putukaliigi või taimeliigi koletise oma käest või hauast.

source: Future Samurai
et: Tuleviku samurai

source: This card is treated as a Normal Monster while face-up on the field or in the Graveyard. While this card is face-up on the field, you can Normal Summon it to have it be treated as an Effect Monster with this effect:<BR>● Once per turn, you can remove from play 1 monster from your Graveyard to destroy 1 face-up monster.
et: Seda kaarti käsitletakse tavalise koletisena, kui see on lahinguväljal või hauas. Kui see kaart on lahinguväljal, saate selle normaalselt kutsuda, et seda käsitletaks efektikoletisena järgmise efektiga:<BR>● Kord ühe käigu jooksul saate eemaldada oma hauast mängust 1 koletise, et hävitada 1 lahinguväljal olev koletis.

source: Vengeful Shinobi
et: Kättemaksuhimuline Shinobi

source: When this face-up Attack Position card is targeted for an attack: Draw 1 card.
et: Kui see avatud Rünnakupositsioonis kaart on rünnaku sihtmärk: Tõmba 1 kaart.

source: The Immortal Bushi
et: Surematu Bushi

source: This card cannot be Tributed, except for the Tribute Summon of a Warrior-Type monster. During your Standby Phase, if this card is in your Graveyard and you control no monsters, you can Special Summon it. You cannot activate this effect if there are any monsters in your Graveyard that are not Warrior-Type.
et: Seda kaarti ei saa ohverdada, välja arvatud Sõdalase-tüüpi koletise ohverdussummoniks. Sinu ootejärgus, kui see kaart on sinu hauas ja sul pole ühtegi koletist, saad selle erilisummonida. Sa ei saa seda efekti aktiveerida, kui sinu hauas on mõni koletis, mis ei ole Sõdalase-tüüpi.

source: Field-Commander Rahz
et: Väljakukomandör Rahz

source: When this card is Normal or Special Summoned: Choose 1 Level 4 or lower Warrior-Type monster from your Deck, except1 "<M7431>Field-Commander Rahz<M>", and place it on top of your Deck.
et: Kui see kaart on Normaal- või Erikutsutud: Vali oma pakist 1 4. taseme või madalama Sõdalase-tüüpi koletis, välja arvatud "<M7431>Field-Commander Rahz<M>", ja aseta see oma paki peale.

source: Gladiator Beast Darius
et: Gladiaatorikutsar Darius

source: When this card is Special Summoned by the effect of a "Gladiator Beast" monster: You can target 1 “Gladiator Beast” monster in your Graveyard; Special Summon that target, but its effect(s) is negated by this card, and it is shuffled into the Deck when this card leaves the field. At the end of the Battle Phase, if this card attacked or was attacked: You can shuffle it into the Deck; Special Summon 1 "Gladiator Beast" monster from your Deck, except1 "<M7432>Gladiator Beast Darius<M>".
et: Kui see kaart kutsutakse eriliselt välja "Gladiaatoribeast" koletise efekti abil: Sa saad valida 1 “Gladiaatoribeast” koletise oma Hauas; Kutsu see sihtmärk eriliselt välja, kuid selle efekt(id) on selle kaardi poolt tühistatud ja see segatakse tagasi Pakki, kui see kaart lahkub väljakult. Lahingu faasi lõpus, kui see kaart ründas või seda rünnati: Sa saad selle segada tagasi Pakki; Kutsu eriliselt välja 1 "Gladiaatoribeast" koletis oma Pakist, välja arvatud1 "<M7432>Gladiaatoribeast Darius<M>".

source: Black Veloci
et: Must Veloci

source: If this card attacks an opponent's monster, this card gains 400 ATK during the Damage Step only. If this card is attacked by an opponent's monster, this card loses 400 ATK during the Damage Step only.
et: Kui see kaart ründab vastase koletist, saab see kaart ainult Kahju Arvutamise sammu ajal 400 ATK juurde. Kui vastase koletis ründab seda kaarti, kaotab see kaart ainult Kahju Arvutamise sammu ajal 400 ATK.

source: Superancient Deepsea King Coelacanth
et: Superiidne süvamere kuningas koelakant

source: Once per turn, you can discard 1 card to Special Summon as many Level 4 or lower Fish-Type monsters as possible from your Deck. A monster Special Summoned by this effect cannot declare an attack and its effect(s) is negated while on the field. If this card is targeted by a Spell, Trap, or Effect Monster's effect, you can Tribute 1 other Fish-Type monster to negate the effect and destroy that card.
et: Korra ühe korra käigu jooksul saad sa ühe kaardi ära visata, et Kutsuda Eriliselt välja nii palju 4. taseme või madalamaid Kalatüüpi koletisi kui võimalik oma pakist. Selle efekti abil Eriliselt Väljakutsutud koletis ei saa rünnata ja tema efekt(id) on väljal olles tühistatud. Kui selle kaardi sihtmärgiks on Loits, Lõks või Efektkoletise efekt, saad sa ohverdada ühe teise Kalatüüpi koletise, et efekt tühistada ja see kaart hävitada.

source: Cannon Soldier MK-2
et: Kahuriväelane MK-2

source: You can Tribute 2 monsters to inflict 1500 damage to your opponent.
et: Sa saad ohverdada 2 koletist, et tekitada oma vastasele 1500 kahju.

source: The Calculator
et: Kalkulaator

source: This card's ATK is equal to the combined Levels of all monsters you control x 300.
et: Selle kaardi ATK on võrdne kõigi sinu kontrollitavate koletiste tasemete summaga x 300.

source: Sea Koala
et: Merekoala

source: Once per turn, if you control another Beast-Type monster, you can reduce the ATK of 1 monster your opponent controls to 0 until the End Phase.
et: Korra ühe korra käigu jooksul, kui sa kontrollid teist Beast-tüüpi koletist, saad vähendada ühe vastase kontrollitava koletise ATK-d 0-ni kuni End Phase'ini.

source: Blue Thunder T-45
et: Sinine Äike T-45

source: When this card destroys an opponent's monster by battle, Special Summon 1 "<M3938>Thunder Option Token<M>" (Machine-Type/LIGHT/Level 4/ATK 1500/DEF 1500). This Token cannot be Tributed for a Tribute Summon.
et: Kui see kaart hävitab lahingus vastase koletise, kutsu eriliselt välja 1 "<M3938>Thunder Option Token<M>" (Masina tüüp/VALGUS/Tase 4/ATK 1500/DEF 1500). Seda Tokenit ei saa kasutada ohverdusena ohverdussummoniks.

source: Magnetic Mosquito
et: Magnetiline Sääsk

source: FLIP: Destroy all face-up Machine-Type monsters on the field.
et: FLIP: Hävita kõik avatud Masinatüüpi koletised väljakul.

source: This card's name is also treated as "<M6771>Neo-Spacian Glow Moss<M>". This card cannot be Special Summoned except with "NEX". When this card attacks or is attacked, draw 1 card. Reveal that card, and based on its type apply the proper effect:<BR>● Monster: End the Battle Phase.<BR>● Spell: You can change this card's attack to a direct attack.<BR>● Trap: This monster is changed to Defense Position.
et: Selle kaardi nimeks loetakse ka "<M6771>Neo-Spacian Glow Moss<M>". Seda kaarti ei saa eriliselt kutsuda, välja arvatud "NEX"-iga. Kui see kaart ründab või teda rünnatakse, tõmba 1 kaart. Paljasta see kaart ja selle tüübi põhjal rakenda sobiv efekt:<BR>● Koletis: Lõpeta lahingufaas.<BR>● Loits: Sa võid muuta selle kaardi rünnaku otseseks rünnakuks.<BR>● Lõks: See koletis muudetakse kaitsepositsiooni.

source: Elemental Hero Storm Neos
et: Elementaalne Kangelane Tormi Neos

source: "<M6653>Elemental Hero Neos<M>" + "<M6769>Neo-Spacian Air Hummingbird<M>" + "<M6768>Neo-Spacian Aqua Dolphin<M>"<BR>Must first be Special Summoned (from your Extra Deck) by shuffling the above cards you control into the Deck. (You do not use "<M4837>Polymerization<M>".) Once per turn: You can destroy all Spell and Trap Cards on the field. During the End Phase: Shuffle this card into the Extra Deck. When this card is shuffled into the Extra Deck this way: Shuffle all cards on the field into the Deck.
et: "<M6653>Elemental Hero Neos<M>" + "<M6769>Neo-Spacian Air Hummingbird<M>" + "<M6768>Neo-Spacian Aqua Dolphin<M>"<BR>Peab kõigepealt olema eriliselt kutsutud (sinu lisapakist), segades ülaltoodud kaardid, mida sa kontrollid, tagasi pakki. (Sa ei kasuta "<M4837>Polymerization<M>".) Kord ühe käigu jooksul: Sa võid hävitada kõik Võlu- ja Lõksukaardid väljakul. Lõppfaasis: Sega see kaart tagasi lisapakki. Kui see kaart segatakse sel viisil lisapakki: Sega kõik kaardid väljakul tagasi pakki.

source: Rainbow Neos
et: Vikerkaare Neos
