Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: Destroy a number of face-up cards on the field equal to the number of face-up Attack Position "X-Saber" monsters you control.
et: Hävita väljakul olevate avatud kaartide arv, mis on võrdne sinu kontrolli all olevate avatud rünnakupositsioonis olevate "X-Saber" koletiste arvuga.

source: Sword of Sparkles
et: Sädemete Mõõk

source: Equip only to an "X-Saber" monster. If it destroys an opponent's monster by battle, you can destroy 1 card your opponent controls. You can Tribute 1 monster you control to return this card from your Graveyard to the top of your Deck.
et: Varusta ainult "X-Saber" koletisega. Kui see hävitab lahingus vastase koletise, võid hävitada 1 kaardi, mida vastane kontrollib. Sa võid ohverdada 1 koletise, mida sa kontrollid, et tagastada see kaart oma Hauakambrist oma Paki tippu.

source: Rekindling
et: Taassüttimine

source: Special Summon from your Graveyard as many FIRE monsters as possible with 200 DEF. During the End Phase, remove from play all monsters that were Special Summoned by this effect.
et: Erikutsuge oma kalmistult nii palju TULEKAHJU koletisi kui võimalik, kellel on 200 DEF. Lõppfaasi ajal eemalda mängust kõik koletised, kes selle efekti abil Erikutsuti.

source: Ancient Leaf
et: Muistne Leht

source: If you have 9000 Life Points or more, you can pay 2000 Life Points to draw 2 cards.
et: Kui sul on 9000 või rohkem Elupunkte, saad maksta 2000 Elupunkti, et tõmmata 2 kaarti.

source: Fossil Dig
et: Fossiilikaevandus

source: Add 1 Level 6 or lower Dinosaur-Type monster from your Deck to your hand.
et: Lisa oma pakist 1 tase 6 või madalama tasemega Dinosauruse-tüüpi koletis oma kätte.

source: Skill Successor
et: Oskuste Järglane

source: Select 1 face-up monster you control. It gains 400 ATK until the End Phase. You can remove from play this card in the Graveyard to give 1 face-up monster you control 800 ATK until the End Phase. This effect cannot be activated the turn this card is sent to the Graveyard, and can only be activated during your turn.
et: Vali 1 avatud positsioonis olev koletis, mida sa kontrollid. See saab 400 ATK juurde kuni End Phase'ini. Sa võid eemaldada selle kaardi oma Hauakambrist mängust, et anda 1 avatud positsioonis olevale koletisele, mida sa kontrollid, 800 ATK juurde kuni End Phase'ini. Seda efekti ei saa aktiveerida samal käigul, kui see kaart saadeti Hauakambrisse, ja seda saab aktiveerida ainult sinu käigu ajal.

source: Reinforce Truth
et: Tõe Tugevdamine

source: Special Summon 1 Level 2 or lower Warrior-Type monster from your Deck. You cannot conduct your Battle Phase the turn you activate this card.
et: Erikutsuge oma pakist 1. taseme või madalama tasemega Sõdalase-tüüpi koletis. Sa ei saa sellel käigul, mil sa selle kaardi aktiveerid, oma Lahingufaasi läbi viia.

source: Pixie Ring
et: Haldjaring

source: If you control 2 or more Attack Position monsters, your opponent cannot select your monster(s) with the lowest ATK as an attack target.
et: Kui sul on kontrolli all 2 või rohkem Rünnakupositsioonis koletist, ei saa sinu vastane valida sinu madalaima ATK-ga koletist rünnaku sihtmärgiks.

source: Fairy Wind
et: Haldjatuul

source: Destroy all other face-up Spell and Traps on the field. Both players take damage equal to the total number of cards destroyed by this effect x 300.
et: Hävita kõik teised avatud Võlu- ja Lõksukaardid väljal. Mõlemad mängijad saavad kahju, mis on võrdne selle efekti poolt hävitatud kaartide koguarvuga x 300.

source: Imperial Custom
et: Imperaatori Komme

source: Face-up Continuous Trap Cards cannot be destroyed, except "<M8357>Imperial Custom<M>". You can control only 1 face-up "<M8357>Imperial Custom<M>".
et: Püsti pidevaid lõksukaarte ei saa hävitada, välja arvatud "<M8357>Imperial Custom<M>". Sa saad kontrollida ainult ühte püstist "<M8357>Imperial Custom<M>".

source: Discord
et: Ebamõla

source: Neither player can Synchro Summon. Send this card to the Graveyard during your 3rd End Phase after activation.
et: Kumbki mängija ei saa Sünkro Kutsuda. Saada see kaart Hauakambrisse oma 3. lõppfaasis pärast aktiveerimist.

source: Slip of Fortune
et: Õnne libisemine

source: Activate only when your opponent's monster declares an attack targeting a monster. Negate the attack and remove from play the attack target monster until the next Standby Phase.
et: Aktiveeri ainult siis, kui sinu vastase koletis kuulutab välja rünnaku, mis on suunatud koletisele. Tühista rünnak ja eemalda mängust rünnaku sihtmärgiks olev koletis kuni järgmise Ootefaasini.

source: Depth Amulet
et: Sügavuse Amulett

source: When an opponent's monster declares an attack, you can discard 1 card from your hand to the Graveyard and negate the attack. This card is destroyed during your opponent's 3rd End Phase after activation.
et: Kui vastase koletis kuulutab välja rünnaku, võid sa oma käest ühe kaardi Hauakambrisse visata ja rünnaku tühistada. See kaart hävitatakse sinu vastase 3. lõppfaasis pärast aktiveerimist.

source: Damage Translation
et: Kahju Tõlge

source: Halve all Effect Damage you take this turn. During the End Phase this turn, Special Summon 1 "<M3958>Ghost Token<M>" (Fiend-Type/DARK/Level 1/ATK 0/DEF 0) in Defense Position for each time you took effect damage this turn.
et: Vähenda kogu sellel käigul saadavat efektikahju poole võrra. Selle käigu lõppfaasis kutsu eriliselt välja 1 "<M3958>Kummituse Määrang<M>" (Deemonitüüp/PIMEDUS/Tase 1/ATK 0/DEF 0) kaitsepositsioonis iga kord, kui sa sellel käigul efektikahju said.

source: Battle Teleportation
et: Lahinguteleportatsioon

source: If you control only 1 face-up Psychic-Type monster, activate by selecting that 1 monster. It can attack your opponent directly this turn. At the end of the Battle Phase of this turn, give control of it to your opponent.
et: Kui sa kontrollid ainult 1 avatud Psüühika-tüüpi koletist, aktiveeri valides selle 1 koletise. See võib sellel käigul rünnata otse sinu vastast. Selle käigu Lahingufaasi lõpus anna selle kontroll oma vastasele.

source: Core Reinforcement
et: Tuuma tugevdamine

source: Select and Special Summon 1 "Koa'ki Meiru" monster from your Graveyard in Attack Position. When that monster is destroyed during your End Phase, the controller of this card takes damage equal to that monster's ATK. When this card is removed from the field, destroy that monster. When that monster is destroyed, destroy this card.
et: Vali ja Kutsu Eriliselt välja 1 "Koa'ki Meiru" koletis oma Hauakambrist Rünnakupositsioonis. Kui see koletis hävitatakse sinu Lõppfaasis, saab selle kaardi kontrollija kahju, mis on võrdne selle koletise ATK-ga. Kui see kaart eemaldatakse väljakult, hävita see koletis. Kui see koletis hävitatakse, hävita see kaart.

source: Iron Core Luster
et: Raudse Tuuma Sära

source: Reveal 1 "<M8207>Iron Core of Koa'ki Meiru<M>" in your hand. Negate the activation of your opponent's Spell or Trap Card and destroy it.
et: Paljasta oma käes olev "<M8207>Iron Core of Koa'ki Meiru<M>". Tühista vastase Loitsu- või Lõksukaardi aktiveerimine ja hävita see.

source: Battle of the Elements
et: Elementide lahing

source: Activate only while all monsters on the field are face-up. Both players send monsters they control to the Graveyard so that they each control only 1 Attribute.
et: Aktiveeri ainult siis, kui kõik koletised väljakul on avatud. Mõlemad mängijad saadavad koletised, mida nad kontrollivad, Hauakambrisse, nii et neil oleks kontrolli all ainult 1 Atribuut.

source: Aegis of the Ocean Dragon Lord
et: Ookeani Draakoni Isanda Egiid

source: Until the End Phase of this turn, all face-up Level 3 or lower WATER monsters you control cannot be destroyed by battle or by card effects.
et: Kuni selle käigu lõppfaasini ei saa kõik sinu kontrollitavad avatud 3. taseme või madalamad VEE koletised lahingus või kaardiefektide tõttu hävitatud.

source: Psychic Soul
et: Psüühiline Hing

source: Tribute 1 Psychic-Type monster you control. Gain Life Points equal to the Level of the Tributed monster × 300.
et: Lohverda 1 sinu kontrolli all olev Psüühika-tüüpi koletis. Saa Elupunkte, mis on võrdne lohverdatud koletise tasemega × 300.

source: Flamvell Counter
et: Flamvelli Vasturünnak

source: Remove from play 1 FIRE monster in your Graveyard with 200 DEF. Negate the activation of a Spell or Trap card, and destroy it.
et: Eemalda oma kalmistult mängust 1 FIRE koletis, mille DEF on 200. Tühista loitsu või lõksukaardi aktiveerimine ja hävita see.

source: At One With the Sword
et: Üks Mõõgaga

source: Activate while the only monster you control is 1 face-up "X-Saber" monster. Equip this card to that monster. It gains 800 ATK. If it destroys your opponent's monster by battle, draw 1 card.
et: Aktiveeri, kui ainus koletis, mida sa kontrollid, on 1 avatud "X-Saber" koletis. Varusta see kaart sellele koletisele. See saab 800 ATK juurde. Kui see hävitab lahingus sinu vastase koletise, tõmba 1 kaart.

source: A Major Upset
et: Suur üllatus

source: Tribute 1 face-up Attack Position Level 2 or lower monster you control. Return all face-up Level 7 or higher Special Summoned monsters to the hand.
et: Lohista 1 avatud ründeasendis 2. või madalama taseme koletis, mida sa kontrollid. Tagasta kõik avatud 7. või kõrgema taseme erikutsutud koletised käele.

source: Battlestorm
et: Lahingutorm

source: This card gains 100 ATK for every face-up Winged-Beast-Type monster you control. Once per turn, if you control 3 or more face-up Winged-Beast-Type monsters, you can destroy 1 Spell or Trap Card your opponent controls.
et: See kaart saab 100 ATK iga avatud Winged-Beast-tüüpi koletise eest, mida sa kontrollid. Kord käigu jooksul, kui sa kontrollid 3 või enamat avatud Winged-Beast-tüüpi koletist, saad hävitada 1 Loitsu või Lõksukaardi, mida su vastane kontrollib.

source: Koa'ki Meiru War Arms
et: Koa'ki Meiru Sõjarelvad

source: During each of your End Phases, destroy this card unless you send 1 "<M8207>Iron Core of Koa'ki Meiru<M>" from your hand to the Graveyard or reveal 1 Warrior-Type monster in your hand. Once per turn, you can select 1 Level 3 or lower Warrior-Type monster in your Graveyard and equip it to this card. This card gains ATK equal to half of those equipped cards' combined ATK. If this card would be destroyed by battle, the equipped monsters are destroyed instead. (There is no limit to the number of monsters that can be equipped to this card)
et: Iga oma lõppfaasi hävita see kaart, kui sa ei saada 1 "<M8207>Koa'ki Meiru Raudtuum<M>" oma käest Hauakambrisse või ei näita 1 Sõdalase-tüüpi koletist oma käes. Kord ühe käigu jooksul saad valida 1 3. taseme või madalama Sõdalase-tüüpi koletise oma Hauakambris ja kinnitada see sellele kaardile. See kaart saab ATK-d, mis on võrdne poolega nende kinnitatud kaartide kombineeritud ATK-st. Kui see kaart hävitatakse lahingus, hävitatakse selle asemel kinnitatud koletised. (Sellele kaardile kinnitatavate koletiste arv ei ole piiratud)

source: Immortal Ruler
et: Surem valitseja

source: This card cannot be Special Summoned. You can Tribute this card to add 1 "<M7857>Zombie World<M>" from your Graveyard to your hand.
et: Seda kaarti ei saa eriliselt kutsuda. Sa saad selle kaardi ohverdada, et lisada 1 "<M7857>Zombie World<M>" oma hauakambrist oma kätte.

source: Hardened Armed Dragon
et: Kõvenenud Relvastatud Draakon

source: You can send 1 Level 8 or higher monster from your hand to the Graveyard and Special Summon this card. If you Tribute this card for the Tribute Summon of a Level 7 or higher monster, that monster cannot be destroyed by card effects.
et: Saadad ühe 8. või kõrgema taseme koletise oma käest Hauakambrisse ja Kutsud selle kaardi Eriliselt välja. Kui sa ohverdad selle kaardi 7. või kõrgema taseme koletise Ohverduskutsumiseks, ei saa seda koletist kaardiefektidega hävitada.

source: When this card is destroyed by battle and sent to the Graveyard, you can add 1 Level 4 Beast-Type monster from your Graveyard to your hand.
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse, saad lisada oma Hauakambrist oma kätte 1 4. taseme Metstüüpi koletise.

source: Beast Striker
et: Metssõdalane

source: Once per turn, you can discard 1 card to Special Summon 1 "Moja" from your Deck.
et: Korra ühe korra käigu jooksul saad sa ühe kaardi ära visata, et kutsuda oma pakist välja 1 "Moja".

source: King of the Beasts
et: Metste kuningas

source: You can Tribute 1 face-up "Moja" you control to Special Summon this card from your hand or Graveyard. There can only be 1 face-up "<M8377>King of the Beasts<M>" on the field.
et: Saad ohverdada 1 avatud "Moja", mida sa kontrollid, et Kutsuda see kaart oma käest või Hauast. Väljakul võib olla ainult 1 avatud "<M8377>Beastide Kuningas<M>".

source: Swallow's Nest
et: Pääsukese Pesa

source: Tribute 1 face-up Winged Beast-Type monster you control to Special Summon 1 Winged Beast-Type monster from the Deck with the same Level as the Tributed monster.
et: Ohverda 1 avatud Näoga Tiivulise Olendi-tüüpi koletis, mida sa kontrollid, et Kutsuda Eriliselt 1 Tiivulise Olendi-tüüpi koletis Tekist, mille tase on sama, mis Ohverdatud koletisel.

source: Overwhelm
et: Ülekaal

source: Activate only while you control a face-up Level 7 or higher monster that was Tribute Summoned. Negate the activation of a Trap Card, or an Effect Monster's effect and destroy that card.
et: Aktiveeri ainult siis, kui sa kontrollid avatud taseme 7 või kõrgemat koletist, mis oli ohverdatud kutsumise teel. Tühista lõksukaardi aktiveerimine või efektkoletise efekt ja hävita see kaart.

source: Once per turn, during your Main Phase or your opponent's Battle Phase, you can select 2 face-up Beast-Type monsters on the field. Until the end of the turn, 1 of the selected monsters loses half its ATK, and the other monster gains an equal amount of ATK.
et: Kord ühe korra oma peafaasil või vastase lahingufaasis saad valida 2 avatud Beast-tüüpi koletist väljal. Kuni käigu lõpuni kaotab üks valitud koletis pool oma ATK-st ja teine koletis saab sama palju ATK-d juurde.

source: Darklord Desire
et: Pimeduseisand Soov

source: Cannot be Special Summoned. You can Tribute Summon this card by Tributing 1 Fairy-Type monster. Once per turn: You can target 1 monster your opponent controls; this card lose 1000 ATK, and you send that target to the Graveyard.
et: Ei saa erikutsuda. Sa saad selle kaardi kutsuda ohverdades 1 haldjatüüpi koletise. Kord ühe käigu jooksul: Sa saad valida 1 koletise, mida sinu vastane kontrollib; see kaart kaotab 1000 ATK ja sa saadad selle sihtmärgi Hauakambrisse.

source: This card gains 200 ATK for each face-up "Dragunity" card you control. When this card is Normal Summoned, you can select 1 Level 3 or lower Dragon-Type "Dragunity" monster in your Graveyard and equip it as an Equip Card to this card.
et: See kaart saab 200 ATK iga avatud "Dragunity" kaardi eest, mida sa kontrollid. Kui see kaart on Normaal-Summonitud, saad valida 1 Tase 3 või madalama Draakoni-Tüüpi "Dragunity" koletise oma Hauas ja varustada see Varustuskaardina sellele kaardile.

source: Dragunity Legionnaire
et: Dragunity leegionär

source: When this card is Normal Summoned, you can select 1 Level 3 or lower "Dragunity" Dragon-Type monster in your Graveyard, and equip it to this card as an Equip Card. You can send 1 "Dragunity" card from your Spell & Trap Card Zone to the Graveyard to select 1 face-up monster your opponent controls, and destroy it.
et: Kui see kaart on Normaal-Kutsutud, saad valida 1. taseme 3 või madalama "Dragunity" Draakoni-Tüüpi koletise oma Hauas ja kinnitada see kaart sellele kaardile Varustuse Kaardina. Sa saad saata 1 "Dragunity" kaardi oma Loitsu & Lõksu Kaardi Tsoonist Hauale, et valida 1 vastase kontrollitav avatud koletis ja hävitada see.

source: When this card is Normal or Special Summoned, you can send 1 Level 3 or lower Dragon-Type monster from your Deck to the Graveyard.
et: Kui see kaart on Normaal- või Erikutsutud, saad sa saata 1 taseme 3 või madalama Draakoni-tüüpi koletise oma pakist hauakambrisse.

source: Dragunity Darkspear
et: Dragunity Tumepii

source: Once per turn, you can Tribute 1 Dragon-Type "Dragunity" monster to select and Special Summon 1 Level 4 or lower Winged Beast-Type monster from your Graveyard.
et: Korra ühe korra käigu jooksul saad sa ohverdada ühe Draakoni-tüüpi "Dragunity" koletise, et valida ja eriliselt kutsuda oma Hauakambrist välja üks 4. taseme või madalama Tiiivulise Metssiga-tüüpi koletis.

source: Once per turn, while this card is equipped to a monster as an Equip Card by a card effect, you can Special Summon this card.
et: Korra ühe korra käigu jooksul, kui see kaart on kaardiefekti abil varustuskaardina koletisele varustatud, saad selle kaardi eriliselt kutsuda.

source: Fabled Dyf
et: Muinasjutuline Dyf

source: When a "Fabled" monster(s) is sent from the hand to your Graveyard, you can Tribute this card to select 1 of those monster(s) and Special Summon it.
et: Kui "Fabled" koletis(ed) saadetakse käest sinu Hauakambrisse, võid sa ohverdada selle kaardi, et valida üks neist koletistest ja Kutsuda see Eriliselt välja.

source: Fabled Ashenveil
et: Muinasjuttude Ashenveil

source: If this card battles with your opponent's monster, you can send 1 card from your hand to the Graveyard during damage calculation to have this card gain 600 ATK during damage calculation only.
et: Kui see kaart võitleb sinu vastase koletisega, saad sa saata 1 kaardi oma käest Hauakambrisse kahju arvutamise ajal, et see kaart saaks kahju arvutamise ajal ainult 600 ATK juurde.

source: Fabled Oltro
et: Muinasjutt Oltro

source: Once per turn, you can send 1 card from your hand to the Graveyard to Special Summon 1 Level 3 "Fabled" monster from your hand.
et: Korra ühe käigu jooksul saad saata 1 kaardi oma käest Hauakambrisse, et Kutsuda Eriliselt välja 1 3. taseme "Fabled" koletis oma käest.

source: This card cannot be Special Summoned. While face-up on the field, this card cannot be targeted by the effects of Traps or Effect Monsters. Once per turn, you can remove from play 1 "Jurrac" monster with 1700 or less ATK from your Graveyard to have this card gain 1000 ATK until the End Phase.
et: Seda kaarti ei saa eriliselt kutsuda. Kui see kaart on väljakul avatud, ei saa seda sihtida lõksude või efektikoletiste mõjudega. Kord ühe käigu jooksul võid eemaldada oma hauakambrist mängust ühe "Jurrac" koletise, mille ATK on 1700 või vähem, et see kaart saaks End Phase'ini 1000 ATK juurde.

source: If this card destroys an opponent's monster by battle, you can Special Summon 1 "Jurrac" monster with 1700 or less ATK from your Deck. It cannot declare an attack this turn.
et: Kui see kaart hävitab lahingus vastase koletise, saad eriliselt kutsuda 1 "Jurrac" koletise, millel on 1700 või vähem rünnakupunkte, oma pakist. See ei saa sel käigul rünnata.

source: If this card is destroyed by battle, Special Summon 2 "<M3959>Jurrac Token<M>"s (Dinosaur-Type/FIRE/Level 1/ATK 0/DEF 0) in Defense Position. These Tokens cannot be Tributed for a Tribute Summon, unless it is for a "Jurrac" monster.
et: Kui see kaart hävitatakse lahingus, kutsu eriliselt välja 2 "<M3959>Jurrac Token<M>"it (Dinosauruse tüüp/TULI/Tase 1/ATK 0/DEF 0) kaitsepositsioonis. Neid žetoone ei saa kasutada ohverdusena ohverdussummoniks, välja arvatud juhul, kui see on "Jurrac" koletis.

source: Naturia Horneedle
et: Naturia Sarvokas

source: When your opponent Special Summons a monster, you can Tribute 1 face-up "Naturia" monster you control, except this card, to destroy the Special Summoned monster.
et: Kui sinu vastane kutsub eriliselt välja koletise, võid sa ohverdada ühe avatud "Naturia" koletise, mida sa kontrollid, välja arvatud see kaart, et hävitada eriliselt välja kutsutud koletis.

source: Naturia Fruitfly
et: Naturia Puuviljakärbes

source: All face-up monsters your opponent controls lose 300 ATK and DEF for each face-up "Naturia" monster you control. Once per turn, you can select 1 face-up monster your opponent controls with 0 DEF, and take control of it until the End Phase.
et: Kõik sinu vastase kontrollitavad avatud positsioonis olevad koletised kaotavad 300 ATK ja DEF iga sinu kontrollitava avatud positsioonis oleva "Naturia" koletise kohta. Kord ühe käigu jooksul saad valida ühe sinu vastase kontrollitava avatud positsioonis oleva koletise, mille DEF on 0, ja võtta selle enda kontrolli alla kuni End Phase'ini.

source: Naturia Hydrangea
et: Naturia Hortensia

source: If the effect of a "Naturia" monster you control was activated during this turn, you can Special Summon this card from your hand.
et: Kui sellel käigul aktiveeriti sinu kontrollitava "Naturia" koletise efekt, saad selle kaardi oma käest eriliselt kutsuda.

source: R-Genex Accelerator
et: R-Genex Kiirendi

source: When a "Genex" monster(s) is added from your Deck to your hand, you can reveal that monster to Special Summon it.
et: Kui "Genex" koletis(ed) lisatakse sinu pakist sinu kätte, saad selle koletise paljastada, et see eriliselt välja kutsuda.

source: R-Genex Oracle
et: R-Genex Oraakel

source: If this card is added from your Deck to your hand by the effect of a "Genex" monster, you can Special Summon this card. This card cannot be used as a Synchro Material Monster, except for the Synchro Summon of a "Genex" monster.
et: Kui see kaart lisatakse sinu pakist sinu kätte "Genex" koletise efekti abil, saad selle kaardi eriliselt kutsuda. Seda kaarti ei saa kasutada Sünkro Materjal Koletisena, välja arvatud "Genex" koletise sünkrokutsumiseks.

source: When this face-up card on the field is destroyed and sent to the Graveyard, you can select 2 "Genex" monsters from your Graveyard, and return them to the Deck.
et: Kui see avatud kaart väljal hävitatakse ja saadetakse Hauakambrisse, saad valida 2 "Genex" koletist oma Hauakambrist ja tagastada need pakki.

source: Spellbreaker of the Ice Barrier
et: Jääbarjääri Loitsumurdja

source: Once per turn, you can send 1 "Ice Barrier" monster from your hand to the Graveyard. If you do, Spell Cards cannot be activated until the End Phase of your next turn, as long as this card remains face-up on the field.
et: Korra ühe käigu jooksul saad saata 1 "Ice Barrier" koletise oma käest Hauakambrisse. Kui sa seda teed, ei saa Loitsukaardid aktiveerida kuni sinu järgmise käigu Lõppfaasini, seni kuni see kaart jääb väljale avatud olekusse.

source: General Grunard of the Ice Barrier
et: Jääbarjääri kindral Grunard

source: During your Main Phase, you can Normal Summon 1 "Ice Barrier" monster in addition to your Normal Summon or Set. This effect can only be used once per turn.
et: Oma peafaasiajal saad sa lisaks oma tavapärasele kutsumisele või asetamisele kutsuda ühe "Jääbarjääri" koletise. Seda efekti saab kasutada ainult üks kord käigu jooksul.

source: Ally of Justice Omni-Weapon
et: Õigluse Liitlase Kõikrelv

source: When this card destroys a LIGHT monster by battle and sends it to the Graveyard, draw 1 card. If that card is a Level 4 or lower DARK monster, you can reveal that card to Special Summon it.
et: Kui see kaart hävitab lahingus LIGHT koletise ja saadab selle Hauakambrisse, tõmba 1 kaart. Kui see kaart on Tase 4 või madalam DARK koletis, võid selle kaardi paljastada, et see Eriliselt Kutsuda.

source: Ally of Justice Quarantine
et: Õigluse Liitlane Karantiin

source: Neither player can Special Summon LIGHT monsters.
et: Kumbki mängija ei saa erikutsuda VALGUSE koletisi.

source: Ally of Justice Cycle Reader
et: Õigluse Liitlane Tsüklilugeja

source: During either player's turn, you can discard this card to select and remove from play up to 2 LIGHT monsters from your opponent's Graveyard.
et: Mõlema mängija käigu ajal saad selle kaardi ära visata, et valida ja eemaldada mängust kuni 2 VALGUSE koletist oma vastase Hauakambrist.

source: Worm Warlord
et: Ussisõdalane
