Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: The End of Anubis
et: <translated Anubise lõpp

source: While this card is face-up on the field, all effects of Spell, Trap, and Monster Cards that target a card(s) in the Graveyard or that activate in the Graveyard are negated.
et: Kui see kaart on lahinguväljal avatud, tühistatakse kõik Võlu-, Lõksu- ja Koletiskaartide efektid, mis sihivad kaarti või kaarte hauas või aktiveeruvad hauas.

source: When this card is Normal Summoned, shuffle all removed from play cards into their owners' Decks. This card gains 100 ATK for each of those cards. When this card is removed from play, both players remove from play the top 5 cards of their Deck.
et: Kui see kaart on Normaal-Kutsutud, sega kõik mängust eemaldatud kaardid nende omanike pakkidesse. See kaart saab 100 ATK iga sellise kaardi eest. Kui see kaart eemaldatakse mängust, eemaldavad mõlemad mängijad mängust oma paki 5 ülemist kaarti.

source: Gandora the Dragon of Destruction
et: Hävituse Draakon Gandora

source: This card cannot be Special Summoned. During your Main Phase, you can pay half your Life Points to destroy, and remove from play, all other cards on the field, and this card gains 300 ATK for each card destroyed this way. Send this card to the Graveyard during the End Phase of the turn it was Summoned.
et: Seda kaarti ei saa eriliselt kutsuda. Oma peafaasi ajal võid maksta poole oma elupunktidest, et hävitada ja eemaldada mängust kõik teised kaardid väljakul, ning see kaart saab 300 ATK iga sel viisil hävitatud kaardi eest. Saada see kaart hauakambrisse selle käigu lõppfaasis, mil see kutsuti.

source: Return from the Different Dimension
et: Tagasi Teisest Dimensioonist

source: Pay half your Life Points. Special Summon as many of your removed from play monsters as possible. During the End Phase, remove from play all monsters that were Special Summoned by this effect.
et: Maksa pool oma Elupunktidest. Kutsu eriliselt välja nii palju oma mängust eemaldatud koletisi kui võimalik. Lõppfaasis eemalda mängust kõik koletised, mis selle efekti abil eriliselt välja kutsuti.

source: Pyramid of Light
et: Valguse Püramiid

source: If this face-up card is removed from your side of the field, destroy "<M6087>Andro Sphinx<M>" and "<M6088>Sphinx Teleia<M>" on your side of the field and remove them from play.
et: Kui see avatud kaart eemaldatakse sinu väljalt, hävita "<M6087>Andro Sphinx<M>" ja "<M6088>Sphinx Teleia<M>" sinu väljalt ja eemalda need mängust.

source: Blue-Eyes Shining Dragon
et: Särasilmne Sinine Draakon

source: This card cannot be Normal Summoned or Set. This card cannot be Special Summoned except by Tributing 1 "<M4386>Blue-Eyes Ultimate Dragon<M>" you control. This card gains 300 ATK for each Dragon-Type monster in your Graveyard. You can negate the effects of Spells, Traps, and Effect Monsters that target this card.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti ei saa eriliselt kutsuda, välja arvatud, kui ohverdate 1 "<M4386>Sinisilmne Ülim Draakon<M>", mida te kontrollite. See kaart saab 300 ATK iga teie hauas oleva Draakoni-tüüpi koletise eest. Saate tühistada selle kaarti sihtivate Loitsude, Lõksude ja Efektikoletiste mõju.

source: Familiar Knight
et: Tuttav Rüütel

source: When this card is destroyed by battle and sent to the Graveyard, each player can Special Summon 1 Level 4 monster from their hand.
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse, võib iga mängija eriliselt kutsuda 1 4. taseme koletise oma käest.

source: Rare Metal Dragon
et: Haruldane Metallist Draakon

source: This card cannot be Normal Summoned or Set.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada.

source: Peten the Dark Clown
et: Peten, Tume Kloun

source: When this card is sent to your Graveyard, you can remove from play this card from the Graveyard to Special Summon 1 "<M6085>Peten the Dark Clown<M>" from your hand or Deck.
et: Kui see kaart saadetakse sinu Hauakambrisse, võid selle kaardi Hauakambrist mängust eemaldada, et Kutsuda Eriliselt 1 "<M6085>Peten the Dark Clown<M>" oma käest või Pakist.

source: Sorcerer of Dark Magic
et: Pimeduse Maagia Nõid

source: This card cannot be Normal Summoned or Set. This card cannot be Special Summoned except by Tributing 2 Level 6 or higher Spellcaster-Type monsters. You can negate the activation of any Trap Cards and destroy them.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti ei saa eriliselt kutsuda, välja arvatud, kui ohverdate 2 6. või kõrgema taseme Loitsija-tüüpi koletist. Saate tühistada mis tahes Lõksukaartide aktiveerimise ja need hävitada.

source: Andro Sphinx
et: Andro Sfinks

source: You can pay 500 Life Points to Special Summon this card when "<M6079>Pyramid of Light<M>" is on the field. This card cannot attack during the turn it is Normal Summoned or Special Summoned. This card cannot be Special Summoned from the Graveyard. If this card destroys a Defense Position monster as a result of battle, inflict damage to your opponent's Life Points equal to half the ATK of the destroyed monster.
et: Saad maksta 500 elupunkti, et kutsuda see kaart eriliselt välja, kui "<M6079>Püramiidvalgus<M>" on väljakul. See kaart ei saa rünnata sellel käigul, mil see on tavaliselt või eriliselt välja kutsutud. Seda kaarti ei saa hauast eriliselt välja kutsuda. Kui see kaart hävitab lahingu tulemusena kaitsepositsioonis oleva koletise, põhjusta oma vastasele kahju, mis on võrdne hävitatud koletise rünnakupunktide poolega.

source: Sphinx Teleia
et: Sfinks Teleia

source: You can pay 500 Life Points to Special Summon this card when "<M6079>Pyramid of Light<M>" is on the field. This card cannot attack during the turn it is Normal Summoned or Special Summoned. This card cannot be Special Summoned from the Graveyard. If this card destroys a Defense Position monster as a result of battle, inflict damage to your opponent's Life Points equal to half the DEF of the destroyed monster.
et: Sa saad maksta 500 Elupunkti, et Kutsuda see kaart Eriliselt välja, kui "<M6079>Valguse Püramiid<M>" on väljakul. See kaart ei saa rünnata sellel käigul, mil see on Tavaliselt Kutsutud või Eriliselt Kutsutud. Seda kaarti ei saa Eriliselt Kutsuda Hauakambrist. Kui see kaart hävitab Lahingu tulemusena Kaitseasendis oleva koletise, põhjusta oma vastasele kahju, mis on võrdne hävitatud koletise poole Kaitseväärtusega.

source: Theinen the Great Sphinx
et: Theinen, Suur Sfinks

source: This card cannot be Normal Summoned or Set. This card cannot be Special Summoned except by paying 500 Life Points when both "<M6087>Andro Sphinx<M>" and "<M6088>Sphinx Teleia<M>" on your side of the field are destroyed at the same time; then you can Special Summon this monster from your hand or Deck. When this card is Special Summoned successfully, pay 500 Life Points to increase the ATK of this card by 3000 points until the end of the End Phase.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti ei saa eriliselt kutsuda, välja arvatud juhul, kui maksate 500 elupunkti, kui mõlemad "<M6087>Andro Sphinx<M>" ja "<M6088>Sphinx Teleia<M>" teie väljaku poolel hävitatakse samal ajal; siis saate selle koletise oma käest või pakist eriliselt kutsuda. Kui see kaart on edukalt eriliselt kutsutud, makske 500 elupunkti, et suurendada selle kaardi rünnakupunkte 3000 punkti võrra kuni lõppfaasi lõpuni.

source: Inferno Tempest
et: Põrgutorm

source: When you take 3000 or more Battle Damage from 1 attack, you can activate this card. Remove all monsters in each player's Deck and Graveyard from play.
et: Kui sa saad ühe rünnaku käigus 3000 või rohkem lahingukahju, saad selle kaardi aktiveerida. Eemalda kõik koletised mõlema mängija pakist ja hauakambrist mängust.

source: If this card is added to your hand from your Deck by the effect of a Spell, Trap or Monster Card, you can Special Summon this card on your side of the field.
et: Kui see kaart lisatakse sinu kätte sinu pakist loitsu, lõksu või koletise kaardi efekti tõttu, saad selle kaardi eriliselt kutsuda oma väljaku poolele.

source: Charcoal Inpachi
et: Süsi-Inpachi

source: A wicked wooden spirit that has burned out. The barbecue grilled with this charcoal is so awesome that everybody thinks it's priceless.
et: Põlenud kurjakuulutav puuvaim. Selle söega grillitud barbecue on nii suurepärane, et kõik arvavad, et see on hindamatu.

source: The true nature of this wizard, who rules all water. It defends itself with a vast, impenetrable wall of ice.
et: Selle võluri tõeline olemus, kes valitseb kogu vett. See kaitseb end tohutu, läbimatu jääseinaga.

source: Skull Dog Marron
et: Kolju Koer Marron

source: A lost dog that wandered off 1000 years ago. He's still waiting for his master to come for him.
et: Koer, kes eksis ära 1000 aastat tagasi. Ta ootab endiselt oma peremeest, et see talle järele tuleks.

source: Goblin Calligrapher
et: Goblini kalligraaf

source: A Goblin who devotes himself to mastering perfect calligraphy of the word "False". He gives his all to each stroke.
et: Goblin, kes pühendub sõna "Vale" täiusliku kalligraafia valdamisele. Ta annab endast kõik iga tõmbe jaoks.

source: Ultimate Insect LV1
et: Ülim Putukas LV1

source: While this card is on the field, it is unaffected by the effects of Spell Cards. During your Standby Phase, by sending this face-up card to the Graveyard, Special Summon 1 "Ultimate Insect LV3" from your hand or Deck. (You cannot activate this effect the turn this card is Normal Summoned, Special Summoned, or flipped face-up.)
et: Kui see kaart on väljal, ei mõjuta seda Loitsukaartide efektid. Oma Ootefaasil, saates selle avatud kaardi Hauakambrisse, Kutsu Eriliselt välja 1 "Ultimate Insect LV3" oma käest või Pakist. (Sa ei saa seda efekti aktiveerida sellel käigul, kui see kaart on Normaalvälja kutsutud, Eriliselt välja kutsutud või avatud.)

source: Horus the Black Flame Dragon LV4
et: Musta Leegioni Draakon Horus LV4

source: Control of this card cannot switch. During the End Phase of a turn that this card destroyed a monster by battle, by sending this card to the Graveyard, Special Summon 1 "Horus the Black Flame Dragon LV6" from your hand or Deck.
et: Selle kaardi kontrolli ei saa vahetada. Lõpufaasis, kui see kaart hävitas lahingus koletise, saadades selle kaardi Hauakambrisse, kutsu eriliselt välja 1 "Horus the Black Flame Dragon LV6" oma käest või pakist.

source: Horus the Black Flame Dragon LV6
et: Horus, Musta Leegidraakon LV6

source: This card is unaffected by the effects of Spell Cards. During the End Phase of a turn that this card destroyed a monster by battle, you can send this card to the Graveyard to Special Summon 1 "Horus the Black Flame Dragon LV8" from your hand or Deck.
et: See kaart ei ole mõjutatud Loitsukaartide efektidest. Lõpuetapis, mil see kaart hävitas lahingus koletise, saad saata selle kaardi Hauakambrisse, et Kutsuda Eriliselt välja 1 "Horus the Black Flame Dragon LV8" oma käest või Pakkist.

source: Horus the Black Flame Dragon LV8
et: Horus, Musta Leegidraakon LV8

source: This card cannot be Normal Summoned or Set. This card cannot be Special Summoned except by the effect of "Horus the Black Flame Dragon LV6". You can negate the activation and effect of any Spell Cards and destroy them.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti ei saa eriliselt kutsuda, välja arvatud "Horus the Black Flame Dragon LV6" efekti abil. Sa saad tühistada mis tahes loitsukaartide aktiveerimise ja efekti ning need hävitada.

source: Dark Mimic LV1
et: Tume Mimik LV1

source: FLIP: Draw 1 card. During your Standby Phase, by sending this face-up card to the Graveyard, Special Summon 1 "Dark Mimic LV3" from your hand or Deck.
et: FLIP: Tõmba 1 kaart. Oma ootejärgu faasis, saates selle avatud kaardi Hauakambrisse, kutsu eriliselt välja 1 "Dark Mimic LV3" oma käest või pakist.

source: Dark Mimic LV3
et: Tume Mimik LV3

source: If this card is sent to the Graveyard by battle, the controller of this card draws 1 card. If this card was Special Summoned by the effect of "Dark Mimic LV1", they draw 2 cards instead.
et: Kui see kaart saadetakse lahingus Hauakambrisse, tõmbab selle kaardi kontrollija 1 kaardi. Kui see kaart kutsuti eriliselt välja "Dark Mimic LV1" efekti abil, tõmbavad nad selle asemel 2 kaarti.

source: Mystic Swordsman LV2
et: Müstiline Mõõgamees LV2

source: If this card attacks a face-down Defense Position monster, destroy the monster immediately with this card's effect without flipping it face-up or applying damage calculation. During the End Phase of a turn that this card destroyed a monster by battle, by sending this card to the Graveyard, Special Summon 1 "Mystic Swordsman LV4" from your hand or Deck.
et: Kui see kaart ründab tagurpidi kaitsepositsioonis olevat koletist, hävita koletis kohe selle kaardi efektiga ilma seda püstiasendisse pööramata või kahjustuse arvutust rakendamata. Lõppfaasis, mil see kaart hävitas lahingus koletise, saad selle kaardi Hauakambrisse saates eriliselt kutsuda 1 "Mystic Swordsman LV4" oma käest või pakist.

source: Mystic Swordsman LV4
et: Müstiline Mõõgamees LV4

source: If you Normal Summon this card, you must place it in face-down Defense Position. If this card attacks a face-down Defense Position monster, destroy the monster immediately with this card's effect without flipping it face-up or applying damage calculation. During the End Phase of a turn that this card destroyed a monster by battle, by sending this card to the Graveyard, Special Summon 1 "Mystic Swordsman LV6" from your hand or Deck.
et: Kui sa kutsud selle kaardi normaalselt välja, pead selle asetama näoga allapoole kaitseasendisse. Kui see kaart ründab näoga allapoole kaitseasendis olevat koletist, hävita koletis kohe selle kaardi efektiga ilma seda ümber pööramata või kahjustuse arvutust rakendamata. Selle käigu lõppfaasis, mil see kaart hävitas lahingus koletise, kutsu see kaart hauakambrisse saates eriliselt välja 1 "Mystic Swordsman LV6" oma käest või pakist.

source: Armed Dragon LV3
et: Relvastatud Draakon LV3

source: During your Standby Phase, you can send this face-up card from the field to the Graveyard to Special Summon 1 "Armed Dragon LV5" from your hand or Deck.
et: Oma ootejärgu ajal võid saata selle avatud kaardi väljakult hauakambrisse, et eriliselt kutsuda 1 "Relvastatud Draakon LV5" oma käest või pakist.

source: Armed Dragon LV5
et: Relvastatud Draakon LV5

source: You can send 1 monster from your hand to the Graveyard to select 1 face-up monster your opponent controls with ATK less than or equal to the ATK of the sent monster, and destroy the selected monster. During the End Phase of the turn this card destroys a monster by battle, you can send this face-up card from the field to the Graveyard to Special Summon 1 "Armed Dragon LV7" from your hand or Deck.
et: Saad ühe koletise oma käest Hauakambrisse, et valida üks vastase kontrollitav avatud koletis, mille ATK on väiksem või võrdne saadetud koletise ATK-ga, ja hävitada valitud koletis. Sellel käigul, mil see kaart hävitab lahingus koletise, saad Sa Lõppfaasis saata selle avatud kaardi väljakult Hauakambrisse, et Kutsuda Eriliselt üks "Relvastatud Draakon LV7" oma käest või Pakist.

source: Armed Dragon LV7
et: Relvastatud Draakon LV7

source: This card cannot be Normal Summoned or Set. This card cannot be Special Summoned except by the effect of "Armed Dragon LV5". Send 1 Monster Card from your hand to the Graveyard to destroy all face-up monsters on your opponent's side of the field with an ATK equal to or less than the ATK of the sent monster.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti ei saa eriliselt kutsuda, välja arvatud "Armed Dragon LV5" efekti abil. Saada 1 koletise kaart oma käest hauakambrisse, et hävitada kõik vastase väljaku avatud koletised, mille ATK on võrdne või väiksem saadetud koletise ATK-st.

source: Horus' Servant
et: Horuse teenija

source: Your opponent cannot select "Horus the Black Flame Dragon" (of any LV) as the target of the effect of a Spell, Trap, or Monster Card.
et: Sinu vastane ei saa valida "Horus the Black Flame Dragon" (ükskõik millisel tasemel) loitsu, lõksu või koletise kaardi efekti sihtmärgiks.

source: Red-Eyes B. Chick
et: Punasilmne B. Tibu

source: By sending this face-up card from the field to the Graveyard, Special Summon 1 "<M4088>Red Eyes B. Dragon<M>" from your hand.
et: Saates selle avatud kaardi väljakult Hauakambrisse saata, kutsuge eriliselt välja 1 "<M4088>Red Eyes B. Dragon<M>" oma käest.

source: Malice Doll of Demise
et: Hukatusenuku nukk

source: If this card is sent from the field to the Graveyard by the effect of a Continuous Spell Card, Special Summon this card from the Graveyard during your Standby Phase.
et: Kui see kaart saadetakse pideva loitsukaardi efekti tõttu väljakult hauakambrisse, kutsu see kaart hauakambrist eriliselt välja oma ootejärgus.

source: Ninja Grandmaster Sasuke
et: Ninja Suurmeister Sasuke

source: If this card attacks a face-up Defense Position monster, destroy the monster with this card's effect without applying damage calculation.
et: Kui see kaart ründab avatud kaitseasendis olevat koletist, hävita koletis selle kaardi efektiga ilma kahju arvutust rakendamata.

source: Rafflesia Seduction
et: Rafflesia Võrgutus

source: FLIP: Take control of 1 face-up monster on your opponent's side of the field until the end of this turn.
et: FLIP: Võta kontroll 1 vastase väljaku avatud koletise üle kuni selle käigu lõpuni.

source: Ultimate Baseball Kid
et: Ülim Pesapoiss

source: This card gains 1000 ATK for each other FIRE monster on the field. By sending a FIRE monster other than this card to the Graveyard, inflict 500 damage to your opponent.
et: See kaart saab 1000 ATK iga teise tule-elemendi koletise eest väljal. Saates selle kaardi asemel teise tule-elemendi koletise Hauakambrisse, tekitab see vastasele 500 kahju.

source: Mobius the Frost Monarch
et: Jäämonarh Mobius

source: When this card is Tribute Summoned, you can destroy up to 2 Spell or Trap Cards on the field.
et: Kui see kaart on ohverdamisega välja kutsutud, saad hävitada kuni 2 Võlu- või Lõksukaarti väljakul.

source: Element Dragon
et: Elementaaldraakon

source: This monster gets the following effect(s) while there is a monster(s) with the following Attribute(s) on the field:<BR>● FIRE: This card gains 500 ATK.<BR>● WIND: If this card destroyed your opponent's monster by battle, it can attack once again in a row.
et: See koletis saab järgmise(d) efekti(d), kui väljakul on järgmise(te) atribuudi(te)ga koletis(ed):<BR>● TULI: See kaart saab 500 ATK juurde.<BR>● TUUL: Kui see kaart hävitas lahingus sinu vastase koletise, võib see rünnata veel kord järjest.

source: Element Soldier
et: Element Sõdur

source: This monster gets the following effect(s) while there is a monster(s) with the following Attribute(s) on the field:<BR>● WATER: Control of this card cannot switch.<BR>● EARTH: Negate the effect of an Effect Monster that this card destroyed by battle.
et: See koletis saab järgmised efektid, kui väljal on koletis(ed) järgmiste Atribuutidega:<BR>● VESI: Selle kaardi kontrolli ei saa vahetada.<BR>● MAA: Tühista Efektkoletise efekt, mille see kaart lahingus hävitas.

source: Howling Insect
et: Ulguv putukas

source: When this card is destroyed by battle and sent to the Graveyard, you can Special Summon 1 Insect-Type monster with 1500 or less ATK from your Deck. Then shuffle your Deck.
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse, saad Sa eriliselt kutsuda 1 putukaliigi koletise, millel on 1500 või vähem rünnakupunkti, oma pakist. Seejärel sega oma pakk.

source: Masked Dragon
et: Maskeeritud Draakon

source: When this card is destroyed by battle and sent to the Graveyard: You can Special Summon 1 Dragon-Type monster with 1500 or less ATK from your Deck.
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse: Sa võid eriliselt kutsuda 1 Draakoni-tüüpi koletise, mille ATK on 1500 või vähem, oma pakist.

source: Mind on Air
et: Mõistus õhus

source: Your opponent must play with their hand revealed.
et: Sinu vastane peab mängima oma käega avatud.

source: Unshaven Angler
et: Raseerimata Kalamees

source: When Tribute Summoning a WATER monster, you can treat this 1 monster as 2 Tributes.
et: Kui ohverdad vee-elemendi koletise kutsumiseks, võid seda ühte koletist käsitleda kui kahte ohverdust.

source: The Trojan Horse
et: Trooja hobune

source: When Tribute Summoning an EARTH monster, you can treat this 1 monster as 2 Tributes.
et: Kui kutsud välja EARTH koletist, võid seda ühte koletist käsitleda kui kahte ohverdust.

source: Nobleman-Eater Bug
et: Aadlimehe-sööja putukas

source: FLIP: Destroy 2 monsters on the field.
et: FLIP: Hävita 2 koletist väljal.

source: Enraged Muka Muka
et: Raevukas Muka Muka

source: This card gains 400 ATK and DEF for each card in your hand.
et: See kaart saab 400 ATK ja DEF iga kaardi eest sinu käes.

source: FLIP: You can return up to 3 monsters on the field to the owner's hand.
et: FLIP: Saad kuni 3 koletist väljakult omaniku kätte tagasi.

source: Penumbral Soldier Lady
et: Penumbriline Sõduridaam

source: If this card battles a LIGHT monster, this card gains 1000 ATK during the Damage Step only.
et: Kui see kaart võitleb VALGUSE koletisega, saab see kaart ainult Kahjustuse Etapi ajal 1000 ATK juurde.

source: Ojama King
et: Ojama Kuningas

source: "<M5761>Ojama Green<M>" + "<M5811>Ojama Yellow<M>" + "<M5812>Ojama Black<M>"<BR>Select up to 3 of your opponent's Monster Card Zones. The selected zones cannot be used.
et: "<M5761>Ojama Roheline<M>" + "<M5811>Ojama Kollane<M>" + "<M5812>Ojama Must<M>"<BR>Vali kuni 3 oma vastase Monster Card Zone'i. Valitud tsoone ei saa kasutada.

source: Master of Oz
et: Ozi Meister

source: "<M5814>Big Koala<M>" + "<M5815>Des Kangaroo<M>"
et: "<M5814>Suur Koala<M>" + "<M5815>Des Känguru<M>"

source: "<M4054>Sangan<M>" + "<M4580>Witch of the Black Forest<M>"
et: "<M4054>Sangan<M>" + "<M4580>Musta metsa nõid<M>"

source: Dark Factor of Mass Production
et: Massiliseeri pimeduse tegur

source: Select 2 Normal Monsters from your Graveyard and add them to your hand.
et: Vali oma kalmistult 2 tavalist koletist ja lisa need oma kätte.

source: Hammer Shot
et: Haamrilöök

source: Destroy 1 face-up Attack Position monster with the highest ATK. (If it is a tie, you get to choose.)
et: Hävita 1 avatud rünnakupositsioonis olev koletis, millel on suurim rünnak. (Kui on viik, saad valida.)

source: Mind Wipe
et: Mõistuse Puhastus

source: Activate only if your opponent has 3 or less cards in their hand. Your opponent adds their hand to the Deck and shuffles it, then draws the same of number of cards they added to the Deck.
et: Aktiveeri ainult siis, kui sinu vastasel on käes 3 või vähem kaarti. Sinu vastane lisab oma käe tagasi pakki ja segab selle, seejärel tõmbab sama arvu kaarte, kui ta lisas pakki.

source: Abyssal Designator
et: Abyssaalne Määrang

source: Pay 1000 Life Points. Declare a Type and an Attribute. Your opponent must send 1 monster with both the declared Type and Attribute from their hand or Deck to the Graveyard.
et: Maksa 1000 Elupunkti. Nimeta tüüp ja omadus. Sinu vastane peab saatma ühe koletise, millel on nii nimetatud tüüp kui ka omadus, oma käest või pakist hauakambrisse.

source: Level Up!
et: Taseme tõus!

source: Send 1 face-up "LV" monster on your side of the field to the Graveyard. Special Summon a monster from your hand or Deck that is written in the card text of the sent monster, ignoring any and all Summoning conditions.
et: Saada 1 avatud "LV" koletis oma väljaku poolelt Hauakambrisse. Kutsu eriliselt välja koletis oma käest või pakist, mis on kirjutatud saadetud koletise kaarditekstis, ignoreerides kõiki kutsumistingimusi.

source: Inferno Fire Blast
et: Põrgutule Plahvatus
