Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: Cannot be Normal Summoned or Set. Must be Special Summoned with "Transcendent Wings" and cannot be Special Summoned by other ways. During your opponent's Battle Phase: You can Tribute this face-up card; destroy all Attack Position monsters your opponent controls and inflict damage to your opponent equal to the combined original ATK of those destroyed monster(s).
et: Ei saa olla normaalset kutsutud ega seatud. Peab olema eriliselt kutsutud "Transcendent Wings" abil ja ei saa olla eriliselt kutsutud muul viisil. Sinu vastase lahingufaasi ajal: Sa võid ohverdada selle avatud kaardi; hävita kõik sinu vastase kontrollitavad rünnakupositsioonis olevad koletised ja tekita oma vastasele kahju, mis on võrdne nende hävitatud koletiste algse ATK kogusummaga.

source: Transcendent Wings
et: Ülised Tiivad

source: Send 1 "<M6314>Winged Kuriboh<M>" you control and 2 cards from your hand to the Graveyard; Special Summon 1 "Winged Kuriboh LV10" from your hand or Deck.
et: Saada 1 "<M6314>Tiivuline Kuriboh<M>", mida sa kontrollid, ja 2 kaarti oma käest Hauakambrisse; Kutsu eriliselt välja 1 "Tiivuline Kuriboh LV10" oma käest või pakist.

source: Bubble Shuffle
et: Mullimull

source: Target 1 face-up Attack Position "<M6393>Elemental HERO Bubbleman<M>" you control and 1 face-up Attack Position monster your opponent controls; change both those targets to Defense Position, then Tribute that 1 "<M6393>Elemental HERO Bubbleman<M>", then Special Summon 11 "Elemental HERO" monster from your hand.
et: Vali 1 ülespoole suunatud rünnakupositsioonis "<M6393>Elemental HERO Bubbleman<M>", mida sa kontrollid, ja 1 ülespoole suunatud rünnakupositsioonis olev koletis, mida sinu vastane kontrollib; muuda mõlemad sihtmärgid kaitsepositsiooniks, seejärel ohverda see 1 "<M6393>Elemental HERO Bubbleman<M>", seejärel kutsu eriliselt välja 1 "Elemental HERO" koletis oma käest.

source: Spark Blaster
et: Sädeplahvataja

source: Equip only to "<M6313>Elemental HERO Sparkman<M>". During your Main Phase: You can target 1 face-up monster; change the battle position of that target. After you use this effect 3 times, destroy this card.
et: Varusta ainult kaardile "<M6313>Elemental HERO Sparkman<M>". Oma peafaasis: Sa võid valida 1 avatud positsioonis oleva koletise; muuda selle sihtmärgi lahingupositsiooni. Pärast selle efekti kasutamist 3 korda, hävita see kaart.

source: Van'Dalgyon the Dark Dragon Lord
et: Van'Dalgyon, Tume Draakoniisand

source: After a Counter Trap Card you control negates the activation of an opponent's card(s) or effect(s), you can Special Summon this card from your hand. Then activate the appropriate effects, based on the type of card negated:<BR>• Spell: Inflict 1500 damage to your opponent.<BR>• Trap: Select and destroy 1 card your opponent controls.<BR>• Effect Monster: Select 1 monster in your Graveyard and Special Summon it.
et: Pärast seda, kui sinu kontrollitav Vastulõksukaart tühistab vastase kaardi(te) või efekti(de) aktiveerimise, saad selle kaardi oma käest eriliselt välja kutsuda. Seejärel aktiveeri sobivad efektid, sõltuvalt tühistatud kaardi tüübist:<BR>• Võlukunst: Tekita vastasele 1500 kahju.<BR>• Lõks: Vali ja hävita 1 kaart, mida vastane kontrollib.<BR>• Efektikoletis: Vali 1 koletis oma Hauakambris ja kutsu see eriliselt välja.

source: Apparently totally unreliable, he wonders if he has incredible potential.
et: Ilmselt täiesti ebausaldusväärne, ta mõtleb, kas tal on uskumatu potentsiaal.

source: Mad Lobster
et: Hullumeelne Homaar

source: A gourmet food renowned by the Dark World upper crust. It has sensational flavor.
et: Tume Maailma kõrgklassi poolt hinnatud gurmeetoit. Sellel on sensatsiooniline maitse.

source: Jerry, a bean soldier, believes he is the strongest warrior in the world, but his true abilities are still untested.
et: Jerry, oasõdur, usub, et ta on maailma tugevaim sõdalane, kuid tema tõelised võimed on endiselt proovimata.

source: Cybernetic Magician
et: Küberneetiline Maag

source: You can discard 1 card to change the ATK of 1 face-up monster to 2000 until the End Phase of this turn.
et: Saad 1 kaardi, et muuta 1 avatud koletise ATK 2000-ni kuni selle käigu lõppfaasini.

source: Cybernetic Cyclopean
et: Küberneetiline Küklop

source: While you have no cards in your hand, this card gains 1000 ATK.
et: Kui sul pole kaarte käes, saab see kaart 1000 ATK juurde.

source: Mechanical Hound
et: Mehaaniline Koer

source: While you have no cards in your hand, your opponent cannot activate Spell Cards.
et: Kui sul pole kaarte käes, ei saa sinu vastane aktiveerida Võlukaarte.

source: Cyber Archfiend
et: Küberdeemon

source: At the beginning of your Draw Phase, if you have no cards in your hand, draw 1 more card in addition to the normal draw. During your End Phase, if you have 1 or more card(s) in your hand, destroy this card.
et: Kui sul ei ole kaarte käes, tõmba oma Tõmbefaasi alguses lisaks tavalisele tõmbele veel 1 kaart. Kui sul on oma Lõppfaasis käes 1 või rohkem kaarti, hävita see kaart.

source: Goblin Elite Attack Force
et: Goblinite Eliitrünnakuüksus

source: B.E.S. Crystal Core
et: B.E.S. Kristalltuum

source: When this card is Normal Summoned, put 3 counters on it. This card cannot be destroyed by battle. If this card attacks or is attacked, remove 1 counter from this card at the end of the Damage Step. If you cannot, destroy it. Once per turn, during your Main Phase, you can change 1 face-up Attack Position monster your opponent controls to face-up Defense Position.
et: Kui see kaart Normaal-Kutsutakse, pane sellele 3 loendurit. Seda kaarti ei saa lahingus hävitada. Kui see kaart ründab või teda rünnatakse, eemalda 1 loendur selle kaardi küljest Kahjustuse Etapi lõpus. Kui sa ei saa, hävita see. Kord käigu jooksul, oma Põhifaasis, saad muuta ühe vastase kontrollitava avatud Rünnakupositsioonis oleva koletise avatud Kaitsepositsiooniks.

source: Giant Kozaky
et: Hiiglaslik Kozaky

source: If there is no face-up "Kozaky" on the field, destroy this card. If this face-up card is destroyed, inflict damage equal to the original ATK of this card to its current controller.
et: Kui väljakul ei ole avatud "Kozaky", hävita see kaart. Kui see avatud kaart hävitatakse, põhjusta kahju, mis on võrdne selle kaardi algse rünnakuga, selle praegusele kontrollijale.

source: Indomitable Fighter Lei Lei
et: Võitmatu Võitleja Lei Lei

source: Protective Soul Ailin
et: Kaitsev Hing Ailin

source: Once per turn, you can equip this card to an "Indomitable Fighter Lei Lei" you control, OR unequip it to Special Summon this card in face-up Attack Position. When equipped to a monster by this card's effect, you can change that monster's battle position once per turn. (A monster can only be equipped with 11 Union Monster at a time. If the equipped monster would be destroyed by battle, destroy this card instead.)
et: Korra ühe korra käigu jooksul saad selle kaardi kinnitada oma kontrollitava kaardi "Indomitable Fighter Lei Lei" külge VÕI eemaldada selle kinnituse, et Kutsuda see kaart erilisesse rünnakupositsiooni. Kui see kaart on kinnitatud koletisele selle kaardi efekti abil, saad selle koletise lahingupositsiooni muuta korra käigu jooksul. (Koletisele saab korraga kinnitada ainult ühe Liidu Koletise. Kui kinnitatud koletis hävitatakse lahingus, hävita selle asemel see kaart.)

source: Once per turn, you can equip this card to a "Soitsu" you control, OR unequip it to Special Summon this card in face-up Attack Position. While equipped to a monster by this card's effect, that monster gains 2500 ATK. (A monster can only be equipped with 11 Union Monster at a time. If the equipped monster would be destroyed by battle, destroy this card instead.)
et: Korra ühe korra käigu jooksul saad selle kaardi kinnitada oma "Soitsu" külge, mida sa kontrollid, VÕI eemaldada see, et kutsuda see kaart eriliselt välja rünnakupositsioonis. Kui see kaart on kinnitatud koletise külge selle kaardi efekti tõttu, saab see koletis 2500 rünnakupunkti juurde. (Koletis saab korraga olla kinnitatud ainult ühe Ühenduskoletisega. Kui kinnitatud koletis hävitatakse lahingus, hävita selle asemel see kaart.)

source: Des Frog
et: Des Konn

source: When this card is Tribute Summoned, you can Special Summon "<M6424>Des Frog<M>"(s) from your hand or Deck up to the number of "T.A.D.P.O.L.E."(s) in your Graveyard.
et: Kui see kaart on ohverdamisega välja kutsutud, saad eriliselt välja kutsuda "<M6424>Des Frog<M>"(e) oma käest või pakist kuni "T.A.D.P.O.L.E."(de) arvuni sinu hauas.

source: T.A.D.P.O.L.E.
et: K.A.B.U.T.I.K.A.S.

source: When this card you control is destroyed by battle and sent to your Graveyard, you can add any "T.A.D.P.O.L.E."(s) from your Deck to your hand.
et: Kui see kaart, mida sa kontrollid, hävitatakse lahingus ja saadetakse sinu Hauakambrisse, võid lisada oma pakist oma kätte ükskõik millise "T.A.D.P.O.L.E."(d).

source: Poison Draw Frog
et: Mürgijoonistaja Konn

source: When this face-up card on the field is sent to the Graveyard (unless it was attacked while face-down and destroyed by battle), you can draw 1 card.
et: Kui see avatud kaart väljakul saadetakse Hauakambrisse (välja arvatud juhul, kui sellele rünnati, kui see oli tagurpidi ja hävitati lahingus), võid tõmmata 1 kaardi.

source: Tyranno Infinity
et: Türanno Lõpmatus

source: The original ATK of this card becomes the number of your Dinosaur-Type monsters that are removed from play x 1000.
et: Selle kaardi algne ATK muutub sinu mängust eemaldatud Dinosaurus-tüüpi koletiste arvu x 1000 võrra.

source: Batteryman C
et: Patareimees C

source: If all "Batteryman C"(s) you control are in Attack Position, all Machine-Type monsters you control gain 500 ATK for each "Batteryman C" you control. If all "Batteryman C"(s) you control are in Defense Position, all Machine-Type monsters you control gain 500 DEF for each "Batteryman C" you control.
et: Kui kõik sinu kontrolli all olevad "Batteryman C"(d) on Rünnakupositsioonis, saavad kõik sinu kontrolli all olevad Masinatüüpi koletised 500 ATK iga sinu kontrolli all oleva "Batteryman C" kohta. Kui kõik sinu kontrolli all olevad "Batteryman C"(d) on Kaitsepositsioonis, saavad kõik sinu kontrolli all olevad Masinatüüpi koletised 500 DEF iga sinu kontrolli all oleva "Batteryman C" kohta.

source: Ebon Magician Curran
et: Eebenmaag Curran

source: During your Standby Phase, inflict 300 damage to your opponent for each monster they control.
et: Oma Standby Phase'i ajal tee oma vastasele 300 kahju iga nende kontrollitava koletise eest.

source: D.D.M. - Different Dimension Master
et: D.D.M. - Teise dimensiooni meister

source: Once per turn, you can discard 1 Spell Card to Special Summon 1 of your removed from play monsters.
et: Korra ühe käigu jooksul saad sa ühe Loitsukaardi ära visata, et Kutsuda Eriliselt välja ühe oma mängust eemaldatud koletise.

source: Fusion Recovery
et: Fusioni taastamine

source: Target 1 "<M4837>Polymerization<M>", and 1 Fusion Material Monster that was used for a Fusion Summon, in your Graveyard; add them to your hand.
et: Vali 1 "<M4837>Polümerisatsioon<M>" ja 1 Fusion Material Monster, mida kasutati Fusion Summon jaoks, oma kalmistul; lisa need oma kätte.

source: Miracle Fusion
et: Imede sulandumine

source: Banish, from your side of the field or your Graveyard, the Fusion Material Monsters that are listed on an "Elemental HERO" Fusion Monster Card, then Special Summon that Fusion Monster from your Extra Deck. (This Special Summon is treated as a Fusion Summon.)
et: Eemalda oma väljakult või oma Hauakambrist Fusion Material Monsters, mis on loetletud "Elemental HERO" Fusion Monster Card'il, seejärel Special Summon see Fusion Monster oma Extra Deck'ist. (See Special Summon käsitletakse kui Fusion Summon.)

source: Dragon's Mirror
et: Draakoni Peegel

source: Banish, from your side of the field or your Graveyard, Fusion Material Monsters that are listed on a Dragon-Type Fusion Monster Card, and Special Summon that Fusion Monster from your Extra Deck. (This Special Summon is treated as a Fusion Summon.)
et: Eemalda oma väljakult või oma hauakambrist Fusion Materjal Koletised, mis on loetletud Draakon-Tüüpi Fusion Koletise Kaardil, ja Kutsu see Fusion Koletis oma Lisa Paki seast. (See Eriline Kutsumine käsitletakse kui Fusion Kutsumist.)

source: System Down
et: Süsteemi Seiskamine

source: Pay 1000 Life Points; banish all face-up Machine-Type monsters your opponent controls and in their Graveyard.
et: Makske 1000 Elupunkti; eemalda mängust kõik vastase kontrolli all olevad ja nende Hauakambris olevad avatud Masinatüüpi koletised.

source: Des Croaking
et: <translated Des Kvaakumine

source: Activate only while you control 3 face-up "Des Frogs". Destroy all cards your opponent controls.
et: Aktiveeri ainult siis, kui sul on kontrolli all 3 avatud "Des Frogs". Hävita kõik kaardid, mida sinu vastane kontrollib.

source: Pot of Generosity
et: Heldeluse pott

source: Return 2 cards from your hand to your Deck. Then shuffle your Deck.
et: Tagasta 2 kaarti oma käest oma pakki. Seejärel sega oma pakk.

source: Shien's Spy
et: Shieni spioon

source: Select 1 face-up monster on your side of the field to activate this card. Until the End Phase of this turn, shift control of the selected monster to your opponent.
et: Vali 1 avatud näoga koletis oma väljaku poolelt, et aktiveerida see kaart. Kuni selle käigu lõppfaasini anna valitud koletise kontroll vastasele.

source: Fire Darts
et: Tule nooled

source: You can only activate this card when you have no cards in your hand. Roll a six-sided die 3 times, and inflict damage to your opponent's Life Points equal to the total result of the die rolls × 100 points.
et: Seda kaarti saad aktiveerida ainult siis, kui sul pole käes ühtegi kaarti. Veereta kuuepoolset täringut 3 korda ja tekita oma vastase Elupunktidele kahju, mis on võrdne täringuveeretuste kogusummaga × 100 punkti.

source: Spiritual Earth Art – Kurogane
et: Vaimne Maa Kunst – Kurogane

source: Tribute 1 EARTH monster on your side of the field. Special Summon 1 Level 4 or lower EARTH monster from your Graveyard, except the Tributed monster.
et: Lohista 1 MAASTIK koletis oma väljaku poolelt. Kutsu eriliselt välja 1 Tase 4 või madalam MAASTIK koletis oma Hauakambrist, välja arvatud lohistatud koletis.

source: Spiritual Water Art – Aoi
et: Vaimne vee kunst – Aoi

source: Tribute 1 WATER monster on your side of the field. Look at your opponent's hand, select 1 card from it, and send that card to the Graveyard.
et: Lohista 1 VEE koletis oma väljaku poolelt. Vaata oma vastase kätt, vali sealt 1 kaart ja saada see kaart Hauakambrisse.

source: Spiritual Fire Art – Kurenai
et: Vaimne Tulekunst – Kurenai

source: Tribute 1 FIRE monster on your side of the field. Inflict damage to your opponent's Life Points equal to the original ATK of the tributed monster.
et: Lohverda 1 FIRE koletis oma väljaku poolelt. Põhjusta oma vastase Elupunktidele kahju, mis on võrdne lohverdatud koletise algse rünnakuga.

source: Spiritual Wind Art – Miyabi
et: Vaimne Tuulekunst – Miyabi

source: Tribute 1 WIND monster to select 1 card your opponent controls. Place that card on the bottom of the Deck.
et: Lohista 1 TUULES koletis, et valida 1 kaart, mida sinu vastane kontrollib. Aseta see kaart paki põhja.

source: A Rival Appears!
et: Rivaal Ilmub!

source: Select 1 face-up monster your opponent controls. Special Summon 1 monster from your hand that has the same Level as the selected monster.
et: Vali 1 avatud näoga koletis, mida sinu vastane kontrollib. Kutsu eriliselt välja 1 koletis oma käest, millel on sama tase kui valitud koletisel.

source: Magical Explosion
et: Maagiline Plahvatus

source: You can only activate this card when you have no cards in your hand. Inflict 200 points of damage to your opponent's Life Points for each Spell Card in your Graveyard.
et: Seda kaarti saad aktiveerida ainult siis, kui sul pole kaarte käes. Põhjusta oma vastase Elupunktidele 200 punkti kahju iga sinu Hauakambris oleva Loitsukaardi eest.

source: Rising Energy
et: Tõusev Energia

source: Discard 1 card to select 1 face-up monster. It gains 1500 ATK until the End Phase of this turn.
et: Viska 1 kaart, et valida 1 avatud koletis. See saab 1500 ATK kuni selle käigu lõppfaasini.

source: D.D. Trap Hole
et: D.D. Lõksuauk

source: You can only activate this card when your opponent Sets 1 monster in Defense Position. Destroy and remove from play the Set monster and 1 monster on your side of the field.
et: Seda kaarti saad aktiveerida ainult siis, kui su vastane seab 1 koletise kaitsepositsiooni. Hävita ja eemalda mängust seatud koletis ja 1 koletis sinu väljaku poolelt.

source: Conscription
et: Kohustuslik ajateenistus

source: Pick up the top card of your opponent's Deck. If the picked up card can be Normal Summoned, Special Summon it to your side of the field. If not, add that card to your opponent's hand.
et: Võta oma vastase pakist pealmine kaart. Kui võetud kaarti saab normaalselt kutsuda, kutsu see eriliselt oma väljaku poolele. Kui ei saa, lisa see kaart oma vastase kätte.

source: Dimension Wall
et: Dimensioonimüür

source: Activate only when an opponent's monster declares an attack. Instead of you, your opponent takes the Battle Damage you would have taken from this battle.
et: Aktiveeri ainult siis, kui vastase koletis kuulutab välja rünnaku. Selle lahingu puhul saab lahingukahju, mida sina oleksid saanud, hoopis sinu vastane.

source: Prepare to Strike Back
et: Valmistu vastulöögiks

source: Each time your opponent declares an attack on a face-up Defense Position monster, toss a coin and call it. If you call it right, change the targeted face-up Defense Position monster to Attack Position. If you call it wrong, the controller of this card takes damage equal to the difference between the ATK of the attacking monster, and DEF of the attacked monster.
et: Iga kord, kui sinu vastane kuulutab rünnaku ülespoole suunatud kaitseasendis koletisele, viska münti ja ütle, kummale poole see kukub. Kui arvad õigesti, muuda sihitud ülespoole suunatud kaitseasendis koletis rünnakuasendisse. Kui arvad valesti, saab selle kaardi kontrollija kahju, mis on võrdne ründava koletise ATK ja rünnatava koletise DEF erinevusega.

source: The Selection
et: Valik

source: Pay 1000 Life Points. Negate the Summon of a monster that has the same Type as a monster on the field, and destroy it.
et: Maksa 1000 Elupunkti. Tühista koletise kutsumine, mille tüüp on sama, mis väljakul oleval koletisel, ja hävita see.

source: Trap of Darkness
et: Pimeduse lõks

source: Activate only by paying 1000 Life Points while you have 3000 Life Points or less. Select a Normal Trap Card in your Graveyard. This card's effect is the same as that Trap Card's. Remove from play that Normal Trap Card.
et: Aktiveeri ainult 1000 Elupunkti maksmisega, kui sul on 3000 või vähem Elupunkti. Vali oma Hauakambris olev Tavaline Lõksukaart. Selle kaardi efekt on sama, mis sellel Lõksukaardil. Eemalda mängust see Tavaline Lõksukaart.

source: Arcana Knight Joker
et: Arcana Rüütel Joker

source: "<M5503>Queen's Knight<M>" + "<M5559>Jack's Knight<M>" + "<M5558>King's Knight<M>"<BR>A Fusion Summon of this card can only be conducted with the above Fusion Material Monsters. Once per turn, if this face-up card on the field is targeted by a Spell Card, Trap Card, or Effect Monster's effect, you can negate that effect by discarding the same kind of card (Spell, Trap, or Monster Card).
et: "<M5503>Kuninganna Rüütel<M>" + "<M5559>Poisi Rüütel<M>" + "<M5558>Kuningas Rüütel<M>"<BR>Selle kaardi sulandumise kutse saab läbi viia ainult ülaltoodud sulandumismaterjalide koletistega. Kord ühe käigu jooksul, kui see ülespoole suunatud kaart väljal on sihitud Loitsukaardi, Lõksukaardi või Efektikoletise efekti poolt, saad selle efekti tühistada, visates ära sama tüüpi kaardi (Loits, Lõks või Koletis).

source: Gilford the Legend
et: Legendaarne Gilford

source: This card cannot be Special Summoned. When this card is Normal Summoned, you can equip as many Equip Spell Cards from your Graveyard as possible to a face-up Warrior-Type monster(s) you control.
et: Seda kaarti ei saa eriliselt kutsuda. Kui see kaart on tavakutsutud, võid oma kalmistult nii palju varustuse loitsukaarte kui võimalik kinnitada oma kontrollitavale püstisele sõdalase-tüüpi koletisele.

source: Warrior Lady of the Wasteland
et: Tühermaa Sõdalanna

source: When this card is destroyed by battle and sent to the Graveyard: You can Special Summon 1 EARTH Warrior-Type monster with 1500 or less ATK from your Deck, in face-up Attack Position.
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse: Sa võid oma pakist eriliselt kutsuda 1 MAA Sõdalase-tüüpi koletise, millel on 1500 või vähem rünnakupunkti, avatud rünnakupositsioonis.

source: Divine Sword - Phoenix Blade
et: Jumalik Mõõk - Fööniksi Tera

source: Equip only to a Warrior-Type monster. It gains 300 ATK. During your Main Phase, if this card is in your Graveyard you can remove from play 2 Warrior-Type monsters in your Graveyard to add this card to your hand.
et: Varusta ainult Sõdalase-tüüpi koletisele. See saab 300 ATK juurde. Oma peafaasis, kui see kaart on sinu hauas, saad eemaldada mängust 2 Sõdalase-tüüpi koletist oma hauas, et lisada see kaart oma kätte.

source: Dreadscythe Harvester
et: Dreadscythe'i Lõikur

source: You can Tribute 1 Insect-Type monster to have this card gain 500 ATK until the end of the turn.
et: Saad ühe Putukaliigi koletise ohverdada, et see kaart saaks 500 ATK juurde kuni käigu lõpuni.

source: Elemental Hero Shining Flare Wingman
et: Elementaalne Kangelane Särav Leekmees

source: "<M6344>Elemental HERO Flame Wingman<M>" + "<M6313>Elemental HERO Sparkman<M>"<BR>Must be Fusion Summoned and cannot be Special Summoned by other ways. This card gains 300 ATK for each "Elemental HERO" card in your Graveyard. When this card destroys a monster by battle and sends it to the Graveyard: Inflict damage to your opponent equal to the ATK of the destroyed monster in the Graveyard.
et: "<M6344>Elemental HERO Leegitsev Tiivuline Kangelane<M>" + "<M6313>Elemental HERO Sädemekangelane<M>"<BR>Peab olema Fusion Summoned ja ei saa olla Special Summoned muul viisil. See kaart saab 300 ATK iga "Elemental HERO" kaardi eest sinu Hauakambris. Kui see kaart hävitab lahingus koletise ja saadab selle Hauakambrisse: Tekita oma vastasele kahju, mis on võrdne hävitatud koletise ATK-ga Hauakambris.

source: Level Modulation
et: Taseme Modifikatsioon

source: Your opponent draws 2 cards. Special Summon 1 monster from your Graveyard that includes "LV" in its card name, ignoring the Summoning conditions. The monster that was Special Summoned by this effect cannot attack, nor activate or apply its effect this turn.
et: Sinu vastane tõmbab 2 kaarti. Kutsu eriliselt välja 1 koletis oma Hauakambrist, mille kaardinimes on "LV", ignoreerides kutsumise tingimusi. Selle efekti abil eriliselt välja kutsutud koletis ei saa rünnata ega aktiveerida või rakendada oma efekti sellel käigul.

source: Ojamuscle
et: Ojamuskel

source: Select 1 face-up "Ojama King" on the field. Destroy all monster(s) on the field that include "Ojama" in their card name, except the selected "Ojama King". Increase the ATK of the selected "Ojama King" by 1000 points for each destroyed monster.
et: Vali 1 avatud "Ojama King" väljal. Hävita kõik koletised väljal, mille kaardinimes on "Ojama", välja arvatud valitud "Ojama King". Suurenda valitud "Ojama King" ATK-d 1000 punkti võrra iga hävitatud koletise eest.

source: Ojamagic
et: Ojamagia

source: When this card is sent from the hand or the field to the Graveyard, add 1 each of "<M5761>Ojama Green<M>", "<M5811>Ojama Yellow<M>" and "<M5812>Ojama Black<M>" from your Deck to your hand.
et: Kui see kaart saadetakse käest või väljakult Hauakambrisse, lisa oma pakist kätte 1 "<M5761>Ojama Green<M>", "<M5811>Ojama Yellow<M>" ja "<M5812>Ojama Black<M>".
