Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: Activate only when you take Battle Damage from your opponent's monster's direct attack. Reveal 1 Level 1 monster in your hand. Special Summon it from your hand, and 1 monster with the same name from your Deck.
et: Aktiveeri ainult siis, kui saad lahingukahju vastase koletise otsesest rünnakust. Paljasta 1. taseme koletis oma käes. Kutsu see oma käest eriliselt välja ja 1 sama nimega koletis oma pakist.

source: Earthbound Wave
et: Maa-aheldaja Laine

source: Activate only while you control a face-up "Earthbound Immortal" monster. Negate the activation of a Spell or Trap Card your opponent controls, and destroy it.
et: Aktiveeri ainult siis, kui sa kontrollid avatud "Earthbound Immortal" koletist. Tühista oma vastase kontrollitava Loitsu või Lõksukaardi aktiveerimine ja hävita see.

source: Roar of the Earthbound
et: Maa-aluse möire

source: Once per turn, when your opponent's monster declares an attack, if the ATK of the attacking monster is lower than that of a face-up "Earthbound Immortal" monster you control, destroy the attacking monster and inflict damage to your opponent equal to half the destroyed monster's ATK.
et: Kord ühe käigu jooksul, kui sinu vastase koletis kuulutab välja rünnaku ja ründava koletise ATK on madalam kui sinu kontrolli all oleva avatud "Earthbound Immortal" koletise ATK, hävita ründav koletis ja tekita oma vastasele kahju, mis on võrdne poolega hävitatud koletise ATK-st.

source: Limit Impulse
et: Piirangimpulss

source: Send 2 cards from your hand to the Graveyard. Special Summon 2 "<M3964>Soul Token<M>"s (Fiend-Type/DARK/Level 1/ATK 0/DEF 0). These Tokens cannot be Tributed except for a Tribute Summon.
et: Saada 2 kaarti oma käest Hauakambrisse. Kutsu eriliselt välja 2 "<M3964>Soul Token<M>"it (Deemon-Tüüp/PIMEDUS/Tase 1/ATK 0/DEF 0). Neid Token'eid ei saa ohverdada, välja arvatud Ohverdus Kutsumise jaoks.

source: Infernity Force
et: Infernity Jõud

source: Activate only when an "Infernity" monster is selected as an attack target while you have no cards in your hand. Destroy the attacking monster and Special Summon 1 "Infernity" monster from your Graveyard.
et: Aktiveeri ainult siis, kui "Infernity" koletis on valitud rünnaku sihtmärgiks ja sul pole käes ühtegi kaarti. Hävita ründav koletis ja Kutsu Eriliselt välja 1 "Infernity" koletis oma Hauakambrist.

source: Nega-Ton Corepanel
et: Nega-Ton Tuumapaneel

source: Activate only if you control a face-up "Koa'ki Meiru" monster and have "<M8207>Iron Core of Koa'ki Meiru<M>" in your Graveyard. Negate the activation of an Effect Monster's effect, and destroy it.
et: Aktiveeri ainult siis, kui sul on kontrolli all avatud "Koa'ki Meiru" koletis ja sinu kalmistul on "<M8207>Iron Core of Koa'ki Meiru<M>". Tühista Efektikoletise efekti aktiveerimine ja hävita see.

source: Gemini Counter
et: Kaksikute Vasturünnak

source: Change 1 face-up Gemini Monster you control to face-down Defense Position and negate the activation of an opponent's Spell Card, and destroy it.
et: Muuda 1 avatud Gemini koletis, mida sa kontrollid, tagurpidi kaitsepositsiooniks ja tühista vastase loitsukaardi aktiveerimine ning hävita see.

source: Gemini Booster
et: Kaksikute Võimendi

source: Equip this card to a Gemini monster you control as an Equip Card. It gains 700 ATK. When this card is destroyed while equipped and sent to the Graveyard, select 1 face-up Gemini monster and treat it as an Effect Monster.
et: Varusta see kaart Gemini koletisele, mida sa kontrollid, kui Varustuskaart. See saab 700 ATK. Kui see kaart hävitatakse varustatuna ja saadetakse Hauakambrisse, vali 1 avatud Gemini koletis ja käsitle seda kui Efektikoletist.

source: Ritual Buster
et: Rituaalipurustaja

source: Activate only when a Ritual Monster is Ritual Summoned. Your opponent cannot activate any Spell or Trap Cards or use their effects until your next Standby Phase.
et: Aktiveeri ainult siis, kui Rituaalikoletis on rituaalsummonitud. Sinu vastane ei saa aktiveerida ühtegi Loitsu- ega Lõksukaarti ega kasutada nende efekte kuni sinu järgmise Ootefaasini.

source: Stygian Dirge
et: Stügia leinalaul

source: Reduce the Levels of all face-up monsters your opponent controls by 1.
et: Vähenda kõigi vastase kontrollitavate avatud koletiste tasemeid 1 võrra.

source: Seal of Wickedness
et: Kurjuse Pitser

source: Once per turn, during your opponent's Standby Phase, select 1 face-up card on the field. The selected card's effect(s) is negated during that turn. During each of your Standby Phases, pay 500 Life Points or destroy this card.
et: Korra ühe korra vastase ootejärgu faasis vali üks avatud kaart väljakul. Valitud kaardi efekt(id) on sellel käigul tühistatud. Iga oma ootejärgu faasi ajal maksa 500 elupunkti või hävita see kaart.

source: Appointer of the Red Lotus
et: Punase Lootose Määramine

source: Pay 2000 Life Points and reveal all cards in your hand. Look at your opponent's hand and select 1 card. Remove that card from play until the End Phase of your opponent's next turn.
et: Makske 2000 Elupunkti ja paljasta kõik kaardid oma käes. Vaata oma vastase kätt ja vali 1 kaart. Eemalda see kaart mängust kuni sinu vastase järgmise käigu Lõppfaasini.

source: During each of your End Phases, destroy this card unless you send 1 "<M8207>Iron Core of Koa'ki Meiru<M>" from your hand to the Graveyard or reveal 1 Warrior-Type monster from your hand. If this card destroys an opponent's monster by battle, it can attack once again in a row.
et: Iga lõpuetapi ajal hävita see kaart, kui sa ei saada 1 "<M8207>Koa'ki Meiru Raudtuum<M>" oma käest kalmistule või ei näita 1 Sõdalase-tüüpi koletist oma käest. Kui see kaart hävitab lahingus vastase koletise, võib see rünnata veel kord järjest.

source: Warm Worm
et: Soe uss

source: When this card is destroyed, send the top 3 cards of your opponent's Deck to the Graveyard.
et: Kui see kaart hävitatakse, saada oma vastase paki 3 ülemist kaarti hauakambrisse.

source: Worm Bait
et: Ussimürk

source: Activate only if you control a face-up Insect-Type monster. Special Summon 2 "<M3960>Worm Token<M>"s (Insect-Type/EARTH/Level 1/ATK 0/DEF 0) to your side of the field. You cannot Normal Summon or Special Summon Level 3 or 4 monsters the turn you activate this card.
et: Aktiveeri ainult siis, kui sa kontrollid avatud Insektitüüpi koletist. Kutsu eriliselt välja 2 "<M3960>Worm Token<M>"-it (Insektitüüp/MAA/Tase 1/ATK 0/DEF 0) oma väljaku poolele. Sa ei saa sellel käigul, mil sa selle kaardi aktiveerid, tavaliselt kutsuda ega eriliselt välja kutsuda 3. või 4. taseme koletisi.

source: Regretful Rebirth
et: Kahetsusväärne taassünd

source: Activate only when a monster you control is destroyed by battle and sent to the Graveyard. Special Summon it in Defense Position. The monster Special Summoned by this effect is destroyed during your End Phase.
et: Aktiveeri ainult siis, kui sinu kontrollitav koletis hävitatakse lahingus ja saadetakse Hauakambrisse. Kutsu see eriliselt välja Kaitsepositsioonis. Selle efekti abil eriliselt välja kutsutud koletis hävitatakse sinu Lõppfaasis.

source: Shield Worm
et: Kilpkonnakilp

source: When this card is Summoned, it is changed to Defense Position. Then, send 1 card from the top of your opponent's Deck to the Graveyard for each face-up Insect-Type monster you control.
et: Kui see kaart kutsutakse välja, muudetakse see kaitsepositsiooniks. Seejärel saadab iga sinu kontrolli all oleva avatud putukaliigi koletise kohta ühe kaardi vastase paki pealt hauakambrisse.

source: If you have 2 or more "X-Saber" monsters in your Graveyard and you control no monsters, you can Special Summon this card from your hand.
et: Kui sul on oma kalmistul 2 või rohkem "X-Saber" koletist ja sa ei kontrolli ühtegi koletist, saad selle kaardi oma käest eriliselt kutsuda.

source: When your opponent declares an attack, you can select the attacking monster, and negate the attack. You can only activate this effect once (while this card remains face-up on the field). If this card destroys a Defense Position monster your opponent controls by battle, you can select 1 Level 4 or lower "X-Saber" monster from your Graveyard and Special Summon it.
et: Kui sinu vastane kuulutab välja rünnaku, saad valida ründava koletise ja rünnaku tühistada. Sa saad seda efekti aktiveerida ainult üks kord (kui see kaart jääb väljale avatud olekusse). Kui see kaart hävitab lahingus sinu vastase kaitseasendis oleva koletise, saad valida 1. taseme 4 või madalama "X-Saber" koletise oma Hauakambrist ja eriliselt kutsuda selle välja.

source: During each of your End Phases, destroy this card unless you send 1 "<M8207>Iron Core of Koa'ki Meiru<M>" from your hand to the Graveyard or reveal 1 Zombie-Type monster in your hand. If a "Koa'ki Meiru" monster you control would be destroyed by battle or by a card effect, you can remove from play 1 "Koa'ki Meiru" monster in your Graveyard instead.
et: Iga oma lõppfaasi ajal hävita see kaart, kui sa ei saada 1 "<M8207>Koa'ki Meiru Raudtuum<M>" oma käest Hauakambrisse või ei näita oma käes olevat ühte Zombi-tüüpi koletist. Kui sinu kontrolli all olev "Koa'ki Meiru" koletis hävitatakse lahingus või kaardi efekti tõttu, võid selle asemel eemaldada mängust ühe "Koa'ki Meiru" koletise oma Hauakambrist.

source: Koa'ki Meiru Gravirose
et: Koa'ki Meiru Graviroos

source: During each of your End Phases, destroy this card unless you send 1 "<M8207>Iron Core of Koa'ki Meiru<M>" from your hand to the Graveyard or reveal 1 Plant-Type monster in your hand. During each of your Standby Phases, you can send 1 Level 3 or lower monster from your Deck to your Graveyard.
et: Iga oma lõppfaasi ajal hävita see kaart, kui sa ei saada 1 "<M8207>Koa'ki Meiru Raudtuum<M>" oma käest Hauakambrisse või ei näita ühte Taimetüüpi koletist oma käes. Iga oma ootejärgu faasi ajal saad saata 1 3. taseme või madalama koletise oma pakist Hauakambrisse.

source: Psychic Emperor
et: Psüühiline Keiser

source: When this card is Normal or Special Summoned, gain 500 Life Points for each Psychic-Type monster in your Graveyard.
et: Kui see kaart on Normaal- või Erikutsutud, saad 500 Elupunkti iga oma Hauakambris oleva Psüühika-tüüpi koletise eest.

source: Card Guard
et: Kaardivalvur

source: When this card is Normal or Special Summoned: Place 1 Guard Counter on it. This card gains 300 ATK for each Guard Counter it has. Once per turn: You can target 1 other face-up card you control; remove 1 Guard Counter from this card and place 1 Guard Counter on that target. If that card would be destroyed, remove 1 Guard Counter from it instead.
et: Kui see kaart on Normaal- või Erikutsutud: Pane sellele 1 Kaitseloendur. See kaart saab 300 ATK iga Kaitseloenduri eest, mis tal on. Kord kord käigu jooksul: Sa võid valida 1 teise avatud kaardi, mida sa kontrollid; eemalda sellelt kaardilt 1 Kaitseloendur ja pane 1 Kaitseloendur sellele sihtmärgile. Kui see kaart hävitatakse, eemalda selle asemel 1 Kaitseloendur.

source: Flamvell Commando
et: Flamvell Komandör

source: This card cannot be Special Summoned. This card can only be Normal Summoned by Tributing 1 "Flamvell" monster you control. Once per turn, you can remove from play 1 monster in your Graveyard with 200 DEF to inflict damage to your opponent equal to that monster's ATK.
et: Seda kaarti ei saa eriliselt kutsuda. Seda kaarti saab normaalselt kutsuda ainult ohverdades 1 "Flamvell" koletise, mida sa kontrollid. Kord käigu jooksul saad sa eemaldada oma hauakambrist mängust 1 koletise, millel on 200 DEF, et tekitada oma vastasele kahju, mis on võrdne selle koletise ATK-ga.

source: Pseudo Space
et: Pseudo Ruum

source: Once per turn, you can remove from play 1 Field Spell Card in your Graveyard to have this card be treated as that card, and gain the same effects until the End Phase.
et: Korra ühe käigu jooksul saad eemaldada oma kalmistult mängust 1 Väljaloitsu Kaardi, et see kaart käsitletaks selle kaardina ja omandaks samad efektid kuni Lõppfaasini.

source: Greed Grado
et: Ahne Grado

source: Activate only if you destroyed a face-up Synchro Monster controlled by your opponent this turn, either by battle or by a card effect. Draw 2 cards.
et: Aktiveeri ainult siis, kui sa hävitasid sel käigul oma vastase kontrollitud avatud Sünkro Koletise, kas lahingus või kaardi efekti abil. Tõmba 2 kaarti.

source: Revival of the Immortals
et: Surematute ülestõusmine

source: Select 1 "Earthbound Immortal" monster in your Graveyard. Special Summon that monster. It cannot declare an attack this turn. Whenever it battles, your opponent takes no Battle Damage.
et: Vali oma kalmistult 1 "Earthbound Immortal" koletis. Kutsu see koletis eriliselt välja. See ei saa sellel käigul rünnata. Iga kord, kui see võitleb, ei saa sinu vastane lahingukahju.

source: This card cannot be Normal Summoned or Set. If a Normal Monster you control is destroyed by battle, you can Special Summon this card from your hand. This card gains 1000 ATK for each monster your opponent controls. Face-up Level 4 Normal Monsters on the field cannot be destroyed by card effects.
et: Seda kaarti ei saa normaalset kutsuda ega asetada. Kui tavaline koletis, mida sa kontrollid, hävitatakse lahingus, saad selle kaardi oma käest eriliselt kutsuda. See kaart saab 1000 ATK iga koletise eest, mida sinu vastane kontrollib. Näoga ülespoole olevad 4. taseme tavalised koletised väljal ei saa hävitatud kaartide efektide tõttu.

source: Guardian Eatos
et: Valvur Eatos

source: If you have no monsters in your Graveyard, you can Special Summon this card from your hand. You can send 1 Equip Spell Card equipped to this card to the Graveyard to select and remove from play up to 3 monsters in your opponent's Graveyard. This card gains 500 ATK for each monster removed by this effect, until the End Phase.
et: Kui sul pole oma Hauakambris ühtegi koletist, saad selle kaardi oma käest eriliselt välja kutsuda. Sa saad saata ühe Varustuse Loitsukaardi, mis on sellele kaardile varustatud, Hauakambrisse, et valida ja eemaldada mängust kuni 3 koletist oma vastase Hauakambrist. See kaart saab 500 ATK iga selle efekti abil eemaldatud koletise kohta kuni Lõppfaasini.

source: Darkness Neosphere
et: Pimeduse Neosfäär

source: This card cannot be Normal Summoned or Set. This card cannot be Special Summoned except by sending 1 Fiend-Type monster you control and 1 Fiend-Type monster from your hand to the Graveyard when your opponent's monster declares an attack. This card cannot be destroyed by battle. Once per turn, you can return all face-up Trap Cards you control to the hand.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti ei saa eriliselt kutsuda, välja arvatud juhul, kui saadad 1 sinu kontrolli all oleva deemonitüüpi koletise ja 1 deemonitüüpi koletise oma käest hauakambrisse, kui sinu vastase koletis kuulutab välja rünnaku. Seda kaarti ei saa lahingus hävitada. Kord ühe käigu jooksul saad sa kõik ülespööratud lõksukaardid, mida sa kontrollid, tagasi kätte saata.

source: Clear Vice Dragon
et: Selge Vice Draakon

source: You are unaffected by the effects of "<M8539>Clear World<M>". If this card attacks an opponent's monster, the ATK of this card becomes twice the ATK of the attack target, during damage calculation only. If this card would be destroyed by an opponent's card effect, you can discard 1 card instead.
et: Sa ei ole mõjutatud "<M8539>Clear World<M>" efektidest. Kui see kaart ründab vastase koletist, muutub selle kaardi ATK rünnatava sihtmärgi ATK-st kaks korda suuremaks ainult kahju arvutamise ajal. Kui see kaart hävitatakse vastase kaardi efekti tõttu, võid selle asemel ühe kaardi ära visata.

source: Clear World
et: Selge Maailm

source: During each of your End Phases, pay 500 Life Points or destroy this card. Each player receives certain effects, depending on the monster Attributes they control.<BR>● LIGHT: Play with your hand revealed at all times.<BR>● DARK: If you control 2 or more monsters, you cannot declare an attack.<BR>● EARTH: During your Standby Phase, destroy 1 face-up Defense Position monster you control.<BR>● WATER: During your End Phase, discard 1 card .<BR>● FIRE: During your End Phase, take 1000 damage.<BR>● WIND: You must pay 500 Life Points to activate a Spell Card.
et: Iga oma lõppfaasi ajal maksa 500 elupunkti või hävita see kaart. Iga mängija saab teatud efekte, sõltuvalt nende kontrollitavate koletiste atribuutidest.<BR>● VALGUS: Mängi kogu aeg oma käsi paljastatult.<BR>● PIMEDUS: Kui sa kontrollid 2 või enamat koletist, ei saa sa rünnakut kuulutada.<BR>● MAA: Oma ootejärgus hävita 1 avatud kaitseasendis koletis, mida sa kontrollid.<BR>● VESI: Oma lõppfaasis viska 1 kaart ära.<BR>● TULI: Oma lõppfaasis saa 1000 kahju.<BR>● TUUL: Sa pead maksma 500 elupunkti, et aktiveerida loitsukaart.

source: Elemental Hero Flash
et: Elementaalne Kangelane Välk

source: When this card is destroyed by battle and sent to the Graveyard: You can banish this card and 3 "Elemental HERO" monsters with different names from your Graveyard to target 1 Normal Spell Card in your Graveyard; add that target to your hand.
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse: Sa võid selle kaardi ja 3 erineva nimega "Elemental HERO" koletist oma Hauakambrist eemaldada, et sihtida 1 Tavalist Loitsukaarti oma Hauakambris; lisa see sihtmärk oma kätte.

source: Elemental Hero The Shining
et: Elementaalne Kangelane Sära

source: 11 "Elemental HERO" monster + 1 LIGHT monster<BR>This card cannot be Special Summoned except by Fusion Summon. This card gains 300 ATK for each of your removed from play "Elemental HERO" monsters. When this card is sent from the field to the Graveyard, you can select up to 2 of your removed from play "Elemental HERO" monsters, and add them to your hand.
et: 11 "Elemental HERO" koletist + 1 VALGUS koletis<BR>Seda kaarti ei saa eriliselt kutsuda, välja arvatud Fusion Summon'iga. See kaart saab 300 ATK iga sinu mängust eemaldatud "Elemental HERO" koletise eest. Kui see kaart saadetakse väljakult Hauakambrisse, saad valida kuni 2 oma mängust eemaldatud "Elemental HERO" koletist ja lisada need oma kätte.

source: Genex Ally Duradark
et: Genexi liitlane Duradark

source: Once per turn, during your Main Phase, you can select 1 face-up Attack Position monster your opponent controls with the same Attribute as this card, and destroy it. This card cannot attack the turn you activate this effect.
et: Korra ühe korra käigu jooksul, oma peafaasis, saad valida ühe vastase kontrollitava avatud rünnakupositsioonis oleva koletise, millel on sama atribuut kui sellel kaardil, ja hävitada see. Sellel käigul, mil aktiveerid selle efekti, ei saa see kaart rünnata.

source: The Fabled Rubyruda
et: Muinasjutuline Rubyruda

source: When this face-up card you control is selected as an attack target, you can discard 1 "Fabled" monster to negate the attack.
et: Kui see avatud kaart, mida sa kontrollid, valitakse rünnaku sihtmärgiks, võid sa rünnaku tühistamiseks ära visata 1 "Fabled" koletise.

source: Dragunity Knight - Vajrayana
et: Dragunity Rüütel - Vajrayana

source: 1 Dragon-Type Tuner + 1 or more non-Tuner Winged Beast-Type monsters<BR>When this card is Synchro Summoned, you can select 1 Level 3 or lower Dragon-Type "Dragunity" monster in your Graveyard and equip it to this card as an Equip Card. Once per turn, you can send 1 Equip Card equipped to this card to the Graveyard to double this card's ATK until the End Phase.
et: 1 Draakoni-tüüpi Tuner + 1 või rohkem mitte-Tuner Tiivulise Olendi-tüüpi koletisi<BR>Kui see kaart on Sünkro Kutsutud, saad valida 1. taseme 3 või madalama Draakoni-tüüpi "Dragunity" koletise oma Hauakambris ja kinnitada see kaart sellele kaardile Varustuskaardina. Kord ühe käigu jooksul saad saata ühe Varustuskaardi, mis on sellele kaardile kinnitatud, Hauakambrisse, et kahekordistada selle kaardi ATK kuni Lõppfaasini.

source: Genex Ally Remote
et: Genexi liitlane Kaugjuht

source: Once per turn, you can select 1 face-up Tuner monster on the field. The selected monster's name is treated as1 "<M7807>Genex Controller<M>" until the End Phase.
et: Korra ühe korra käigu jooksul saad valida ühe avatud Tuner koletise väljal. Valitud koletise nimeks loetakse "<M7807>Genex Controller<M>" kuni End Phase'ini.

source: Genex Ally Powercell
et: Genexi liitlane Võimsusrakk

source: Other face-up monsters you control with the same Attribute as this card gain 500 ATK.
et: Teised avatud positsioonis koletised, mida sa kontrollid ja millel on sama atribuut kui sellel kaardil, saavad 500 ATK juurde.

source: Genex Ally Changer
et: Genexi Liitlane Muutja

source: Once per turn, you can select 1 face-up monster on the field and declare 1 Attribute. The selected monster's Attribute becomes the declared Attribute until the End Phase.
et: Korra ühe korra käigu jooksul saad valida ühe avatud koletise väljakul ja määrata sellele ühe atribuudi. Valitud koletise atribuut muutub määratud atribuudiks kuni lõppfaasini.

source: Genex Ally Volcannon
et: Genexi liitlane Volcannon

source: Once per turn, you can send 1 face-up FIRE "Genex" monster you control to the Graveyard to select 1 face-up monster your opponent controls, destroy it, and inflict damage to your opponent equal to the Level of the destroyed monster x 400.
et: Korra ühe korra käigu jooksul saad saata ühe ülespööratud FIRE "Genex" koletise, mida sa kontrollid, Hauakambrisse, et valida üks ülespööratud koletis, mida sinu vastane kontrollib, hävitada see ja tekitada oma vastasele kahju, mis on võrdne hävitatud koletise tasemega x 400.

source: Genex Ally Solid
et: Genexi liitlane Tahke

source: Once per turn, you can send 1 face-up WATER "Genex" monster you control to the Graveyard to draw 2 cards.
et: Korra ühe korra käigu jooksul saad saata ühe avatud veetüüpi "Genex" koletise, mida sa kontrollid, hauakambrisse, et tõmmata 2 kaarti.

source: The Fabled Chawa
et: Muinasjutuline Chawa

source: During your Main Phase, you can discard 1 "Fabled" monster and Special Summon this card from your hand.
et: Oma peafaasia ajal saad sa ühe "Fabled" koletise ära visata ja selle kaardi oma käest eriliselt välja kutsuda.

source: The Fabled Catsith
et: Muinasjutuline Kassith

source: When this card is discarded to the Graveyard, select 1 face-up card on the field, and destroy it.
et: Kui see kaart saadetakse Hauakambrisse, vali 1 avatud kaart väljal ja hävita see.

source: The Fabled Cerburrel
et: Muinasjutuline Cerburrel

source: When this card is discarded to the Graveyard, Special Summon it.
et: Kui see kaart visatakse Hauakambrisse, kutsu see eriliselt välja.

source: The Fabled Ganashia
et: Muinasjutuline Ganashia

source: When this card is discarded to the Graveyard, Special Summon it. If this card is Special Summoned this way, it gains 200 ATK and is removed from play when it is removed from the field.
et: Kui see kaart saadetakse Hauakambrisse, kutsu see eriliselt välja. Kui see kaart kutsutakse sel viisil eriliselt välja, saab see 200 ATK ja eemaldatakse mängust, kui see eemaldatakse väljakult.

source: The Fabled Nozoochee
et: Muinasjutuline Nozoochee

source: During your Main Phase, you can discard 1 "Fabled" monster and Special Summon this card from your hand. When this card is Special Summoned this way, you can Special Summon 1 Level 2 or lower "Fabled" monster from your hand.
et: Oma peafaasiajal saad sa ühe "Fabled" koletise ära visata ja selle kaardi oma käest eriliselt välja kutsuda. Kui see kaart kutsutakse sel viisil eriliselt välja, saad sa oma käest eriliselt välja kutsuda ühe 2. taseme või madalama "Fabled" koletise.

source: Once per turn, you can select 1 "Dragunity" card in your Spell & Trap Card Zone, and Special Summon it.
et: Korra ühe korra käigu jooksul saad valida 1 "Dragunity" kaardi oma Loitsu & Lõksu Kaardi Tsoonis ja Kutsuda see Eriliselt välja.
