Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: Select 11 Union Monster in your Graveyard and equip it to an appropriate monster you control.
et: Vali oma kalmistult 1 Ühenduskoletis ja kinnita see sobiva koletise külge, mida sa kontrollid.

source: Non-Fusion Area
et: Mitteväljaala

source: Neither player can Fusion Summon.
et: Kumbki mängija ei saa Fusion Summon'it teha.

source: Level Limit - Area A
et: Taseme Piirang - Ala A

source: All face-up Level 3 or lower monsters on the field are changed to Attack Position and remain in Attack Position.
et: Kõik avatud 3. taseme või madalama tasemega koletised väljakul muudetakse Rünnakupositsiooni ja jäävad Rünnakupositsiooni.

source: Armed Changer
et: Relvastatud Muutja

source: Send 1 Equip Spell Card from your hand to the Graveyard to activate this card. If the equipped monster destroys a monster by battle, the controller of this Equip Card can add 1 monster with ATK equal to or less than the equipped monster from their Graveyard to their hand.
et: Saada 1 Varustuse Võlusõna kaart oma käest Hauakambrisse, et aktiveerida see kaart. Kui varustatud koletis hävitab lahingus koletise, võib selle Varustuse Kaardi kontrollija lisada oma Hauakambrist oma kätte 1 koletise, mille ATK on võrdne või väiksem varustatud koletisest.

source: If you controlled 2 or more monsters at the start of your opponent's Battle Phase and all of them were destroyed by battle and sent to the Graveyard, you can Special Summon this card from your hand during that Battle Phase. If you do, choose an Attribute and destroy all face-up monsters with that Attribute. Your opponent cannot Normal or Special Summon monsters with that Attribute.
et: Kui sul oli oma vastase Lahingu Faasi alguses kontrolli all 2 või rohkem koletist ja kõik need hävitati lahingus ning saadeti Hauakambrisse, saad selle kaardi selle Lahingu Faasi ajal oma käest Eriliselt Kutsuda. Kui sa seda teed, vali üks Atribuut ja hävita kõik selle Atribuudiga avatud koletised. Sinu vastane ei saa selle Atribuudiga koletisi Tavaliselt ega Eriliselt Kutsuda.

source: Elemental Hero Necroshade
et: Elementaalne Kangelane Nekrovarjund

source: Once, while this card is in the Graveyard, you can Normal Summon 1 Level 5 or higher1 "Elemental HERO" monster from your hand without Tributes.
et: Kord üks kord, kui see kaart on Hauakambris, saad sa oma käest ilma ohverdusteta Normaal-Kutsuda 1 taseme 5 või kõrgema "Elemental HERO" koletise.

source: Hero Ring
et: Kangelase Sõrmus

source: Target 1 Warrior-Type monster with an 1500 or less ATK; equip this card to that target. Monsters your opponent controls with 1900 or more ATK cannot attack that target.
et: Vali 1 Sõdalase-tüüpi koletis, mille ATK on 1500 või vähem; kinnita see kaart sellele sihtmärgile. Koletised, mida sinu vastane kontrollib ja mille ATK on 1900 või rohkem, ei saa seda sihtmärki rünnata.

source: Elemental Hero Mudballman
et: Elementaalne Kangelane Mudballman

source: "<M6393>Elemental HERO Bubbleman<M>" + "<M6312>Elemental HERO Clayman<M>"<BR>Must be Fusion Summoned and cannot be Special Summoned by other ways.
et: "<M6393>Elementaalne KANGELANE Mullimees<M>" + "<M6312>Elementaalne KANGELANE Saviga Mees<M>"<BR>Peab olema Fusion Summoned ja ei saa olla Special Summoned muul viisil.

source: Dark Eradicator Warlock
et: Pimekaotaja Võlur

source: This card cannot be Normal Summoned or Set. This card cannot be Special Summoned except by Tributing 1 "<M4041>Dark Magician<M>". Each time a Normal Spell Card is activated, inflict 1000 damage to your opponent.
et: Seda kaarti ei saa tavaliselt kutsuda ega asetada. Seda kaarti ei saa eriliselt kutsuda, välja arvatud 1 "<M4041>Pimeduse Maag<M>" ohverdamise teel. Iga kord, kui aktiveeritakse tavaline loitsukaart, tekitage oma vastasele 1000 kahju.

source: Mythical Beast Cerberus
et: Müütiline Metsaline Cerberus

source: Each time a Spell Card is activated, place 1 Spell Counter on this card. This card gains 500 ATK for each Spell Counter on it. If this card attacks or is attacked, remove all Spell Counters from it at the end of the Battle Phase.
et: Iga kord, kui aktiveeritakse Võlukaar, aseta sellele kaardile 1 Võluloendur. See kaart saab 500 ATK iga sellel oleva Võluloenduri kohta. Kui see kaart ründab või seda rünnatakse, eemalda kõik Võluloendurid sellelt lahingufaasi lõpus.

source: Magical Blast
et: Maagiline Plahvatus

source: Activate only while you control a Spellcaster-Type monster. Inflict 200 damage to your opponent for each Spellcaster-Type monster you control. If this card is in your Graveyard, you can add it to your hand instead of conducting your normal draw during your Draw Phase.
et: Aktiveeri ainult siis, kui sa kontrollid Nõiduri-tüüpi koletist. Tekita oma vastasele 200 kahju iga Nõiduri-tüüpi koletise eest, mida sa kontrollid. Kui see kaart on sinu Hauas, võid selle lisada oma kätte tavalise tõmbamise asemel oma Tõmbamisfaasis.

source: King of Destruction - Xexex
et: Hävingu Kuningas - Xexex

source: This card cannot be Special Summoned. This card must be Tribute Summoned by Tributing 3 Fiend-Type monsters on your side of the field. If this card attacks your opponent's Life Points directly and makes them 0, the controller of this card wins the Match.
et: Seda kaarti ei saa eriliselt kutsuda. See kaart tuleb kutsuda ohverdades 3 deemonitüüpi koletist oma väljaku poolelt. Kui see kaart ründab otse sinu vastase elupunkte ja viib need nulli, võidab selle kaardi kontrollija matši.

source: Queen of Fate - Eternia
et: Saatuse Kuninganna - Eternia

source: This card cannot be Special Summoned. This card must be Tribute Summoned by Tributing 3 Fairy-Type monsters on your side of the field. If this card attacks your opponent's Life Points directly and makes them 0, the controller of this card wins the Match.
et: Seda kaarti ei saa eriliselt kutsuda. See kaart tuleb ohverdada, ohverdades 3 haldjatüüpi koletist oma väljaku poolel. Kui see kaart ründab otse sinu vastase elupunkte ja teeb need 0-ks, võidab selle kaardi kontrollija matši.

source: Elemental Hero Steam Healer
et: Elementaalne Kangelane Aurutervendaja

source: "<M6311>Elemental HERO Burstinatrix<M>" + "<M6393>Elemental HERO Bubbleman<M>"<BR>Must be Fusion Summoned and cannot be Special Summoned by other ways. When this card destroys a monster by battle and sends it to the Graveyard: Gain Life Points equal to the ATK of that destroyed monster in the Graveyard.
et: "<M6311>Elementaalne Kangelane Burstinatrix<M>" + "<M6393>Elementaalne Kangelane Mullimees<M>"<BR>Peab olema sulandatud ja ei saa olla eriliselt kutsutud muul viisil. Kui see kaart hävitab lahingus koletise ja saadab selle Hauakambrisse: Saad Elupunkte, mis on võrdne Hauakambrisse saadetud hävitatud koletise rünnakuga.

source: Burst Return
et: Puhanguline Tagasitulek

source: If you control a face-up "<M6311>Elemental HERO Burstinatrix<M>": Return all face-up "Elemental HERO" monsters on the field to the hand, except "<M6311>Elemental HERO Burstinatrix<M>".
et: Kui sa kontrollid avatud "<M6311>Elemental HERO Burstinatrix<M>": Tagasta kõik avatud "Elemental HERO" koletised väljal käele, välja arvatud "<M6311>Elemental HERO Burstinatrix<M>".

source: Bubble Blaster
et: Mulliprits

source: You can only equip this card to "<M6393>Elemental HERO Bubbleman<M>". Increase the ATK of the equipped monster by 800 points. If the equipped monster would be destroyed as a result of battle, destroy this card instead, and make the Battle Damage to the controller of the equipped monster 0.
et: Saate selle kaardi varustada ainult "<M6393>Elemental HERO Bubbleman<M>"-le. Suurendage varustatud koletise ATK-d 800 punkti võrra. Kui varustatud koletis hävitatakse lahingu tulemusena, hävitage selle asemel see kaart ja tehke varustatud koletise kontrollijale tekitatud lahingukahju 0.

source: Bubble Illusion
et: Mullillusioon

source: You can only activate this card while there is a face-up "<M6393>Elemental HERO Bubbleman<M>" on your side of the field. During this turn, you can activate 1 Trap Card from your hand.
et: Seda kaarti saad aktiveerida ainult siis, kui sinu väljaku poolel on avatud "<M6393>Elemental HERO Bubbleman<M>". Selle käigu ajal saad aktiveerida 1 lõksukaardi oma käest.

source: Clay Charge
et: Savikaitse

source: When an "<M6312>Elemental HERO Clayman<M>" you control is targeted for an attack (even if it is face-down, but reveal it to your opponent in that case): Destroy the attacking monster and that "<M6312>Elemental HERO Clayman<M>", and inflict 800 damage to your opponent.
et: Kui sinu "<M6312>Elemental HERO Clayman<M>" on rünnaku sihtmärk (isegi kui see on tagurpidi, kuid sel juhul näita seda oma vastasele): Hävita ründav koletis ja see "<M6312>Elemental HERO Clayman<M>", ning tekita oma vastasele 800 kahju.

source: Armed Dragon LV10
et: Relvastatud Draakon LV10

source: This card cannot be Normal Summoned or Set. This card cannot be Special Summoned except by Tributing 1 "Armed Dragon LV7". You can send 1 card from your hand to the Graveyard to destroy all face-up monsters your opponent controls.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti ei saa eriliselt kutsuda, välja arvatud, kui ohverdate 1 "Armed Dragon LV7". Saate saata 1 kaardi oma käest hauakambrisse, et hävitada kõik vastase avatud koletised.

source: Magical Mallet
et: Maagiline Kurikas

source: Shuffle any number of cards from your hand into the Deck, then draw that same number of cards.
et: Sega suvaline arv kaarte oma käest tagasi pakki, seejärel tõmba sama arv kaarte.

source: Inferno Reckless Summon
et: Põrgu Hulljulge Kutsumine

source: Activate only when 1 monster with 1500 or less ATK is Special Summoned to your side of the field while your opponent controls a face-up monster(s). Special Summon all cards with the same name as the Summoned monster from your hand, Deck, and Graveyard in face-up Attack Position. Your opponent selects 1 face-up monster they control and Special Summons all cards with that same name from their hand, Deck, and Graveyard.
et: Aktiveeri ainult siis, kui sinu poolel väljakule kutsutakse eriliselt 1 koletis, millel on 1500 või vähem rünnakupunkti, samal ajal kui sinu vastane kontrollib avatud koletist(e). Kutsu eriliselt kõik kaardid, millel on sama nimi kui kutsutud koletisel, oma käest, pakist ja hauast avatud rünnakupositsioonis. Sinu vastane valib 1 avatud koletise, mida nad kontrollivad, ja kutsub eriliselt kõik kaardid, millel on sama nimi, oma käest, pakist ja hauast.

source: Ring of Defense
et: Kaitserõngas

source: Activate only when an effect of a Trap Card that inflicts damage is activated. Make the effect damage of that Trap Card 0.
et: Aktiveeri ainult siis, kui aktiveeritakse lõksukaardi efekt, mis tekitab kahju. Muuda selle lõksukaardi efekti kahju 0-ks.

source: The Grave of Enkindling
et: Süütamise Haud

source: You can only activate this card when a monster on your side of the field is destroyed as a result of battle and sent to the Graveyard. You and your opponent each select 1 monster from your respective Graveyards and Special Summon them in Defense Position. Neither monster Special Summoned by this card's effect can change its battle position while it is face-up on the field, except with a card effect.
et: Seda kaarti saad aktiveerida ainult siis, kui sinu poolel olev koletis hävitatakse lahingu tulemusena ja saadetakse Hauakambrisse. Sina ja sinu vastane valite kumbki ühe koletise oma vastavatest Hauakambritest ja Kutsute need Eriliselt välja Kaitseasendisse. Ükski selle kaardi efektiga Eriliselt Väljakutsutud koletis ei saa oma lahinguasendit muuta, kui see on väljaku peal näoga ülespoole, välja arvatud kaardi efekti tõttu.

source: Mist Body
et: Udukeha

source: The equipped monster cannot be destroyed by battle. (Damage calculation is applied normally.)
et: Varustatud koletist ei saa lahingus hävitada. (Kahju arvutamine toimub tavapäraselt.)

source: Axe Dragonute
et: Kirveeloheline draakon

source: If this card attacks, it is changed to Defense Position at the end of the Damage Step.
et: Kui see kaart ründab, muudetakse see Kahjustuse Etapi lõpus Kaitsepositsiooniks.

source: White-Horned Dragon
et: Valge-Sarviline Draakon

source: When this card is Normal Summoned or Special Summoned, select up to 5 Spell Cards from your opponent's Graveyard and remove them from play. This card gains 300 ATK for each card removed from play by this card's effect.
et: Kui see kaart on Normaal- või Erikutsutud, vali kuni 5 Loitsukaarti oma vastase Hauakambrist ja eemalda need mängust. See kaart saab 300 ATK juurde iga kaardi eest, mis selle kaardi efekti tõttu mängust eemaldatakse.

source: Dark Red Enchanter
et: Tumepunane Võlur

source: When this card is Normal Summoned, place 2 Spell Counters on it. Each time a Spell Card is activated, place 1 Spell Counter on this card. It gains 300 ATK for each Spell Counter on it. Once per turn, you can remove 2 Spell Counters from this card to make your opponent discard 1 random card.
et: Kui see kaart Normaal-Kutsutakse, pane sellele 2 Loitsuloendurit. Iga kord, kui aktiveeritakse Loitsukaart, pane sellele kaardile 1 Loitsuloendur. See saab 300 ATK iga Loitsuloenduri kohta sellel. Kord käigu jooksul saad eemaldada 2 Loitsuloendurit sellelt kaardilt, et sundida oma vastast juhuslikult 1 kaarti ära viskama.

source: Gorz the Emissary of Darkness
et: Pimeduse Emissar Gorz

source: When you take damage from a card your opponent controls while you control no cards, you can Special Summon this card from your hand. Then activate the appropriate effect, based on the type of damage:<BR>● Battle Damage: Special Summon 1 "<M3922>Emissary of Darkness Token<M>" (Fairy-Type/LIGHT/Level 7/ATK ?/DEF ?). Its ATK and DEF are each equal to the amount of battle damage you took.<BR>● Effect Damage: Inflict damage to your opponent equal to the damage you took.
et: Kui saad kahju vastase kaardilt, kui sul pole ühtegi kaarti, saad selle kaardi oma käest eriliselt kutsuda. Seejärel aktiveeri sobiv efekt, sõltuvalt kahju tüübist:<BR>● Lahingukahju: Kutsu eriliselt 1 "<M3922>Pimeduse Emissari Token<M>" (Haldjatüüp/VALGUS/Tase 7/ATK ?/DEF ?). Selle ATK ja DEF on võrdsed saadud lahingukahju kogusega.<BR>● Efektikahju: Tekita vastasele kahju, mis on võrdne saadud kahjuga.

source: Uria, Lord of Searing Flames
et: Uria, Põlevate Leekide Isand

source: Cannot be Normal Summoned or Set. Must be Special Summoned (from your hand) by sending 3 face-up Trap Cards you control to the Graveyard, and cannot be Special Summoned by other ways. This card gains 1000 ATK for each Continuous Trap Card in your Graveyard. Once per turn: You can target 1 Set Spell/Trap Card your opponent controls; destroy that target. Spell and Trap Cards cannot be activated in response to this effect's activation.
et: Ei saa normaalset kutsuda ega asetada. Peab olema eriliselt kutsutud (teie käest), saates 3 ülespööratud lõksukaarti, mida te kontrollite, hauakambrisse, ja ei saa olla eriliselt kutsutud muul viisil. See kaart saab 1000 ATK iga pideva lõksukaardi eest teie hauakambris. Kord ühe käigu jooksul: saate sihtida 1 seatud loitsu/lõksukaarti, mida teie vastane kontrollib; hävitage see sihtmärk. Loitsu- ja lõksukaarti ei saa aktiveerida vastusena selle efekti aktiveerimisele.

source: Hamon, Lord of Striking Thunder
et: Hamon, Löökläike Isand

source: Cannot be Normal Summoned or Set. Must be Special Summoned (from your hand) by sending 3 face-up Continuous Spell Cards you control to the Graveyard, and cannot be Special Summoned by other ways. When this card destroys your opponent's monster by battle and sends it to the Graveyard: Inflict 1000 damage to your opponent. While this card is in face-up Defense Position card, your opponent cannot target other monsters for attacks.
et: Ei saa normaalset kutsuda ega asetada. Peab olema eriliselt kutsutud (teie käest), saates 3 ülespoole suunatud pidevat loitsukaarti, mida te kontrollite, hauakambrisse, ja ei saa olla eriliselt kutsutud muul viisil. Kui see kaart hävitab lahingus teie vastase koletise ja saadab selle hauakambrisse: põhjustage oma vastasele 1000 kahju. Kui see kaart on ülespoole suunatud kaitsepositsioonis, ei saa teie vastane sihtida teisi koletisi rünnakuteks.

source: Raviel, Lord of Phantasms
et: Raviel, Fantoomide Isand

source: Cannot be Normal Summoned or Set. Must be Special Summoned (from your hand) by Tributing 3 Fiend-Type monsters, and cannot be Special Summoned by other ways. Each time your opponent Normal Summons a monster(s): Special Summon 1 "<M3923>Phantasm Token<M>" (Fiend-Type/DARK/Level 1/ATK 1000/DEF 1000) for each monster Summoned. These Tokens cannot declare an attack. Once per turn: You can Tribute 1 monster, this card gains ATK equal to the original ATK of the Tributed monster, until the End Phase.
et: Ei saa normaalset kutsuda ega asetada. Peab olema eriliselt kutsutud (teie käest) ohverdades 3 deemonitüüpi koletist ja ei saa olla eriliselt kutsutud muul viisil. Iga kord, kui teie vastane kutsub normaalselt koletise(id): Kutsuge eriliselt 1 "<M3923>Fantaasiatoken<M>" (deemonitüüp/PIMEDUS/Tase 1/ATK 1000/DEF 1000) iga kutsutud koletise kohta. Need tokenid ei saa rünnakut kuulutada. Kord ühe käigu jooksul: Võite ohverdada 1 koletise, see kaart saab ATK-d, mis on võrdne ohverdatud koletise algse ATK-ga, kuni lõppfaasini.

source: Elemental Hero Neo Bubbleman
et: Elementaalne Kangelane Neo Mulli-mees

source: This card cannot be Normal Summoned or Set. This card cannot be Special Summoned except by sending "<M6393>Elemental HERO Bubbleman<M>" on your side of the field and "Metamorphosis" in your hand to the Graveyard. This card's name is treated as "<M6393>Elemental HERO Bubbleman<M>" while it is face-up on the field. Destroy an opponent's monster that battles with this card at the end of the Damage Step.
et: Seda kaarti ei saa normaalset kutsuda ega asetada. Seda kaarti ei saa eriliselt kutsuda, välja arvatud juhul, kui saadate oma väljaku poolel oleva "<M6393>Elemental HERO Bubbleman<M>" ja oma käes oleva "Metamorphosis" kalmistule. Selle kaardi nimeks loetakse "<M6393>Elemental HERO Bubbleman<M>", kui see on väljaku peal avatud. Hävita vastase koletis, mis selle kaardiga lahingus osaleb, kahjustuse sammu lõpus.

source: Hero Kid
et: Kangelase Laps

source: When this card is Special Summoned: You can Special Summon any number of "Hero Kid"(s) from your Deck.
et: Kui see kaart on eriliselt kutsutud: Sa võid eriliselt kutsuda ükskõik kui palju "Hero Kid"(e) oma pakist.

source: Cyber Barrier Dragon
et: Küberbarjääri Draakon

source: This card cannot be Normal Summoned or Set. This card cannot be Special Summoned except with "Attack Reflector Unit". Once per turn, while this card is in Attack Position, your opponent's next attack is negated.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti ei saa eriliselt kutsuda, välja arvatud "Rünnaku Peegeldaja Ühikuga". Kord käigu jooksul, kui see kaart on rünnakuasendis, tühistatakse sinu vastase järgmine rünnak.

source: Cyber Laser Dragon
et: Küberlaser Draakon

source: This card cannot be Normal Summoned or Set. This card cannot be Special Summoned except with "Photon Generator Unit". Once per turn, you can destroy 1 monster with ATK or DEF equal to or higher than the ATK of this card.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti ei saa eriliselt kutsuda, välja arvatud "Photon Generator Unit" abil. Kord ühe käigu jooksul saad hävitada 1 koletise, mille ATK või DEF on võrdne või suurem kui selle kaardi ATK.

source: Ancient Gear
et: Muinasvarustus

source: While an "Ancient Gear" is face-up on your side of the field, you can Special Summon this card from your hand in Attack Position.
et: Kui sinu väljaku poolel on "Ancient Gear" avatud, saad selle kaardi oma käest eriliselt kutsuda rünnakupositsioonis.

source: Hero Heart
et: Kangelase Süda

source: Target 1 face-up1 "Elemental HERO" monster you control; halve its ATK until the end of this turn, but it can attack twice during this turn's Battle Phase.
et: Vali 1 avatud "Elemental HERO" koletis, mida sa kontrollid; vähenda selle ATK-d poole võrra kuni selle käigu lõpuni, kuid see võib rünnata kaks korda selle käigu Lahingu Faasis.

source: Magnet Circle LV2
et: Magnetiring LV2

source: Special Summon 1 Level 2 or lower Machine-Type monster from your hand.
et: Kutsu oma käest välja 1. taseme või madalama taseme Masinatüüpi koletis.

source: Ancient Gear Factory
et: Muinasvarustuse Tehas

source: Select 1 "Ancient Gear" monster in your hand and show it to your opponent. Remove from play "Ancient Gear" cards in your Graveyard whose total Levels are equal to double the selected card's. You can Normal Summon the selected card without Tributes this turn.
et: Vali oma käest 1 "Ancient Gear" koletis ja näita seda oma vastasele. Eemalda mängust oma Hauakambris olevad "Ancient Gear" kaardid, mille kogutasemed on võrdne valitud kaardi taseme kahekordsega. Sa võid valitud kaardi sellel käigul ilma ohverdusteta Normaal-Kutsuda.

source: Ancient Gear Drill
et: Muinasaja Käikpuur

source: Activate only while you control a face-up "Ancient Gear" monster. Discard 1 card from your hand. Select 1 Spell Card from your Deck and Set it. You cannot use that Spell Card this turn.
et: Aktiveeri ainult siis, kui sa kontrollid avatud "Ancient Gear" koletist. Viska 1 kaart oma käest ära. Vali 1 Võlukaart oma pakist ja aseta see. Sa ei saa seda Võlukaarti sel käigul kasutada.

source: Phantasmal Martyrs
et: Fantoomohvrid

source: You can only activate this card while you have 2 or more cards in your hand, and have either "<M6563>Uria, Lord of Searing Flames<M>" or "<M6564>Hamon, Lord of Striking Thunder<M>" face-up on your side of the field. By sending your entire hand to the Graveyard, Special Summon 3 "<M3924>Phantasmal Martyr Token<M>"(s) (Fiend-Type/DARK/Level 1/ATK 0/DEF 0) in Attack Position on your side of the field.
et: Seda kaarti saab aktiveerida ainult siis, kui sul on käes 2 või rohkem kaarti ja sul on kas "<M6563>Uria, Põlevate Leekide Isand<M>" või "<M6564>Hamon, Lööva Äikese Isand<M>" avatud sinu väljaku poolel. Saates kogu oma käe Hauakambrisse, kutsu eriliselt välja 3 "<M3924>Fantasmiline Märter Token<M>"(it) (Deemon-Tüüp/PIMEDUS/Tase 1/ATK 0/DEF 0) Rünnakupositsioonis sinu väljaku poolel.

source: Cyclone Boomerang
et: Tornaado Bumerang

source: Equip only to "<M6478>Elemental Hero Wildheart<M>". It gains 500 ATK. When the equipped monster is destroyed by a card effect and sent to the Graveyard: Destroy all Spell and Trap Cards on the field, then inflict 100 damage to your opponent for each Spell/Trap Card destroyed by this effect.
et: Varusta ainult kaardile "<M6478>Elemental Hero Wildheart<M>". See saab 500 ATK juurde. Kui varustatud koletis hävitatakse kaardi efekti tõttu ja saadetakse Hauakambrisse: Hävita kõik Väljal olevad Loitsu- ja Lõksukaardid, seejärel tekita oma vastasele 100 kahju iga selle efekti tõttu hävitatud Loitsu/Lõksukaardi eest.

source: Photon Generator Unit
et: Fotonigeneraatori Üksus

source: Tribute 2 "Cyber Dragons". Special Summon 1 "Cyber Laser Dragon" from your hand, Deck, or Graveyard.
et: Ohverda 2 "Küberdraakonit". Kutsu eriliselt välja 1 "Küberlaser Draakon" oma käest, pakist või hauast.

source: Ancient Gear Castle
et: Muinasvarustuse Loss

source: Face-up "Ancient Gear" monsters gain 300 ATK. Each time a monster(s) is Normal Summoned or Set, put 1 counter on this card. If you Tribute Summon an "Ancient Gear" monster, you can substitute this card for a Tribute(s), if the number of counters is equal to or greater than the number of required Tribute(s).
et: Avatud "Ancient Gear" koletised saavad 300 ATK juurde. Iga kord, kui koletis(ed) kutsutakse normaalsetena või seatakse, pane sellele kaardile 1 loendur. Kui sa ohverdad "Ancient Gear" koletise, võid selle kaardi asendada ohverdustega, kui loendurite arv on võrdne või suurem kui nõutud ohverduste arv.
