Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: Swift Gaia the Fierce Knight
et: Kiire Gaia, Raevukas Rüütel

source: If this is the only card in your hand, you can Normal Summon it without Tributing.
et: Kui see on ainus kaart sinu käes, saad selle Normaal-Kutsuda ilma ohverdamata.

source: Obnoxious Celtic Guard
et: Ebameeldiv Keldi valvur

source: This card cannot be destroyed by battle with a monster that has 1900 or more ATK.
et: Seda kaarti ei saa hävitada lahingus koletisega, kellel on 1900 või rohkem ATK.

source: Zombyra the Dark
et: Zombyra Pime

source: This card cannot attack a player directly. Each time this card destroys 1 monster as a result of battle, decrease the ATK of this card by 200 points.
et: See kaart ei saa rünnata mängijat otse. Iga kord, kui see kaart hävitab lahingu tulemusena 1 koletise, vähenda selle kaardi ATK-d 200 punkti võrra.

source: Spiritualism
et: Spiritism

source: Return 1 Spell or Trap Card on your opponent's side of the field to his/her hand. This card's activation and effect cannot be negated by any other card.
et: Tagasta 1 loitsu- või lõksukaart oma vastase väljaku poolelt tema kätte. Selle kaardi aktiveerimist ja efekti ei saa ühegi teise kaardiga tühistada.

source: Jowgen the Spiritualist
et: Spiritist Jowgen

source: Discard 1 random card from your hand to the Graveyard to destroy all Special Summoned monsters on the field. As long as this card remains face-up on the field, no monsters can be Special Summoned.
et: Viska juhuslik kaart oma käest Hauakambrisse, et hävitada kõik spetsiaalselt kutsutud koletised väljal. Kuni see kaart jääb väljal avatud olekusse, ei saa ühtegi koletist spetsiaalselt kutsuda.

source: Kycoo the Ghost Destroyer
et: Kycoo, kummituste hävitaja

source: When this card inflicts Battle Damage to your opponent, you can remove from play up to 2 Monster Cards from their Graveyard. Your opponent cannot remove from play cards from either player's Graveyard.
et: Kui see kaart tekitab lahingukahju sinu vastasele, saad eemaldada mängust kuni 2 koletisekaarti nende hauakambrist. Sinu vastane ei saa eemaldada mängust kaarte kummagi mängija hauakambrist.

source: Summoner of Illusions
et: Illusioonide Kutsuja

source: FLIP: Tribute 1 other monster to Special Summon 1 Fusion Monster from your Extra Deck. The Fusion Monster is destroyed at the end of the turn this effect is activated.
et: FLIP: Ohverda 1 teine ​​koletis, et Kutsuda 1 Fusion Monster oma Extra Deckist. Fusion Monster hävitatakse selle käigu lõpus, kui see efekt aktiveeritakse.

source: Bazoo the Soul-Eater
et: Hingesööja Bazoo

source: Once per turn: You can banish up to 3 monsters from your Graveyard; this card gains 300 ATK for each, until your opponent's End Phase.
et: Kord ühe korra käigu jooksul: Sa võid oma kalmistult pagendada kuni 3 koletist; see kaart saab igaühe eest 300 ATK-d juurde kuni sinu vastase lõppfaasini.

source: Soul of Purity and Light
et: Puhasuse ja Valguse Hing

source: This card cannot be Normal Summoned or Set. This card can only be Special Summoned by removing from play 2 LIGHT monsters in your Graveyard. All monsters your opponent controls lose 300 ATK during their Battle Phase only.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti saab eriliselt kutsuda ainult eemaldades oma kalmistult mängust 2 VALGUSE koletist. Kõik sinu vastase kontrollitavad koletised kaotavad oma lahingufaasis 300 rünnakupunkti.

source: Spirit of Flames
et: Leekide vaim

source: This card cannot be Normal Summoned or Set. This card can only be Special Summoned by removing 1 FIRE monster in your Graveyard from play. Increase the ATK of this monster by 300 points during your Battle Phase.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti saab eriliselt kutsuda ainult eemaldades oma kalmistult mängust 1 TULE monsteri. Suurenda selle koletise rünnakupunkte 300 võrra oma lahingufaasi ajal.

source: Aqua Spirit
et: Veevaim

source: This card cannot be Normal Summoned or Set. This card can only be Special Summoned by removing 1 WATER monster in your Graveyard from play. During each of your opponent's Standby Phases, you can change the battle position of 1 of your opponent's face-up Monster Cards. Once changed, the monster must remain in this position for the rest of the turn.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti saab eriliselt kutsuda ainult eemaldades oma kalmistult mängust 1 VEE koletise. Iga sinu vastase ootejärgu faasi ajal saad muuta ühe oma vastase avatud koletise kaardi lahinguasendit. Kui asend on muudetud, peab koletis jääma sellesse asendisse ülejäänud käigu ajaks.

source: The Rock Spirit
et: Kivivaim

source: This card cannot be Normal Summoned or Set. This card can only be Special Summoned by removing 1 EARTH monster in your Graveyard from play. Increase the ATK of this monster by 300 points during your opponent's Battle Phase.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti saab eriliselt kutsuda ainult eemaldades oma kalmistult mängust 1 MAA koletise. Suurenda selle koletise rünnakupunkte 300 võrra oma vastase lahingufaasis.

source: Garuda the Wind Spirit
et: Tuulevaim Garuda

source: This card cannot be Normal Summoned or Set. This card can only be Special Summoned by removing from play 1 WIND monster in your Graveyard. During your opponent's End Phase, you can select 1 face-up monster your opponent controls, and change its battle position.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti saab eriliselt kutsuda ainult eemaldades oma kalmistult mängust 1 TUULE koletise. Oma vastase lõppfaasis saad valida 1 vastase kontrollitava avatud koletise ja muuta selle lahinguasendit.

source: You can Special Summon this card from your hand. If you do, your opponent can Special Summon 1 monster from their Graveyard.
et: Saad selle kaardi oma käest eriliselt välja kutsuda. Kui teed seda, võib sinu vastane kutsuda ühe koletise oma hauakambrist eriliselt välja.

source: Tornado Bird
et: Tornaadolind

source: FLIP: Return 2 Spell or Trap Cards on the field to their owners' hands.
et: FLIP: Tagasta 2 loitsu- või lõksukaarti väljakult nende omanike kätte.

source: Dreamsprite
et: Unenäohaldjas

source: When attacked by your opponent's monster, select another 1 of your Monster Cards and designate it as the attack's target, then calculate damage.
et: Kui sinu vastase koletis ründab, vali üks teine oma koletiskaartidest ja määra see rünnaku sihtmärgiks, seejärel arvuta kahju.

source: Supply
et: Varustus

source: FLIP: Return 2 Fusion Material monsters that were sent to the Graveyard as a result of a Fusion Summon to your hand.
et: FLIP: Tagasta 2 Fusion Material koletist, mis saadeti Fusion Summoni tulemusena Hauakambrisse, oma kätte.

source: You can only activate this card's effect during your opponent's turn. When your opponent activates a Spell Card, Tribute this face-up card to negate the activation of the Spell Card and destroy it.
et: Seda kaardi efekti saad aktiveerida ainult oma vastase käigu ajal. Kui sinu vastane aktiveerib Võlukaardi, ohverda see avatud kaart, et Võlukaardi aktiveerimine tühistada ja see hävitada.

source: Collected Power
et: Kogutud Jõud

source: Select 1 face-up monster on the field. Equip this monster with all face-up Equip Cards on the field. If the target of the Equip Card is not correct, destroy the Equip Card.
et: Vali 1 avatud näoga koletis väljal. Varusta see koletis kõigi avatud näoga Varustuskaartidega väljal. Kui Varustuskaardi sihtmärk ei ole õige, hävita Varustuskaart.

source: Royal Command
et: Kuninglik Käsk

source: Negate the activation and effects of all Flip Effect monsters effects.
et: Tühista kõigi Flip Effect koletiste efektide aktiveerimine ja mõju.

source: Riryoku Field
et: Riryoku Väljak

source: Negate the activation of a Spell Card that targets 1 monster on the field and destroy the Spell Card.
et: Tühista Väljaloitsu aktiveerimine, mis sihib ühte koletist väljal, ja hävita Väljaloits.

source: Skull Lair
et: Kolju Urg

source: Remove from play any number of Monster Cards in your Graveyard to destroy 1 face-up monster on the field whose Level is equal to the number of the cards you removed from play.
et: Eemalda oma kalmistult mängust suvaline arv koletiskaarte, et hävitada 1 avatud koletis väljal, mille tase on võrdne mängust eemaldatud kaartide arvuga.

source: Graverobber's Retribution
et: Hauaröövli kättemaks

source: During each of your Standby Phases, inflict 100 points of damage to your opponent's Life Points for each of your opponent's monsters that have been removed from play.
et: Iga oma ootejärgu ajal põhjusta oma vastase Elupunktidele 100 punkti kahju iga oma vastase mängust eemaldatud koletise eest.

source: Deal of Phantom
et: Fantoomitehing

source: Select 1 monster face-up on the field. Increase the selected monster's ATK by 100 points for each monster in your Graveyard during the turn this card is activated. The number of monsters is applied when this card is activated.
et: Vali 1 avatud näoga koletis väljal. Suurenda valitud koletise ATK-d 100 punkti võrra iga sinu Hauakambris oleva koletise kohta sellel käigul, kui see kaart aktiveeritakse. Koletiste arv rakendatakse, kui see kaart aktiveeritakse.

source: Destruction Punch
et: Hävituslöök

source: If the ATK of an attacking monster on your opponent's side of the field is lower than the DEF of the attacked Defense Position monster, destroy the attacking monster at the end of the Damage Step. (Damage calculation is applied normally.)
et: Kui sinu vastase väljaku ründava koletise ATK on madalam kui rünnatava Kaitseasendis koletise DEF, hävita ründav koletis Kahjustuse Sammu lõpus. (Kahjustuse arvutamine toimub tavapäraselt.)

source: Blind Destruction
et: Pime hävitus

source: During your Standby Phase, roll 1 six-sided die once. Destroy any monster whose Level is equal to the number rolled. (If the number is "6", destroy all face-up Level 6 or higher monsters on the field.)
et: Oma Standby Phase'i ajal veereta üks kord kuuepoolset täringut. Hävita kõik koletised, kelle tase on võrdne veeretatud numbriga. (Kui number on "6", hävita kõik avatud taseme 6 või kõrgemad koletised väljal.)

source: The Emperor's Holiday
et: Keisri puhkus

source: Negate the effects of all Equip Cards.
et: Negateeri kõigi Varustuskaartide efektid.

source: Cyclon Laser
et: Tsükloni Laser

source: You can only equip this card to "<M5140>Gradius<M>". Increase the ATK of "<M5140>Gradius<M>" by 300 points. When the equipped "<M5140>Gradius<M>" attacks with an ATK that is higher than the DEF of a Defense Position monster, inflict the difference as Battle Damage to your opponent's Life Points.
et: Seda kaarti saab varustada ainult kaardile "<M5140>Gradius<M>". Suurenda "<M5140>Gradius<M>" ATK-d 300 punkti võrra. Kui varustatud "<M5140>Gradius<M>" ründab ATK-ga, mis on kõrgem kui kaitseasendis oleva koletise DEF, põhjusta vahe vastase Elupunktidele Lahingukahjuna.

source: Spirit Message "E"
et: Vaimusõnum "E"

source: This card can only be placed on the field by the effect of "<M5224>Destiny Board<M>"
et: Seda kaarti saab väljakule asetada ainult "<M5224>Saatusetahvel<M>" efekti abil

source: Spirit Message "A"
et: Vaimusõnum "A"

source: Spirit Message "T"
et: Vaimusõnum "T"

source: Spirit Message "H"
et: Vaimusõnum "H"

source: Bait Doll
et: Söödunukk

source: Force the activation of 1 face-down Trap Card. If the timing of the activation of the Trap Card is incorrect, negate the effect and destroy it. If it is not a Trap Card, it is returned to its original position. After this card is activated, it is placed into the Deck (not the Graveyard). Then shuffle the Deck.
et: Sunni 1 allapoole pööratud lõksukaardi aktiveerimine. Kui lõksukaardi aktiveerimise ajastus on vale, tühista efekt ja hävita see. Kui see ei ole lõksukaart, tagastatakse see algsesse asendisse. Pärast selle kaardi aktiveerimist asetatakse see pakki (mitte hauakambrisse). Seejärel sega pakk.

source: Fusion Gate
et: Fusioonivärav

source: While this card is on the field: Either player can Fusion Summon a Fusion Monster without using "<M4837>Polymerization<M>", but the Fusion Material Monsters are banished instead of being sent to the Graveyard.
et: Kui see kaart on väljakul: Mõlemad mängijad saavad kutsuda Fusion Koletise ilma "<M4837>Polümerisatsioon<M>" kasutamata, kuid Fusion Materjal Koletised saadetakse Haua asemel pagendusse.

source: The equiped monster cannot attack. Destroy the equipped monster at the end of its controller's 2nd turn after this card is activated. At that time, this card is returned to the owner's hand.
et: Varustatud koletis ei saa rünnata. Hävita varustatud koletis selle kaardi aktiveerimise järel selle kontrollija teise käigu lõpus. Sel ajal tagastatakse see kaart omaniku kätte.

source: Miracle Dig
et: Imekaevamine

source: If 5 or more of your monsters are currently removed from play, return 3 of them to the Graveyard.
et: Kui 5 või enam sinu koletist on praegu mängust eemaldatud, vii 3 neist Hauakambrisse tagasi.

source: Dragonic Attack
et: Draakonirünnak

source: This card can only be used to equip Warrior-Type monsters. The equipped monster is treated as a Dragon-Type and increases the ATK and DEF of the equipped monster by 500 points.
et: Seda kaarti saab kasutada ainult Sõdalase-tüüpi koletiste varustamiseks. Varustatud koletist käsitletakse Draakoni-tüüpi koletisena ning varustatud koletise ATK ja DEF suureneb 500 punkti võrra.

source: Vengeful Bog Spirit
et: Kättemaksuhimuline Soor Vaim

source: No monsters on the field can attack during the same turn that they are Normal Summoned, Flip Summoned or Special Summoned.
et: Ükski koletis lahinguväljal ei saa rünnata samal käigul, mil nad on Normaal-Kutsutud, Pööratud-Kutsutud või Eriliselt Kutsutud.

source: Amazoness Swords Woman
et: Amazonesside mõõganaine

source: Your opponent takes all Battle Damage that you would have taken from a battle involving this card.
et: Sinu vastane saab kogu lahingukahju, mida sina oleksid saanud selle kaardiga seotud lahingus.

source: Makyura the Destructor
et: Makyura Hävitaja

source: During the turn this card is sent to the Graveyard, the owner of this card can activate Trap Card(s) from his/her hand.
et: Selle kaardi saatmise käigus Hauakambrisse võib selle kaardi omanik aktiveerida Lõksukaardi(d) oma käest.

source: Amazoness Archers
et: Amazoonlaste Vibukütid

source: Activate only when your opponent declares an attack while you control an "Amazoness" monster. All monsters your opponent controls are changed to face-up Attack Position (Flip Effects are not activated), and lose 500 ATK as long as they remain face-up on the field. Your opponent must attack with all of their monsters.
et: Aktiveeri ainult siis, kui sinu vastane kuulutab välja rünnaku, kui sa kontrollid "Amazoness" koletist. Kõik sinu vastase kontrollitavad koletised muudetakse avatud Rünnakupositsiooni (Flip-efekte ei aktiveerita) ja kaotavad 500 ATK-d, kuni nad jäävad väljale avatud olekus. Sinu vastane peab ründama kõigi oma koletistega.

source: Rope of Life
et: Eluköis

source: When 1 of your monsters is sent to the Graveyard by battle, discard your entire hand to Special Summon that monster. It gains 800 ATK.
et: Kui 1 sinu koletis saadetakse lahingus Hauakambrisse, viska kogu oma käsi ära, et see koletis Eriliselt Kutsuda. See saab 800 ATK juurde.

source: Spell Shattering Arrow
et: Loitsu Purustav Nool

source: Destroy all face-up Spell Cards your opponent controls. For each destroyed Spell Card, inflict 500 damage to your opponent.
et: Hävita kõik vastase avatud Võlukaardid. Iga hävitatud Võlukaardi eest põhjusta vastasele 500 kahju.

source: Amazoness Chain Master
et: Amazoonlaste Ahelameister

source: When this card is destroyed by battle and sent to the Graveyard, you can pay 1500 Life Points to look at your opponent's hand, select 1 Monster Card in it, and add that card to your hand.
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse, võid maksta 1500 Elupunkti, et vaadata oma vastase kätt, valida sealt 1 Koletisekaart ja lisada see kaart oma kätte.

source: When this card is Normal Summoned, select 1 monster your opponent controls. Destroy that monster during your 3rd Standby Phase after the Summon. This card cannot be destroyed by battle until this effect is resolved.
et: Kui see kaart on Normaal-Kutsutud, vali 1 koletis, mida sinu vastane kontrollib. Hävita see koletis oma 3. Ootefaasil pärast Kutsumist. Seda kaarti ei saa lahingus hävitada, kuni see efekt on lahendatud.

source: Amazoness Fighter
et: Amazoonia Võitleja

source: You take no Battle Damage from battles involving this card.
et: Sa ei saa selle kaardiga seotud lahingutest lahingukahju.

source: Amazoness Spellcaster
et: Amazoonlaste Nõid

source: Select 1 face-up "Amazoness" monster you control and 1 face-up monster your opponent controls. Switch the original ATK of these monsters until the end of this turn.
et: Vali 1 avatud "Amazoness" koletis, mida sa kontrollid, ja 1 avatud koletis, mida sinu vastane kontrollib. Vaheta nende koletiste algne ATK kuni selle käigu lõpuni.

source: Nightmare Wheel
et: Õudusunenäo Ratas

source: Select 1 monster your opponent controls. It cannot attack or change its battle position. When it is removed from the field, destroy this card. During each of your Standby Phases, your opponent takes 500 damage.
et: Vali 1 koletis, mida sinu vastane kontrollib. See ei saa rünnata ega muuta oma lahingupositsiooni. Kui see eemaldatakse väljakult, hävita see kaart. Iga sinu ooteetapi ajal saab sinu vastane 500 kahju.

source: Dramatic Rescue
et: Dramatiline päästmine

source: Activate only when a card is activated that targets an "Amazoness" monster. Return the targeted monster to its owner's hand and Special Summon 1 other monster from your hand.
et: Aktiveeri ainult siis, kui aktiveeritakse kaart, mis sihib "Amazoness" koletist. Tagasta sihitud koletis selle omaniku kätte ja Kutsu Eriliselt välja 1 teine koletis oma käest.

source: When this card is Normal Summoned, Flip Summoned, or Special Summoned, return all Set cards on the field to their owner's respective hands.
et: Kui see kaart on Normaal-Kutsutud, Pööratud-Kutsutud või Eriliselt Kutsutud, tagasta kõik Seatud kaardid väljakul nende omanike kätesse.

source: Dark Ruler Ha Des
et: Pimevalitseja Ha Des

source: This card cannot be Special Summoned from the Graveyard. Negate the effects of Effect Monsters destroyed by battle with Fiend-Type monsters you control.
et: Seda kaarti ei saa Hauakambrist Eriliselt Kutsuda. Tühista Efektikoletiste efektid, mis on hävitatud lahingus sinu kontrollitavate Deemonitüüpi koletistega.

source: Dark Balter the Terrible
et: Kohutav Tume Balter

source: "<M5304>Possessed Dark Soul<M>" + "<M5322>Frontier Wiseman<M>"<BR>A Fusion Summon of this monster can only be conducted with the above Fusion Material Monsters. When a Normal Spell Card is activated, negate the effect by paying 1000 Life Points. The effect of an Effect Monster that this monster destroys as a result of battle is negated.
et: "<M5304>Omandatud Tume Hing<M>" + "<M5322>Pioneer Tark<M>"<BR>Selle koletise Fusion Summon'i saab läbi viia ainult ülaltoodud Fusion Material Monsters'itega. Kui aktiveeritakse Tavaline Loitsukaart, tühista efekt, makstes 1000 Elupunkti. Efektikoletise efekt, mille see koletis lahingu tulemusena hävitab, on tühistatud.

source: Lesser Fiend
et: Väike Deemon

source: (This card is always treated as an "Archfiend" card.)<BR>As long as this monster remains face-up on the field, monsters destroyed by this monster as a result of battle are removed from play instead of being sent to the Graveyard.
et: (Seda kaarti käsitletakse alati kui "Archfiend" kaarti.)<BR>Niikaua kui see koletis jääb väljale avatud olekusse, eemaldatakse selle koletise poolt lahingus hävitatud koletised mängust, selle asemel et need saadetaks Hauakambrisse.

source: Possessed Dark Soul
et: Valduses Tume Hing

source: Tribute this face-up monster. Take control of all face-up Level 3 or lower monsters your opponent controls until they are removed from the field.
et: Ohverda see avatud koletis. Võta kontroll kõigi vastase avatud 3. taseme või madalamate koletiste üle, kuni need eemaldatakse väljakult.

source: Winged Minion
et: Tiivuline Käskija

source: Tribute this face-up card. Select 1 face-up Fiend-Type monster on the field. Increase the ATK and DEF of the monster by 700 points as long as it remains face-up on the field.
et: Ohverda see avatud kaart. Vali 1 avatud Deemon-tüüpi koletis väljal. Suurenda koletise ATK ja DEF 700 punkti võrra, kuni see jääb väljal avatuks.

source: Skull Knight #2
et: Kolju Rüütel #2

source: If you Tribute Summon a Fiend-Type monster by Tributing this monster, Special Summon 1 "<M5306>Skull Knight #2<M>" from your Deck. Then shuffle your Deck.
et: Kui sa kutsud ohverdades välja Deemon-tüüpi koletise, ohverdades selle koletise, kutsu eriliselt välja 1 "<M5306>Skull Knight #2<M>" oma pakist. Seejärel sega oma pakk.

source: Ryu-Kishin Clown
et: Ryu-Kishin Kloun

source: When this card is Summoned (including Flip Summon and Special Summon), select 1 face-up monster on the field and change its battle position.
et: Kui see kaart kutsutakse välja (sealhulgas ümberpööramine ja erikutsumine), vali 1 avatud koletis väljakul ja muuda selle lahinguasendit.

source: Twin-Headed Wolf
et: Kakspeaga Hunt

source: When there is another face-up Fiend-Type monster on your side of the field, negate the effect of Flip Effect Monsters destroyed by this card as a result of battle.
et: Kui sinu väljaku poolel on veel üks avatud deemonitüüpi koletis, tühista selle kaardi lahingus hävitatud ümberpööramise efektiga koletiste efekt.

source: Opticlops
et: Optiklops

source: A one-eyed giant that serves the "<M5301>Dark Ruler Ha Des<M>", it skewers its enemies with its sharp horn, shattering them to pieces.
et: Ühesilmne hiiglane, kes teenib "<M5301>Dark Ruler Ha Des<M>", torkab oma vaenlasi terava sarvega, purustades nad tükkideks.

source: Bark of Dark Ruler
et: Pimeduse Valitseja Haukumine

source: You can only activate this card during the Damage Step of a Battle Phase if a Fiend-Type monster on your side of the field battles. Pay Life Points (in multiples of 100 points) to decrease 1 of your opponent's monster's ATK and DEF by the same amount of points until the End Phase of that turn.
et: Seda kaarti saab aktiveerida ainult Lahingufaasi Kahjustusetapi ajal, kui sinu väljaku poolel võitleb Deemon-tüüpi koletis. Maksa Elupunkte (100 punkti kaupa), et vähendada ühe vastase koletise ATK ja DEF sama palju punkte kuni selle käigu Lõppfaasini.

source: Fatal Abacus
et: Saatuslik abakus

source: Each time 1 monster is sent from the field to the Graveyard, inflict 500 points of damage per card to the respective card owner's Life Points.
et: Iga kord, kui 1 koletis saadetakse väljakult Hauakambrisse, põhjusta 500 punkti kahju kaardi vastava omaniku Elupunktidele kaardi kohta.

source: Life Absorbing Machine
et: Elu Neelav Masin

source: During your Standby Phase, gain Life Points equal to half of the total Life Points you paid during your last turn.
et: Oma Standby Phase'i ajal saad Elupunkte, mis on võrdne poolega Elupunktidest, mida maksid oma viimasel käigul.

source: The Puppet Magic of Dark Ruler
et: Pimeduse Valitseja Nukumaagia

source: Select 1 Fiend-Type monster from your Graveyard. Remove from play monsters on your side of the field whose total Levels exactly equal the Level of the selected Fiend-Type monster. Then Special Summon the selected monster from your Graveyard.
et: Vali oma kalmistult 1 deemonitüüpi koletis. Eemalda mängust oma väljaku koletised, kelle kogutasemed on täpselt võrdsed valitud deemonitüüpi koletise tasemega. Seejärel kutsu valitud koletis oma kalmistult eriliselt välja.

source: Soul Demolition
et: Hinge hävitamine
