Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: Once per turn: You can gain 500 Life Points for each card in your opponent's hand.
et: Korra ühe korra käigu jooksul: Sa võid saada 500 Elupunkti iga kaardi eest, mis on sinu vastase käes.

source: At the start of the Damage Step, if this card battles an opponent's monster: You can return both monsters to the hand (without damage calculation).
et: Damage Stepi alguses, kui see kaart võitleb vastase koletisega: Sa võid mõlemad koletised käele tagasi saata (ilma kahjukalkulatsioonita).

source: When this card attacks or is attacked: Your opponent draws 1 card. Reveal it, and based on its type apply this effect.<BR>● Monster: End the Battle Phase.<BR>● Spell: If this card is attacking, you can change it to a direct attack instead.<BR>● Trap: Change this card to Defense Position.
et: Kui see kaart ründab või teda rünnatakse: Sinu vastane tõmbab 1 kaardi. Paljasta see ja rakenda selle tüübi põhjal järgmist efekti.<BR>● Koletis: Lõpeta Lahingufaas.<BR>● Võlu: Kui see kaart ründab, saad muuta selle otseseks rünnakuks.<BR>● Lõks: Muuda see kaart Kaitsepositsiooni.

source: Once per turn: You can target 1 face-up monster your opponent controls; until the End Phase, while you control this face-up card, this card's name and effects become those of that target.
et: Korra ühe korra käigu jooksul: Sa võid valida ühe vastase avatud koletise; kuni lõppfaasini, kui sa kontrollid seda avatud kaarti, muutuvad selle kaardi nimi ja efektid valitud sihtmärgi omadeks.

source: This card gains 400 ATK for each Spell/Trap Card your opponent controls.
et: See kaart saab 400 ATK iga Võlu-/Lõksukaardi eest, mida sinu vastane kontrollib.

source: Contact
et: Kontakt

source: Send all "Chrysalis" monsters you control to the Graveyard, and Special Summon 1 monster from your hand or Deck that is written in the card text of those cards.
et: Saada kõik "Chrysalis" koletised, mida sa kontrollid, Hauakambrisse ja Kutsu Eriliselt välja 1 koletis oma käest või Pakist, mis on nende kaartide tekstis kirjas.

source: Neo Space
et: Neo Kosmos

source: "<M6653>Elemental Hero Neos<M>" and all Fusion Monsters that list "<M6653>Elemental Hero Neos<M>" as a Fusion Material Monster gain 500 ATK. Fusion Monsters that list "<M6653>Elemental Hero Neos<M>" as a Fusion Material Monster do not have to have activate their effects during the End Phase that shuffle them into the Extra Deck.
et: "<M6653>Elementaalne Kangelane Neos<M>" ja kõik Fusion Monsterid, mis loetlevad "<M6653>Elementaalne Kangelane Neos<M>" kui Fusion Material Monster, saavad 500 ATK. Fusion Monsterid, mis loetlevad "<M6653>Elementaalne Kangelane Neos<M>" kui Fusion Material Monster, ei pea oma efektide aktiveerimiseks End Phase ajal neid Extra Decki tagasi segama.

source: Black Stego
et: Must Stego

source: When this card is selected as an attack target by your opponent's monster, this card is changed to Defense Position.
et: Kui sinu vastase koletis valib selle kaardi rünnaku sihtmärgiks, muutub see kaart kaitsepositsiooniks.

source: Ultimate Tyranno
et: Ülim Tyranno

source: If this card is in Attack Position at the beginning of your Battle Phase, first, you can and must attack all monsters on your opponent's side of the field once each with this card.
et: Kui see kaart on sinu Lahingu Faasi alguses Rünnakupositsioonis, siis esmalt pead sa ründama kõiki vastase poolel olevaid koletisi üks kord igaüht selle kaardiga.

source: Rallis the Star Bird
et: Rallis, Tähtlind

source: This card gains ATK equal to the Level of the monster that it battles × 200 during the Damage Step only. If this card attacks, it is removed from play at the end of the Damage Step and returned to your side of the field in face-up Attack Position at the beginning of your next turn's Battle Phase.
et: See kaart saab ATK, mis on võrdne koletise tasemega, millega ta võitleb × 200 ainult Kahjustuse Etapi ajal. Kui see kaart ründab, eemaldatakse see mängust Kahjustuse Etapi lõpus ja tagastatakse sinu väljale näoga ülespoole Rünnaku Asendis sinu järgmise käigu Lahingu Faasi alguses.

source: Fake Hero
et: Vale kangelane

source: Special Summon 11 "Elemental HERO" monster from your hand. That monster cannot attack, and returns to the hand during the End Phase.
et: Erikutsuge oma käest 1 "Elemental HERO" koletis. See koletis ei saa rünnata ja naaseb lõppfaasis kätte.

source: Common Soul
et: Tavaline Hing

source: Select 1 face-up monster on the field. Special Summon 1 "Neo-Spacian" monster from your hand to the same side of the field as the selected monster. The selected monster gains ATK equal to the ATK of the monster that was Special Summoned by this effect. When this card is removed from the field, return the Special Summoned monster to its owner's hand.
et: Vali 1 avatud positsioonis olev koletis väljakul. Kutsu eriliselt esile 1 "Neo-Spacian" koletis oma käest samale poolele väljakut kui valitud koletis. Valitud koletis saab ATK-d juurde võrdse koguse võrra eriliselt esile kutsutud koletise ATK-ga. Kui see kaart eemaldatakse väljakult, tagasta eriliselt esile kutsutud koletis selle omaniku kätte.

source: Spell Calling
et: Loitsu Kutse

source: When this face-down card is destroyed and sent to the Graveyard by the effect of a Spell or Trap Card controlled by your opponent, select 1 Quick-Play Spell Card from your Deck and Set it after showing it to your opponent.
et: Kui see kaardi tagakülg hävitatakse ja saadetakse Hauakambrisse vastase kontrollitava Loitsu või Lõksukaardi efekti tõttu, vali oma pakist 1 Kiirloitsu kaart ja aseta see pärast selle vastasele näitamist.

source: Future Fusion
et: Tuleviku Sulandumine

source: Reveal 1 Fusion Monster in your Extra Deck and send, from your Main Deck to the Graveyard, the Fusion Material Monsters that are listed on that Fusion Monster Card. During your 2nd Standby Phase after this card's activation, Special Summon 1 of that Fusion Monster from your Extra Deck and target it with this card. (This Special Summon is treated as a Fusion Summon.) When this card leaves the field, destroy that target. When that target is destroyed, destroy this card.
et: Paljasta 1 Fusion Monster oma Extra Deckist ja saada oma Main Deckist Hauakambrisse Fusion Material Monsters, mis on loetletud selle Fusion Monster kaardil. Selle kaardi aktiveerimise 2. Standby Phase'il, Special Summon 1 sellest Fusion Monsterist oma Extra Deckist ja sihi seda selle kaardiga. (See Special Summon käsitletakse kui Fusion Summon.) Kui see kaart lahkub väljakult, hävita see sihtmärk. Kui see sihtmärk hävitatakse, hävita see kaart.

source: Overload Fusion
et: Ülekoormuse Sulandumine

source: Banish, from your side of the field or your Graveyard, Fusion Material Monsters that are listed on a DARK Machine-Type Fusion Monster Card, then Special Summon that 1 Fusion Monster from your Extra Deck. (This Special Summon is treated as a Fusion Summon.)
et: Eemalda oma väljakult või oma Hauakambrist Fusion Materjal Koletised, mis on loetletud PIMEDAL Masina-Tüüpi Fusion Koletise Kaardil, seejärel Kutsu Eriliselt välja see 1 Fusion Koletis oma Lisa Pakkist. (See Eriline Kutsumine käsitletakse kui Fusion Kutsumist.)

source: Elemental Hero Stratos
et: Elementaalne Kangelane Stratos

source: When this card is Normal or Special Summoned: You can activate 1 of these effects:<BR>● You destroy Spell/Trap Cards on the field, up to the number of other "HERO" monsters you control.<BR>● Add 1 "HERO" monster from your Deck to your hand.
et: Kui see kaart on Normaal- või Erikutsutud: Sa saad aktiveerida ühe neist efektidest:<BR>● Sa hävitad Väljal olevad Loitsu/Lõksukaardid, kuni teiste sinu kontrollitavate "HERO" koletiste arvuni.<BR>● Lisa 1 "HERO" koletis oma pakist oma kätte.

source: Hero's Bond
et: Kangelase side

source: If there is a face-up "HERO" monster on the field: Special Summon 2 Level 4 or lower "Elemental HERO" monsters from your hand.
et: Kui väljakul on avatud "HERO" koletis: Kutsu oma käest välja 2 taseme 4 või madalama "Elemental HERO" koletist.

source: Dragonic Knight
et: Draakoni Rüütel

source: When the effect of an opponent's monster is activated that targets and destroys a card(s) you control, you can send the targeted card(s) to the Graveyard to Special Summon this card from your hand.
et: Kui aktiveeritakse vastase koletise efekt, mis sihib ja hävitab sinu kontrollitava kaardi(d), saad sihitud kaardi(d) saata Hauakambrisse, et eriliselt kutsuda see kaart oma käest välja.

source: You can Tribute 1 "<M3930>Eva Token<M>" to Special Summon this card from your hand. While this card is in your Graveyard, each time a monster(s) your opponent controls is removed from play, Special Summon 1 "<M3930>Eva Token<M>" (Fiend-Type/DARK/Level 2/ATK 500/DEF 500).
et: Saad ohverdada 1 "<M3930>Eva Token<M>", et Kutsuda see kaart oma käest. Kui see kaart on sinu Hauas, siis iga kord, kui vastase kontrollitav(ad) koletis(ed) eemaldatakse mängust, Kutsu Eriliselt 1 "<M3930>Eva Token<M>" (Deemonitüüp/PIMEDUS/Tase 2/ATK 500/DEF 500).

source: This normally gentle dinosaur enjoys relaxing in its nest in the prairies. If it becomes angered, it turns terribly ferocious.
et: See tavaliselt leebe dinosaurus naudib preerias oma pesas lõõgastumist. Kui see vihastub, muutub see kohutavalt raevukaks.

source: Miracle Jurassic Egg
et: Imeline Jura muna

source: While this card is face-up on your side of the field, this card cannot be removed from play. Place 2 counters on this card each time a Dinosaur-Type Monster Card is sent to your Graveyard. By Tributing this card, select and Special Summon 1 Dinosaur-Type monster from your Deck whose Level is equal to or lower than the number of counters on this card when it was Tributed.
et: Kui see kaart on sinu väljaku poolel avatud, ei saa seda kaarti mängust eemaldada. Pane sellele kaardile 2 loendurit iga kord, kui Dinosauruse-tüüpi koletise kaart saadetakse sinu Hauakambrisse. Ohverdades selle kaardi, vali ja Kutsu Eriliselt välja 1 Dinosauruse-tüüpi koletis oma Pakist, mille tase on võrdne või madalam kui sellel kaardil ohverdamise hetkel olnud loendurite arv.

source: Black Ptera
et: Must Ptera

source: When this card is sent from the field to the Graveyard, except when destroyed as a result of battle, it is returned to the owner's hand.
et: Kui see kaart saadetakse väljakult Hauakambrisse, välja arvatud lahingu tulemusena hävitamise korral, tagastatakse see omaniku kätte.

source: If this card is destroyed by an effect and sent it to the Graveyard, select 1 Level 4 or lower Dinosaur-Type monster from your Deck and Special Summon it.
et: Kui see kaart hävitatakse efekti tõttu ja saadetakse Hauakambrisse, vali oma pakist 1. taseme 4 või madalama tasemega Dinosauruse-tüüpi koletis ja kutsu see eriliselt välja.

source: Alien Grey
et: Tulnukas Hall

source: FLIP: Place 1 A-Counter on 1 face-up monster on your opponent's side of the field. (If a monster with an A-Counter battles an "Alien" monster, it loses 300 ATK and DEF for each A-Counter during damage calculation only.) After this card has been flipped face-up, when it is destroyed by battle and sent to the Graveyard, draw 1 card.
et: FLIP: Aseta 1 A-loendur ühele vastase väljaku avatud poolel olevale koletisele. (Kui koletis, millel on A-loendur, võitleb "Tulnuka" koletisega, kaotab see iga A-loenduri kohta 300 ATK ja DEF ainult kahju arvutamise ajal.) Pärast selle kaardi avamist, kui see hävitatakse lahingus ja saadetakse Hauakambrisse, tõmba 1 kaart.

source: Alien Mars
et: Välismaalane Mars

source: The effects of Effect Monsters with A-Counters are negated, except for "<M6801>Alien Mars<M>".
et: Efektikoletistega koletiste, millel on A-loendurid, efektid on tühistatud, välja arvatud "<M6801>Alien Mars<M>".

source: Alien Skull
et: Tulnukkolju

source: You can Tribute 1 face-up Level 3 or lower monster on your opponent's side of the field to Special Summon this card to your opponent's side of the field. If you Special Summon the monster this way, place 1 A-Counter on this card, and you cannot Normal Summon or Set the same turn. (If a monster with an A-Counter battles an "Alien" monster, it loses 300 ATK and DEF for each A-Counter during damage calculation only.)
et: Saad ohverdada 1 vastase väljaku poolel oleva avatud 3. taseme või madalama koletise, et Kutsuda see kaart eriliselt vastase väljaku poolele. Kui Kutsud koletise eriliselt sel viisil, aseta sellele kaardile 1 A-loendur ja sa ei saa samal käigul normaalset Kutsumist ega Asetamist teha. (Kui koletis, millel on A-loendur, võitleb "Tulnuka" koletisega, kaotab see iga A-loenduri kohta 300 ATK ja DEF ainult kahju arvutamise ajal.)

source: Alien Hunter
et: Tulnukakütt

source: If this card destroys a monster with an A-Counter by battle, it can attack once again in a row.
et: Kui see kaart hävitab lahingus A-loenduriga koletise, võib see rünnata veel kord järjest.

source: Alien Warrior
et: Tulnukas Sõdalane

source: When this card is destroyed by battle and sent to the Graveyard, place 2 A-Counters on the monster that destroyed it. (If a monster with an A-Counter battles an "Alien" monster, it loses 300 ATK and DEF for each A-Counter during damage calculation only.)
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse, aseta 2 A-loendurit koletisele, kes selle hävitas. (Kui koletis, millel on A-loendur, võitleb "Tulnukas" koletisega, kaotab see iga A-loenduri kohta 300 ATK ja DEF ainult kahju arvutamise ajal.)

source: Alien Mother
et: Tulnuka Ema

source: If this card destroys a monster with an A-Counter by battle and sends it to the Graveyard, Special Summon the destroyed monster to your side of the field at the end of the Battle Phase. When this card is removed from the field, all monsters that were Special Summoned by this card's effect are destroyed.
et: Kui see kaart hävitab lahingus A-loenduriga koletise ja saadab selle Hauakambrisse, kutsu hävitatud koletis lahingufaasi lõpus oma väljaku poolele. Kui see kaart eemaldatakse väljalt, hävitatakse kõik koletised, mis kutsuti selle kaardi efekti abil.

source: Cosmic Horror Gangi'el
et: Kosmiline õudus Gangi'el

source: If you're Tributing a monster on your side of the field that is owned by your opponent, this card can be Normal Summoned with 1 Tribute. Once per turn, you can place 1 A-Counter on a monster on your opponent's side of the field. (If a monster with an A-Counter battles an "Alien" monster, it loses 300 ATK and DEF for each A-Counter during damage calculation only.)
et: Kui ohverdad oma väljaku poolel oleva koletise, mis kuulub sinu vastasele, saab selle kaardi Normaal-Kutsuda 1 ohverdusega. Kord ühe käigu jooksul saad asetada 1 A-loenduri koletisele, mis on sinu vastase väljaku poolel. (Kui koletis, millel on A-loendur, võitleb "Tulnuka" koletisega, kaotab see iga A-loenduri kohta 300 ATK ja DEF ainult kahju arvutamise ajal.)

source: Flying Saucer Muusik'i
et: Lendav Taldrik Muusik'i

source: While this card is face-up on the field, you can select and add 1 "Alien" card from your Deck to your hand instead of conducting your normal draw during your Draw Phase.
et: Kui see kaart on lahinguväljal avatud, võid oma Tõmbamisfaasis tavalise tõmbamise asemel valida ja lisada oma käele 1 "Tulnuka" kaardi oma pakist.

source: Crop Circles
et: Põlluringid

source: Send any number of monsters from your side of the field to the Graveyard to activate this card. Select from your Deck 1 "Alien" monster whose Level is equal to the total Levels of the sent monsters, and Special Summon it. If you fail to find a monster to Special Summon, you take 2000 damage.
et: Saada ükskõik milline arv koletisi oma väljalt Hauakambrisse, et aktiveerida see kaart. Vali oma pakist 1 "Alien" koletis, mille tase on võrdne saadetud koletiste kogutasemega, ja Kutsu see Eriliselt välja. Kui sul ei õnnestu leida koletist, keda Eriliselt välja kutsuda, saad sa 2000 kahju.

source: The Paths of Destiny
et: Saatuseteed

source: Both players toss a coin once. If a player's result is Heads, they gain 2000 Life Points, and if their result is Tails, they take 2000 damage.
et: Mõlemad mängijad viskavad korra münti. Kui mängija tulemus on kull, saab ta 2000 Elupunkti, ja kui tulemus on kiri, saab ta 2000 kahju.

source: Orbital Bombardment
et: Orbitaalne pommitamine

source: Send 1 "Alien" monster from your side of the field to the Graveyard to activate this card. Destroy 1 Spell or Trap Card on the field.
et: Saada 1 "Alien" koletis oma väljaku poolelt kalmistule, et aktiveerida see kaart. Hävita 1 Võlu- või Lõksukaart väljal.

source: Fossil Excavation
et: Fossiilikaevamine

source: Discard 1 card from your hand. Select 1 Dinosaur-Type monster in your Graveyard and Special Summon it. An Effect Monster Special Summoned this way has its effect negated. When this card is removed from the field, destroy that monster. When the monster is destroyed, destroy this card.
et: Viska 1 kaart oma käest. Vali 1 Dinosaurus-tüüpi koletis oma Hauakambris ja Kutsu see Eriliselt välja. Sellel viisil Eriliselt Väljakutsutud Efektkoletisel on tema efekt tühistatud. Kui see kaart eemaldatakse väljakult, hävita see koletis. Kui koletis hävitatakse, hävita see kaart.

source: Brainwashing Beam
et: Ajupesu kiir

source: Select 1 monster with at least 1 A-Counter on your opponent's side of the field, and take control of that monster. During each of your End Phases, remove 1 A-Counter from that controlled monster. If all A-Counters are removed from this monster, or that monster is destroyed, destroy this card.
et: Vali 1 koletis, millel on vähemalt 1 A-loendur sinu vastase väljaku poolel, ja võta selle koletise üle kontroll. Iga oma lõppfaasi ajal eemalda 1 A-loendur sellest kontrollitud koletisest. Kui kõik A-loendurid on sellelt koletiselt eemaldatud või see koletis hävitatakse, hävita see kaart.

source: Royal Writ of Taxation
et: Kuninglik maksukäsk

source: Activate only during your opponent's Standby Phase. Select 1 random card from your opponent's hand and look at it. Unless the selected card or a card with the same name is Normal Summoned or activated by the end of your next turn, inflict 1000 damage to your opponent. If the selected card or a card with the same name is Normal Summoned or activated by the end of your next turn, you take 1000 damage.
et: Aktiveeri ainult oma vastase Ootefaasil. Vali 1 juhuslik kaart oma vastase käest ja vaata seda. Kui valitud kaart või sama nimega kaart ei ole tavaline kutsutud või aktiveeritud sinu järgmise käigu lõpuks, põhjusta oma vastasele 1000 kahju. Kui valitud kaart või sama nimega kaart on tavaline kutsutud või aktiveeritud sinu järgmise käigu lõpuks, saad sina 1000 kahju.

source: Cyclone Blade
et: Tormiketas

source: Equip only to a "Destiny HERO" monster. At the end of the Damage Step, if the equipped monster attacked: Target 1 Spell/Trap Card on the field; destroy that target.
et: Varusta ainult „Destiny HERO” koletisega. Kahjustusetapi lõpus, kui varustatud koletis ründas: sihi 1 Võlu-/Lõksukaarti väljal; hävita see sihtmärk.

source: Toy Magician
et: Mänguasi Maag

source: You can Set this card face-down in your Spell & Trap Card Zone as a Spell Card. If this face-down card in your Spell & Trap Card Zone is destroyed by an opponent's card effect and sent to the Graveyard, Special Summon it during the End Phase. When this card is Flip Summoned, destroy Spell or Trap Cards on the field equal to the number of "<M6815>Toy Magician<M>" on the field.
et: Sa saad selle kaardi asetada oma Võlu- ja Lõksukaartide alasse näoga allapoole kui Võlukaardi. Kui see näoga allapoole kaart sinu Võlu- ja Lõksukaartide alas hävitatakse vastase kaardi efekti tõttu ja saadetakse Hauakambrisse, kutsu see eriliselt välja Lõppfaasis. Kui see kaart on ümber pööratud, hävita Võlu- või Lõksukaardid väljal, mis on võrdne väljal olevate "<M6815>Toy Magician<M>" arvuga.

source: Super Conductor Tyranno
et: Superjuhtiv Türannosaurus

source: Once per turn, you can Tribute 1 monster to inflict 1000 damage to your opponent. This monster cannot declare an attack during the turn you activate this effect.
et: Korra ühe käigu jooksul võid ohverdada 1 koletise, et tekitada oma vastasele 1000 kahju. See koletis ei saa rünnata käigu jooksul, mil sa selle efekti aktiveerid.

source: Hunting Instinct
et: Küttimisinstinkt

source: Activate only when a monster is Special Summoned to your opponent's side of the field. Special Summon 1 Dinosaur-Type monster from your hand.
et: Aktiveeri ainult siis, kui koletis kutsutakse eriliselt sinu vastase väljale. Kutsu eriliselt 1 dinosauruse-tüüpi koletis oma käest.

source: Survival Instinct
et: Ellujäämisinstinkt

source: Select any number of Dinosaur-Type monsters in your Graveyard and remove them from play. Gain 400 Life Points for each Dinosaur-Type monster you removed.
et: Vali oma Hauakambris olevate Dinosauruse-tüüpi koletiste hulgast ükskõik kui palju ja eemalda nad mängust. Saad 400 Elupunkti iga eemaldatud Dinosauruse-tüüpi koletise eest.

source: Big Evolution Pill
et: Suur Evolutsioonipill

source: Tribute 1 Dinosaur-Type monster to activate this card. This card remains face-up on the field for 3 of your opponent's turns. While this card is face-up on the field, you can Normal Summon or Set Dinosaur-Type monsters without Tributing.
et: Ohverda 1 Dinosaurus-tüüpi koletis, et aktiveerida see kaart. See kaart jääb lahinguväljale ülespoole 3 sinu vastase käigu jooksul. Kui see kaart on lahinguväljal ülespoole, saad sa Normaalset Kutsuda või Paigutada Dinosaurus-tüüpi koletisi ilma ohverdamata.

source: Light and Darkness Dragon
et: Valguse ja Pimeduse Draakon

source: This card cannot be Special Summoned. While this card is face-up on the field, its Attribute is also treated as DARK. When a Spell or Trap Card is activated, or the effect of an Effect Monster is activated, that activation is negated and this card loses 500 ATK and DEF. When this card is destroyed and sent to the Graveyard, select 1 monster in your Graveyard. Then destroy all cards you control, and Special Summon that monster.
et: Seda kaarti ei saa eriliselt kutsuda. Kui see kaart on väljakul avatud, käsitletakse selle atribuuti ka kui PIMEDUST. Kui aktiveeritakse Võlu- või Lõksukaart või aktiveeritakse Efektikoletise efekt, siis see aktiveerimine tühistatakse ja see kaart kaotab 500 ATK ja DEF. Kui see kaart hävitatakse ja saadetakse Hauakambrisse, vali 1 koletis oma Hauakambris. Seejärel hävita kõik kaardid, mida sa kontrollid, ja kutsu see koletis eriliselt välja.

source: Tail Swipe
et: Saba löök

source: Select 1 face-up Level 5 or higher Dinosaur-Type monster on your side of the field to activate this card. Select and return to the owner's hand(s) up to 2 monsters that are either lower Level than the selected monster or face-down on your opponent's side of the field.
et: Vali 1 avatud tasemega 5 või kõrgem Dinosauruse-tüüpi koletis oma väljaku poolelt, et aktiveerida see kaart. Vali ja tagasta omaniku(te) kätte kuni 2 koletist, mis on kas madalama tasemega kui valitud koletis või vastase väljaku poolel tagurpidi.

source: Jurassic World
et: Juura maailm

source: All face-up Dinosaur-Type monsters gain 300 ATK and DEF.
et: Kõik avatud Dinosauruse-tüüpi koletised saavad 300 ATK ja DEF juurde.

source: Volcanic Eruption
et: Vulkaani purse

source: Activate only during your End Phase while "<M6823>Jurassic World<M>" is on your side of the field. Destroy all cards on the field.
et: Aktiveeri ainult oma lõppfaasis, kui "<M6823>Jurassic World<M>" on sinu väljaku poolel. Hävita kõik kaardid väljal.

source: Seismic Shockwave
et: Seismiline Šokklaine
