Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: There can only be 1 face-up "Earthbound Immortal" monster on the field. If there is no face-up Field Spell Card on the field, destroy this card. Your opponent cannot select this card as an attack target. This card can attack your opponent directly. When this card is Normal Summoned, return up to 3 cards you control to your Deck, except this card, and discard the same number of cards from your opponent's hand at random. This card gains 1000 ATK for each card discarded by this effect.
et: Väljal võib olla ainult 1 avatud "Earthbound Immortal" koletis. Kui väljal ei ole avatud Väljaloitsu Kaarti, hävita see kaart. Sinu vastane ei saa valida seda kaarti rünnaku sihtmärgiks. See kaart võib rünnata sinu vastast otse. Kui see kaart on Normaalkutsutud, tagasta kuni 3 kaarti, mida sa kontrollid, oma pakki, välja arvatud see kaart, ja viska sama arv kaarte juhuslikult oma vastase käest ära. See kaart saab 1000 ATK iga selle efekti tõttu ära visatud kaardi eest.

source: Koa'ki Meiru Sea Panther
et: Koa'ki Meiru Meripanter

source: During each of your End Phases, destroy this card unless you send 1 "<M8207>Iron Core of Koa'ki Meiru<M>" from your hand to the Graveyard or reveal 1 WATER monster in your hand. Once per turn, you can send 1 "<M8207>Iron Core of Koa'ki Meiru<M>" from your hand to the Graveyard to return 1 Spell Card from your Graveyard to the top of your Deck.
et: Iga oma lõppfaasis hävita see kaart, kui sa ei saada 1 "<M8207>Koa'ki Meiru Raudtuum<M>" oma käest hauakambrisse või ei näita 1 VEE koletist oma käes. Kord ühe käigu jooksul võid saata 1 "<M8207>Koa'ki Meiru Raudtuum<M>" oma käest hauakambrisse, et tagastada 1 Loitsukaart oma hauakambrist oma paki tippu.

source: During each of your End Phases, destroy this card unless you send 1 "<M8207>Iron Core of Koa'ki Meiru<M>" from your hand to the Graveyard or reveal 1 Warrior-Type monster in your hand. You can Tribute Summon this card by Tributing 1 "Koa'ki Meiru" monster. When this card is Normal Summoned, you can remove from play 1 "Koa'ki Meiru" card in your Graveyard to destroy up to 2 cards your opponent controls.
et: Iga lõpuetapi ajal hävita see kaart, kui sa ei saada 1 "<M8207>Koa'ki Meiru Raudtuum<M>" oma käest Hauakambrisse või ei näita 1 Sõdalase-tüüpi koletist oma käes. Sa võid selle kaardi pakkuda ohvriks, pakkudes ohvriks 1 "Koa'ki Meiru" koletise. Kui see kaart on normaalselt kutsutud, võid sa eemaldada mängust 1 "Koa'ki Meiru" kaardi oma Hauakambrist, et hävitada kuni 2 kaarti, mida su vastane kontrollib.

source: Tuned Magician
et: Häälestatud Maag

source: This card is treated as a Normal Monster while face-up on the field or in the Graveyard. While this card is face-up on the field, you can Normal Summon it to have it be treated as an Effect Monster with this effect:<BR>● This card is treated as a Tuner Monster.
et: Seda kaarti käsitletakse tavalisena koletisena, kui see on lahinguväljal või hauas. Kui see kaart on lahinguväljal, saate selle normaalselt kutsuda, et seda käsitletaks efektikoletisena järgmise efektiga:<BR>● Seda kaarti käsitletakse häälestajana.

source: Crusader of Endymion
et: Endymioni ristisõdija

source: This card is treated as a Normal Monster while face-up on the field or in the Graveyard. While this card is face-up on the field, you can Normal Summon it to have it be treated as an Effect Monster with this effect:<BR>● Once per turn, you can place 1 Spell Counter on a face-up card on the field that you can place a Spell Counter on. If you do, this card gains 600 ATK until the End Phase.
et: Seda kaarti käsitletakse tavalise koletisena, kui see on väljaku peal või hauas. Kui see kaart on väljaku peal, võid selle normaalselt kutsuda, et seda käsitletaks efektikoletisena järgmise efektiga:<BR>● Kord kord käigu jooksul võid asetada 1 loitsuloenduri väljaku peal olevale kaardile, millele saab loitsuloenduri asetada. Kui teed seda, saab see kaart 600 ATK juurde kuni lõppfaasini.

source: Woodland Archer
et: Metsakütt

source: This card cannot be Normal Summoned or Set. This card cannot be Special Summoned except by having 2 or more Normal Monsters in your Graveyard. You can Tribute this card to add 1 Gemini monster from your Deck to your hand.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti ei saa eriliselt kutsuda, välja arvatud juhul, kui teie hauas on 2 või rohkem normaalset koletist. Saate selle kaardi ohverdada, et lisada oma pakist 1 Kaksik-koletis oma kätte.

source: Knight of the Red Lotus
et: Punase Lootose Rüütel

source: If you have exactly 3 Normal Monsters in your Graveyard, you can Special Summon this card from your hand by removing from play 2 Normal Monsters from your Graveyard. Once per turn, you can select and Special Summon 1 Level 4 or lower Normal Monster from your Graveyard.
et: Kui sul on täpselt 3 tavalist koletist oma hauas, saad selle kaardi oma käest eriliselt välja kutsuda, eemaldades mängust 2 tavalist koletist oma hauast. Kord käigu jooksul saad valida ja eriliselt välja kutsuda 1 4. taseme või madalama tavalise koletise oma hauast.

source: Energy Bravery
et: Energiavapperus

source: Gemini monsters you control that are being treated as Effect Monsters cannot be destroyed by card effects.
et: Gemini koletised, keda sa kontrollid ja keda käsitletakse Efektikoletistena, ei saa kaardiefektide tõttu hävitatud.

source: Swap Frog
et: Vahetus Konn

source: You can discard 1 WATER monster to Special Summon this card from your hand. When this card is Summoned, you can select and send 1 Level 2 or lower Aqua-Type WATER monster from your Deck or your side of the field to the Graveyard. Once per turn, you can return 1 monster you control to your hand to Normal Summon 1 "Frog" monster, except "<M8469>Swap Frog<M>" or "<M4555>Frog the Jam<M>", in addition to your Normal Summon or Set this turn.
et: Saad ühe VEE koletise ära visata, et see kaart oma käest eriliselt välja kutsuda. Kui see kaart välja kutsutakse, saad valida ja saata oma pakist või oma väljaku poolelt kalmistule ühe 2. taseme või madalama Aqua-tüüpi VEE koletise. Kord käigu jooksul saad ühe koletise, mida sa kontrollid, oma kätte tagasi saata, et tavaliselt välja kutsuda üks "Konna" koletis, välja arvatud "<M8469>Swap Frog<M>" või "<M4555>Frog the Jam<M>", lisaks oma tavapärasele välja kutsumisele või seadistamisele sellel käigul.

source: Lord British Space Fighter
et: Lord Britishi kosmoselennuk

source: If this card destroys an opponent's monster by battle, select and activate 1 of these effects:<BR>● You can attack once again in a row.<BR>● Select and destroy 1 Set card on the field.<BR>● Special Summon 1 "<M3961>Multi Token<M>" (Machine-Type/LIGHT/Level 4/ATK 1200/DEF 1200).
et: Kui see kaart hävitab lahingus vastase koletise, vali ja aktiveeri üks järgmistest efektidest:<BR>● Sa saad rünnata veel ühe korra järjest.<BR>● Vali ja hävita üks seatud kaart väljal.<BR>● Kutsu eriliselt välja 1 "<M3961>Multi Token<M>" (Masina tüüp/VALGUS/Tase 4/RÜNNAK 1200/KAITSE 1200).

source: While you control this face-up card, your opponent cannot select a monster other than "<M8471>Oshaleon<M>" as an attack target. When this card is destroyed by battle and sent to the Graveyard, you can add 1 Reptile-Type monster with 500 ATK or less from your Deck to your hand.
et: Kui sa kontrollid seda avatud kaarti, ei saa sinu vastane valida rünnaku sihtmärgiks ühtegi teist koletist peale "<M8471>Oshaleon<M>". Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse, saad lisada oma pakist oma kätte ühe Reptiili-tüüpi koletise, millel on 500 ATK või vähem.

source: Djinn Releaser of Rituals
et: Rituaalide Vabastaja Džinn

source: When you Ritual Summon a Ritual Monster, you can remove from play this card from your Graveyard as 1 of the monsters required for the Ritual Summon. While the monster Ritual Summoned using this card is face-up on the field, your opponent cannot Special Summon.
et: Kui sa kutsud välja Rituaalikoletise, võid selle kaardi oma Hauakambrist mängust eemaldada kui ühe koletise, mida Rituaalikutsumiseks vaja on. Kui selle kaardiga Rituaalikutsutud koletis on väljakul avatud, ei saa sinu vastane Erakutsuda.

source: Djinn Presider of Rituals
et: Rituaalide Djinn Presider

source: When you Ritual Summon a Ritual Monster, you can remove from play this card from your Graveyard as 1 of the monsters required for the Ritual Summon. If the monster Ritual Summoned using this card destroys a monster by battle, the controller of the Ritual Monster draws 1 card.
et: Kui sa kutsud rituaalikoletise rituaalikutsumisega, saad selle kaardi oma hauakambrist mängust eemaldada ühe rituaalikutsumiseks vajaliku koletisena. Kui selle kaardiga rituaalikutsutud koletis hävitab lahingus koletise, tõmbab rituaalikoletise juht 1 kaardi.

source: Divine Grace - Northwemko
et: Jumalik Arm - Northwemko

source: This card can only be Ritual Summoned with the Ritual Spell Card, "Ritual of Grace". When this card is Ritual Summoned, select a number of face-up cards on the field (except this card), up to the number of monsters you used for the Ritual Summon. While any of the selected cards are face-up on the field, this card cannot be destroyed by card effects.
et: Seda kaarti saab Rituaali Kutsuda ainult Rituaali Loitsukaardiga "Grace'i Rituaal". Kui see kaart on Rituaali Kutsutud, vali välja hulk avatud kaarte väljakul (välja arvatud see kaart), kuni nende koletiste arvuni, mida sa kasutasid Rituaali Kutsumiseks. Kuni mõni valitud kaartidest on väljakul avatud, ei saa seda kaarti kaardiefektidega hävitada.

source: Savior Star Dragon
et: Päästja Tähedraakon

source: "<M8436>Savior Dragon<M>" + "<M7734>Stardust Dragon<M>" + 1 non-Tuner monster<BR>You can Tribute this card to negate the activation of an opponent's Spell Card, Trap Card, or Effect Monster's effect and destroy all cards your opponent controls. Once per turn, you can negate the effect(s) of 1 face-up monster your opponent controls until the End Phase. Also, if the negated effect can be activated, you can activate it once as this card's effect. During the End Phase, return this card from the field to the Extra Deck, and Special Summon 1 "<M7734>Stardust Dragon<M>" from your Graveyard.
et: "<M8436>Päästja Draakon<M>" + "<M7734>Tähelend Draakon<M>" + 1 mitte-Tuuner koletis<BR>Sa võid ohverdada selle kaardi, et tühistada vastase Loitsukaardi, Lõksukaardi või Efektikoletise efekti aktiveerimine ja hävitada kõik kaardid, mida vastane kontrollib. Kord ühe käigu jooksul võid tühistada ühe vastase kontrollitava avatud koletise efekti kuni Käigu Lõpuni. Samuti, kui tühistatud efekti saab aktiveerida, võid seda aktiveerida korra selle kaardi efektina. Käigu Lõpus tagasta see kaart väljakult Ekstra Paki ja Kutsu Eriliselt välja 1 "<M7734>Tähelend Draakon<M>" oma Hauakambrist.

source: Blackwing - Silverwind the Ascendant
et: Musta Tiib - Tõusev Hõbetuul

source: 1 "Blackwing" Tuner Monster + 2 or more non-Tuner monsters<BR>When this card is Synchro Summoned, you can select and destroy up to 2 face-up monsters on the field with DEF lower than this card's ATK. You cannot conduct your Battle Phase the turn you activate this effect. The next time a "Blackwing" monster you control would be destroyed by battle during your opponent's turn, it is not destroyed; this effect only happens once.
et: 1 "Mustade tiibade" häälestuskoletis + 2 või rohkem mitte-häälestuskoletist<BR>Kui see kaart on Sünkroonväljakutsutud, saad valida ja hävitada kuni 2 avatud koletist väljal, mille DEF on madalam kui selle kaardi ATK. Sa ei saa läbi viia oma Lahingufaasi sellel käigul, mil aktiveerid selle efekti. Järgmine kord, kui "Mustade tiibade" koletis, mida sa kontrollid, hävitatakse lahingus sinu vastase käigu ajal, ei hävitata seda; see efekt toimub ainult üks kord.

source: 1 "Reptilianne" Tuner + 1 or more non-Tuner monsters<BR>When this card is Synchro Summoned, destroy all face-up monsters with 0 ATK that your opponent controls, and draw 1 card for each monster destroyed.
et: 1 "Reptilianne" Tuner + 1 või rohkem mitte-Tuner koletist<BR>Kui see kaart on Sünkro Kutsutud, hävita kõik vastase kontrolli all olevad avatud koletised, mille ATK on 0, ja tõmba 1 kaart iga hävitatud koletise kohta.

source: Black Brutdrago
et: Must Brütodraak

source: 1 Tuner + 1 or more non-Tuner Gemini monsters<BR>Once per turn, you can send 1 Gemini monster from your hand to the Graveyard to select and destroy 1 Spell or Trap Card your opponent controls. When this card is destroyed and sent to the Graveyard, you can select 1 Gemini monster in your Graveyard and Special Summon it. The Special Summoned Gemini monster is treated as an Effect Monster, and gains its effect.
et: 1 Tuner + 1 või rohkem mitte-Tuner Kaksikmonstrit<BR>Korra käigu jooksul saad saata 1 Kaksikmonstri oma käest Hauakambrisse, et valida ja hävitada 1 Loitsu- või Lõksukaart, mida su vastane kontrollib. Kui see kaart hävitatakse ja saadetakse Hauakambrisse, saad valida 1 Kaksikmonstri oma Hauakambris ja Kutsuda see Eriliselt välja. Eriliselt välja kutsutud Kaksikmonstrit käsitletakse Efektimonstrina ja see saab oma efekti.

source: Explosive Magician
et: Plahvatuslik Maag

source: 1 Tuner + 1 or more non-Tuner Spellcaster monsters<BR>You can remove 2 Spell Counters from your side of the field to select and destroy 1 Spell Card or Trap Card your opponent controls.
et: 1 Tuner + 1 või rohkem mitte-Tuner Võluri koletist<BR>Sa võid eemaldada 2 Loitsuloendurit oma väljaku poolelt, et valida ja hävitada 1 Loitsukaart või Lõksukaart, mida su vastane kontrollib.

source: Spider Web
et: Ämblikuvõrk

source: If a monster declares an attack, it is changed to Defense Position at the end of the Damage Step. It cannot change its battle position until the End Phase of its controller's next turn, while this card remains on the field.
et: Kui koletis kuulutab rünnaku, muudetakse see Kahjustuse Etapi lõpus Kaitsepositsiooniks. See ei saa oma lahingupositsiooni muuta enne oma kontrollija järgmise käigu Lõppfaasi, kui see kaart jääb väljakule.

source: Earthbound Whirlwind
et: Maa-seotud keeristorm

source: Activate only while you control a face-up "Earthbound Immortal" monster. Destroy all Spell and Trap Cards your opponent controls.
et: Aktiveeri ainult siis, kui sa kontrollid avatud "Earthbound Immortal" koletist. Hävita kõik Võlu- ja Lõksukaardid, mida su vastane kontrollib.

source: Savage Colosseum
et: Metsik Kolosseum

source: If a monster attacks, its controller gains 300 Life Points at the end of the Damage Step. All monsters must attack, if able. During the End Phase, destroy all face-up Attack Position monsters the turn player controls, that did not declare an attack.
et: Kui koletis ründab, saab selle juht 300 Elupunkti Damage Step'i lõpus. Kõik koletised peavad ründama, kui võimalik. End Phase'i ajal hävita kõik avatud Rünnakupositsioonis koletised, mida käigu mängija kontrollib ja mis ei kuulutanud rünnakut.

source: Attack Pheromones
et: Ründeferomoonid

source: If a monster you control attacks a Defense Position monster, change that monster to face-up Attack Position at the end of the Damage Step if your attacking monster is Reptile-Type.
et: Kui sinu kontrollitav koletis ründab kaitseasendis koletist, muuda see koletis näoga ülespoole ründeasendisse Kahjustuse etapi lõpus, kui sinu ründav koletis on roomajatüüpi.

source: Molting Escape
et: <translated Sulgnemine Põgenemine

source: Equip only to a Reptile-Type monster. Once per turn, if the equipped monster would be destroyed by battle, it is not destroyed. The equipped monster gains 300 ATK at the end of the Damage Step each time this effect is applied.
et: Varusta ainult Reptiil-tüüpi koletisele. Kord käigu jooksul, kui varustatud koletis hävitatakse lahingus, siis seda ei hävitata. Varustatud koletis saab iga kord, kui see efekt rakendub, 300 ATK juurde Kahjustuse Etapi lõpus.

source: Reptilianne Spawn
et: Reptilianne Kude

source: Remove from play 1 "Reptilianne" monster from your Graveyard. Special Summon 2 "<M3962>Reptilianne Token <M>"(s) (Reptile-Type/EARTH/Level 1/ATK 0/DEF 0) to your side of the field.
et: Eemalda oma kalmistult mängust 1 "Reptilianne" koletis. Kutsu eriliselt välja 2 "<M3962>Reptilianne Token <M>"(it) (Roomaja-tüüp/MAA/Tase 1/ATK 0/DEF 0) oma väljaku poolele.

source: Fortune's Future
et: Õnne Tulevik

source: Select 1 of your removed from play "Fortune Lady" monsters and return it to the Graveyard. Then draw 2 cards.
et: Vali 1 oma mängust eemaldatud "Fortune Lady" koletist ja vii see Hauakambrisse tagasi. Seejärel tõmba 2 kaarti.

source: Time Passage
et: Aja möödumine

source: Increase the Level of 1 face-up "Fortune Lady" monster you control by 3, until the End Phase.
et: Suurenda ühe sinu kontrolli all oleva avatud "Fortune Lady" koletise taset 3 võrra kuni lõppfaasini.

source: Iron Core Armor
et: Raudtuuma Rüü

source: Equip only to a "Koa'ki Meiru" monster. During damage calculation only, monsters that battle with the equipped monster lose ATK equal to the equipped monster's Level x 100. If the equipped monster would be destroyed during the End Phase, you can send this card to the Graveyard instead.
et: Varusta ainult "Koa'ki Meiru" koletisele. Ainult kahju arvutamise ajal kaotavad koletised, kes võitlevad varustatud koletisega, ATK-d, mis on võrdne varustatud koletise tasemega x 100. Kui varustatud koletis hävitatakse lõppfaasis, võid selle kaardi asemel saata Hauakambrisse.

source: Herculean Power
et: Heraklese jõud

source: Once per turn, if your opponent controls a monster and you control no monsters, you can Special Summon 1 Level 4 or lower Gemini monster from your hand.
et: Korra ühe korra käigu jooksul, kui sinu vastasel on koletis ja sul ei ole koletisi, saad sa eriliselt kutsuda ühe 4. taseme või madalama Kaksik-koletise oma käest.

source: Gemini Spark
et: Kaksikute Säde

source: Tribute 1 face-up Level 4 Gemini monster you control to target 1 card on the field; destroy it and draw 1 card.
et: Ohverda 1 avatud 4. taseme Gemini koletis, mida sa kontrollid, et sihtida 1 kaarti väljal; hävita see ja tõmba 1 kaart.

source: Ritual of Grace
et: Armurituaal

source: This card is used to Ritual Summon "Divine Grace - Northwemko". You must also Tribute monsters whose total Levels equal 7 or more from the field or your hand. During your Main Phase, you can remove from play this card from your Graveyard to make 1 face-up Ritual Monster you control become un-targetable by effects this turn.
et: Seda kaarti kasutatakse "Divine Grace - Northwemko" rituaalsummonimiseks. Sa pead ka ohverdama koletisi, kelle kogutasemed on 7 või rohkem, kas väljakult või oma käest. Oma peafaasis saad eemaldada selle kaardi oma hauast mängust, et muuta 1 sinu kontrollitav ülespööratud rituaalkoletis sellel käigul sihtimatuks efektide poolt.

source: Preparation of Rites
et: Rituaalide Ettevalmistus

source: Add to your hand 1 Level 7 or lower Ritual Monster Card from your Deck. Then you can add to your hand 1 Ritual Spell Card from your Graveyard.
et: Lisa oma kätte 1. taseme 7 või madalama Rituaal Koletise Kaart oma pakist. Seejärel saad lisada oma kätte 1 Rituaali Loitsukaardi oma hauakambrist.

source: Moray of Greed
et: Ahneviha Moray

source: Return 2 WATER monsters from your hand to your Deck and draw 3 cards.
et: Tagasta 2 VEE koletist oma käest oma pakki ja tõmba 3 kaarti.

source: Spiritual Forest
et: Vaimude Mets

source: Each turn, the first face-up Beast-Type, Beast-Warrior-Type, or Plant-Type monster you control that would be destroyed by battle, is not destroyed.
et: Igal käigul ei hävitata esimest avatud Nähtavat Looma-tüüpi, Loomasõdalase-tüüpi või Taim-tüüpi koletist, mida sa kontrollid ja mis lahingus hävitataks.

source: Raging Mad Plants
et: Raevukad taimed

source: Face-up Plant-Type monsters you control gain 300 ATK for each Plant-Type monster in your Graveyard; this increase lasts until the End Phase. During the End Phase of this turn, destroy all face-up Plant-Type monsters you control.
et: Avatud positsioonis Taim-tüüpi koletised, mida sa kontrollid, saavad 300 ATK-d iga sinu Hauakambris oleva Taim-tüüpi koletise kohta; see tõus kestab kuni Lõppfaasini. Selle käigu Lõppfaasis hävita kõik avatud positsioonis Taim-tüüpi koletised, mida sa kontrollid.

source: Insect Neglect
et: Putuka Eiramine

source: When your opponent's monster declares an attack, you can remove from play 1 Insect-Type monster from your Graveyard to negate the attack.
et: Kui sinu vastase koletis kuulutab välja rünnaku, saad sa eemaldada mängust ühe putukaliigi koletise oma hauakambrist, et rünnak tühistada.

source: Faustian Bargain
et: Fausti leping

source: Send 1 Special Summoned monster on either side of the field to the Graveyard and Special Summon 1 Level 4 or lower Normal Monster from your hand.
et: Saada 1 eriliselt kutsutud koletis mõlemal pool väljakut Hauakambrisse ja kutsu eriliselt 1 4. taseme või madalam tavaline koletis oma käest.

source: Slip Summon
et: Libisev Kutsumine

source: Activate only when your opponent Summons a monster. Special Summon 1 Level 4 or lower monster from your hand in face-up Defense Position. Return it to the owner's hand during the End Phase.
et: Aktiveeri ainult siis, kui sinu vastane kutsub välja koletise. Kutsu eriliselt välja 1 tase 4 või madalam koletis oma käest avatud kaitsepositsioonis. Tagasta see omaniku kätte lõppfaasi ajal.

source: Synchro Barrier
et: Sünkroontõke

source: Tribute 1 Synchro Monster you control. You do not take any damage until the End Phase of the next turn.
et: Ohverda 1 Sünkrokoletis, mida sa kontrollid. Sa ei saa mingit kahju kuni järgmise käigu lõppfaasini.

source: Enlightenment
et: Valgustatus

source: You cannot Summon the turn you activate this card. Activate at the end of the Damage Step, if a Spellcaster-Type monster you control attacked and destroyed an opponent's monster by battle. That monster can attack again (immediately).
et: Sa ei saa sellel käigul kutsuda, kui aktiveerid selle kaardi. Aktiveeri Kahjustuse Etapi lõpus, kui sinu kontrollitav Loitsija-tüüpi koletis ründas ja hävitas vastase koletise lahingus. See koletis saab uuesti rünnata (koheselt).

source: Bending Destiny
et: Saatuspaine

source: Activate only if all face-up monsters you control are "Fortune Lady" monsters. Negate the activation of a Spell or Trap Card, or the Normal Summon of a monster, and remove that card from play. The card removed from play by this effect is returned to its owner's hand during the End Phase.
et: Aktiveeri ainult siis, kui kõik sinu kontrolli all olevad avatud koletised on "Fortune Lady" koletised. Tühista Loitsu või Lõksukaardi aktiveerimine või koletise normaalne kutsumine ja eemalda see kaart mängust. Selle efekti abil mängust eemaldatud kaart tagastatakse selle omaniku kätte Lõppfaasis.

source: Inherited Fortune
et: Pärandatud Õnn

source: Activate during the turn a face-up "Fortune Lady" monster you control was destroyed. Special Summon up to 2 "Fortune Lady" monsters from your hand during your next Standby Phase.
et: Aktiveeri sellel käigul, mil sinu kontrollitav avatud "Fortune Lady" koletis hävitati. Kutsu oma järgmisel Ootefaasil eriliselt välja kuni 2 "Fortune Lady" koletist oma käest.

source: Spider Egg
et: Ämblikmuna

source: Activate only when your opponent declares a direct attack, while you have 3 or more Insect-Type monsters in your Graveyard. Negate that attack. Special Summon 3 "<M3963>Spider Token<M>"(s) (Insect-Type/EARTH/Level 1/ATK 100/DEF 100) in Attack Position.
et: Aktiveeri ainult siis, kui sinu vastane kuulutab välja otsese rünnaku, kui sul on hauas 3 või enam Putukaliigi koletist. Tühista see rünnak. Kutsu erilisel viisil välja 3 "<M3963>Ämblik Token<M>"(it) (Putukaliik/MAA/Tase 1/RÜN 100/KAIT 100) rünnakupositsioonis.

source: Wolf in Sheep's Clothing
et: Lambanahas hunt
