Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: FLIP: Select 1 Trap Card on the field and destroy it. If the selected card is Set, pick up and see the card. If it is a Trap Card, it is destroyed. If it is a Spell Card, return it to its original position.
et: FLIP: Vali 1 lõksukaart väljal ja hävita see. Kui valitud kaart on seatud, tõsta see üles ja vaata kaarti. Kui see on lõksukaart, hävitatakse see. Kui see on loitsukaart, vii see tagasi oma algsesse asendisse.

source: King of Yamimakai
et: Yamimakai kuningas

source: Wields the power of darkness to destroy its enemies.
et: Kasutab pimeduse jõudu, et hävitada oma vaenlasi.

source: "<M4207>Frenzied Panda<M>" + "<M4011>Ryu-Kishin<M>"
et: "<M4207>Raevukas Panda<M>" + "<M4011>Ryu-Kishin<M>"

source: Dark Chimera
et: Tume Chimera

source: A fire-breathing monster that dwells in the netherworld.
et: Tulehingav koletis, kes elab allilmas.

source: Metal Guardian
et: Metallikaitsja

source: A fiend guarding the treasures of the netherworld, it's most at home in the dark.
et: Deemon, kes valvab allilma aardeid, tunneb end kõige kodusemalt pimeduses.

source: Catapult Turtle
et: Katapultkilpkonn

source: You can Tribute 1 monster to inflict damage to your opponent equal to half of its ATK.
et: Saad ohverdada 1 koletis, et tekitada oma vastasele kahju, mis on võrdne poolega selle rünnakust (ATK).

source: his fairy uses her mystical power to protect the weak and provide spiritual support.
et: See haldjas kasutab oma müstilist jõudu, et kaitsta nõrku ja pakkuda vaimset tuge.

source: Mystic Horseman
et: Müstiline Ratsanik

source: Half man and half horse, this monster is known for its extreme speed.
et: Poolen inimene ja poolen hobune, see koletis on tuntud oma äärmise kiiruse poolest.

source: Rabid Horseman
et: <translated Raev Ratsanik

source: "<M4032>Battle Ox<M>" + "<M4097>Mystic Horseman<M>"
et: "<M4032>Lahinghärg<M>" + "<M4097>Müstiline Ratsanik<M>"

source: His swiftly drawn blade delivers quick and fatal damage.
et: Tema kiiresti tõmmatud tera tekitab kiiret ja surmavat kahju.

source: Crawling Dragon
et: Roomav Draakon

source: his weakened dragon can no longer fly, but is still a deadly force to be reckoned with.
et: see nõrgestatud draakon ei suuda enam lennata, kuid on endiselt surmav jõud, millega tuleb arvestada.

source: Crass Clown
et: Jõhker Kloun

source: When this card is changed from Defense Position to Attack Position, return 1 monster on your opponent's side of the field to the owner's hand.
et: Kui see kaart muudetakse kaitseasendist rünnakuasendisse, tagasta 1 koletis vastase väljalt omaniku kätte.

source: Armored Zombie
et: Soomusrüütel

source: This warrior blindly swings a deadly blade with devastating force.
et: See sõdalane vehib pimesi surmava mõõgaga, millel on laastav jõud.

source: Dragon Zombie
et: Draakonzombi

source: A dragon revived by sorcery. Its breath is highly corrosive.
et: Maagiaga ellu äratatud draakon. Selle hingus on väga söövitav.

source: Clown Zombie
et: Klovn Zombi

source: A clown revived by the powers of darkness. Its deadly dance has sent many monsters to their graves.
et: Pimeduse jõudude poolt ellu äratatud kloun. Selle surmav tants on saatnud paljusid koletisi hauda.

source: Pumpking The King of Ghosts
et: Kummituste kuningas Pumpking

source: If "<M4089>Castle of Dark Illusions<M>" is face-up on the field, increase the ATK and DEF of this card by 100 points. As long as "<M4089>Castle of Dark Illusions<M>" remains face-up on the field, the ATK and DEF of this card continues to increase by 100 points during each of your Standby Phases. This effect continues until your 4th turn after this card is activated.
et: Kui "<M4089>Castle of Dark Illusions<M>" on väljas avatud, suurenda selle kaardi ATK ja DEF 100 punkti võrra. Nii kaua kui "<M4089>Castle of Dark Illusions<M>" jääb väljas avatuks, suureneb selle kaardi ATK ja DEF iga sinu Standby Phase'i ajal 100 punkti võrra. See efekt jätkub kuni sinu 4. käiguni pärast selle kaardi aktiveerimist.

source: Battle Warrior
et: Lahingusõdalane

source: A warrior that fights with his bare hands.
et: Sõdalane, kes võitleb paljaste kätega.

source: Wings of Wicked Flame
et: Kurja Leegi Tiivad

source: Crimson wings of fire make this a very lethal creature.
et: Tulipunased tiivad muudavad selle väga surmavaks olendiks.

source: Mask of Darkness
et: Pimeduse Mask

source: FLIP: Add 1 Trap Card from your Graveyard to your hand.
et: FLIP: Lisa oma hauast 1 lõksukaart oma kätte.

source: Job-Change Mirror
et: Ametivahetuse Peegel

source: A wicked mirror that blocks off the damaging effects of an attack.
et: Kuri peegel, mis blokeerib rünnaku kahjulikke mõjusid.

source: Curtain of The Dark Ones
et: Pimeduse Kardin

source: A curtain that a spellcaster made, it is said to raise a dark power.
et: Loitsija loodud kardin, mis väidetavalt tõstab tumedat jõudu.

source: Small but vicious, this monster even attacks its own kind.
et: Väike, kuid äge, see koletis ründab isegi oma liike.

source: Spirit of the Winds
et: Tuulte Vaim

source: A free-spirited wind elemental that flits about as it desires. It brings storms when it becomes upset.
et: Vabameelne tuuleelementaal, kes lendleb ringi, nagu ta soovib. Kui ta ärritub, toob ta kaasa tormid.

source: Uses both physical and shadow forms to attack, making it a difficult monster to overcome.
et: Kasutab rünnakuks nii füüsilisi kui ka varjuvorme, muutes selle raskesti ületatavaks koletiseks.

source: Graveyard and The Hand of Invitation
et: Hauakamber ja Kutsumise Käsi

source: A graveyard that serves as a power source for zombies.
et: Kalmuist, mis toimib zombide jõuallikana.

source: Goddess with the Third Eye
et: Kolmanda silmaga jumalanna

source: You can substitute this card for any 1 Fusion Material Monster. When you do this, the other Fusion Material Monster(s) must be the correct one(s).
et: Saate selle kaardi asendada ükskõik millise Fusion Material Monsteriga. Kui te seda teete, peavad teised Fusion Material Monster(id) olema õiged.

source: Hero of the East
et: Ida-Kangelane

source: A sword-swinging samurai of the Far East.
et: Kaug-Ida mõõka viibutav samurai.

source: Doma, The Angel of Silence
et: Doma, Vaikuse Ingel

source: This fairy rules over the end of existence.
et: See haldjas valitseb eksistentsi lõppu.

source: That Which Feeds On Life
et: See, mis toitub elust

source: A monster that feeds on the energy of other creatures.
et: Koletis, mis toitub teiste olendite energiast.

source: Dark Gray
et: Tumehall

source: Entirely gray, this beast has rarely been seen by mortal eyes.
et: Täielikult hall, seda metsalist on surelikud harva näinud.

source: White Magical Hat
et: Valge Maagiline Müts

source: When this card inflicts Battle Damage to your opponent's Life Points, your opponent discards 1 card randomly from his/her hand.
et: Kui see kaart tekitab lahingukahju sinu vastase elupunktidele, siis sinu vastane viskab juhuslikult ühe kaardi oma käest ära.

source: Kamionwizard
et: Kamioninõid

source: "<M4008>Mystical Elf<M>" + "<M4110>Curtain of The Dark Ones<M>"
et: "<M4008>Müstiline Elf<M>" + "<M4110>Pimeduse Kardin<M>"

source: Nightmare Scorpion
et: Õudusunenäo Skorpion

source: A creature that generates nightmares to haunt an opponent, it attacks with four poisonous tails.
et: Olend, mis tekitab õudusunenägusid vastase kummitamiseks, ründab nelja mürgise sabaga.

source: Spirit of The Books
et: Raamatute Vaim

source: This wise spirit dwells in books, using its accumulated knowledge to defeat enemies.
et: See tark vaim elab raamatutes, kasutades oma kogutud teadmisi vaenlaste alistamiseks.

source: Supporter in The Shadows
et: Toetaja varjudes

source: A cute little elf that hides in the shadows and provides spiritual support.
et: Armas väike päkapikk, kes peidab end varjudes ja pakub vaimset tuge.

source: Trial of Nightmare
et: Õudusunenäo kohtuprotsess

source: This fiend passes judgment on enemies that are locked in coffins.
et: See deemon mõistab kohut vaenlaste üle, kes on lukustatud kirstudesse.

source: Dream Clown
et: Unistuste Kloun

source: When this card is changed from Attack Position to Defense Position, destroy 1 monster on your opponent's side of the field.
et: Kui see kaart muudetakse rünnakupositsioonist kaitsepositsiooni, hävita 1 koletis oma vastase väljaku poolel.

source: Sleeping Lion
et: Magav Lõvi

source: A ferocious animal that sleeps all day. Sometimes it's better to let Sleeping Lions lie.
et: Raevukas loom, kes magab kogu päeva. Mõnikord on parem lasta Magavatel Lõvidel magada.

source: Yamatano Dragon Scroll
et: Yamatano Draakoni Kerimine

source: A dragon conjured from the very scroll in which it was depicted.
et: Draakon, kes on välja kutsutud rullist, milles ta oli kujutatud.

source: Dark Plant
et: Tume Taim

source: This mutant flower draws its power from pollutants and the dark forces.
et: See mutantlill tõmbab oma jõu saasteainetest ja pimedatest jõududest.

source: Ancient Tool
et: Muinasrelv

source: A destructive machine discovered in the Ruins of the Ancients.
et: Hävituslik masin, mis avastati Muistsete varemetes.

source: Faith Bird
et: Usu Lind

source: This long-tailed bird blinds its enemies with mystical light.
et: See pikksaba lind pimestab oma vaenlasi müstilise valgusega.

source: Orion the Battle King
et: Lahingukuningas Orion

source: None have lived to tell tales of this powerful battle fairy.
et: Keegi pole elusalt pääsenud, et rääkida lugusid sellest võimsast lahinguhaldjast.

source: A silent and deadly warrior specializing in assassinations.
et: Vaikne ja surmav sõdalane, kes on spetsialiseerunud mõrvadele.

source: A sorcerer that draws its power from the lunar landscape.
et: Maag, kes ammutab oma jõu kuumaastikust.

source: A child-like creature that controls a sleep fiend to beckon enemies into eternal slumber.
et: Lapselik olend, kes kontrollib unedeemonit, et kutsuda vaenlasi igavesse unne.

source: Weather Control
et: Ilmakontroll

source: This creature controls weather and is often the cause of mountain storms.
et: See olend kontrollib ilma ja on sageli mägimägede tormide põhjustajaks.

source: Octoberser
et: Oktooberseer

source: With the head of a fish and the legs of an octopus, this strange creature attacks enemies by flinging spears.
et: Kalapea ja kaheksajala jalgadega see kummaline olend ründab vaenlasi oda visates.

source: The 13th Grave
et: 13. haud

source: A zombie that suddenly appeared from plot #13 - an empty grave.
et: Zombi, kes ilmus äkitselt krundilt nr 13 - tühjast hauast.

source: Charubin the Fire Knight
et: Tule Rüütel Charubin

source: "<M4153>Monster Egg<M>" + "<M4216>Hinotama Soul<M>"
et: "<M4153>Koletis<M>" + "<M4216>Hinotama Hing<M>"

source: Mystical Capture Chain
et: Müstiline Püüdmisekeede

source: A mystical chain that binds enemies, rendering them immobile.
et: Müstiline ahel, mis seob vaenlasi, muutes nad liikumatuks.

source: Fiend's Hand
et: Deemoni käsi

source: Arms that reach out from the Swamp of Chaos to drag down the damned.
et: Kaose soost välja sirutuvad käed, mis tõmbavad alla neednud.

source: Witty Phantom
et: Vaimukas Fantoom

source: Dressed in a night-black tuxedo, this creature presides over the darkness.
et: Öösinises smokis riietatud olend valitseb pimeduse üle.

source: Mystery Hand
et: Salapärane Käsi

source: This monster twists reality and reaches between dimensions to attack its enemies.
et: See koletis väänab reaalsust ja ulatub mõõtmete vahel, et rünnata oma vaenlasi.

source: Dragon Statue
et: Draakoni kuju

source: A stone warrior with the heart of a dragon.
et: Kivisõdalane, kellel on draakoni süda.

source: Blue-Eyed Silver Zombie
et: Sinisilmne hõbezombi

source: The beams from the eyes of this creature are said to turn enemies into zombies.
et: Selle olendi silmadest lähtuvad kiired pidavat vaenlasi zombideks muutma.

source: Toad Master
et: Konnmeistrer

source: A hermit frog that has been in existence for thousands of years, it attacks with tadpoles.
et: Eraklik konn, kes on eksisteerinud tuhandeid aastaid, ründab kullestega.

source: Spiked Snail
et: Ogalik Tigu

source: A very fast, bipedal snail with a pair of lethal arms.
et: Väga kiire, kahejalgne tigu, kellel on paar surmavat kätt.

source: Flame Manipulator
et: Leegimanipulaator

source: This Spellcaster attacks enemies with fire-related spells such as "Sea of Flames" and "Wall of Fire".
et: See loitsija ründab vaenlasi tulega seotud loitsudega nagu "Leekide meri" ja "Tulemüür".

source: Necrolancer the Timelord
et: Ajaisandur Nekromant

source: The one-eyed Necrolancer launches his onslaught from a dimensional ring that can appear out of thin air.
et: Ühesilmne nekrolantser alustab oma rünnakut dimensioonirõngast, mis võib ilmuda eikuskilt.

source: Djinn the Watcher of the Wind
et: Tuulevaatleja Džinn

source: This creature generates gale-force winds and tornadoes to blow its enemies away.
et: See olend tekitab tormituuli ja tornaadosid, et oma vaenlasi minema puhuda.

source: The Bewitching Phantom Thief
et: Nõiduslik Fantoomvaras

source: An elegant thief with a black cloak that charms its enemies.
et: Elegantne varas mustas mantlis, kes võlub oma vaenlasi.

source: Temple of Skulls
et: Koljude Tempel

source: A mysterious temple of skulls and bones that pulls in unsuspecting enemies.
et: Salapärane kolju ja luude tempel, mis tõmbab sisse kahtlustamata vaenlasi.

source: Monster Egg
et: Koletise Muna

source: A warrior hidden within an egg that attacks enemies by flinging eggshells.
et: Munas peidus sõdalane, kes ründab vaenlasi munakoortega loopides.

source: The Shadow Who Controls The Dark
et: Pimeduse Varju Kontrollija

source: A shadow that dwells in the dark, paralyzing its opponents and rendering them harmless.
et: Vari, mis elab pimeduses, halvates oma vastaseid ja muutes nad kahjutuks.

source: Lord of The Lamp
et: Lambi isand

source: This spirit emerges from the mystic lamp and obeys the wishes of its summoner.
et: See vaim ilmub müstilampist ja täidab oma kutsuja soove.

source: This strange creature hides in the deep, dark corners of the seven seas.
et: See kummaline olend peidab end seitsme mere sügavates, pimedates nurkades.

source: Rhaimundos of the Red Sword
et: Punase Mõõga Rhaimundos

source: Armed with the Sword of Crimson Flames, this warrior can bind a monster with fiery restraints.
et: Relvastatud karmiinpunaste leekide mõõgaga, suudab see sõdalane siduda koletise tuliste ahelatega.

source: The Melting Red Shadow
et: Sulav Punane Vari

source: This monster melts away to materialize under its enemies, taking them by surprise.
et: See koletis sulab, et oma vaenlaste all materialiseeruda, võttes neid üllatusena.

source: Dokuroizo the Grim Reaper
et: Dokuroizo, sünge niidumees

source: A messenger of doom that steals a soul with a single blow.
et: Hukatussõnumitooja, kes varastab hinge üheainsa löögiga.

source: Fire Reaper
et: Tulelõikur

source: A reaper with a flaming arrow that burns an enemy to a crisp.
et: Leegionär, kellel on leekiv nool, mis põletab vaenlase tuhaks.

source: Larvas
et: Larvad

source: A fast-moving, bird-like creature that strangles opposing monsters with its long, thin arms.
et: Kiirelt liikuv, linnulaadne olend, kes kägistab vastase koletisi oma pikkade, peenikeste kätega.

source: Hard Armor
et: Kõva Rüü

source: A living suit of armor that attacks enemies with a bone-jarring tackle.
et: Elus rüü, mis ründab vaenlasi luud raputava tõukega.

source: Firegrass
et: Tulehein

source: A fire-breathing plant found growing near volcanoes.
et: Tulekahing purskav taim, mida leidub vulkaanide lähedal kasvamas.

source: Man Eater
et: Inimsööja

source: Man-eating plant with poison feelers for attacking enemies.
et: Inimesi söödev taim, millel on mürgised kombitsad vaenlaste ründamiseks.

source: Dig Beak
et: Kaevur Nokk

source: This beast coils like a snake, and strikes quickly with its snapping beak.
et: See metsaline keerleb nagu madu ja lööb kiiresti oma naksava nokaga.

source: M-Warrior #1
et: M-Sõdalane #1

source: Specializing in combination attacks, this warrior uses magnetism to block an enemy's escape.
et: Spetsialiseerudes kombinatsioonirünnakutele, kasutab see sõdalane magnetismi, et blokeerida vaenlase põgenemine.

source: M-Warrior #2
et: M-Sõdalane #2

source: Specializing in combination attacks, this warrior is equipped with a tough, magnetically coated armor.
et: See on kombinatsioonirünnakutele spetsialiseerunud sõdalane, kes on varustatud tugeva, magnetkattega soomusega.

source: Tainted Wisdom
et: Rikutud Tarkus

source: When this card is changed from Attack Position to Defense Position, shuffle your Deck.
et: Kui see kaart muudetakse rünnakupositsioonist kaitsepositsiooniks, sega oma pakk.

source: A creature with sapphire eyes that mesmerizes and confuses enemies.
et: Olevusilmadega olend, kes hüpnotiseerib ja segadusse ajab vaenlasi.

source: Lord of Zemia
et: Zemia isand

source: A wicked entity that manipulates enemies towards a path of destruction.
et: Kuri vaenlane, kes manipuleerib vaenlasi hävingu teele.

source: The Judgement Hand
et: Kohtuotsuse Käsi

source: An all-powerful hand that delivers ruthless attacks.
et: Kõikvõimas käsi, mis annab halastamatuid lööke.

source: Mysterious Puppeteer
et: Müstiline Nukunäitleja

source: Each time you or your opponent Normal Summons or Flip Summons a monster, increase your Life Points by 500 points.
et: Iga kord, kui sina või sinu vastane kutsub normaal- või ümberpööratud kutsumisega välja koletise, suurenda oma Elupunkte 500 punkti võrra.

source: Ancient Jar
et: Vana purk

source: A very fragile jar that contains something ancient and dangerous.
et: Väga habras purk, mis sisaldab midagi iidset ja ohtlikku.

source: Darkfire Dragon
et: Pimedustule Draakon

source: "<M4163>Firegrass<M>" + "<M4206>Petit Dragon<M>"
et: "<M4163>Tulehein<M>" + "<M4206>Väike Draakon<M>"

source: Dark King of The Abyss
et: Pimeduse Kuningas Kuristikust

source: It's said that this King of the Netherworld once had the power to rule over the dark.
et: Öeldakse, et see Allilma Kuningas omas kunagi võimu pimeduse üle valitseda.

source: Spirit of The Harp
et: Harfi Vaim

source: A spirit that soothes the soul with the music of its heavenly harp.
et: Vaim, kes rahustab hinge oma taevase harfi muusikaga.

source: Big Eye
et: Suur Silm

source: FLIP: See the 5 cards from the top of your Deck, arrange them in any order desired, and replace them on the top of the Deck.
et: FLIP: Vaata oma paki viit ülemist kaarti, korralda need soovitud järjekorda ja aseta need tagasi paki peale.

source: A strange warrior who manipulates three deadly blades with both hands and his tail.
et: Kummaline sõdalane, kes manipuleerib kolme surmava teraga mõlema käe ja sabaga.

source: Dark Prisoner
et: Tume Vang

source: This monster bends light to hide its image from the eyes of opponents.
et: See koletis painutab valgust, et varjata oma kujutist vastaste silmade eest.

source: A tornado that ravages the wastelands with sharp winds that can cut to the bone.
et: Tornaado, mis laastab tühermaad teravate tuultega, mis võivad lõigata läbi luu.

source: Ancient Brain
et: Muistsed Ajud

source: A fallen fairy that is powerful in the dark.
et: Pimeduses võimas langenud haldjas.

source: Fire Eye
et: Tule Silm

source: An eye engulfed in flames that flaps its wings to create hot blasts of air.
et: Leekidesse mähitud silm, mis lehvitab tiibu, et luua kuumi õhuvooge.

source: Monsturtle
et: Koletis

source: Protected by a spiked shell, this turtle has a very nasty disposition.
et: Oma teravate ogadega kaitse all on see kilpkonn väga pahura iseloomuga.

source: Claw Reacher
et: Küünis Haaraja

source: Stretching arms and razor-sharp claws make this monster a formidable opponent.
et: Venivad käed ja teravad küünised teevad sellest koletisest hirmuäratava vastase.

source: Phantom Dewan
et: Fantoom Dewan

source: A sorcerer that can paralyze an enemy with a single curse.
et: Võlur, kes suudab üheainsa needusega vaenlase halvatuks muuta.

source: A lady monster dwelling in a flower, she sprinkles the air with poisonous pollen.
et: Lilles elav daamkoletis, kes puistab õhku mürgise õietolmuga.

source: Dark Shade
et: Tume Vari

source: A crystal monster that unleashes a brilliant light to blind enemies.
et: Kristallkoletis, mis vabastab vaenlaste pimestamiseks särava valguse.

source: Masked Clown
et: Maskeeritud Kloun

source: This warrior's fatal dance is performed with a lethal sickle.
et: Selle sõdalase surmav tants sooritatakse surmava sirbiga.

source: Lucky Trinket
et: Õnnetalisman

source: This creature may look slim and weak, but it's protected by a mystical force.
et: See olend võib tunduda sale ja nõrk, kuid seda kaitseb müstiline jõud.

source: A creature that defeats its enemies using sleight-of-hand.
et: Olend, kes võidab oma vaenlasi käteosavuse abil.

source: This warrior transforms into various creatures to confuse enemies in battle.
et: See sõdalane muutub lahingus vaenlaste segamiseks erinevateks olenditeks.

source: Fiend Reflection #2
et: Deemoni peegeldus #2

source: A bird-beast that summons reinforcements with a hand mirror.
et: Linnuloom, kes kutsub abiväge käespeegliga.

source: Gate Deeg
et: Värava Deeg

source: This weird monster has a portal in its belly that brings reinforcements from the farthest reaches of the netherworld.
et: Sellel kummalisel koletisel on kõhus portaal, mis toob tugevdusi allilma kõige kaugematest nurkadest.

source: Synchar
et: Sünkhar

source: This two-headed creature spits laser blasts at its enemies.
et: See kahepealine olend sülitab oma vaenlaste pihta laserkiiri.

source: Fusionist
et: Fusioneer

source: "<M4214>Petit Angel<M>" + "<M4288>Mystical Sheep #2<M>"
et: "<M4214>Väike ingel<M>" + "<M4288>Müstiline lammas #2<M>"

source: A sorcerer who utters spells that render monsters unconscious.
et: Võlur, kes lausub loitse, mis muudavad koletised teadvusetuks.

source: An electric cloud creature, its acid rain makes it very dangerous.
et: Elektriline pilveolend, selle happeline vihm teeb selle väga ohtlikuks.

source: Key Mace
et: Võtme Nuia

source: Enemies' hearts will melt at the sight of this small fairy's cuteness.
et: Vaenlaste südamed sulavad selle väikese haldja armsuse nägemisel.

source: Turtle Tiger
et: Kilpkonn Tiiger

source: A tiger encased in a protective shell that attacks with razor-sharp fangs.
et: Tera kaitstud kestaga tiiger, kes ründab teravate kihvadega.

source: Terra the Terrible
et: Kohutav Terra

source: Known as a swamp dweller, this creature is a minion of the dark forces.
et: Tuntud kui sooasukas, on see olend pimeduse jõudude käsilane.

source: This monster splits in two and attacks from opposite sides.
et: See koletis jaguneb kaheks ja ründab vastassuunast.

source: Arma Knight
et: Arma Rüütel

source: An ammonite warrior that has protected the seas throughout history.
et: Ammoniidist sõdalane, kes on läbi ajaloo kaitsnud meresid.

source: Mech Mole Zombie
et: Mehhaaniline Mutt Zombi

source: This creature attacks by launching missile-like arms.
et: See olend ründab raketitaoliste kätega.

source: Happy Lover
et: Õnnelik Armastaja

source: Enemies become overjoyed when struck by the Heart Ray emitted from the forehead of this tiny cherub.
et: Vaenlased muutuvad ülevoolavalt rõõmsaks, kui neid tabab selle pisikese kerubi otsaesist kiirgav Südamekiir.

source: Penguin Knight
et: Pingviinirüütel

source: When this card is sent directly from your Deck to the Graveyard by an effect of a card controlled by your opponent, unite your Graveyard cards and your own Deck, shuffle them and form a new Deck.
et: Kui see kaart saadetakse otse sinu pakist hauakambrisse sinu vastase kontrollitava kaardi efekti tõttu, ühenda oma hauakambri kaardid ja oma pakk, sega need ja moodusta uus pakk.

source: Petit Dragon
et: Väike Draakon
