Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: Temporal Machine Angel
et: Ajutine Masinaingel

source: If this face-up Attack Position card is destroyed by battle, return all monsters on the field to the hand.
et: Kui see avatud Rünnakupositsioonis kaart hävitatakse lahingus, tagasta kõik koletised väljakult kätte.

source: Temporal Machine Priestess
et: Ajutine Masinapreestrinna

source: This card cannot be Normal Summoned or Set. If you control no monsters, you can Special Summon this card from your hand. You can Tribute this card to add 1 "Temporal Machine" monster from your Deck to your hand.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Kui sul pole ühtegi koletist, saad selle kaardi oma käest eriliselt kutsuda. Sa saad selle kaardi ohverdada, et lisada oma pakist 1 "Ajamasina" koletis oma kätte.

source: Temporal Machine God Lazion
et: Ajutine Masinajumal Lazion

source: Cannot be Special Summoned from the Deck. If you control no monsters, you can Summon this card without Tribute.This card cannot be destroyed by battle or by card effects. Battle Damage you take from battles involving this face-up Attack Position card becomes 0. At the end of the Battle Phase, which this card battles: Return all cards in your opponent's Graveyard to the Deck. When your opponent draws a card during their Draw Phase, inflict 500 damage to your opponent. During your Standby Phase, return this card to the Deck.
et: Ei saa eriliselt kutsuda pakist. Kui sul pole koletisi, saad selle kaardi kutsuda ilma ohvrita. Seda kaarti ei saa hävitada lahingus ega kaardiefektidega. Lahingukahju, mida saad selle näoga ülespoole rünnakupositsioonis oleva kaardiga seotud lahingutest, muutub 0-ks. Lahingufaasi lõpus, milles see kaart võitleb: Tagasta kõik kaardid oma vastase hauast pakki. Kui sinu vastane tõmbab kaardi oma tõmbefaasis, tekitab see vastasele 500 kahju. Sinu ooteetapi ajal tagasta see kaart pakki.

source: Temporal Machine God Zaphion
et: Ajamasina Jumal Zaphion

source: Cannot be Special Summoned from the Deck. If you control no monsters, you can Summon this card without Tribute. This card cannot be destroyed by battle or by card effects. You take no Battle Damage from battles involving this face-up Attack Position card. If this card battles, return all Spell/Trap Cards your opponent controls to the Deck, after damage calculation. During your Standby Phase, return this face-up card you control to the Deck.
et: Ei saa eriliselt kutsuda pakist. Kui sul pole ühtegi koletist, saad selle kaardi kutsuda ilma ohvrita. Seda kaarti ei saa hävitada lahingus ega kaardiefektidega. Sa ei saa lahingukahju lahingutest, milles osaleb see avatud rünnakupositsioonis kaart. Kui see kaart võitleb, tagasta kõik loits/lõksukaardid, mida su vastane kontrollib, pakki pärast kahju arvutamist. Sinu ooteetapi ajal tagasta see avatud kaart, mida sa kontrollid, pakki.

source: Temporal Machine God Sadion
et: Ajutine Masinajumal Sadion

source: This card cannot be Special Summoned from your deck. This card cannot be destroyed by battle or by card effects. You take no Battle Damage from battles involving this face-up Attack Position card. If this card battles while your Life Points are lower than 4000, your Life Points become 4000 after damage calculation. During your Standby Phase, return this face-up card you control to the Deck.
et: Seda kaarti ei saa eriliselt kutsuda oma pakist. Seda kaarti ei saa hävitada lahingus ega kaardi efektide poolt. Sa ei saa lahingukahju lahingutest, mis hõlmavad seda avatud Rünnakupositsioonis kaarti. Kui see kaart võitleb, kui su Elupunktid on alla 4000, muutuvad su Elupunktid pärast kahju arvutamist 4000-ks. Sinu Ootefaasil tagasta see avatud kaart, mida sa kontrollid, pakki.

source: Temporal Machine God Kamion
et: Ajutine Masinajumal Kamion

source: Cannot be Special Summoned from the Deck. If you control no monsters, you can Summon this card without Tribute. This card cannot be destroyed by battle or by card effects. Battle Damage you take from battles involving this face-up Attack Position card becomes 0. At the end of the Battle Phase, select and return one monster on your opponent's field to their deck, then inflict 500 damage to your opponent. During your Standby Phase, return this card to the Deck.
et: Ei saa eriliselt kutsuda pakist. Kui sul pole ühtegi koletist, saad selle kaardi kutsuda ilma ohvrita. Seda kaarti ei saa hävitada lahingus ega kaardiefektidega. Lahingukahju, mida saad selle näoga ülespoole rünnakupositsioonis oleva kaardiga seotud lahingutest, muutub 0-ks. Lahingufaasi lõpus vali ja tagasta üks koletis oma vastase väljal nende pakki, seejärel tekita oma vastasele 500 kahju. Oma ootejärgu faasis tagasta see kaart pakki.

source: Temporal Machine God Michion
et: Ajutine Masinajumal Michion

source: Cannot be Special Summoned from the Deck. If you control no monsters, you can Summon this card without Tribute. This card cannot be destroyed by battle or by card effects. Battle Damage you take from battles involving this face-up Attack Position card becomes 0. At the end of the Battle Phase, which this card battles: Halve your opponent's Life Points. During your Standby Phase, return this card to the Deck.
et: Ei saa eriliselt kutsuda pakist. Kui sul pole koletisi, saad selle kaardi kutsuda ilma ohvrita. Seda kaarti ei saa hävitada lahingus ega kaardi efektide tõttu. Lahingukahju, mida saad selle avatud rünnakupositsioonis oleva kaardiga seotud lahingutest, muutub 0-ks. Lahingufaasi lõpus, milles see kaart võitleb: vähenda oma vastase elupunkte poole võrra. Oma ootejärgu faasis tagasta see kaart pakki.

source: Temporal Machine God Hailon
et: Ajutise Masina Jumal Hailon

source: This card cannot be Special Summoned from the Deck. If you control no monsters, you can Normal Summon this card without Tribute. This card cannot be destroyed by battle or by card effects. Both players take no Battle Damage from battles involving this face-up Attack Position card. If this card battles while you Life Points are lower than your opponent's Life Points, inflict damage to your opponent equal to the difference, after damage calculation. During your Standby Phase, return this face-up card you control to the Deck.
et: Seda kaarti ei saa eriliselt kutsuda pakist. Kui sul pole ühtegi koletist, saad selle kaardi normaalset kutsuda ilma ohvrita. Seda kaarti ei saa hävitada lahingus ega kaardi efektide poolt. Mõlemad mängijad ei saa lahingukahju lahingutest, mis hõlmavad seda avatud rünnakupositsioonis kaarti. Kui see kaart võitleb, kui sinu elupunktid on madalamad kui sinu vastase elupunktid, põhjusta oma vastasele kahju, mis on võrdne erinevusega, pärast kahju arvutamist. Sinu ooteetapi ajal tagasta see avatud kaart, mida sa kontrollid, pakki.

source: Temporal Machine God Raphion
et: Ajutine Masinajumal Raphion

source: Cannot be Special Summoned from the Deck. If you control no monsters: You can Summon this card without Tribute. This card cannot be destroyed by battle or by card effects. Battle Damage you take from battles involving this face-up Attack Position card becomes 0. At the end of the Battle Phase, when this card battles: Inflict damage to your opponent equal to the ATK of the monster it battled. During your Standby Phase: Return this face-up card to the Deck.
et: Ei saa eriliselt kutsuda pakist. Kui sul pole koletisi: Sa saad selle kaardi kutsuda ilma ohvrita. Seda kaarti ei saa hävitada lahingus ega kaardiefektidega. Lahingukahju, mida sa saad selle näoga ülespoole rünnakupositsioonis oleva kaardiga seotud lahingutest, muutub 0-ks. Lahingufaasi lõpus, kui see kaart lahingus osaleb: Tekita oma vastasele kahju, mis on võrdne koletise rünnakujõuga, kellega see lahingus oli. Sinu ooteetapi ajal: Tagasta see näoga ülespoole kaart pakki.

source: Temporal Machine God Gabrion
et: Ajutine Masinajumal Gabrion

source: Cannot be Special Summoned from the Deck. If you control no monsters, you can Summon this card without Tribute. This card cannot be destroyed (either by battle or by card effects). Battle Damage you take from battles involving this face-up Attack Position card becomes 0. At the end of the Battle Phase, in which this card battles: Target 1 card you opponent controls; return that target to the Deck. During your Standby Phase: Return this face-up card to the Deck.
et: Ei saa eriliselt kutsuda pakist. Kui sul pole ühtegi koletist, saad selle kaardi kutsuda ilma ohvrita. Seda kaarti ei saa hävitada (ei lahingus ega kaardiefektide tõttu). Lahingukahju, mida sa saad lahingutest, milles see ründepositsioonis kaart osaleb, muutub 0-ks. Lahingufaasi lõpus, milles see kaart lahingus osaleb: Märgi 1 kaart, mida su vastane kontrollib; tagasta see sihtmärk pakki. Oma ootejärgus: Tagasta see avatud kaart pakki.

source: Temporal Machine God Sandaion
et: Ajutise Masinajumal Sandaion

source: This card cannot be Special Summoned from the Deck. If you control no monsters, you can Normal Summon this card without Tribute. This card cannot be destroyed by battle or by card effects. Both players take no Battle Damage from battles involving this face-up Attack Position card. At the end of the Battle Phase in which this card battled: Inflict 2000 damage to your opponent. During your Standby Phase: Return this card to the Deck.
et: Seda kaarti ei saa eriliselt kutsuda pakist. Kui sul ei ole kontrolli all ühtegi koletist, saad selle kaardi normaalselt kutsuda ilma ohvrita. Seda kaarti ei saa hävitada lahingus ega kaardiefektide poolt. Mõlemad mängijad ei saa lahingukahju lahingutest, milles osaleb see avatud rünnakupositsioonis kaart. Lahingufaasi lõpus, milles see kaart võitles: Tekita oma vastasele 2000 kahju. Sinu ooteetapi ajal: Tagasta see kaart pakki.

source: Nonexistence Machine - Ain
et: Olemasolematu Masin - Ain

source: Once per turn: You can discard 1 "Temporal Machine" monster from your hand; draw 1 card.
et: Korra ühe käigu jooksul: Sa võid oma käest ära visata 1 "Temporal Machine" koletise; tõmba 1 kaart.

source: Endless Machine - Ain Soph
et: Lõputu Masin - Ain Soph

source: Activate only by sending 1 face-up "<M3470>Nonexistence Machine - Ain<M>" you control to the Graveyard. Once per turn, you can Special Summon 1 "Temporal Machine" monster from your hand. Once per opponent's turn, you can discard 1 "Temporal Machine" monster to draw 2 cards from your Deck. When this card is sent to the graveyard, you can special summon, ignoring the Summoning conditions., one "<M3470>Nonexistence Machine - Ain<M>" from your hand, deck or graveyard.
et: Aktiveeri ainult, saates 1 avatud "<M3470>Olemasolematu Masin - Ain<M>" sinu kontrolli alt Hauakambrisse. Kord ühe käigu jooksul saad sa Erikutsuda 1 "Ajamasiina" koletise oma käest. Kord vastase käigu jooksul saad sa ühe "Ajamasiina" koletise ära visata, et tõmmata 2 kaarti oma pakist. Kui see kaart saadetakse hauakambrisse, saad sa erikutsuda, ignoreerides kutsumise tingimusi, ühe "<M3470>Olemasolematu Masin - Ain<M>" oma käest, pakist või hauakambrist.

source: Infinite Light - Ain Soph Ohr
et: Lõpmatu Valgus - Ain Soph Ohr

source: Activate only by sending 1 face-up "<M3471>Endless Machine - Ain Soph<M>" you control to the Graveyard. Once per turn, you can Special Summon 1 "Temporal Machine" monster from your hand. Once per turn, you can discard 1 "Temporal Machine" monster to draw 2 cards from your Deck. "Temporal Machine" monsters you control do not return to the Deck due to their own effects during your Standby Phase. If this face-up card is sent to the graveyard, you can Special Summon 1 "<M9708>Temporal Machine God Sephylon<M>" from your hand, Deck, or Graveyard, ignoring the Summoning conditions.
et: Aktiveeri ainult, saates 1 avatud "<M3471>Lõputu Masin - Ain Soph<M>" oma kontrolli alt Hauakambrisse. Kord käigu jooksul saad sa Kutsuda Eriliselt 1 "Aja Masin" koletise oma käest. Kord käigu jooksul saad sa visata 1 "Aja Masin" koletise, et tõmmata 2 kaarti oma Pakkist. "Aja Masin" koletised, mida sa kontrollid, ei naase oma efektide tõttu Pakkki sinu Oote Faasi ajal. Kui see avatud kaart saadetakse hauakambrisse, saad sa Kutsuda Eriliselt 1 "<M9708>Aja Masina Jumal Sephylon<M>" oma käest, Pakkist või Hauakambrist, ignoreerides Kutsumise tingimusi.

source: Empress' Staff
et: Keisrinna sau

source: When an opponent's monster declares an attack: Negate it and end the Battle Phase. Then, inflict 500 damage to your opponent. If you control no monsters, you can activate this card from your hand.
et: Kui vastase koletis kuulutab välja rünnaku: Tühista see ja lõpeta Lahingufaas. Seejärel põhjusta vastasele 500 kahju. Kui sul pole koletisi, saad selle kaardi aktiveerida oma käest.

source: Empress' Crown
et: Keisrinna kroon

source: You can only activate this card if you control 1 face-up "Temporal Machine" Monster in your Field, You can activate this card from your hand when a Synchro Monster is Special Summoned to your opponent's side of the field. Draw 2 cards for each face-up Synchro Monster your opponent controls.
et: Seda kaarti saad aktiveerida ainult siis, kui sinu väljal on 1 avatud "Temporal Machine" koletis. Sa saad selle kaardi oma käest aktiveerida, kui Sünkro Koletis kutsutakse eriliselt välja sinu vastase väljale. Tõmba 2 kaarti iga avatud Sünkro Koletise eest, mida sinu vastane kontrollib.

source: Aurora Draw
et: Aurora Tõmme

source: Activate only if you control a Face-up "Machine Imperial" monster and you have no other cards in your hand. Draw 2 cards.
et: Aktiveeri ainult siis, kui sa kontrollid avatud "Masinaimpeeriumi" koletist ja sul pole teisi kaarte käes. Tõmba 2 kaarti.

source: Chaos Bloom
et: Kaose õis

source: This card gains effects based on the number of "<M3476>Chaos Bloom<M>" cards in your Graveyard.<BR>● 0: Destroy 1 face-up monster on the field with 1000 or less ATK.<BR>● 1: Destroy 1 Spell/Trap Card on the field.<BR>● 2: Destroy 1 card on the field.
et: See kaart saab oma mõju vastavalt sinu Hauakambris olevate "<M3476>Chaos Bloom<M>" kaartide arvule.<BR>● 0: Hävita 1 avatud koletis väljal, mille ATK on 1000 või vähem.<BR>● 1: Hävita 1 Võlu-/Lõksukaart väljal.<BR>● 2: Hävita 1 kaart väljal.

source: Chaos Blast
et: Kaose Plahvatus

source: Send 3 Level 1 Machine-Type monsters from your Deck to the Graveyard to target 1 face-up Level 4 or lower monster on the field; destroy it.
et: Saada 3. taseme 1 masinatüüpi koletist oma pakist hauakambrisse, et sihtida ühte avatud 4. taseme või madalamat koletist väljal; hävita see.

source: Future Destruction
et: Tuleviku hävitamine

source: Send cards from the top of your Deck to the Graveyard equal to the number of cards in your hand.
et: Saada oma pakist kaarte hauakambrisse võrdne arvuga kaartidest sinu käes.

source: Afterglow
et: Järelkuma

source: Shuffle this card back into the Deck. During your next Draw Phase, if you draw "<M3479>Afterglow<M>": Inflict 8000 damage to your opponent.
et: Sega see kaart tagasi pakki. Järgmise tõmbefaasi ajal, kui tõmbad "<M3479>Afterglow<M>": Tekita oma vastasele 8000 kahju.

source: Cursed Synchro
et: Neetud Sünkro

source: Activate only when you take Battle Damage from the attack of an opponent's Synchro Monster. Synchro Monsters cannot declare an attack.
et: Aktiveeri ainult siis, kui saad lahingukahju vastase Sünkro Koletise rünnakust. Sünkro Koletised ei saa rünnakut kuulutada.

source: Highrate Draw
et: Kiire joonistus

source: Destroy all monsters you control. Then, draw 1 card for each Machine type monster destroyed by this effect.
et: Hävita kõik koletised, mida sa kontrollid. Seejärel tõmba 1 kaart iga selle efekti tõttu hävitatud Masina tüüpi koletise kohta.

source: Machine Imperial Creation
et: Masina keiserlik looming

source: Banish 1 "<M3657>Wise Core<M>", "<M3659>Grand Core<M>", and "<M3658>Sky Core<M>" from your Graveyard. Special Summon 1 "<M9553>Machine Imperial God Machinicle ∞<M>" from your hand, Deck or Graveyard, ignoring the Summoning conditions. Then, equip this card to it. If the equipped monster would be destroyed, you can banish 1 "Wisel", "Granel", or "Skiel" monster from your Graveyard, instead.
et: Eemalda oma kalmistult 1 "<M3657>Wise Core<M>", "<M3659>Grand Core<M>" ja "<M3658>Sky Core<M>". Kutsu eriliselt välja 1 "<M9553>Machine Imperial God Machinicle ∞<M>" oma käest, pakist või kalmistult, ignoreerides kutsumise tingimusi. Seejärel kinnita see kaart sellele. Kui varustatud koletis hävitatakse, võid selle asemel oma kalmistult eemalda 1 "Wisel", "Granel" või "Skiel" koletis.

source: Infinite Prison
et: Lõputu Vangla

source: Once per turn: You can discard 1 card from your hand to the Graveyard to target 1 Level 4 or lower monster in your Graveyard; Place it face-up in your Spell & Trap Card Zone as a Spell Card. If this card is destroyed and sent to the Graveyard: Return all monsters placed by this card's effect in your Spell & Trap Card Zone to the hand.
et: Kord päevas: Sa võid oma käest ühe kaardi Hauakambrisse visata, et sihtida ühte 4. taseme või madalama tasemega koletist oma Hauakambris; Aseta see näoga ülespoole oma Loitsu ja Lõksu Kaardi Alale Loitsukaardina. Kui see kaart hävitatakse ja saadetakse Hauakambrisse: Tagasta kõik selle kaardi efekti abil Loitsu ja Lõksu Kaardi Alale asetatud koletised kätte.

source: T.G. Metal Skeleton
et: T.G. Metallist Skelett

source: If a monster on the field is destroyed while you control a face-up "T.G." monster: You can Special Summon this card from your hand.
et: Kui koletis väljal hävitatakse ajal, mil sa kontrollid avatud "T.G." koletist: Sa võid selle kaardi oma käest eriliselt kutsuda.

source: T.G. Gear Zombie
et: T.G. Käigu Zombi

source: If there another face-up "T.G." monster on your side of the field, you can Special Summon this card from your hand. If this card is successfully Special Summoned this way, target another "T.G." monster on your side of the field, that monster loses 1000 ATK
et: Kui sinu väljaku poolel on veel üks avatud "T.G." koletis, saad selle kaardi oma käest eriliselt kutsuda. Kui see kaart on sel viisil edukalt eriliselt kutsutud, sihi veel ühte "T.G." koletist oma väljaku poolel, see koletis kaotab 1000 ATK

source: T.G. Drill Fish
et: T.G. Puurkala

source: If you control another face-up "T.G." monster, this card can attack you opponent's Life Points directly. When this card inflicts Battle Damage, select and destroy 1 monster your opponent controls.
et: Kui sa kontrollid teist avatud "T.G." koletist, võib see kaart rünnata sinu vastase Elupunkte otse. Kui see kaart tekitab Lahingukahju, vali ja hävita 1 koletis, mida sinu vastane kontrollib.

source: Jormungardr the Nordic Serpent
et: Jormungardr, Põhjala Madu

source: You cannot normal summon this card. You can Special Summon this card from your hand to your opponent's side of the field in face-up Defense Position. You cannot Normal Summon or Set monsters during the turn that this monster is Special Summoned this way. When this Defense Position card is changed to Attack Position, its controller takes 3000 damage. This card cannot be used as tribute or as synchro material.
et: Sa ei saa seda kaarti tavaliselt kutsuda. Sa saad selle kaardi oma käest eriliselt kutsuda oma vastase väljaku poolele avatud kaitsepositsioonis. Sa ei saa tavaliselt kutsuda ega asetada koletisi sellel käigul, kui see koletis on niimoodi eriliselt kutsutud. Kui see kaitsepositsioonis kaart muudetakse rünnakupositsiooniks, saab selle kontrollija 3000 kahju. Seda kaarti ei saa kasutada tribuudina ega sünkromaterjalina.

source: Fenrir the Nordic Wolf
et: Fenrir, Põhjala Hunt

source: This card cannot be normal summoned, you can Special Summon this card from your hand to your opponent's side of the field in face-up Defense Position. You cannot Normal Summon or Set monsters, nor conduct your battle phase during the turn you Summon this monster. During each Standby Phase, change the Battle Position of all monsters you control. If there is no other face-up "Nordic" or "Aesir" monster(s), destroy this card. The Battle Damage your opponent takes from battles involving this card is also inflicted to you.
et: Seda kaarti ei saa tavaliselt kutsuda, sa saad selle kaardi oma käest eriliselt kutsuda vastase väljaku poolele avatud kaitsepositsioonis. Sa ei saa tavaliselt kutsuda ega asetada koletisi ega läbi viia oma lahingufaasi sellel käigul, mil sa selle koletise kutsud. Iga ooteetapi ajal muuda kõigi sinu kontrollitavate koletiste lahingupositsiooni. Kui ei ole teisi avatud "Nordic" või "Aesir" koletisi, hävita see kaart. Lahingukahju, mida sinu vastane saab selle kaardiga seotud lahingutest, kantakse ka sinule.

source: Activate this card from your Graveyard by Selecting 1 "Aesir" Monster, return this card from your Graveyard to your Spell & Trap Card Zone, The selected Monster is unaffected by Spell and Trap cards except this one. Inflict Dammage to your opponent equal to the sum of the ATK of all face-up monsters on your side of the Field. During your 3rd End Phase after activation: Banish all monsters you control, this card to be included.
et: Aktiveeri see kaart oma Hauakambrist, valides 1 "Aesir" koletis, tagasta see kaart oma Hauakambrist oma Loitsu ja Lõksu Kaartide Alale. Valitud koletis ei ole mõjutatud Loitsu ja Lõksu kaartidest, välja arvatud see. Tekita oma vastasele kahju, mis on võrdne kõigi sinu väljaku avatud koletiste rünnakupunktide summaga. Oma 3. lõppfaasi ajal pärast aktiveerimist: pagenda kõik koletised, mida sa kontrollid, kaasa arvatud see kaart.

source: Holding-Hands Majin
et: Käest Hoidev Majin

source: Your opponent cannot target other face-up monsters you control for an attack. While this card is in face-up on the Field, it gains DEF equal to the total original DEF of every other face-up monster you control.
et: Sinu vastane ei saa sihtida teisi avatud koletisi, mida sa kontrollid, rünnakuks. Kui see kaart on väljas ja avatud väljal, saab see DEF-i, mis on võrdne kõigi teiste avatud koletiste algse DEF-i kogusummaga, mida sa kontrollid.

source: Sleeping Giant Thud
et: Magav Hiiglane Thud

source: This card cannot be Normal Summoned or Set. This card cannot be Special Summoned except by Tributing 1 Level 1 Normal Monster that has remained face-up on your side of the field for 10 or more turns. If this card battles with an opponent's monster, until the end of the Damage Step, it gains ATK and DEF equal to the ATK of the opponent's monster + 1000 and that monster's effect(s) is negated. This card is unaffected by card effects other than this Card.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti ei saa eriliselt kutsuda, välja arvatud, kui ohverdatakse 1. taseme normaalne koletis, mis on jäänud sinu väljale avatud kujul 10 või rohkem käiku. Kui see kaart võitleb vastase koletisega, saab see kuni Kahjustuse Sammuni lõpuni ATK ja DEF, mis on võrdne vastase koletise ATK + 1000-ga, ja selle koletise efekt(id) tühistatakse. Seda kaarti ei mõjuta muud kaardi efektid peale selle kaardi.

source: While you control 2 or more Defense Position monsters, those monsters cannot be destroyed by card effects.
et: Kui sa kontrollid 2 või enamat kaitseasendis koletist, ei saa neid koletisi kaartide efektidega hävitada.

source: Dimension Equilibrium
et: Mõõtmete tasakaal

source: Target 1 Beast-Type monster you control; if that target is destroyed by battle and sent to the Graveyard, banish the monster that attacked and Special Summon the destroyed monster from the Graveyard.
et: Vali 1 Põhjuse-Tüüpi koletis, mida sa kontrollid; kui see sihtmärk hävitatakse lahingus ja saadetakse Hauakambrisse, pagenda koletis, kes ründas, ja Kutsu hävitatud koletis Hauakambrist Eriliselt välja.

source: Beast Burial Ritual
et: Metse matmise rituaal

source: Destroy 1 Beast-Type monster you control. During your next Standby Phase, draw 2 cards.
et: Hävita 1 Beast-tüüpi koletis, mida sa kontrollid. Järgmise Standby Phase'i ajal tõmba 2 kaarti.

source: Tuning Collapse
et: Häälestuse Kokkupõrge
