Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: If an opponent's Synchro Monster is destroyed by battle: Your opponent sends cards from the top of their Deck to the Graveyard equal to the Level of the destroyed Synchro Monster.
et: Kui vastase Sünkroonkoletis hävitatakse lahingus: Sinu vastane saadab kaarte oma paki pealt hauakambrisse, mis on võrdne hävitatud Sünkroonkoletise tasemega.

source: Destruction Trigger
et: Hävituse Käivitaja

source: Activate only when a card you control is destroyed by the effect of a Spell/Trap/Monster Card. Your opponent sends the top 5 cards of their Deck to their Graveyard.
et: Aktiveeri ainult siis, kui sinu kontrolli all olev kaart hävitatakse Loitsu/Lõksu/Koletise Kaardi efekti tõttu. Sinu vastane saadab oma paki 5 ülemist kaarti hauakambrisse.

source: Thousand Crisscross
et: Tuhat Ristmikku

source: Activate only when your Life Points become less than 2000. Your Life Points become 2000. After this effect is used 3 times, destroy this card.
et: Aktiveeri ainult siis, kui sinu Elupunktid langevad alla 2000. Sinu Elupunktid muutuvad 2000-ks. Pärast selle efekti kasutamist 3 korda, hävita see kaart.

source: Superficial Peace
et: Pindmine rahu

source: During this turn, monsters cannot be destroyed by battle. In addition, when a monster you control inflicts Battle Damage to your opponent, target and destroy 1 Spell/Trap Card your opponent controls.
et: Selle käigu jooksul ei saa koletisi lahingus hävitada. Lisaks, kui sinu kontrollitav koletis tekitab vastasele lahingukahju, sihi ja hävita 1 loitsu/lõksukaart, mida sinu vastane kontrollib.

source: Passion of Baimasse
et: Baimasse kirg

source: You can activate this Card only if you control 1 face-up "Earthbound Immortal" Monster on your side of the Field, Negate the activation of an Effect Monster's effect and destroy it.
et: Seda kaarti saab aktiveerida ainult siis, kui sinu väljaku poolel on 1 avatud "Earthbound Immortal" koletis. Tühista Efektikoletise efekti aktiveerimine ja hävita see.

source: Armored White Bear
et: Soomustatud Valge Karu

source: When this card is destroyed and sent to the Graveyard (by battle or card effect), you can Special Summon 1 Level 4 or lower LIGHT Beast-Type monster from your Deck or Graveyard.
et: Kui see kaart hävitatakse ja saadetakse Hauakambrisse (lahingu või kaardi efekti tõttu), saad Sa eriliselt kutsuda 1 Tase 4 või madalama VALGUS Tüüpi metsalise oma Paki või Hauakambri seest.

source: Synchro Monument
et: Sünkroonmonument

source: Synchro Summons cannot be Negated. In Addition, when a Synchro Monster is Synchro Summoned, neither Players can activate any Spell/Trap cards.
et: Sünkroonväljakutsed ei saa tühistada. Lisaks, kui sünkroonkoletis on sünkroonväljakutsutud, ei saa kumbki mängija aktiveerida ühtegi loitsu/lõksukaarti.

source: Frozen Fitzgerald
et: Külmunud Fitzgerald

source: 1 non-Tuner - 1 Dark Tuner Monster<BR>This card can only be Synchro Summoned if the Level of the non-Tuner Synchro Material Monster minus the Level of the Dark Tuner Synchro Material Monster equals -5. If this card attacks, your opponent cannot activate a Spell or Trap Card until the end of the Damage Step. When this card is destroyed by battle and sent to the Graveyard, if you control no other monsters, Special Summon this card in face-up Defense Position on your side of the field. While this card is face-up on the field, destroy all monsters who attacked a "<M9216>Frozen Fitzgerald<M>" this turn at the end of the Battle Phase.
et: 1 mittehäälestaja - 1 Tume Häälestaja Koletis<BR>Seda kaarti saab Sünkroon-Kutsuda ainult siis, kui mittehäälestaja Sünkroon-Materjali Koletise tase miinus Tume Häälestaja Sünkroon-Materjali Koletise tase võrdub -5. Kui see kaart ründab, ei saa sinu vastane aktiveerida Loitsu ega Lõksukaarti kuni Kahjustuse Etapi lõpuni. Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse, kui sul pole teisi koletisi, Kutsu see kaart eriliselt välja näoga ülespoole Kaitseasendis sinu väljaku poolele. Kui see kaart on näoga ülespoole väljakul, hävita kõik koletised, kes ründasid "<M9216>Frozen Fitzgerald<M>" sellel käigul Lahingu Faasi lõpus.

source: Dark Diviner
et: Tume Ennustaja

source: 1 non-Tuner monster - 1 Dark Tuner<BR>This card can only be Synchro Summoned if the Level of the non-Tuner Synchro Material Monster minus the Level of the Dark Tuner Synchro Material Monster equals -4. This card cannot be destroyed by battle. When this card declares an attack and the ATK of the attack target is higher than the original ATK of this card, send 1 card from the top of your opponent's Deck to the Graveyard for every 100 points of difference.
et: 1 mittehäälestaja koletis - 1 Tumehäälestaja<BR>Seda kaarti saab Sünkroonväljakutsuda ainult siis, kui mittehäälestaja sünkroonmaterjali koletise tase miinus Tumehäälestaja sünkroonmaterjali koletise tase võrdub -4. Seda kaarti ei saa lahingus hävitada. Kui see kaart kuulutab välja rünnaku ja rünnaku sihtmärgi ATK on kõrgem kui selle kaardi algne ATK, siis saadab iga 100 punktise erinevuse kohta 1 kaardi sinu vastase paki pealt hauakambrisse.

source: One Hundred-Eyed Dragon
et: Sajasilmne Draakon

source: 1 non-Tuner monster - 1 DARK Tuner<BR>This card can only be Synchro Summoned if the Level of the non-Tuner Synchro Material Monster minus the Level of the Dark Tuner Synchro Material Monster equals -8. If this card attacks, your opponent cannot activate Spell or Trap Cards until the end of the Damage Step. While this card is face-up on the field, it gains the effects of all "Infernity" monsters in your Graveyard. If this card is destroyed while on the field, select 1 card from your Deck and add it to your hand.
et: 1 mittehäälestuskoletis - 1 PIMEDUS häälestuskoletis<BR>Seda kaarti saab Sünkro Kutsuda ainult siis, kui mittehäälestus Sünkro Materjal Koletise tase miinus Pimeduse Häälestus Sünkro Materjal Koletise tase on -8. Kui see kaart ründab, ei saa sinu vastane aktiveerida Loitsu- ega Lõksukaarte kuni Kahjustuse Sammuni. Kui see kaart on väljal näoga ülespoole, saab see kõikide sinu Hauas olevate "Infernity" koletiste efektid. Kui see kaart hävitatakse väljal olles, vali 1 kaart oma Pakist ja lisa see oma kätte.

source: Underground Arachnid
et: Maa-alune ämblik

source: 1 non-Tuner monster - 1 Dark Tuner<BR>This card can only be Synchro Summoned if the Level of the non-Tuner Synchro Material Monster minus the Level of the Dark Tuner Synchro Material Monster equals -6. If this card attacks, your opponent cannot activate Spell or Trap Cards until the end of the Damage Step. Once per turn, you can equip 1 monster your opponent controls to this card. If this card would be destroyed, destroy the equipped monster instead.
et: 1 mittehäälestuskoletis - 1 Tumehäälestaja<BR>Seda kaarti saab Sünkroonvälja kutsuda ainult siis, kui mittehäälestuskoletise Sünkroonmaterjali taseme ja Tumehäälestaja Sünkroonmaterjali taseme vahe on -6. Kui see kaart ründab, ei saa sinu vastane aktiveerida Loitsu- ega Lõksukaarte kuni Kahjustusetapi lõpuni. Kord ühe käigu jooksul saad varustada selle kaardiga 1 koletise, mida sinu vastane kontrollib. Kui see kaart hävitatakse, hävita selle asemel varustatud koletis.

source: Zeman the Ape King
et: Ahvikuningas Zeman

source: 1 non-Tuner Monster - 1 DARK Tuner<BR>This card can only be Synchro Summoned if the Level of the non-Tuner Synchro Material Monster minus the Level of the Dark Tuner Synchro Material Monster equals -7. If this card attacks, your opponent cannot activate any Spell or Trap Card until the end of the Damage Step. When your opponent's monster declares an attack, send 1 monster from either your hand or your side of the field to the Graveyard to negate that attack.
et: 1 mittehäälestaja koletis - 1 PIMEDUS häälestaja<BR>Seda kaarti saab sünkroonväljakutsuda ainult siis, kui mittehäälestaja sünkroonmaterjali koletise tase miinus Pimeduse häälestaja sünkroonmaterjali koletise tase on -7. Kui see kaart ründab, ei saa sinu vastane aktiveerida ühtegi loitsu- ega lõksukaarti kuni Kahjustusetapi lõpuni. Kui sinu vastase koletis kuulutab välja rünnaku, saada 1 koletis kas oma käest või oma väljaku poolelt Hauakambrisse, et see rünnak tühistada.

source: Dark Tuner Catastrogue
et: Tume Tuuner Katastroog

source: This card cannot be used as a Synchro Material Monster, except for the Synchro Summon of a Dark Synchro monster. If this card is used for a Synchro Summon and sent to the Graveyard, destroy 1 card on your opponent's side of the field.
et: Seda kaarti ei saa kasutada Sünkro Materjal Koletisena, välja arvatud Pimeduse Sünkro koletise Sünkro Kutsumiseks. Kui seda kaarti kasutatakse Sünkro Kutsumiseks ja saadetakse Hauakambrisse, hävita 1 kaart oma vastase väljaku poolel.

source: Dark Tuner Chaos Rogue
et: Pimehäälestaja Kaose Rändur

source: This card cannot be used as a Synchro Material Monster, except for the Synchro Summon of a Dark Synchro monster. If this card is used for a Synchro Summon and sent to the Graveyard, send 5 cards from the top of your opponent's Deck to the Graveyard.
et: Seda kaarti ei saa kasutada Sünkro Materjal Koletisena, välja arvatud Pimeduse Sünkro koletise Sünkro Kutsumiseks. Kui seda kaarti kasutatakse Sünkro Kutsumiseks ja see saadetakse Hauakambrisse, siis saada 5 kaarti oma vastase paki pealt Hauakambrisse.

source: Dark Tuner Nightmare Hand
et: Pimehäälestaja Õudusunenäo Käsi

source: When this card is Normal or Special Summoned, you can Special Summon 1 Level 2 monster from your hand. This card cannot be used as a Synchro Material Monster, except for the Synchro Summon of a Dark Synchro Monster.
et: Kui see kaart on Normaal- või Erikutsutud, saad sa Erikutsuda 1. taseme 2 koletise oma käest. Seda kaarti ei saa kasutada Sünkromaterjalina, välja arvatud Pimeduse Sünkrokoletise Sünkrokutsumiseks.

source: Dark Tuner Spider Cocoon
et: Pimehäälestaja Ämblikukookon

source: If your opponent controls a monster and you control no monsters, you can Special Summon this card from your hand. This card cannot be used as a Synchro Material Monster, except for the Synchro Summon of a Dark Synchro monster.
et: Kui sinu vastasel on koletis ja sul ei ole koletisi, saad selle kaardi oma käest eriliselt kutsuda. Seda kaarti ei saa kasutada Sünkro Materjal Koletisena, välja arvatud Pimeduse Sünkro koletise Sünkro Kutsumiseks.

source: Dark Tuner Dark Ape
et: Tume Häälestaja Tume Ahv

source: This card cannot be used as a Synchro Material Monster, except for the Synchro Summon of a Dark Synchro monster. If this card is used for a Synchro Summon and sent to the Graveyard, draw 1 card from your Deck.
et: Seda kaarti ei saa kasutada Sünkromaterjalina, välja arvatud Pimeduse Sünkrokoletise Sünkrokutsumiseks. Kui seda kaarti kasutatakse Sünkrokutsumiseks ja see saadetakse Hauakambrisse, tõmba oma pakist 1 kaart.

source: Dark Wave
et: Tume Laine

source: Select 1 face-up non-Tuner monster that you control. If that monster is used this turn as a Synchro Material Monster for the Synchro Summon of a Dark Synchro Monster, treat its level as a negative number.
et: Vali 1 avatud mitte-Tuuner koletis, mida sa kontrollid. Kui seda koletist kasutatakse sel käigul Sünkro Materjal Koletisena Pimeduse Sünkro Koletise Sünkro Kutsumiseks, käsitle selle taset negatiivse numbrina.

source: Crystal Skull
et: Kristallkolju

source: When this card is Summoned: This card's controller takes 1000 damage.
et: Kui see kaart kutsutakse välja: Selle kaardi kontrollija saab 1000 kahju.

source: Ashoka Pillar
et: Ashoka sammas

source: When this card is destroyed,its controller takes 2000 points of damage.
et: Kui see kaart hävitatakse, saab selle kontrollija 2000 punkti kahju.

source: Cabrera Stone
et: Cabrera Kivi

source: If this card is in face-up Defense Position on the field, destroy this card. When this card is destroyed, take 2000 points of damage.
et: Kui see kaart on väljaku peal avatud kaitsepositsioonis, hävita see kaart. Kui see kaart hävitatakse, saad 2000 punkti kahju.

source: Triangle O
et: Kolmnurk O

source: You can activate this card's effect if you control a face-up "<M3611>Crystal Skull<M>", "<M3612>Ashoka Pillar<M>" and "<M3613>Cabrera Stone<M>". Destroy all cards on the field. During this turn, if you would take damage due to a card effect, your opponent takes that damage instead.
et: Saate aktiveerida selle kaardi efekti, kui kontrollite avatud "<M3611>Kristallkolju<M>", "<M3612>Ashoka sammas<M>" ja "<M3613>Cabrera kivi<M>". Hävitage kõik kaardid väljal. Selle käigu ajal, kui peaksite kaardi efekti tõttu kahju saama, saab teie vastane selle kahju asemel.

source: Giant Ushi Oni
et: Hiiglaslik Ushi Oni

source: Tribute 1 "<M4407>Ushi Oni<M>" you control to Special Summon this card from your hand. If this card destroys your opponent's monster by battle, it can attack once again in a row.
et: Lohista 1 "<M4407>Ushi Oni<M>", mida sa kontrollid, et Kutsuda see kaart oma käest Eriliselt välja. Kui see kaart hävitab lahingus sinu vastase koletise, saab see rünnata veel kord järjest.

source: Masked Knight LV3
et: Maskeeritud Rüütel LV3

source: During your Standby Phase, you can send this face-up card to the Graveyard to Special Summon 1 "<M3617>Masked Knight LV5<M>" from your hand or Deck. Once per turn, you can inflict 400 damage to your opponent. If you activate this effect, this card cannot attack during this turn.
et: Oma Standby-faasis võid saata selle avatud kaardi Hauakambrisse, et Kutsuda Eriliselt välja 1 "<M3617>Maskeeritud Rüütel LV5<M>" oma käest või Pakist. Kord käigu jooksul võid tekitada oma vastasele 400 kahju. Kui aktiveerid selle efekti, ei saa see kaart sellel käigul rünnata.

source: Masked Knight LV5
et: Maskeeritud Rüütel LV5

source: During your Standby Phase, you can send this face-up card to the Graveyard to Special Summon 1 "<M3618>Masked Knight LV7<M>" from your hand or Deck. (You cannot activate this effect the turn this card is Normal Summoned, Special Summoned, or flipped face-up.) Once per turn, you can inflict 1000 damage to your opponent. If you activate this effect, this card cannot attack during this turn.
et: Oma Standby Phase'i ajal võid saata selle avatud kaardi Hauakambrisse, et Kutsuda Eriliselt välja 1 "<M3618>Maskeeritud Rüütel LV7<M>" oma käest või Pakkist. (Sa ei saa seda efekti aktiveerida sellel käigul, kui see kaart on Normaal-Kutsutud, Eriliselt Kutsutud või avatud.) Kord käigu jooksul võid tekitada oma vastasele 1000 kahju. Kui aktiveerid selle efekti, ei saa see kaart sellel käigul rünnata.

source: Masked Knight LV7
et: Maskeeritud Rüütel LV7

source: This card cannot be Normal Summoned or Set. This card can only be Special Summoned by the effect of "<M3617>Masked Knight LV5<M>". Once per turn, you can inflict 1500 damage to your opponent.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti saab eriliselt kutsuda ainult "<M3617>Maskeeritud Rüütel LV5<M>" efekti abil. Kord käigu jooksul võid oma vastasele tekitada 1500 kahju.

source: Chariot Pile
et: Vankrihunnik

source: Once per turn, during your Main Phase, you can inflict 300 points of damage to your opponent's Life Points. Once per turn, if your opponent declares a direct attack, pay 800 Life Points to destroy the attacking monster.
et: Kord ühe korra oma peafaasil võid sa tekitada oma vastase Elupunktidele 300 punkti kahju. Kord ühe korra, kui sinu vastane kuulutab välja otsese rünnaku, maksa 800 Elupunkti, et hävitada ründav koletis.

source: Fortune Fairy Hikari
et: Õnnehaldjas Hikari

source: Drawing this card means your fortune today is "Super Happy"!<BR>Your lucky number is 1.<BR>Your lucky color is yellow.<BR>Your lucky item is a shiny charm.<BR>All of your wishes will come ture!
et: Selle kaardi tõmbamine tähendab, et sinu õnn täna on "Super Õnnelik"!<BR>Sinu õnnenumber on 1.<BR>Sinu õnnevärv on kollane.<BR>Sinu õnneese on läikiv amulett.<BR>Kõik sinu soovid täituvad!

source: Fortune Fairy En
et: Õnnehaldjas En

source: Drawing this card means your fortune today is "Very Happy"!<BR>Your lucky number is 2.<BR>Your lucky color is red.<BR>Your lucky item is a goldfish.<BR>I bet something really fun will happen!
et: Selle kaardi tõmbamine tähendab, et sinu õnn täna on "Väga Õnnelik"!<BR>Sinu õnnenumber on 2.<BR>Sinu õnnevärv on punane.<BR>Sinu õnneese on kuldkala.<BR>Ma arvan, et midagi tõeliselt lõbusat juhtub!

source: Fortune Fairy Hu
et: Õnnehaldjas Hu

source: Drawing this card means your fortune today is "Not too Bad".<BR>Your lucky number is 3.<BR>Your lucky color is green.<BR>Your lucky item is a plant.<BR>You might find something you lost.
et: Selle kaardi tõmbamine tähendab, et sinu õnn täna on "Pole kõige hullem".<BR>Sinu õnnenumber on 3.<BR>Sinu õnnevärv on roheline.<BR>Sinu õnneese on taim.<BR>Võid leida midagi, mille oled kaotanud.

source: Fortune Fairy Swee
et: Õnnehaldjas Swee

source: Drawing this card means your fortune today is "A Little Bad".<BR>Your lucky number is 4.<BR>Your lucky color is blue.<BR>Your lucky item is an umbrella.<BR>Your luck may change if you head to the east.
et: Selle kaardi tõmbamine tähendab, et sinu õnn täna on "Natuke Halb".<BR>Sinu õnnenumber on 4.<BR>Sinu õnnevärv on sinine.<BR>Sinu õnneese on vihmavari.<BR>Sinu õnn võib muutuda, kui suundud itta.

source: Fortune Fairy Ann
et: Õnnehaldjas Ann

source: Your fortune the day you draw this card is unhappy.<BR>Lucky number, 5<BR>Lucky color, purple.<BR>Lucky item, sunglasses.<BR>Be Wary of falling things!
et: Sinu õnn selle kaardi tõmbamise päeval on õnnetu.<BR>Õnnenumber, 5<BR>Õnnevärv, lilla.<BR>Õnneese, päikeseprillid.<BR>Ole ettevaatlik kukkuvate asjade suhtes!

source: Fortune Fairy Chee
et: Õnnehaldjas Chee

source: Your fortune the day you draw this card is super pinch!<BR>Lucky number, 6<BR>Lucky color, black.<BR>Lucky item, leather shoes.<BR>You may gain an edge over your competition. Cheer up!!
et: Sinu õnn sellel päeval, kui sa selle kaardi tõmbad, on super kitsas!<BR>Õnnenumber, 6<BR>Õnnevärv, must.<BR>Õnneese, nahast kingad.<BR>Sa võid saada eelise oma konkurentide ees. Rõõmusta!!

source: Unacceptable Result
et: Vastuvõetamatu tulemus

source: Activate only when you Summon a "Fortune Fairy" monster(s). Special Summon 1 "Fortune Fairy" monster from your hand.
et: Aktiveeri ainult siis, kui sa kutsud välja "Fortune Fairy" koletise(d). Kutsu eriliselt välja 1 "Fortune Fairy" koletis oma käest.

source: Luck Loan
et: Õnne Laen

source: Select 1 face-up "Fortune Fairy" monster you control. Special Summon 1 "Fortune Fairy" monster 1 Level lower than the monster you selected from your hand or Deck. You cannot Normal Summon monsters during your next turn.
et: Vali 1 avatud "Fortune Fairy" koletis, mida sa kontrollid. Kutsu eriliselt välja 1 "Fortune Fairy" koletis, mis on 1 taseme võrra madalam kui sinu valitud koletis sinu käest või pakist. Sa ei saa järgmisel käigul normaalselt kutsuda koletisi.

source: Miracle Stone
et: Imekivi

source: All "Fortune Fairy" monsters you control gain 1000 ATK for each "Fortune Fairy" monster you control. "Fortune Fairy" monsters you control cannot attack the turn that they are Summoned.
et: Kõik "Fortune Fairy" koletised, mida sa kontrollid, saavad iga sinu kontrollitava "Fortune Fairy" koletise eest 1000 ATK juurde. "Fortune Fairy" koletised, mida sa kontrollid, ei saa rünnata sellel käigul, mil nad kutsutakse välja.

source: When this card is destroyed by battle: Inflict 800 damage to your opponent.
et: Kui see kaart hävitatakse lahingus: Põhjusta oma vastasele 800 kahju.

source: Ice Mirror
et: Jääpeegel

source: Select 1 face-up Level 3 or lower WATER monster you control. Special Summon 1 monster with the same name as that monster from your Deck. The monster Special Summoned by this card's effect cannot declare an attack that turn.
et: Vali 1 avatud Level 3 või madalama tasemega VEE koletis, mida sa kontrollid. Kutsu eriliselt välja 1 koletis sama nimega nagu see koletis oma pakist. Selle kaardi efektiga eriliselt välja kutsutud koletis ei saa sellel käigul rünnata.

source: Gate Defender
et: Värava Kaitsja

source: Once per turn, when an opponent's monster declares an attack, you can negate that attack. As long as you control another monster, your opponent cannot select this card as an attack target. If a monster you control is destroyed by battle, destroy this face-up card.
et: Korra ühe korra käigu jooksul, kui vastase koletis kuulutab välja rünnaku, saad selle rünnaku tühistada. Nii kaua, kui kontrollid teist koletist, ei saa vastane valida seda kaarti rünnaku sihtmärgiks. Kui koletis, mida kontrollid, hävitatakse lahingus, hävita see avatud kaart.

source: Defender's Mind
et: Kaitsja Mõistus

source: This card's effect can only be activated during the Main Phase. Change all face-up monsters you control to Defense Position. Double the DEF of all face-up Defense Position monsters you control. You cannot change these monsters to Attack Position. You can only control 1 face-up "<M3632>Defender's Mind<M>".
et: Selle kaardi efekti saab aktiveerida ainult peafaasis. Muuda kõik sinu kontrolli all olevad avatud koletised kaitsepositsiooni. Kahekordista kõigi sinu kontrolli all olevate avatud kaitsepositsioonis olevate koletiste DEF. Sa ei saa neid koletisi rünnakupositsiooni muuta. Sa saad kontrollida ainult ühte avatud "<M3632>Kaitsja Mõistus<M>".

source: Mask Token
et: Maski Märk

source: Special Summon with the effect of "<M3712>École de Zone<M>" or "<M3715>Imitation<M>". This Token's ATK and DEF are equal to the repsective ATK and DEF of the monster destroyed by the effect of "<M3712>École de Zone<M>" or "<M3715>Imitation<M>".
et: Eriliselt kutsutud "<M3712>École de Zone<M>" või "<M3715>Imitation<M>" efektiga. Selle žetooni ATK ja DEF on võrdsed "<M3712>École de Zone<M>" või "<M3715>Imitation<M>" efektiga hävitatud koletise vastava ATK ja DEF-iga.

source: Synchro Spirits
et: Sünkrovaimud

source: Select 1 Synchro Monster in your Graveyard and remove it from play. Then, if all the monsters that were used for the Synchro Summon of that monster are in your Graveyard, you can Special Summon them.
et: Vali oma kalmistul olevast 1 Sünkrokoletis ja eemalda see mängust. Seejärel, kui kõik koletised, mida kasutati selle koletise Sünkrokutsumiseks, on sinu kalmistul, saad need eriliselt kutsuda.

source: Trick Battle
et: Trikilahing

source: When a face-up Attack Position monster you control battles a face-up Attack Position monster your opponent controls, the monster with the higher ATK is destroyed by battle.
et: Kui sinu kontrollitav avatud ründeasendis koletis võitleb vastase kontrollitava avatud ründeasendis koletisega, hävitatakse lahingus koletis, mille ATK on suurem.

source: Synchro Back
et: Sünkro Tagasi

source: Return 1 Synchro Monster you control to the Extra Deck. Special Summon it during your next Standby Phase.
et: Tagasta 1 Sünkrokoletis, mida sa kontrollid, Ekstra Teki. Kutsu see eriliselt välja oma järgmise Ootefaasil.

source: Double Ripple
et: Kahekordne Laine

source: Send from your side of the field to the Graveyard 1 face-up Tuner Monster and 1 or more face-up non-Tuner Monsters whose combined Levels equal 7, then Special Summon from your Extra Deck 1 "<M8137>Power Tool Dragon<M>" and 1 "<M8090>Ancient Fairy Dragon<M>" in face-up Defense Position.
et: Saada oma väljaku poolelt kalmistule 1 avatud Tuner Monster ja 1 või rohkem avatud mitte-Tuner Monsterit, mille kombineeritud tasemed on kokku 7, seejärel kutsu oma Extra Deckist eriliselt välja 1 "<M8137>Power Tool Dragon<M>" ja 1 "<M8090>Ancient Fairy Dragon<M>" avatud kaitsepositsioonis.

source: Power Converter
et: Võimu Konverter
