Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: ● While in Attack Position: Once per turn, if you control exactly 2 other face-up Attack Position monsters, and no additional monsters, this card gains the combined ATK of the other two monsters until the End Phase. The other two monsters cannot attack the turn you activate this effect.<BR>● While in Defense Position: Monsters you control cannot attack.
et: ● Rünnakupositsioonil olles: Kord ühe käigu jooksul, kui sa kontrollid täpselt 2 teist avatud rünnakupositsioonis olevat koletist ja mitte ühtegi lisakoletist, saab see kaart teiste kahe koletise kombineeritud rünnaku (ATK) kuni lõppfaasini. Teised kaks koletist ei saa rünnata käigu jooksul, mil sa selle efekti aktiveerid.<BR>● Kaitsepositsioonil olles: Koletised, mida sa kontrollid, ei saa rünnata.

source: Jester Lord
et: Jesteri Isand

source: While this card is the only monster on the field, it gains 1000 ATK for each card in the Spell & Trap Card Zones.
et: Kui see kaart on ainus koletis väljakul, saab see iga Loitsu ja Lõksu kaarditsoonis oleva kaardi eest 1000 ATK juurde.

source: You can Special Summon this card from your hand in face-up Attack Position. If you do, return this card and 1 face-up monster your opponent controls to the hand during the End Phase of your opponent's next turn. You can only control 1 face-up "<M8300>Jester Confit<M>".
et: Saad selle kaardi oma käest eriliselt kutsuda näoga ülespoole Rünnakupositsioonis. Kui teed seda, tagasta see kaart ja 1 näoga ülespoole olev koletis, mida su vastane kontrollib, käe peale oma vastase järgmise käigu lõppfaasis. Sa saad kontrollida ainult 1 näoga ülespoole olevat "<M8300>Jester Confit<M>".

source: Fortune Lady Light
et: Õnnetädi Valgus

source: This card's ATK and DEF are equal to its Level x 200. During each of your Standby Phases, increase the Level of this card by 1 (max 12). When this card is removed from the field by a card effect, you can Special Summon 1 "Fortune Lady" monster from your Deck.
et: Selle kaardi ATK ja DEF on võrdne selle tasemega x 200. Iga sinu Standby Phase'i ajal suurenda selle kaardi taset 1 võrra (maksimaalselt 12). Kui see kaart eemaldatakse väljakult kaardi efekti tõttu, saad sa eriliselt kutsuda 1 "Fortune Lady" koletise oma pakist.

source: Fortune Lady Fire
et: Õnnetädi Tuli

source: This card's ATK and DEF are equal to its Level x 200. During each of your Standby Phases, increase the Level by 1 (max. 12). When this card is Special Summoned in Attack Position by the effect of a "Fortune Lady", destroy 1 face-up monster on your opponent's side of the field, and inflict damage to your opponent equal to that monster's ATK.
et: Selle kaardi ATK ja DEF on võrdne selle tasemega x 200. Iga sinu Standby Phase'i ajal suurenda taset 1 võrra (maks. 12). Kui see kaart kutsutakse eriliselt välja rünnakupositsioonis "Fortune Lady" efekti abil, hävita 1 vastase poolel olev avatud koletis ja tekita vastasele kahju, mis on võrdne selle koletise ATK-ga.

source: Infernity Beast
et: Infernity Põrgu

source: If this card attacks while you have no cards in your hand, your opponent cannot activate Spell or Trap Cards until after the Damage Step.
et: Kui see kaart ründab, kui sul pole kaarte käes, ei saa su vastane aktiveerida Loitsu- ega Lõksukaarte enne Kahjustuse Sammuni.

source: Darksea Rescue
et: Päästja Pimedamere

source: If this card is used for a Synchro Summon and sent to the Graveyard, the owner of this card draws 1 card.
et: Kui seda kaarti kasutatakse Sünkrosummoniks ja saadetakse Hauakambrisse, tõmbab selle kaardi omanik 1 kaardi.

source: Darksea Float
et: Tumemere hõljuk

source: When this card on the field is destroyed by a card effect and sent to the Graveyard, the owner of this card draws 1 card.
et: Kui see kaart väljal hävitatakse kaardi efekti tõttu ja saadetakse Hauakambrisse, tõmbab selle kaardi omanik 1 kaardi.

source: One Shot Rocket
et: Ühe Lasku Rakett

source: If this card attacks, it is not destroyed by battle. After damage calculation, inflict damage to your opponent equal to half the ATK of the target monster's ATK.
et: Kui see kaart ründab, siis seda ei hävitata lahingus. Pärast kahju arvutamist tekitage oma vastasele kahju, mis on võrdne poolega sihtmärgi koletise rünnakust.

source: Earthbound Immortal Cusillu
et: Maa-alune Surematu Cusillu

source: There can only be 1 "Earthbound Immortal" monster on the field. If there is no face-up Field Spell Card on the field, destroy this card. Your opponent cannot select this card as an attack target. This card can attack your opponent directly. If this face-up card you control would be destroyed by battle, you can Tribute 1 other monster you control instead, and halve your opponent's Life Points.
et: Väljal saab olla ainult 1 "Earthbound Immortal" koletis. Kui väljal ei ole ühtegi avatud Väliloitsu Kaarti, hävita see kaart. Sinu vastane ei saa valida seda kaarti rünnaku sihtmärgiks. See kaart võib rünnata sinu vastast otse. Kui see avatud kaart, mida sa kontrollid, hävitatakse lahingus, võid selle asemel ohverdada 1 teise koletise, mida sa kontrollid, ja vähendada oma vastase Elupunkte poole võrra.

source: Earthbound Immortal Chacu Challhua
et: Maa-siduv surematu Chacu Challhua

source: There can only be 1 face-up "Earthbound Immortal" monster on the field. If there is no face-up Field Spell Card on the field, destroy this card. Your opponent cannot select this card as an attack target. This card can attack your opponent directly. While this card is in face-up Defense Position, your opponent cannot conduct their Battle Phase. Once per turn, you can inflict damage to your opponent equal to half the DEF of this card. This card cannot attack the turn this effect is used.
et: Väljal saab olla ainult 1 avatud "Earthbound Immortal" koletis. Kui väljal ei ole avatud Väliloitsu Kaarti, hävita see kaart. Sinu vastane ei saa valida seda kaarti rünnaku sihtmärgiks. See kaart saab rünnata sinu vastast otse. Kui see kaart on avatud Kaitseasendis, ei saa sinu vastane läbi viia oma Lahingufaasi. Kord ühe käigu jooksul saad sa tekitada oma vastasele kahju, mis on võrdne poolega selle kaardi DEF-ist. See kaart ei saa rünnata käigu jooksul, mil seda efekti kasutatakse.

source: Koa'ki Meiru Boulder
et: Koa'ki Meiru Kalju

source: When this card is destroyed by battle and sent to the Graveyard, you can add 1 "<M8207>Iron Core of Koa'ki Meiru<M>" or 1 Level 4 or lower "Koa'ki Meiru" monster from your Deck to your hand.
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse, saad lisada oma käele 1 "<M8207>Koa'ki Meiru Raudtuum<M>" või 1 4. taseme või madalama "Koa'ki Meiru" koletise oma pakist.

source: Koa'ki Meiru Crusader
et: Koa'ki Meiru Ristirüütel

source: During each of your End Phases, destroy this card unless you send 1 "<M8207>Iron Core of Koa'ki Meiru<M>" from your hand to the Graveyard or reveal 1 Beast-Warrior-Type monster in your hand. If this card destroys an opponent's monster by battle, you can add 1 "Koa'ki Meiru" card from your Graveyard to your hand.
et: Iga lõpuetapi ajal hävita see kaart, kui sa ei saada 1 "<M8207>Koa'ki Meiru Raudtuum<M>" oma käest Hauakambrisse või ei näita 1 Beast-Warrior-tüüpi koletist oma käes. Kui see kaart hävitab lahingus vastase koletise, saad lisada 1 "Koa'ki Meiru" kaardi oma Hauakambrist oma kätte.

source: Koa'ki Meiru Speeder
et: Koa'ki Meiru Kiirendaja

source: During each of your End Phases, destroy this card unless you send 1 "<M8207>Iron Core of Koa'ki Meiru<M>" from your hand to the Graveyard or reveal 1 Machine-Type monster in your hand. If you draw "<M8207>Iron Core of Koa'ki Meiru<M>" during your Draw Phase, you can reveal it to your opponent to draw 1 more card.
et: Iga lõpuetapi ajal hävita see kaart, kui sa ei saada 1 "<M8207>Koa'ki Meiru Raudtuum<M>" oma käest Hauakambrisse või ei näita 1 Masinatüüpi koletist oma käes. Kui sa tõmbad "<M8207>Koa'ki Meiru Raudtuum<M>" oma tõmbefaasis, võid selle oma vastasele näidata, et tõmmata 1 kaart juurde.

source: You can return 1 "<M8207>Iron Core of Koa'ki Meiru<M>" from your hand to the top of your deck to destroy all Special Summoned monsters your opponent controls.
et: Saad oma käest ühe "<M8207>Iron Core of Koa'ki Meiru<M>" oma paki tippu, et hävitada kõik vastase kontrollitavad erikutsutud koletised.

source: Koa'ki Meiru Hydro Barrier
et: Koa'ki Meiru Hüdrobarjäär

source: You can return 1 "<M8207>Iron Core of Koa'ki Meiru<M>" from your hand to the top of your Deck. If you do, the effect(s) of all face-up Effect Monsters are negated until the Standby Phase of your next turn, except Koa'ki Meiru monsters.
et: Saad oma käest ühe "<M8207>Iron Core of Koa'ki Meiru<M>" oma pakki tagasi panna. Kui teed seda, siis kõigi avatud Efektkoletiste efekt(id) tühistatakse kuni sinu järgmise käigu Ootefaasini, välja arvatud Koa'ki Meiru koletised.

source: Scary Moth
et: Kolev Koi

source: Each player can only Special Summon a monster(s) once per turn.
et: Iga mängija saab kord käigu jooksul eriliselt kutsuda ainult ühe koletise.

source: Shiny Black "C"
et: Särav Must "C"

source: When 1 Synchro Monster is Special Summoned on your opponent's side of the field, you can remove from play this card in the Graveyard to destroy that monster.
et: Kui 1 Sünkrokoletis kutsutakse eriliselt välja sinu vastase väljale, saad eemaldada selle kaardi oma hauast, et hävitada see koletis.

source: Armed Sea Hunter
et: Relvastatud Merikütt

source: If you control another face-up WATER monster, negate the effects of the monster that battled with this card, after damage calculation. If this card would be destroyed, you can destroy 1 face-up Level 3 or lower WATER monster you control instead.
et: Kui sa kontrollid teist avatud VEE koletist, tühista selle koletise efektid, mis võitles selle kaardiga, pärast kahju arvutamist. Kui see kaart peaks hävima, võid selle asemel hävitada ühe avatud 3. taseme või madalama VEE koletise, mida sa kontrollid.

source: Divine Dragon Aquabizarre
et: Jumalik Draakon Aquabizarre

source: Once per turn, you can Tribute 1 other face-up WATER monster and select 1 Continuous or Field Spell Card in your Graveyard to return it to the top of your Deck.
et: Korra ühe korra käigu jooksul, saad ohverdada 1 teise avatud VEE koletise ja valida 1 Pideva või Välja Loitsukaardi oma Hauakambris, et see oma Paki tippu tagasi panna.

source: Fishborg Blaster
et: Kalaküborgi Plahvataja

source: If you control a face-up level 3 or lower WATER monster: You can discard 1 card; Special Summon this card from your Graveyard. If this card is used as a Synchro Material Monster, all other Synchro Material Monsters must all be WATER.
et: Kui sa kontrollid avatud taseme 3 või madalama VEE koletist: Sa võid ühe kaardi ära visata; Kutsu see kaart oma Hauakambrist eriliselt välja. Kui seda kaarti kasutatakse Sünkro Materjal Koletisena, peavad kõik teised Sünkro Materjal Koletised olema VEE.

source: Shark Cruiser
et: Hai Ristleja

source: If this face-up card is destroyed by your opponent's card effect, you can Special Summon up to 2 level 4 or lower WATER monsters from your Deck.
et: Kui see avatud kaart hävitatakse sinu vastase kaardi efekti tõttu, saad eriliselt kutsuda kuni 2 taseme 4 või madalama VEE koletist oma pakist.

source: Armored Axon Kicker
et: Soomustatud Aksoni Lööja

source: If you control a face-up Psychic-Type monster, you can Normal Summon this card without Tributing. If this card destroys an opponent's monster by battle, you take damage equal to half the destroyed monster's ATK. Then, you can Special Summon 1 monster from your Graveyard with ATK less than or equal to the damage you took.
et: Kui sa kontrollid avatud Psüühika-tüüpi koletist, saad selle kaardi Normaal-Summon'ida ilma ohverdamata. Kui see kaart hävitab lahingus vastase koletise, saad sa kahju, mis on võrdne poolega hävitatud koletise ATK-st. Seejärel saad sa oma Hauakambrist Special Summon'ida 1 koletise, mille ATK on väiksem või võrdne saadud kahjuga.

source: Genetic Woman
et: Geneetiline Naine

source: Once per turn, you can pay 1000 Life Points and select 1 of your removed from play Psychic-Type monsters. Add it to your hand.
et: Korra ühe käigu jooksul võid maksta 1000 Elupunkti ja valida ühe oma mängust eemaldatud Psüühika-tüüpi koletise. Lisa see oma kätte.

source: Magicat
et: Maagikass

source: If this card is sent to the Graveyard for the Synchro Summon of a Spellcaster-Type Synchro Monster, you can return 1 Spell Card from your Graveyard to the top of your Deck.
et: Kui see kaart saadetakse Sünkrosummonduse jaoks Hauakambrisse, et kutsuda välja Sünkromonster, kes on Tüüpi Loitsija, võid sa oma Hauakambrist ühe Loitsukaardi oma Paki tippu tagasi panna.

source: Cyborg Doctor
et: Küberneetiline Doktor

source: Once per turn, you can Tribute 1 Tuner monster you control to Special Summon a monster from your Graveyard with the same Attribute and Level as the Tributed monster.
et: Korra ühe korra käigu jooksul saad ohverdada ühe oma kontrollitava Tuner-koletise, et erilises kutses kutsuda oma Hauakambrist koletis, millel on sama Atribuut ja Tase kui ohverdatud koletisel.

source: White Potan
et: Valge Potan

source: If you control a face-up Tuner monster, this card cannot be destroyed by battle. When a face-up Tuner monster you control is destroyed by battle and sent to the Graveyard, inflict 500 damage to your opponent
et: Kui sa kontrollid avatud Tuner koletist, ei saa seda kaarti lahingus hävitada. Kui avatud Tuner koletis, mida sa kontrollid, hävitatakse lahingus ja saadetakse Hauakambrisse, põhjusta oma vastasele 500 kahju

source: Minefieldriller
et: Miinivälja puurija

source: When this face-up card you control is removed from the field, you can return 1 Field Spell Card from your Graveyard to your hand.
et: Kui see avatud kaart, mida sa kontrollid, eemaldatakse väljakult, saad ühe Väljaloitsu Kaardi oma Hauakambrist oma kätte tagasi tuua.

source: Cannot be Normal Summoned or Set. This card cannot be Special Summoned except while you control 2 or more face-up "X-Saber" monsters. Once per turn, you can Special Summon 1 level 4 or lower "X-Saber" monster from your Graveyard.
et: Ei saa normaalset kutsuda ega asetada. Seda kaarti ei saa eriliselt kutsuda, välja arvatud juhul, kui kontrollid 2 või enamat avatud "X-Saber" koletist. Kord ühe käigu jooksul saad eriliselt kutsuda 1 taseme 4 või madalama "X-Saber" koletise oma hauakambrist.

source: When this card is Normal Summoned or Special Summoned, you can add 1 "X-Saber" monster from your Graveyard to your hand.
et: Kui see kaart on Normaal- või Erikutsutud, saad lisada 1 "X-Saber" koletise oma Hauakambrist oma kätte.

source: Flamvell Firedog
et: Flamvell'i Tulekutsikas

source: When this card destroys an opponent's monster by battle and sends it to the Graveyard, you can Special Summon 1 FIRE monster with 200 or less DEF from your Deck, except "<M8328>Flamvell Firedog<M>".
et: Kui see kaart hävitab lahingus vastase koletise ja saadab selle Hauakambrisse, saad oma pakist eriliselt kutsuda 1 TULE koletise, mille DEF on 200 või vähem, välja arvatud "<M8328>Flamvell Firedog<M>".

source: Ancient Crimson Ape
et: Muistne Punane Ahv

source: When a monster(s) you control is destroyed and sent to the Graveyard, gain 1000 Life Points.
et: Kui sinu kontrolli all olev(ad) koletis(ed) hävitatakse ja saadetakse Hauakambrisse, saad 1000 Elupunkti.

source: If this card destroys a monster by battle, select and activate 1 of these effects.<BR>● Send 1 LIGHT Machine-Type monster with 1200 or less ATK from your Deck to your Graveyard.<BR>● Special Summon 1 LIGHT Machine-Type monster with 1200 or less ATK from your Graveyard.
et: Kui see kaart hävitab lahingus koletise, vali ja aktiveeri üks neist efektidest.<BR>● Saada üks 1200 või vähem ATK-ga VALGUS Masinatüüpi koletis oma pakist hauakambrisse.<BR>● Kutsu eriliselt välja üks 1200 või vähem ATK-ga VALGUS Masinatüüpi koletis oma hauakambrist.

source: One Shot Cannon
et: Ühe Lasku Kahur

source: "<M8306>One Shot Rocket<M>" + 1 or more non-Tuner monsters<BR>Once per turn, you can destroy 1 face-up monster on the field, and inflict damage to its controller equal to half of its ATK.
et: "<M8306>One Shot Rocket<M>" + 1 või rohkem mitte-Tuuner koletisi<BR>Kord ühe käigu jooksul saad hävitada ühe avatud koletise väljakul ja tekitada selle valdajale kahju, mis on võrdne poolega selle rünnakust.

source: Archfiend Zombie-Skull
et: Deemonzombi-Kolju

source: "<M7849>Plaguespreader Zombie<M>" + 2 or more non-Tuner Zombie-Type monsters<BR>Face-up Zombie-Type monsters you control cannot be destroyed by card effects.
et: "<M7849>Katkulevitaja Zombi<M>" + 2 või rohkem mittehäälestaja Zombi-tüüpi koletist<BR>Avatud Zombi-tüüpi koletisi, mida sa kontrollid, ei saa kaardiefektide abil hävitada.

source: Ancient Sacred Wyvern
et: Muistne Püha Wyvern

source: 1 LIGHT Tuner + 1 or more non-Tuner monsters<BR>While your Life Points are higher than your opponent's, this card gains ATK equal to the difference. While your Life Points are lower than your opponent's, this card loses ATK equal to the difference. When this card is destroyed by battle and sent to the Graveyard, you can pay 1000 Life Points to Special Summon this card.
et: 1 VALGUSTI Häälestaja + 1 või rohkem mitte-Häälestaja koletist<BR>Kui sinu Elupunktid on kõrgemad kui vastasel, saab see kaart ATK-d, mis on võrdne vahega. Kui sinu Elupunktid on madalamad kui vastasel, kaotab see kaart ATK-d, mis on võrdne vahega. Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse, saad maksta 1000 Elupunkti, et see kaart eriliselt kutsuda.

source: 1 Tuner + 1 or more EARTH monsters<BR>You can Tribute 1 "X-Saber" monster to discard 1 random card from your opponent's hand.
et: 1 Tuner + 1 või rohkem EARTH koletist<BR>Sa võid ohverdada 1 "X-Saber" koletise, et visata 1 juhuslik kaart oma vastase käest ära.

source: Release Restraint Wave
et: Vabasta Piirangulaine

source: Select 1 face-up Equip Spell Card you control. Destroy it and all Set Spell and Trap Cards your opponent controls.
et: Vali 1 avatud Varustuse Võlusõna Kaart, mida sa kontrollid. Hävita see ja kõik vastase seatud Võlu- ja Lõksukaardid.

source: Silver Wing
et: Hõbesulg

source: Equip only to a Level 8 or higher Dragon-Type Synchro Monster. Up to twice per turn, if it would be destroyed by battle, it is not destroyed. If it would be destroyed by a card effect, you can destroy this card instead.
et: Varusta ainult 8. taseme või kõrgema Draakoni-tüüpi Sünkro Koletisega. Kuni kaks korda käigu jooksul, kui see hävitatakse lahingus, siis seda ei hävitata. Kui see hävitatakse kaardi efekti tõttu, võid selle asemel hävitada selle kaardi.

source: Advance Draw
et: Ettemaks Joonistus

source: Tribute 1 face-up Level 8 or higher monster you control. Draw 2 cards.
et: Ohverda 1 avatud 8. või kõrgema taseme koletis, mida sa kontrollid. Tõmba 2 kaarti.

source: Ancient Forest
et: Muistne Mets

source: When you activate this card, change any Defense Position monster(s) to face-up Attack Position. Flip Effects are not activated at this time. If a monster attacks, destroy it at the end of that turn's Battle Phase.
et: Kui aktiveerid selle kaardi, muuda kõik Kaitseasendis olevad koletised Näoga Üles Rünnakuasendisse. Pööramisefekte ei aktiveerita sel ajal. Kui koletis ründab, hävita see selle käigu Lahingu Faasi lõpus.

source: Emergency Assistance
et: Hädaabi

source: Activate during your Main Phase 2, to Special Summon 1 Level 4 monster from your Graveyard that was destroyed by a card effect and sent to the Graveyard this turn.
et: Aktiveeri oma teise põhifaasi ajal, et erilissummonida 1. taseme 4 koletis oma hauakambrist, mis hävitati kaardi efekti tõttu ja saadeti sel käigul hauakambrisse.

source: Spirit Burner
et: Vaimupõletaja

source: Once per turn, you can change the battle position of the equipped monster to Defense Position. When the equipped monster is returned from the field to the hand and this card is sent to the Graveyard, inflict 600 damage to your opponent. If this card is in the Graveyard, you can add it to your hand instead of conducting a normal draw during your Draw Phase.
et: Korra ühe korra käigu jooksul saad muuta varustatud koletise lahingupositsiooni kaitsepositsiooniks. Kui varustatud koletis naaseb väljakult kätte ja see kaart saadetakse Hauakambrisse, põhjusta oma vastasele 600 kahju. Kui see kaart on Hauakambris, saad selle lisada oma kätte tavalise tõmbamise asemel oma Tõmbamisfaasi ajal.

source: Future Visions
et: Tuleviku Nägemused

source: When a monster is Normal Summoned, remove from play that monster. During the next Standby Phase of the controller who Summoned that monster, return it to the field in face-up Attack Position.
et: Kui koletis kutsutakse normaalselt välja, eemalda see koletis mängust. Järgmise selle mängija ootejärgu faasi ajal, kes koletise välja kutsus, too see tagasi väljakule avatud ründeasendis.

source: Core Compression
et: Tuuma kokkusurumine

source: Reveal 1 "<M8207>Iron Core of Koa'ki Meiru<M>" from your hand and discard 1 "Koa'ki Meiru" monster from your hand to draw 2 cards.
et: Paljasta oma käest 1 "<M8207>Iron Core of Koa'ki Meiru<M>" ja viska oma käest ära 1 "Koa'ki Meiru" koletis, et tõmmata 2 kaarti.

source: Core Blaster
et: Tuuma Plahvataja

source: Equip only to a "Koa'ki Meiru" monster. If it battles a LIGHT or DARK monster, destroy that monster without applying damage calculation. When the equipped monster is removed from the field and this card is sent to the Graveyard, you can return this card to your hand.
et: Varusta ainult "Koa'ki Meiru" koletisele. Kui see võitleb VALGUSE või PIMEDUSE koletisega, hävita see koletis ilma kahjukalkulatsiooni rakendamata. Kui varustatud koletis eemaldatakse väljakult ja see kaart saadetakse Hauakambrisse, saad selle kaardi oma kätte tagasi tuua.

source: Solidarity
et: Solidaarsus

source: If you have only 1 original (printed) Type of monster in your Graveyard, face-up monsters you control with the same Type gain 800 ATK.
et: Kui sul on oma kalmistul ainult 1 algne (trükitud) tüüpi koletis, saavad sinu kontrollitavad sama tüüpi avatud koletised 800 ATK juurde.

source: Hydro Pressure Cannon
et: Hüdrosurve kahur

source: Equip only to a Level 3 or lower WATER monster. If it destroys an opponent's monster by battle, send 1 random card from your opponent's hand to the Graveyard.
et: Varusta ainult 3. taseme või madalama VEE koletisega. Kui see hävitab lahingus vastase koletise, saada 1 juhuslik kaart vastase käest Hauakambrisse.

source: Water Hazard
et: Veeoht

source: Once per turn, if you control no monsters, you can Special Summon 1 Level 4 or lower WATER monster from your hand.
et: Kord korra, kui sul pole ühtegi koletist, saad oma käest eriliselt kutsuda 1. taseme 4 või madalama VEE koletise.

source: Brain Research Lab
et: Ajuuuringute Labor

source: Once per turn, you can Normal Summon 1 Psychic-Type monster in addition to your Normal Summon or Set. If successful, place 1 Psychic Counter on this card. You can also place 1 Psychic Counter on this card instead of paying Life Points to activate any Psychic-Type monster's effect that you control. When this card is removed from the field, the controller of this card takes 1000 damage for each Psychic Counter on it.
et: Korra ühe korra käigu jooksul saad sa Normaal-Kutsuda 1 Psüühika-tüüpi koletise lisaks oma Normaal-Kutsumisele või Asetamisele. Kui see õnnestub, aseta sellele kaardile 1 Psüühika Loendur. Sa võid ka asetada sellele kaardile 1 Psüühika Loenduri selle asemel, et maksta Elupunkte, et aktiveerida ükskõik millise sinu kontrolli all oleva Psüühika-tüüpi koletise efekt. Kui see kaart eemaldatakse väljakult, saab selle kaardi kontrollija 1000 kahju iga sellel oleva Psüühika Loenduri eest.

source: Saber Slash
et: Mõõgalöök
