Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: When this card is flipped face-up, select 1 card on the field and inflict 500 damage to its controller. When this card is destroyed by battle and sent to the Graveyard, you can Special Summon 1 "<M7724>Mecha Bunny<M>" from your Deck in face-down Defense Position.
et: Kui see kaart pööratakse avatud asendisse, vali 1 kaart väljal ja tekita selle kontrollijale 500 kahju. Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse, saad sa eriliselt kutsuda 1 "<M7724>Mecha Bunny<M>" oma pakist tagurpidi kaitseasendisse.

source: When control of this face-up card changes, its new controller discards 1 random card.
et: Kui selle avatud kaardi kontroll muutub, viskab uus kontrollija juhuslikult ühe kaardi ära.

source: Beast of the Pharaoh
et: Vaarao metsaline

source: If this card is sent to the Graveyard for a Synchro Summon, you can Special Summon 1 Level 4 or lower Zombie-Type monster from your Graveyard.
et: Kui see kaart saadetakse Sünkrosummonduseks Hauakambrisse, saad eriliselt kutsuda 1 taseme 4 või madalama Zombi-tüüpi koletise oma Hauakambrist.

source: Dark Hunter
et: Tume Kütt

source: This card's effect changes depending on the number of DARK monsters in your Graveyard.<BR>● 1 or fewer: This card loses 400 ATK.<BR>● 2 to 4: This card gains 400 ATK.<BR>● 5 or more: You can send this card to the Graveyard to destroy all face-down monsters your opponent controls.
et: Selle kaardi efekt muutub sõltuvalt Pimeduse (DARK) koletiste arvust sinu Hauakambris.<BR>● 1 või vähem: See kaart kaotab 400 ATK.<BR>● 2 kuni 4: See kaart saab 400 ATK juurde.<BR>● 5 või rohkem: Sa võid saata selle kaardi Hauakambrisse, et hävitada kõik vastase näoga allapoole olevad koletised.

source: This card cannot be Special Summoned. This card returns to its owner's hand during the End Phase of the turn it is Normal Summoned or flipped face-up. When this card is Normal Summoned or flipped face-up, you can Special Summon 1 Level 1 monster from your Graveyard. When this card is removed from the field, remove from play that monster.
et: Seda kaarti ei saa eriliselt kutsuda. See kaart naaseb omaniku kätte selle käigu lõppfaasis, mil see on normaalselt kutsutud või ümber pööratud. Kui see kaart on normaalselt kutsutud või ümber pööratud, saad sa eriliselt kutsuda ühe 1. taseme koletise oma hauakambrist. Kui see kaart eemaldatakse väljakult, eemalda mängust see koletis.

source: This card cannot be Normal Summoned or Set. This card cannot be Special Summoned except by removing from play 1 Spirit monster from your Graveyard. This card returns to its owner's hand during the End Phase of the turn it is Special Summoned. If this card destroys an opponent's monster by battle, you can destroy 1 Spell or Trap Card your opponent controls.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti ei saa eriliselt kutsuda, välja arvatud eemaldades mängust 1 Vaimu koletis oma kalmistult. See kaart naaseb omaniku kätte selle käigu lõppfaasis, mil see eriliselt kutsuti. Kui see kaart hävitab lahingus vastase koletise, võid hävitada 1 Loitsu või Lõksukaardi, mida vastane kontrollib.

source: Silent Strider
et: Vaikne Rändur

source: You can send this card from your hand to the Graveyard to reduce the Level of 1 monster on the field by 1, until the End Phase.
et: Saad selle kaardi oma käest Hauakambrisse saata, et vähendada ühe koletise taset väljal 1 võrra kuni Lõppfaasini.

source: Noisy Gnat
et: Käratsev Sääsk

source: You can send this card from your hand to the Graveyard to increase the Level of 1 monster on the field by 1, until the End Phase.
et: Saad selle kaardi oma käest Hauakambrisse saata, et suurendada ühe koletise taset väljal 1 võrra kuni Lõppfaasini.

source: Multiple Piece Golem
et: Mituosaline Golem

source: "<M7706>Big Piece Golem<M>" + "<M7705>Medium Piece Golem<M>"<BR>At the end of the Battle Phase, if this card attacked or was attacked, you can return it to the Extra Deck. Then, if all of the Fusion Material Monsters that were used for the Fusion Summon of this card are in your Graveyard, you can Special Summon them.
et: "<M7706>Big Piece Golem<M>" + "<M7705>Medium Piece Golem<M>"<BR>Lahingufaasi lõpus, kui see kaart ründas või seda rünnati, saad selle tagastada Ekstra Paki. Seejärel, kui kõik Fusion Materjal Koletised, mida kasutati selle kaardi Fusion Kutsumiseks, on sinu Hauakambris, saad need Eriliselt Kutsuda.

source: Nitro Warrior
et: Nitrosõdalane

source: "<M7700>Nitro Synchron<M>" + 1 or more non-Tuner Monsters<BR>Once during each of your turns, if you activated a Spell Card(s), this card gains 1000 ATK during its next attack, for damage calculation only. Once per turn, if this attacking card destroys an opponent's monster by battle, you can change 1 face-up Defense Position monster your opponent controls to Attack Position, and attack it with this card.
et: "<M7700>Nitro Sünkron<M>" + 1 või rohkem mittehäälestuskoletisi<BR>Kord iga sinu käigu jooksul, kui aktiveerisid Võlukaardi(d), saab see kaart oma järgmise rünnaku ajal 1000 ATK juurde, ainult kahju arvutamiseks. Kord käigu jooksul, kui see ründav kaart hävitab lahingus vastase koletise, saad muuta ühe vastase kontrollitava ülespoole suunatud Kaitseasendis koletise Rünnakuasendisse ja rünnata seda selle kaardiga.

source: Stardust Dragon
et: Tähetolmu Draakon

source: 1 Tuner + 1 or more non-Tuner monsters<BR>When a Spell, Trap, Spell/Trap effect, or Effect Monster's effect is activated that destroys a card(s) on the field: You can Tribute this card; negate the activation and destroy it. During the End Phase, if this card negated an effect this way during this turn: You can Special Summon this card from your Graveyard.
et: 1 Tuner + 1 või rohkem mitte-Tuner koletist<BR>Kui aktiveeritakse Võlu-, Lõks-, Võlu/Lõks-efekt või Efektkoletise efekt, mis hävitab kaardi(d) väljal: Sa võid ohverdada selle kaardi; tühista aktiveerimine ja hävita see. Lõppfaasis, kui see kaart tühistas sel viisil efekti sellel käigul: Sa võid eriliselt kutsuda selle kaardi oma Hauakambrist.

source: Red Demon's Dragon
et: Punase Deemoni Draakon

source: 1 Tuner + 1 or more non-Tuner monsters<BR>After damage calculation, when this card attacks a Defense Position monster your opponent controls: Destroy all Defense Position monsters your opponent controls. During your End Phase: Destroy all other monsters you control that did not declare an attack this turn. This card must remain face-up on the field to activate and to resolve this effect.
et: 1 Häälestaja + 1 või rohkem mitte-Häälestaja koletist<BR>Pärast kahju arvutamist, kui see kaart ründab vastase kaitseasendis koletist: Hävita kõik vastase kaitseasendis koletised. Sinu lõppfaasis: Hävita kõik teised sinu kontrolli all olevad koletised, mis sel käigul rünnakut ei kuulutanud. Selle efekti aktiveerimiseks ja lahendamiseks peab see kaart jääma väljale avatud olekus.

source: Goyo Guardian
et: Goyo Kaitsja

source: 1 Tuner + 1 or more non-Tuner monsters<BR>When this card destroys an opponent's monster by battle and sends it to the Graveyard, you can Special Summon that monster to your side of the field in face-up Defense Position.
et: 1 Tuner + 1 või rohkem mitte-Tuner koletist<BR>Kui see kaart hävitab lahingus vastase koletise ja saadab selle Hauakambrisse, saad selle koletise oma väljale spetsiaalselt kutsuda avatud kaitseasendis.

source: Magical Android
et: Maagiline Android

source: 1 Tuner + 1 or more non-Tuner monsters<BR>During your End Phase, gain 600 Life Points for each face-up Psychic-Type monster you control.
et: 1 Tuner + 1 või rohkem mitte-Tuner koletist<BR>Oma lõppfaasis saad 600 elupunkti iga ülespoole suunatud Psüühika-tüüpi koletise eest, mida sa kontrollid.

source: Thought Ruler Archfiend
et: Mõttevalitseja deemon

source: 1 Tuner + 1 or more non-Tuner monsters<BR>When this card destroys a monster by battle and sends it to the Graveyard, gain Life Points equal to that monster's original ATK. You can pay 1000 Life Points to negate the activation of a Spell or Trap Card that targets exactly 1 Psychic-Type monster, and destroy it.
et: 1 Tuner + 1 või rohkem mitte-Tuner koletist<BR>Kui see kaart hävitab lahingus koletise ja saadab selle Hauakambrisse, saad Elupunkte, mis on võrdne selle koletise algse ATK-ga. Sa võid maksta 1000 Elupunkti, et tühistada täpselt ühte Psüühika-tüüpi koletist sihtiva Loitsu või Lõksukaardi aktiveerimine ja hävitada see.

source: Fighting Spirit
et: Võitlusvaim

source: The equipped monster gains 300 ATK for each monster your opponent controls. If it would be destroyed by battle, you can destroy this card instead.
et: Varustatud koletis saab 300 ATK iga koletise eest, mida sinu vastane kontrollib. Kui see hävitatakse lahingus, võid selle asemel hävitada selle kaardi.

source: Domino Effect
et: Dominoefekt

source: When a monster your opponent controls is destroyed by battle and sent to the Graveyard, you can send 1 monster you control to the Graveyard to destroy 1 monster your opponent controls.
et: Kui sinu vastase kontrollitav koletis hävitatakse lahingus ja saadetakse Hauakambrisse, saad saata 1 oma kontrollitava koletise Hauakambrisse, et hävitada 1 sinu vastase kontrollitav koletis.

source: Junk Barrage
et: Rämpsurünnak

source: When the equipped monster destroys a monster by battle and sends it to the Graveyard, inflict damage to your opponent equal to half the destroyed monster's ATK.
et: Kui varustatud koletis hävitab lahingus koletise ja saadab selle Hauakambrisse, põhjusta oma vastasele kahju, mis on võrdne poolega hävitatud koletise rünnakust.

source: Battle Tuned
et: Lahinguhäälestus

source: Remove from play 1 Tuner monster from your Graveyard. Target face-up monster you control gains ATK equal to the removed monster's ATK.
et: Eemalda oma kalmistult mängust 1 Tuner koletis. Sihtmärgiks olev avatud koletis, mida sa kontrollid, saab ATK-d, mis on võrdne eemaldatud koletise ATK-ga.

source: De-Synchro
et: De-Sünkro

source: Select 1 face-up Synchro Monster. Return it to its owner's Extra Deck. Then, if all the monsters that were used for the Synchro Summon of that monster are in your Graveyard, you can Special Summon them.
et: Vali 1 avatud Sünkrokoletis. Tagasta see omaniku Ekstra Paki. Seejärel, kui kõik koletised, mida kasutati selle koletise Sünkrokutsumiseks, on sinu Hauas, saad need Eriliselt Kutsuda.

source: Lightwave Tuning
et: Valguse laine häälestamine

source: Select 1 Level 4 LIGHT monster you control. It is treated as a Tuner monster while it is face-up on the field.
et: Vali 1. taseme 4 VALGUS koletis, mida sa kontrollid. Seda käsitletakse kui Tuner koletist, kui see on väljaku peal avatud olekus.

source: Psi-Station
et: Psi-jaam

source: When a Psychic-Type monster is Normal Summoned, you can pay 500 Life Points to have it gain 300 ATK and increase its Level by 1.
et: Kui Psüühika-tüüpi koletis kutsutakse normaalselt välja, võid maksta 500 Elupunkti, et see saaks 300 ATK juurde ja selle tase tõuseks 1 võrra.

source: Psi-Impulse
et: Psi-Impulss

source: Tribute 1 Psychic-Type monster. Return all cards in your opponent's hand to the Deck. Then, they draw 3 cards.
et: Ohverda 1 Psüühika-tüüpi koletis. Tagasta kõik kaardid vastase käest pakki. Seejärel tõmbavad nad 3 kaarti.

source: Emergency Teleport
et: Hädaabi Teleport

source: Special Summon 1 Level 3 or lower Psychic-Type monster from your hand or Deck. During the End Phase this turn, remove from play that monster.
et: Erikutsuge 1 tase 3 või madalama tasemega psüühika-tüüpi koletis oma käest või pakist. Selle käigu lõppfaasis eemalda see koletis mängust.

source: Lightsworn Sabre
et: Valgusevandu Mõõk

source: Equip only to a "Lightsworn" monster. It gains 700 ATK. When this card is sent from your Deck to your Graveyard, you can equip it to 1 "Lightsworn" monster you control.
et: Varusta ainult "Lightsworn" koletisega. See saab 700 ATK. Kui see kaart saadetakse sinu pakist sinu hauakambrisse, saad selle varustada ühe "Lightsworn" koletisega, mida sa kontrollid.

source: Unstable Evolution
et: Ebastabiilne Evolutsioon

source: While your Life Points are lower than your opponent's, the equipped monster's original ATK becomes 2400. While your Life Points are higher than your opponent's, its original ATK becomes 1000.
et: Kui sinu Elupunktid on madalamad kui sinu vastasel, saab varustatud koletise algne rünnak 2400. Kui sinu Elupunktid on kõrgemad kui sinu vastasel, saab selle algne rünnak 1000.

source: Recycling Batteries
et: Patareide taaskasutamine

source: Add 2 Thunder-Type monsters with 1500 or less ATK from your Graveyard to your hand.
et: Lisa oma käest oma kalmistult 2 Thunder-tüüpi koletist, mille ATK on 1500 või vähem.

source: Book of Eclipse
et: Varjutuste Raamat

source: Change all face-up monsters on the field to face-down Defense Position. During the End Phase, flip all face-down Defense Position monsters your opponent controls face-up, and your opponent draws 1 card for each.
et: Muuda kõik avatud positsioonis olevad koletised väljakul kinniseks kaitsepositsiooniks. Lõppfaasis keera kõik sinu vastase kontrolli all olevad kinnised kaitsepositsioonis koletised avatud positsiooni ja sinu vastane tõmbab igaühe eest ühe kaardi.

source: Equip Shot
et: Varustuse Lask

source: Activate only during the Battle Phase. Select 1 Equip Card equipped to a face-up Attack Position monster you control, and select 1 face-up Attack Position monster your opponent controls. Equip that monster with the selected Equip Card. Then, conduct battle between your previously equipped monster and the selected monster (other effects cannot be activated during this battle).
et: Aktiveeri ainult Lahingufaasi ajal. Vali 1 Varustuskaart, mis on varustatud sinu kontrollitava avatud Rünnakupositsioonis oleva koletisega, ja vali 1 avatud Rünnakupositsioonis olev koletis, mida sinu vastane kontrollib. Varusta see koletis valitud Varustuskaardiga. Seejärel vii läbi lahing sinu eelnevalt varustatud koletise ja valitud koletise vahel (teisi efekte ei saa selle lahingu ajal aktiveerida).

source: Graceful Revival
et: Graatsiline Taassünd

source: Select 1 Level 2 or lower monster from your Graveyard and Special Summon it in Attack Position. When this card is removed from the field, destroy that monster. When that monster is removed from the field, destroy this card.
et: Vali oma kalmistult 1. taseme 2 või madalama tasemega koletis ja kutsu see eriliselt välja rünnakupositsioonis. Kui see kaart eemaldatakse väljakult, hävita see koletis. Kui see koletis eemaldatakse väljakult, hävita see kaart.

source: Defense Draw
et: Kaitse Joonistus

source: Activate only during damage calculation during your opponent's turn. The Battle Damage you would receive becomes 0. Draw 1 card.
et: Aktiveeri ainult oma vastase käigu ajal toimuva kahju arvutamise ajal. Lahingu kahju, mida sa saaksid, muutub 0-ks. Tõmba 1 kaart.

source: Remote Revenge
et: Kauge kättemaks

source: Activate only when a monster you control is targeted by a Spell, Trap, or Effect Monster's effect that destroys 1 monster on the field. Switch the target to an appropriate monster your opponent controls.
et: Aktiveeri ainult siis, kui sinu kontrollitav koletis on sihitud loitsu, lõksu või efektkoletise efekti poolt, mis hävitab ühe koletise väljal. Vaheta sihtmärgiks sobiv koletis, mida sinu vastane kontrollib.

source: Spacegate
et: Kosmosevärav

source: When a monster your opponent controls attacks or is attacked, place 1 Gate Counter on this card at the end of the Damage Step. During your Main Phase, you can send this card to the Graveyard to Special Summon 1 monster from your hand whose Level is equal to or lower than the number of Gate Counters on this card.
et: Kui vastase kontrollitav koletis ründab või teda rünnatakse, aseta sellele kaardile 1 Värava Loendur Kahjustuse Etapi lõpus. Oma Põhifaasis saad saata selle kaardi Hauakambrisse, et Kutsuda Eriliselt välja 1 koletis oma käest, mille Tase on võrdne või madalam kui sellel kaardil olevate Värava Loendurite arv.

source: Synchro Deflector
et: Sünkroontõrje

source: Activate only when a face-up Synchro Monster you control is selected as an attack target. Negate the attack and destroy 1 monster your opponent controls.
et: Aktiveeri ainult siis, kui sinu juhitav avatud Sünkro Monster valitakse rünnaku sihtmärgiks. Tühista rünnak ja hävita 1 koletis, mida sinu vastane juhib.

source: Broken Blocker
et: Murtud Blokeerija

source: Activate only when a Defense Position monster you control, whose DEF is higher than its ATK, is destroyed by battle. Special Summon up to 2 monsters with the same name as that monster from your Deck in face-up Defense Position.
et: Aktiveeri ainult siis, kui sinu kontrolli all olev kaitseasendis koletis, mille DEF on kõrgem kui selle ATK, hävitatakse lahingus. Kutsu eriliselt välja kuni 2 sama nimega koletist oma pakist näoga ülespoole kaitseasendis.

source: Machine Lord Ür
et: Masinlord Ür

source: This card can attack all monsters your opponent controls once each. Any Battle Damage this card inflicts to your opponent becomes 0.
et: See kaart võib rünnata kõiki vastase kontrollitavaid koletisi üks kord. Kogu lahingukahju, mida see kaart vastasele tekitab, muutub nulliks.

source: Telepathic Power
et: Telepaatia Jõud

source: Activate only when a face-up Psychic-Type monster you control is attacked and destroyed by battle with an opponent's monster. Destroy the monster that attacked, and gain Life Points equal to its ATK.
et: Aktiveeri ainult siis, kui sinu kontrollitav näoga ülespoole olev Psüühika-tüüpi koletis rünnatakse ja hävitatakse lahingus vastase koletisega. Hävita rünnanud koletis ja saa Elupunkte, mis on võrdsed selle ATK-ga.

source: Mind Over Matter
et: Vaim üle aine

source: Tribute 1 Psychic-Type monster. Negate the activation of a Spell or Trap Card, or the Normal or Special Summon of a monster, and destroy that card.
et: Ohverda 1 Psüühika-tüüpi koletis. Tühista Loitsu või Lõksukaardi aktiveerimine või koletise normaalne või eriline kutsumine ja hävita see kaart.

source: Gladiator Beast War Chariot
et: Gladiaalne metssõdalane sõjavanker

source: When an Effect Monster's effect is activated, if you control a face-up "Gladiator Beast" monster: Negate the activation and destroy it.
et: Kui Efektikoletise efekt aktiveeritakse ja sul on kontrollis avatud „Gladiaatoribeast“ koletis: Tühista aktiveerimine ja hävita see.

source: Lightsworn Barrier
et: Valgusevande Barjäär

source: When a face-up "Lightsworn" monster you control is selected as an attack target, you can send the top 2 cards of your Deck to the Graveyard to negate the attack.
et: Kui sinu kontrollitav avatud "Lightsworn" koletis valitakse rünnaku sihtmärgiks, võid saata oma paki kaks ülemist kaarti Hauakambrisse, et rünnak tühistada.

source: Intercept
et: Pealtkuulamine

source: Activate only when a monster is Tribute Summoned with 1 Tribute. Take control of that monster.
et: Aktiveeri ainult siis, kui koletis kutsutakse välja ühe ohvriga. Võta selle koletise üle kontroll.

source: Judgment of Thunder
et: Äikeseotsus

source: Activate only when you Summon a Thunder-Type monster(s). Destroy 1 card your opponent controls.
et: Aktiveeri ainult siis, kui sa kutsud välja Äikese-tüüpi koletise(d). Hävita 1 kaart, mida sinu vastane kontrollib.

source: Psychic Rejuvenation
et: Psüühiline Taastumine

source: Gain 1000 Life Points for each face-up Psychic-Type monster you control.
et: Saa 1000 Elupunkti iga avatud Psüühika-tüüpi koletise eest, mida sa kontrollid.

source: Fish Depth Charge
et: Kalade sügavuse laeng

source: Tribute 1 Fish-Type monster. Destroy 1 card on the field, and draw 1 card.
et: Ohverda 1 Kalatüüpi koletis. Hävita 1 kaart väljal ja tõmba 1 kaart.

source: Needlebug Nest
et: Nõelaputuka Pesa

source: Send the top 5 cards of your Deck to the Graveyard.
et: Saada oma pakist 5 ülemist kaarti hauakambrisse.

source: Dark Simorgh
et: Tume Simorgh

source: While face-up on the field, this card is also WIND-Attribute. You can banish 1 DARK monster and 1 WIND monster from your Graveyard; Special Summon this card from your hand. You can banish 1 DARK monster and 1 WIND monster from your hand; Special Summon this card from your Graveyard. Your opponent cannot Set any cards on the field.
et: Kui see kaart on väljakul avatud, on see ka TUULE atribuudi kaart. Sa võid oma kalmistult eemaldada mängust 1 PIMEDUSE koletise ja 1 TUULE koletise; Kutsu see kaart oma käest eriliselt välja. Sa võid oma käest eemaldada mängust 1 PIMEDUSE koletise ja 1 TUULE koletise; Kutsu see kaart oma kalmistult eriliselt välja. Sinu vastane ei saa väljakule ühtegi kaarti asetada.

source: Alector, Sovereign of Birds
et: Alector, Lindude Suverään

source: If your opponent controls 2 or more face-up monsters of the same Attribute, you can Special Summon this card (from your hand). Once per turn: You can target 1 face-up card on the field; its effect(s) on the field are negated during this turn. There can only be 1 face-up1 "<M7782>Alector, Sovereign of Birds<M>" on the field.
et: Kui sinu vastasel on 2 või rohkem sama atribuudi avatud koletist, saad selle kaardi (oma käest) eriliselt kutsuda. Kord käigu jooksul: Saad sihtida 1 avatud kaarti väljal; selle mõju(d) väljal on selle käigu jooksul tühistatud. Väljal võib olla ainult 1 avatud "<M7782>Alector, Sovereign of Birds<M>".

source: Power Filter
et: Võimufilter

source: Neither player can Special Summon monsters with 1000 or less ATK.
et: Kumbki mängija ei saa erilist kutsuda koletisi, kellel on 1000 või vähem ATK.

source: Dupe Frog
et: Duplikaatkonn

source: This card's name is treated as "<M6424>Des Frog<M>" while it is face-up on the field. Your opponent cannot select another monster as an attack target. When this card is sent from the field to the Graveyard, you can add 1 "Frog" monster except1 "<M7788>Dupe Frog<M>" or "<M4555>Frog the Jam<M>" from your Deck or Graveyard to your hand.
et: Selle kaardi nimeks loetakse "<M6424>Des Frog<M>", kui see on väljaku peal avatud. Sinu vastane ei saa valida teist koletist rünnaku sihtmärgiks. Kui see kaart saadetakse väljaku pealt Hauakambrisse, saad lisada oma käele 1 "Frog" koletise, välja arvatud "<M7788>Dupe Frog<M>" või "<M4555>Frog the Jam<M>", oma pakist või Hauakambrist.

source: Psychic Overload
et: Psüühiline Ülekoormus

source: Select 3 Psychic-Type monsters in your Graveyard. Return them to the Deck, then draw 2 cards.
et: Vali oma kalmistult 3 psüühika-tüüpi koletist. Tagasta need pakki, seejärel tõmba 2 kaarti.

source: Beast Machine King Barbaros Ür
et: Metallikuningas Barbaros Ür

source: You can Special Summon this card from your hand by removing from play 1 Machine-Type monster and 1 Beast-Warrior-Type monster in your hand, field, and/or Graveyard. When this card battles, any Battle Damage to your opponent becomes 0.
et: Saad selle kaardi oma käest eriliselt välja kutsuda, eemaldades mängust 1 Masinatüüpi koletise ja 1 Metssõdalasetüüpi koletise oma käest, väljast ja/või Hauakambrist. Kui see kaart võitleb, muutub kogu Lahingukahju sinu vastasele 0-ks.

source: Guardian of Order
et: Korra valvur

source: If you control 2 or more LIGHT monsters, you can Special Summon this card from your hand. You can only control 1 "<M7795>Guardian of Order<M>".
et: Kui sa kontrollid 2 või rohkem VALGUS koletist, saad selle kaardi oma käest eriliselt kutsuda. Sa saad kontrollida ainult 1 "<M7795>Korrapärasuse Kaitsja<M>".

source: Aurkus, Lightsworn Druid
et: Aurkus, Valgusevande Druid
