Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: Equip only to a "Morphtronic" monster. Each time the equipped monster's battle position is changed, destroy 1 Spell or Trap Card on the field.
et: Varusta ainult "Morphtronic" koletisega. Iga kord, kui varustatud koletise lahingupositsiooni muudetakse, hävita 1 Võlu- või Lõksukaart väljal.

source: Morphtronic Engine
et: Morftroniline Mootor

source: Equip only to a Level 3 "Morphtronic" monster. Its ATK becomes double its original ATK. During your second Standby Phase after this card's activation, destroy this card, and take damage equal to the original ATK of the equipped monster.
et: Varusta ainult 3. taseme "Morphtronic" koletisega. Selle ATK muutub kahekordseks selle algsest ATK-st. Teise ootejärgu faasi ajal pärast selle kaardi aktiveerimist hävita see kaart ja saa kahju, mis on võrdne varustatud koletise algse ATK-ga.

source: Poison Chain
et: Mürgiahel

source: During the End Phase of your turn, if you did not attack, you can make your opponent send cards equal to the number of face-up "Iron Chain" monsters you control from the top of their Deck to the Graveyard.
et: Oma käigu lõppfaasis, kui sa ei rünnanud, võid sundida oma vastast saatma kaarte, mis on võrdne sinu kontrolli all olevate avatud "Iron Chain" koletiste arvuga, nende paki pealt hauakambrisse.

source: Paralyzing Chain
et: Halvav Kett

source: When a card(s) is sent from your opponent's Deck to the Graveyard by a card effect, inflict 300 damage to your opponent.
et: Kui kaardid saadetakse sinu vastase pakist hauakambrisse kaardi efekti tõttu, põhjusta vastasele 300 kahju.

source: Teleport
et: Teleporteerumine

source: Once per turn, if your opponent controls a monster and you control no monsters, you can pay 800 Life Points to Special Summon 1 Psychic-Type monster from your hand.
et: Korra ühe korra käigu jooksul, kui sinu vastasel on koletis ja sul ei ole koletisi, võid maksta 800 Elupunkti, et Kutsuda Eriliselt 1 Psüühika-tüüpi koletis oma käest.

source: Psychokinesis
et: Psühhokinees

source: Activate only while you control a face-up Psychic-Type monster. Destroy 1 card on the field and take 1000 damage.
et: Aktiveeri ainult siis, kui sa kontrollid avatud Psüühika-tüüpi koletist. Hävita 1 kaart väljal ja saa 1000 kahju.

source: Fragrance Storm
et: Lõhnatorm

source: Destroy 1 face-up Plant-Type monster on the field and draw 1 card. If that card is a Plant-Type monster, you can reveal it to your opponent and draw 1 more card.
et: Hävita 1 avatud näoga Taim-tüüpi koletis väljal ja tõmba 1 kaart. Kui see kaart on Taim-tüüpi koletis, võid selle oma vastasele näidata ja tõmmata veel 1 kaart.

source: The World Tree
et: Maailmapuu

source: Each time a Plant-Type monster(s) on the field is destroyed, place 1 Flower Counter on this card. You can remove Flower Counters to activate this card's effects.<BR>● Remove 1: Target face-up Plant-Type monster gains 400 ATK and DEF until the End Phase.<BR>● Remove 2: Destroy 1 card on the field.<BR>● Remove 3: Select 1 Plant-Type monster from your Graveyard and Special Summon it.
et: Iga kord, kui väljal hävitatakse Taimetüüpi koletis(ed), aseta sellele kaardile 1 Lilleloendur. Sa saad Lilleloendureid eemaldada, et aktiveerida selle kaardi efektid.<BR>● Eemalda 1: Sihtmärgiks olev avatud Taimetüüpi koletis saab 400 ATK ja DEF kuni End Phase'ini.<BR>● Eemalda 2: Hävita 1 kaart väljal.<BR>● Eemalda 3: Vali 1 Taimetüüpi koletis oma Hauakambrist ja Kutsu see Eriliselt välja.

source: Everliving Underworld Cannon
et: Igavene Allilma Kahur

source: Once during each player's turn, when a Zombie-Type monster is Special Summoned to your side of the field, inflict 800 damage to your opponent.
et: Kord mängija käigu jooksul, kui sinu poolele väljakule kutsutakse eriliselt välja Zombi-tüüpi koletis, põhjusta oma vastasele 800 kahju.

source: Secret Village of the Spellcasters
et: Loitsijate Salaküla

source: If you control a Spellcaster-Type monster and your opponent does not, your opponent cannot activate Spell Cards. If you control no Spellcaster-Type monsters, you cannot activate Spell Cards.
et: Kui sa kontrollid Loitsija-tüüpi koletist ja sinu vastane ei kontrolli, ei saa sinu vastane aktiveerida Loitsukaarte. Kui sa ei kontrolli ühtegi Loitsija-tüüpi koletist, ei saa sa aktiveerida Loitsukaarte.

source: Omega Goggles
et: Omega prillid

source: Equip only to a monster you control. Once per turn, you can look at 1 random card in your opponent's hand. The equipped monster cannot attack the turn you activate this effect.
et: Varusta ainult koletisele, mida sa kontrollid. Kord ühe käigu jooksul saad vaadata ühte juhuslikku kaarti oma vastase käes. Varustatud koletis ei saa rünnata käigu jooksul, mil sa selle efekti aktiveerid.

source: Battle Mania
et: Lahingumaani

source: Activate only during your opponent's Standby Phase. All face-up monsters your opponent controls are changed to Attack Position, and cannot change their battle positions this turn. All monsters your opponent currently controls must attack this turn, if able.
et: Aktiveeri ainult oma vastase ootejärgu faasis. Kõik sinu vastase kontrolli all olevad avatud koletised muudetakse rünnakupositsiooni ja ei saa sel käigul oma lahingupositsioone muuta. Kõik koletised, mida sinu vastane praegu kontrollib, peavad sel käigul ründama, kui võimalik.

source: Confusion Chaff
et: Segaduse Peibutis

source: Activate only when your opponent declares a second direct attack during the same Battle Phase. Conduct battle between the attacking monster and the first monster that attacked directly (other effects cannot be activated during this battle).
et: Aktiveeri ainult siis, kui sinu vastane kuulutab välja teise otsese rünnaku sama lahingufaasi jooksul. Viige läbi lahing ründava koletise ja esimese otseselt rünnanud koletise vahel (teisi efekte ei saa selle lahingu ajal aktiveerida).

source: Urgent Tuning
et: Kiire häälestamine

source: Activate only during the Battle Phase. Synchro Summon 1 Synchro Monster. (Send the appropriate Synchro Material Monsters to the Graveyard.)
et: Aktiveeri ainult Lahingu Faasis. Sünkrokutsu 1 Sünkrokoletis. (Saada sobivad Sünkromaterjal Koletised Hauakambrisse.)

source: Synchro Strike
et: Sünkro Rünnak

source: Target Synchro Summoned monster gains 500 ATK for each Synchro Material Monster used to Summon it, until the End Phase.
et: Sihtmärk Sünkrosummonitud koletis saab 500 ATK iga Sünkromaterjali Koletise eest, mida kasutati selle kutsumiseks, kuni lõppfaasini.

source: Prideful Roar
et: Uhke möirgamine

source: Activate only during damage calculation when the ATK of your battling monster is lower than the ATK of your opponent's, and pay Life Points equal to the difference in ATK. Your monster gains ATK equal to that difference +300 during damage calculation only.
et: Aktiveeri ainult kahju arvutamise ajal, kui sinu võitleva koletise rünnakupunktid on madalamad kui sinu vastase omad, ja maksa Elupunkte, mis on võrdsed rünnakupunktide erinevusega. Sinu koletis saab kahju arvutamise ajal rünnakupunkte juurde, mis on võrdsed selle erinevuse +300-ga.

source: Revival Gift
et: Elustuse Kingitus

source: Select 1 Tuner monster from your Graveyard and Special Summon it. Its effects are negated. Special Summon 2 "<M3949>Gift Fiend Token<M>" (Fiend-Type/DARK/Level 3/ATK 1500/DEF 1500) to your opponent's side of the field.
et: Vali 1 Tuner-koletis oma Hauakambrist ja Kutsu see Eriliselt välja. Selle efektid on tühistatud. Kutsu Eriliselt välja 2 "<M3949>Kingituse Deemon Token<M>" (Deemon-Tüüp/PIMEDUS/Tase 3/ATK 1500/DEF 1500) oma vastase väljaku poolele.

source: Lineage of Destruction
et: Hävingu sugupuu

source: Activate only during a turn in which you destroyed a Defense Position monster your opponent controlled. Select 1 Level 8 monster you control. During this turn, the selected monster can attack twice.
et: Aktiveeri ainult sellel käigul, mil hävitasid vastase kontrollitud kaitseasendis oleva koletise. Vali 1 tase 8 koletis, mida sa kontrollid. Sellel käigul võib valitud koletis rünnata kaks korda.

source: Doppelganger
et: Doppelgänger

source: When you take damage from the effect of a monster your opponent controls, inflict the same amount of damage to your opponent.
et: Kui sa saad kahju vastase kontrollitava koletise efekti tõttu, põhjusta vastasele sama palju kahju.

source: Morphtransition
et: Morfimuutus

source: Activate only when a face-up "Morphtronic" monster you control is selected as an attack target. Negate the attack, and change the battle position of the selected "Morphtronic" monster.
et: Aktiveeri ainult siis, kui sinu kontrollitav avatud "Morphtronic" koletis valitakse rünnaku sihtmärgiks. Tühista rünnak ja muuda valitud "Morphtronic" koletise lahingupositsiooni.

source: Morphtronic Transition
et: Morftroniline Üleminek

source: When a "Morphtronic" monster is Summoned, you can change it to face-up Defense Position.
et: Kui "Morphtronic" koletis kutsutakse välja, saad selle muuta avatud kaitseasendisse.

source: Psychic Trigger
et: Psüühiline Päästik

source: Activate only while your Life Points are lower than your opponent's. Select 2 Psychic-Type monsters in your Graveyard. Remove them from play and draw 2 cards.
et: Aktiveeri ainult siis, kui sinu Elupunktid on madalamad kui sinu vastasel. Vali 2 Psüühika-tüüpi koletist oma Hauakambris. Eemalda need mängust ja tõmba 2 kaarti.

source: Pollinosis
et: Pollinoos

source: Tribute 1 Plant-Type monster. Negate the activation of a Spell or Trap Card, or the Normal or Special Summon of a monster, and destroy that card.
et: Lohista 1 Taim-tüüpi koletis. Tühista Loitsu või Lõksukaardi aktiveerimine või koletise normaalne või eriline kutsumine ja hävita see kaart.

source: Bamboo Scrap
et: Bambusekraabits

source: Tribute 1 Plant-Type monster. Special Summon 2 "<M3950>Plant Token<M>" (Plant-Type/EARTH/Level 1/ATK 800/DEF 500) to your opponent's side of the field in Defense Position.
et: Lohista 1 Taim-tüüpi koletis. Kutsu eriliselt esile 2 "<M3950>Taimetokenit<M>" (Taim-tüüpi/MAA/Tase 1/ATK 800/DEF 500) oma vastase väljaku kaitsepositsioonile.

source: Plant Food Chain
et: Taimetoiduahel

source: Equip this card to a Plant-Type monster you control. It gains 500 ATK. If this card is destroyed by a card effect while equipped, you can Special Summon 1 Plant-Type monster from your Graveyard.
et: Varusta see kaart oma kontrollitavale Taimetüüpi koletisele. See saab 500 ATK juurde. Kui see kaart hävitatakse kaardi efekti tõttu, kui see on varustatud, saad Sa eriliselt kutsuda 1 Taimetüüpi koletise oma Hauakambrist.

source: Trap of the Imperial Tomb
et: Keiserliku hauakambri lõks

source: Activate only when a Zombie-Type monster(s) is Special Summoned from your opponent's Graveyard to your side of the field. Destroy 2 cards on the field.
et: Aktiveeri ainult siis, kui Zombie-tüüpi koletis(ed) kutsutakse eriliselt välja sinu vastase hauakambrist sinu väljale. Hävita 2 kaarti väljal.

source: DNA Checkup
et: DNA kontroll

source: Select 1 face-down monster you control. Your opponent declares 2 Attributes. Reveal the selected monster. If its Attribute is one of the declared Attributes, your opponent draws 2 cards. If not, you draw 2 cards.
et: Vali 1 allapoole suunatud koletis, mida sa kontrollid. Sinu vastane nimetab 2 atribuuti. Paljasta valitud koletis. Kui selle atribuut on üks nimetatud atribuutidest, tõmbab sinu vastane 2 kaarti. Kui ei ole, tõmbad sina 2 kaarti.

source: Gozen Match
et: Gozeni Matš

source: Each player sends monsters they control to the Graveyard until they each control monsters of only 1 Attribute. Each player cannot control monsters with different Attributes.
et: Iga mängija saadab koletised, mida nad kontrollivad, Hauakambrisse, kuni nad kontrollivad ainult ühe Atribuudiga koletisi. Iga mängija ei saa kontrollida erinevate Atribuutidega koletisi.

source: Giant Trap Hole
et: Hiiglaslik Lõksuauk

source: Activate only when 2 or more monsters are Special Summoned at the same time. Destroy all monsters on the field.
et: Aktiveeri ainult siis, kui 2 või rohkem koletist kutsutakse eriliselt välja samal ajal. Hävita kõik koletised väljakul.

source: Cannot be Normal Summoned or Set. Must be Special Summoned (from your hand) by controlling 2 or more face-up Zombie-Type monsters, and cannot be Special Summoned by other ways. When this card is Special Summoned: Shuffle all other monsters on the field into the Decks; this card's ATK is equal to the number of face-up Zombie-Type monsters shuffled into the Deck this way x 1000.
et: Ei saa olla normaalset kutsutud ega seatud. Peab olema eriliselt kutsutud (teie käest), kui kontrollite 2 või enamat avatud Zombi-tüüpi koletist, ja ei saa olla eriliselt kutsutud muul viisil. Kui see kaart on eriliselt kutsutud: segage kõik teised koletised väljakul tagasi pakkidesse; selle kaardi ATK on võrdne avatud Zombi-tüüpi koletiste arvuga, mis sel viisil pakkidesse segati x 1000.

source: Parallel World Fusion
et: Paralleelmaailma Sulandumine

source: Choose an "Elemental HERO" Fusion Monster in your Extra Deck whose listed Fusion Material Monsters are banished, shuffle the banished Fusion Material Monsters into the deck, then Special Summon that Fusion Monster from your Extra Deck.(This Special Summon is treated as a Fusion Summon.) You cannot Special Summon another monster(s) during the turn you activate this card.
et: Vali oma Lisapakist üks "Elemental HERO" Fusion Monster, mille loetletud Fusion Material Monsters on eemaldatud mängust, sega eemaldatud Fusion Material Monsters tagasi pakki, seejärel kutsu see Fusion Monster oma Lisapakist eriliselt välja. (See eriline väljakutse loetakse Fusion Summoniks.) Sa ei saa sellel käigul, mil sa selle kaardi aktiveerid, eriliselt välja kutsuda teisi koletisi.

source: Flip Flop Frog
et: Loksutav Konn

source: Once per turn, you can flip this card into face-down Defense Position. When this card is flipped face-up, you can return monsters your opponent controls to their owners' hand up to the number of face-up "Frog" monsters you control, except "<M4555>Frog the Jam<M>".
et: Korra ühe korra käigu jooksul saad selle kaardi pöörata näoga allapoole Kaitsepositsiooni. Kui see kaart pööratakse näoga ülespoole, saad vastase kontrollitavad koletised tagastada nende omanike kätte kuni sinu kontrollitavate näoga ülespoole olevate "Konna" koletiste arvuni, välja arvatud "<M4555>Frog the Jam<M>".

source: Naturia Beetle
et: Naturia Põrnikas

source: Switch the original ATK and DEF of this card each time a Spell Card is activated.
et: Vaheta selle kaardi algne ATK ja DEF iga kord, kui aktiveeritakse Võlukaarte.

source: Naturia Rock
et: Naturia Kivi

source: When a Trap Card is activated, you can send the top card of your Deck to the Graveyard to Special Summon this card from your hand.
et: Kui aktiveeritakse lõksukaart, võid saata oma pakist pealmise kaardi hauakambrisse, et kutsuda see kaart oma käest eriliselt välja.

source: Naturia Guardian
et: Naturia Kaitsja

source: When your opponent Normal Summons a monster, this card gains 300 ATK until the End Phase.
et: Kui sinu vastane kutsub normaalselt välja koletise, saab see kaart End Phase'ini 300 ATK juurde.

source: You can Tribute this card and 1 "Naturia" monster to negate the activation of your opponent's Spell or Trap Card, and destroy it.
et: Saate ohverdada selle kaardi ja 1 "Naturia" koletise, et tühistada vastase Loitsu- või Lõksukaardi aktiveerimine ja hävitada see.

source: Genex Furnace
et: Genexi Ahi

source: If you control a face-up1 "<M7807>Genex Controller<M>", you can Normal Summon this card without Tributing.
et: Kui sa kontrollid avatud1 "<M7807>Genex Controller<M>", saad selle kaardi normaalset kutsuda ilma ohverdamata.

source: If this card would be destroyed, you can destroy 1 "<M7807>Genex Controller<M>" monster you control instead.
et: Kui see kaart hävitatakse, võid selle asemel hävitada 1 "<M7807>Genex Controller<M>" koletis, mida sa kontrollid.

source: Genex Spare
et: Genexi Varuosa

source: Once per turn, if you control another "Genex" monster, you can make this card's name1 "<M7807>Genex Controller<M>" until the End Phase.
et: Korra ühe korra käigu jooksul, kui sa kontrollid teist "Genex" koletist, saad muuta selle kaardi nime1 "<M7807>Genex Controller<M>" kuni End Phase'ini.

source: Genex Turbine
et: Genexi Turbiin

source: All face-up "Genex" monsters you control gain 400 ATK.
et: Kõik sinu kontrolli all olevad avatud "Genex" koletised saavad 400 ATK juurde.

source: Genex Doctor
et: Genexi Doktor

source: You can Tribute 1 face-up1 "<M7807>Genex Controller<M>" to select and destroy 1 card on the field.
et: Saad ohverdada 1 avatud "<M7807>Genex Controller<M>", et valida ja hävitada 1 kaardi väljal.

source: You can Normal Summon this card by Tributing 1 "Genex" monster. Inflict 500 damage to your opponent each time a face-up "Genex" monster you control is sent to the Graveyard.
et: Sa saad selle kaardi tavaliselt välja kutsuda, ohverdades 1 "Genex" koletise. Iga kord, kui sinu kontrolli all olev avatud "Genex" koletis saadetakse hauakambrisse, tekitad oma vastasele 500 kahju.

source: Dai-sojo of the Ice Barrier
et: Jääbarjääri Dai-sojo

source: When this card is Normal or Flip Summoned, it is changed to Defense Position. Face-up "Ice Barrier" monsters you control cannot be destroyed by Spell or Trap Card effects.
et: Kui see kaart on Normaal- või Pöördkutsutud, muudetakse see Kaitsepositsiooni. Näoga ülespoole olevad "Jääbarjääri" koletised, mida sa kontrollid, ei saa hävitatud olla Loitsu või Lõksukaardi efektide poolt.

source: Medium of the Ice Barrier
et: Jääbarjääri Meedium

source: If your opponent controls 4 or more cards than you do, you can Special Summon this card from your hand. Your opponent can only activate 1 Spell/Trap Card per turn.
et: Kui sinu vastasel on 4 või rohkem kaarti kui sinul, saad selle kaardi oma käest eriliselt kutsuda. Sinu vastane saab aktiveerida ainult 1 Loitsu/Lõksu kaardi käigu kohta.

source: Mist Valley Baby Roc
et: Uduorgu Beebi Roc

source: When this card is sent directly from the hand to the Graveyard, you can Special Summon it.
et: Kui see kaart saadetakse otse käest Hauakambrisse, saad selle eriliselt välja kutsuda.

source: Mist Valley Executor
et: Uduorgu Täideviija

source: When this card is Normal Summoned, return all face-up Spell and Trap Cards on the field to their owners' hands.
et: Kui see kaart on normaalvälja kutsutud, tagasta kõik avatud Võlu- ja Lõksukaardid väljal nende omanike kätte.

source: When this card destroys a monster by battle and sends it to the Graveyard, inflict damage to your opponent equal to the Level of the destroyed monster x 200.
et: Kui see kaart hävitab lahingus koletise ja saadab selle Hauakambrisse, põhjusta oma vastasele kahju, mis on võrdne hävitatud koletise tasemega x 200.

source: Flamvell Baby
et: Flamvell Beebi

source: During your Main Phase, you can send this card from your hand to the Graveyard to select 1 face-up FIRE monster you control and have it gain 400 ATK.
et: Oma peafaasia ajal saad saata selle kaardi oma käest Hauakambrisse, et valida 1 avatud TULEKAHJU koletis, mida sa kontrollid, ja anda sellele 400 ATK juurde.

source: Ally Mind
et: Liitlane Mõistus

source: A high-performance unit developed to enhance the Artificial Intelligence program of the Allies of Justice. Loaded with elements collected from a meteor found in the Worm Nebula, it allows for highly tuned performance, but its full capacity is not yet determined.
et: Kõrge jõudlusega üksus, mis on välja töötatud Õigluse Liitlaste tehisintellekti programmi täiustamiseks. Koormatud elementidega, mis on kogutud Usside Udukogust leitud meteoriidist, võimaldab see väga häälestatud jõudlust, kuid selle täielik võimekus pole veel kindlaks määratud.

source: Ally of Justice Nullfier
et: Õigluse Liitlane Nullfier

source: Any LIGHT monster that has battled this card has its effects negated (starting after damage calculation).
et: Mis tahes selle kaardiga võidelnud VALGUS koletise efektid tühistatakse (alates pärast kahju arvutamist).

source: Ally of Justice Searcher
et: Õigluse Liitlase Otsija

source: Once per turn, you can discard 1 card to select 1 face-down Defense Position monster your opponent controls and change it to face-up Attack Position. Flip Effects are not activated at this time.
et: Korra ühe korra käigu jooksul saad sa ühe kaardi ära visata, et valida 1 vastase kontrollitav näoga allapoole olev kaitseasendis koletis ja muuta see näoga ülespoole rünnakuasendisse. Pööramisefekte sel ajal ei aktiveerita.

source: Ally of Justice Enemy Catcher
et: Õigluse Liitlase Vaenlase Püüdja

source: When this card is Normal Summoned, you can take control of 1 face-down Defense Position monster your opponent controls, until the End Phase of this turn.
et: Kui see kaart on normaalvälja kutsutud, saad võtta kontrolli oma vastase ühe allapoole suunatud kaitsepositsioonis oleva koletise üle kuni selle käigu lõppfaasini.

source: Ally of Justice Thunder Armor
et: Õigluse Liitlane Äikese Rüü

source: This card cannot be Special Summoned. When an "Ally of Justice" monster you control attacks a Defense Position monster, inflict Piercing Battle Damage to your opponent.
et: Seda kaarti ei saa eriliselt kutsuda. Kui sinu kontrolli all olev "Õigluse Liitlane" koletis ründab kaitseasendis koletist, põhjusta vastasele läbistavat lahingukahju.

source: Ally of Justice Cosmic Gateway
et: Õigluse Liitlane Kosmiline Värav

source: If your opponent controls 2 or more monsters, including a LIGHT monster, you can Special Summon this card from your hand.
et: Kui sinu vastasel on 2 või rohkem koletist, sealhulgas VALGUS koletis, saad selle kaardi oma käest eriliselt kutsuda.

source: Worm Linx
et: Uss Linx

source: FLIP: During each End Phase, if this card is face-up, draw 1 card.
et: FLIP: Iga lõpuetapi ajal, kui see kaart on avatud, tõmba 1 kaart.

source: Worm Millidith
et: Uss Millidith

source: FLIP: You can equip this card to a monster your opponent controls as an Equip Card. Inflict 400 damage to the controller of the equipped monster during each Standby Phase.
et: FLIP: Saate selle kaardi kinnitada oma vastase kontrollitava koletise külge kui Varustuskaart. Iga Ootefaasiga tekitage varustatud koletise kontrollijale 400 kahju.

source: Worm Noble
et: Ussikuningas

source: FLIP: If this card is flipped face-up by an opponent's monster's attack, inflict damage to your opponent equal to half the attacking monster's ATK.
et: FLIP: Kui see kaart pööratakse vastase koletise rünnaku tõttu ülespoole, põhjusta oma vastasele kahju, mis on võrdne ründava koletise ATK poolega.

source: Naturia Beast
et: Naturia Metss

source: 1 EARTH Tuner + 1 or more non-Tuner EARTH monsters<BR>While this card is face-up on the field, you can send the top 2 cards of your Deck to the Graveyard to negate the activation of a Spell Card and destroy it.
et: 1 MAA Tuner + 1 või rohkem mitte-Tuner MAA koletist<BR>Kui see kaart on väljal avatud, võid saata oma paki 2 ülemist kaarti Hauakambrisse, et tühistada Loitsukaardi aktiveerimine ja see hävitada.

source: Dewloren, Tiger King of the Ice Barrier
et: Dewloren, Jääbarjääri Tiigrikuningas

source: 1 Tuner + 1 or more non-Tuner WATER monsters<BR>Once per turn, you can return any number of face-up cards you control to the owner's hand. For each card returned to the owner's hand by this effect, this card gains 500 ATK until the End Phase.
et: 1 Tuner + 1 või rohkem mitte-Tuner VEE koletist<BR>Korra käigu jooksul saad sa tagastada suvalise arvu ülespööratud kaarte, mida sa kontrollid, omaniku kätte. Iga selle efekti abil omaniku kätte tagastatud kaardi eest saab see kaart 500 ATK kuni End Phase'ini.

source: Thermal Genex
et: Termo Genex
