Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: When this card is destroyed by battle and sent to the Graveyard: You can Special Summon 1 FIRE monster with 1500 or less ATK from your Deck, in face-up Attack Position.
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse: Sa võid oma pakist eriliselt kutsuda 1 TULEKAHJU koletise, mille ATK on 1500 või vähem, näoga ülespoole Rünnakupositsioonis.

source: Flash Assailant
et: Välgu Ründaja

source: Decrease the ATK and DEF of this card by 400 points for every card in your hand.
et: Vähenda selle kaardi ATK ja DEF 400 punkti võrra iga kaardi eest, mis sul käes on.

source: Karate Man
et: Karateemees

source: You can double the original ATK of this card once per turn. If you used this effect, destroy this card during the End Phase.
et: Saad selle kaardi algse ATK-i kord ühe korra käigu jooksul kahekordistada. Kui kasutasid seda efekti, hävita see kaart End Phase'i ajal.

source: Dark Zebra
et: Tume Sebra

source: If this is the only Monster Card in your control during your Standby Phase, it is changed to Defense Position. You cannot change the position of this card during the same turn.
et: Kui see on ainus koletisekaart sinu kontrolli all sinu ooteetapi ajal, muudetakse see kaitsepositsiooniks. Sa ei saa selle kaardi positsiooni samal käigul muuta.

source: Giant Germ
et: Hiidbakter

source: When this card is destroyed by battle and sent to the Graveyard, inflict 500 damage to your opponent. You can also Special Summon up to 2 "<M4921>Giant Germ<M>"(s) from your Deck in face-up Attack Position.
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse, põhjusta oma vastasele 500 kahju. Sa võid ka eriliselt kutsuda kuni 2 "<M4921>Giant Germ<M>" oma pakist avatud rünnakupositsioonis.

source: Nimble Momonga
et: Nobelev Orav

source: When this card is destroyed by battle and sent to the Graveyard, gain 1000 Life Points. You can also Special Summon any number of "<M4922>Nimble Momonga<M>"(s) from your Deck in face-down Defense Position.
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse, saad 1000 Elupunkti. Sa võid ka eriliselt kutsuda ükskõik kui palju "<M4922>Nimble Momonga<M>" oma pakist tagurpidi kaitsepositsioonis.

source: Spear Cretin
et: Oda Kretiin

source: FLIP: When this card is sent to the Graveyard after being flipped, each player selects 1 monster from their Graveyard, and Special Summon it in face-up Attack Position or face-down Defense Position.
et: FLIP: Kui see kaart saadetakse hauakambrisse pärast ümberpööramist, valib iga mängija ühe koletise oma hauakambrist ja kutsub selle eriliselt välja näoga ülespoole rünnakupositsioonis või näoga allapoole kaitsepositsioonis.

source: Shining Angel
et: Särav Ingel

source: When this card is destroyed by battle and sent to the Graveyard: You can Special Summon 1 LIGHT monster with 1500 or less ATK from your Deck, in face-up Attack Position.
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse: Sa võid eriliselt kutsuda 1 VALGUS koletise, mille ATK on 1500 või vähem, oma pakist, avatud rünnakupositsioonis.

source: Boar Soldier
et: Metssea Sõdur

source: If this card is Normal Summoned, destroy this card. If your opponent controls 1 or more monsters, decrease the ATK of this card by 1000 points.
et: Kui see kaart on Normaal-Kutsutud, hävita see kaart. Kui sinu vastane kontrollib 1 või rohkem koletisi, vähenda selle kaardi ATK-d 1000 punkti võrra.

source: Mother Grizzly
et: Ema Grizzly

source: When this card is destroyed by battle and sent to the Graveyard: You can Special Summon 1 WATER monster with 1500 or less ATK from your Deck, in face-up Attack Position.
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse: Sa võid eriliselt kutsuda 1 VEE koletise, millel on 1500 või vähem ATK-d, oma pakist, avatud rünnakupositsioonis.

source: Flying Kamakiri #1
et: Lendav Kamakiri #1

source: When this card is destroyed by battle and sent to the Graveyard: You can Special Summon 1 WIND monster with 1500 or less ATK from your Deck in face-up Attack Position.
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse: Sa võid oma pakist eriliselt kutsuda ühe 1500 või vähem ATK-ga TUULE koletise avatud ründeasendisse.

source: Ceremonial Bell
et: Tseremoniaalne Kell

source: As long as this card remains face-up on the field, both players must show their respective hands.
et: Niikaua kui see kaart jääb väljale avatud olekus, peavad mõlemad mängijad oma käsi näitama.

source: When this card is Normal Summoned or Flip Summoned, you can add 1 Ritual Spell Card from your Deck to your hand.
et: Kui see kaart on Normaal- või Pöördkutsutud, saad lisada 1 Rituaaliloitsukaardi oma pakist oma kätte.

source: Mystic Tomato
et: Müstiline Tomat

source: When this card is destroyed by battle and sent to the Graveyard, you can Special Summon 1 DARK monster with 1500 or less ATK from your Deck in face-up Attack Position.
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse, saad oma pakist eriliselt kutsuda 1 PIMEDUSE koletise, mille ATK on 1500 või vähem, näoga ülespoole Rünnakupositsioonis.

source: As long as this card remains face-up on the field, more than 1 monster with the same name cannot exist face-up on the field. If a monster with the same name as a face-up monster on the field is Normal Summoned, Flip Summoned, Special Summoned or flipped face-up later, it is destroyed. (If monsters with the same name are Summoned or flipped face-up at the same time, they are destroyed).
et: Niikaua kui see kaart jääb väljale avatud olekusse, ei saa väljale jääda rohkem kui 1 sama nimega koletis avatud olekusse. Kui sama nimega koletis nagu väljale avatud koletis kutsutakse välja tavalisel viisil, pööratakse ümber, kutsutakse eriliselt välja või pööratakse hiljem avatud olekusse, hävitatakse see. (Kui sama nimega koletised kutsutakse välja või pööratakse avatud olekusse samal ajal, hävitatakse need).

source: Gaia Power
et: Gaia Jõud

source: All EARTH monsters gain 500 ATK and lose 400 DEF.
et: Kõik MAA koletised saavad 500 ATK juurde ja kaotavad 400 DEF.

source: All WATER monsters gains 500 ATK and lose 400 DEF.
et: Kõik VEE koletised saavad 500 ATK juurde ja kaotavad 400 DEF.

source: Molten Destruction
et: Sulav häving

source: All FIRE monsters gains 500 ATK and lose 400 DEF.
et: Kõik TULEKAHJU koletised saavad 500 ATK juurde ja kaotavad 400 DEF.

source: Rising Air Current
et: Tõusev Õhuvool

source: All WIND monsters gains 500 ATK and lose 400 DEF.
et: Kõik TUULE-elemendi koletised saavad 500 ATK juurde ja kaotavad 400 DEF.

source: Luminous Spark
et: Helendav Säde

source: All LIGHT monsters gains 500 ATK and lose 400 DEF.
et: Kõik VALGUS koletised saavad 500 ATK juurde ja kaotavad 400 DEF.

source: Mystic Plasma Zone
et: Müstiline Plasma Tsoon

source: Increase the ATK of all DARK monsters by 500 points and decreases their DEF by 400 points.
et: Suurendab kõigi PIMEDATE koletiste ATK-d 500 punkti võrra ja vähendab nende DEF-i 400 punkti võrra.

source: Messenger of Peace
et: Rahu Sõnumitooja

source: During each of your Standby Phases pay 100 Life Points or destroy this card. Neither player can declare attacks with face-up monsters with 1500 or more ATK.
et: Iga oma ootejärgu ajal maksa 100 Elupunkti või hävita see kaart. Ükski mängija ei saa kuulutada rünnakuid näoga ülespoole olevate koletistega, mille ATK on 1500 või rohkem.

source: You can activate this card when a monster is sent from the field to your Graveyard. Destroy 1 monster on the field.
et: Sa saad selle kaardi aktiveerida, kui koletis saadetakse väljakult sinu hauakambrisse. Hävita 1 koletis väljakul.

source: Gust
et: Puhang

source: You can activate this card when 1 or more of your Spell Cards are destroyed and sent from the field to the Graveyard by a card effect your opponent controls. Destroy 1 Spell or Trap Card on the field.
et: Sa saad selle kaardi aktiveerida, kui 1 või rohkem sinu Võlukaartidest hävitatakse ja saadetakse väljakult Hauakambrisse sinu vastase kontrollitud kaardi efekti tõttu. Hävita 1 Võlu- või Lõksukaart väljakul.

source: Driving Snow
et: Tuisk

source: You can only activate this card when 1 or more of your Trap Cards are destroyed and sent from the field to the Graveyard by a card effect your opponent controls. Destroy 1 Spell or Trap Card on the field.
et: Seda kaarti saad aktiveerida ainult siis, kui üks või rohkem sinu lõksukaartidest hävitatakse ja saadetakse väljakult hauakambrisse sinu vastase kontrollitava kaardi efekti tõttu. Hävita 1 loitsu- või lõksukaart väljakul.

source: Armored Glass
et: Soomustatud Klaas

source: You can only activate this card when a monster is equipped with an Equip Spell Card. Negate the effects of all Equip Spell Cards on the field during the turn this card is activated.
et: Seda kaarti saab aktiveerida ainult siis, kui koletis on varustatud Varustuse Võlusõnakaardiga. Tühista kõigi Varustuse Võlusõnakaartide efektid väljakul sellel käigul, mil see kaart aktiveeritakse.

source: World Suppression
et: Maailma Allasurumine

source: You can only activate this card when a Field Spell Card is activated. Negate the Field Spell Card during the turn this card is activated.
et: Seda kaarti saab aktiveerida ainult siis, kui aktiveeritakse Väljaloitsu kaart. Tühista Väljaloitsu kaart sellel käigul, mil see kaart aktiveeritakse.

source: Mystic Probe
et: Müstiline Sond

source: You can only activate this card when a Continuous Spell Card is activated. Negate all Continuous Spell Cards during the turn this card is activated.
et: Seda kaarti saab aktiveerida ainult siis, kui aktiveeritakse pidev loitsukaart. Tühista kõik pidevad loitsukaardid sellel käigul, mil see kaart aktiveeritakse.

source: Metal Detector
et: Metalliotsija

source: You can only activate this card when a Continuous Trap Card is activated. Negate all Continuous Trap Cards during the turn this card is activated.
et: Seda kaarti saab aktiveerida ainult siis, kui aktiveeritakse Pidev Lõksukaart. Tühista kõik Pidevad Lõksukaardid sellel käigul, mil see kaart aktiveeritakse.

source: Numinous Healer
et: Numinoosne Tervendaja

source: You can only activate this card when you take damage to your Life Points. Increase your Life Points by 1000 points. Also, increase your Life Points by 500 points per card if there are additional "<M4946>Numinous Healer<M>" cards in your Graveyard.
et: Seda kaarti saad aktiveerida ainult siis, kui saad oma Elupunktidele kahju. Suurenda oma Elupunkte 1000 punkti võrra. Lisaks suurenda oma Elupunkte 500 punkti võrra iga kaardi kohta, kui sinu Hauakambris on täiendavaid "<M4946>Numinous Healer<M>" kaarte.

source: Appropriate
et: Asjakohane

source: Activate only when your opponent draws a card(s), except during their Draw Phase. Draw 2 cards.
et: Aktiveeri ainult siis, kui sinu vastane tõmbab kaardi(d), välja arvatud nende tõmbefaasi ajal. Tõmba 2 kaarti.

source: Forced Requisition
et: Sunnitud rekvireerimine

source: You can activate this card when you discard from your hand. After that, each time you discard from your hand, your opponent must also discard the same number of cards from his/her hand.
et: Saate selle kaardi aktiveerida, kui viskate oma käest kaardi ära. Pärast seda peab teie vastane iga kord, kui te oma käest kaardi ära viskate, samuti viskama sama arvu kaarte oma käest ära.

source: Minor Goblin Official
et: Väike Goblin Ametnik

source: You can only activate this card when your opponent's Life Points are 3000 or less. Inflict 500 points of damage to your opponent's Life Points during each of his/her Standby Phases.
et: Seda kaarti saad aktiveerida ainult siis, kui sinu vastase Elupunktid on 3000 või vähem. Iga tema Ootefaaside ajal tekitad vastase Elupunktidele 500 punkti kahju.

source: Gamble
et: Hasartmäng

source: You can only activate this card when your opponent's hand is 6 or more cards and your hand is 2 or less. Toss a coin and call heads or tails. If you call it right, draw until your hand has 5 cards. If you call it wrong, skip your next turn.
et: Seda kaarti saad aktiveerida ainult siis, kui sinu vastase käes on 6 või rohkem kaarti ja sinu käes on 2 või vähem. Viska münti ja ütle, kas kull või kiri. Kui arvad õigesti, tõmba kaarte, kuni sinu käes on 5 kaarti. Kui arvad valesti, jäta oma järgmine käik vahele.

source: DNA Surgery
et: DNA operatsioon

source: When you activate this card, declare 1 Type of monster. As long as this card remains face-up on the field, all face-up monsters become the Type you declared.
et: Kui aktiveerid selle kaardi, nimeta 1 tüüpi koletis. Kuni see kaart jääb väljale avatud olekusse, muutuvad kõik avatud koletised nimetatud tüübiks.

source: The Regulation of Tribe
et: Hõimu reguleerimine

source: Declare 1 Type of monster. Monsters of the declared Type cannot attack. Tribute 1 monster from your side of the field during each of your Standby Phases. If you do not, this card is destroyed.
et: Vali 1 tüüpi koletis. Välja kuulutatud tüüpi koletised ei saa rünnata. Ohverda iga oma ootejärgu faasi ajal 1 koletis oma väljaku poolelt. Kui sa seda ei tee, hävitatakse see kaart.

source: Backup Soldier
et: Varusõdur

source: Activate only if there are 5 or more monsters in your Graveyard. Add up to 3 non-Effect Monsters with 1500 ATK or less from your Graveyard to your hand.
et: Aktiveeri ainult siis, kui sinu Hauakambris on 5 või rohkem koletist. Lisa oma Hauakambrist oma kätte kuni 3 mitte-efektiga koletist, millel on 1500 ATK või vähem.

source: Attack and Receive
et: Rünnak ja Vastuvõtt

source: You can only activate this card when you take damage to your Life Points. Inflict 700 points of damage to your opponent's Life Points. Also, inflict 300 points of damage to your opponent's Life Points for each "<M4954>Attack and Receive<M>" card in your Graveyard.
et: Seda kaarti saad aktiveerida ainult siis, kui saad oma Elupunktidele kahju. Põhjusta oma vastase Elupunktidele 700 punkti kahju. Samuti põhjusta oma vastase Elupunktidele 300 punkti kahju iga oma Hauakambris oleva "<M4954>Rünnak ja Vastuvõtt<M>" kaardi eest.

source: Major Riot
et: Suur Mäss

source: You can activate this card when 1 or more of your monsters are returned from the field to your hand by your opponent's card effect. Return all Monster Cards on the field to your respective hands. Both you and your opponent can then Special Summon from your hand the same number of Monster Cards on the field in face-down Defense Position.
et: Sa saad selle kaardi aktiveerida, kui 1 või rohkem sinu koletisi tagastatakse väljakult sinu kätte vastase kaardi efekti tõttu. Tagasta kõik koletiskaardid väljakult nende vastavatesse kätesse. Seejärel saavad nii sina kui ka sinu vastane eriliselt kutsuda oma käest sama arvu koletiskaarte väljakule näoga allapoole kaitsepositsioonis.

source: Ceasefire
et: Relvarahu

source: Flip all face-down Defense Position monsters face-up. Flip Effects are not activated at this time. Inflict 500 damage to your opponent for each face-up Effect Monster on the field.
et: Pööra kõik tagurpidi kaitseasendis olevad koletised näoga ülespoole. Pööramise efektid ei aktiveeru sel ajal. Tekita oma vastasele 500 kahju iga näoga ülespoole oleva efektikoletise eest väljakul.

source: Light of Intervention
et: Sekkumise Valgus

source: Monster Cards cannot be Set face-down. Monsters Set in Defense Position are Normal Summoned in face-up Defense Position.
et: Koletiskaarte ei saa asetada pildiga allapoole. Kaitseasendisse asetatud koletised kutsutakse tavalisel viisil esile pildiga ülespoole kaitseasendis.

source: Respect Play
et: Austusmäng

source: During their respective turns, each player must show their opponent their hand.
et: Oma käigu ajal peab iga mängija näitama oma vastasele oma kätt.

source: Imperial Order
et: Keiserlik käsk

source: As long as this card remains face-up on the field, negate the effects of all Spell Cards on the field. Pay 700 Life Points during each of your Standby Phases. If you do not, this card is destroyed.
et: Niikaua kui see kaart jääb väljale avatud olekusse, tühista kõigi väljale asetatud Loitsukaartide efektid. Maksa iga oma Ootefaaside ajal 700 Elupunkti. Kui sa seda ei tee, hävitatakse see kaart.

source: Skull Invitation
et: Kutsung Kolju

source: Each time a card(s) is sent to the Graveyard, inflict 300 damage to its owner for each card sent.
et: Iga kord, kui kaart või kaardid saadetakse Hauakambrisse, tekitage selle omanikule 300 kahju iga saadetud kaardi eest.

source: Magical Hats
et: Maagilised Mütsid

source: Activate only during your opponent's Battle Phase. Select 2 non-Monster Cards from your Deck and 1 monster you control. Shuffle those 3 cards and Set them on the field in face-down Defense Position. The 2 cards selected from your Deck are treated as monsters (ATK 0/DEF 0) and are destroyed at the end of the Battle Phase.
et: Aktiveeri ainult oma vastase Lahingufaasis. Vali oma pakist 2 mitte-koletis kaarti ja 1 koletis, mida sa kontrollid. Sega need 3 kaarti ja aseta need väljale tagurpidi Kaitsepositsioonis. Pakist valitud 2 kaarti käsitletakse koletistena (ATK 0/DEF 0) ja need hävitatakse Lahingufaasi lõpus.

source: Nobleman of Crossout
et: Ristirüütel

source: Destroy 1 face-down monster and remove it from play. If it is a Flip Effect Monster, remove from play all monsters with the same name from both player's Deck.
et: Hävita 1 tagurpidi koletis ja eemalda see mängust. Kui see on Pöördefekti Koletis, eemalda mängust kõik sama nimega koletised mõlema mängija pakist.

source: Nobleman of Extermination
et: Hävitamise Aadel

source: Destroy and remove from play 1 face-down Spell or Trap Card. If it was a Trap Card, both players must remove from play all cards in their Deck with the same name as it.
et: Hävita ja eemalda mängust 1 allapoole pööratud Võlu- või Lõksukaart. Kui see oli Lõksukaart, peavad mõlemad mängijad eemaldama mängust kõik oma paki kaardid, millel on sama nimi.

source: The Shallow Grave
et: Madal haud

source: Each player selects 1 monster in their Graveyard and Special Summons it in face-down Defense Position.
et: Iga mängija valib 1 koletise oma Hauakambrist ja Kutsuge see eriliselt välja näoga allapoole Kaitseasendisse.

source: Premature Burial
et: Enneaegne Matmine

source: Pay 800 Life Points. Select 1 monster from your Graveyard. Special Summon it in face-up Attack Position, and equip it with this card. When this card is destroyed, destroy the equipped monster.
et: Makske 800 Elupunkti. Vali 1 koletis oma Hauakambrist. Kutsu see eriliselt välja rünnakupositsioonis ja varusta see selle kaardiga. Kui see kaart hävitatakse, hävita varustatud koletis.

source: Inspection
et: Inspektsioon

source: During your opponent's Standby Phase, you can pay 500 Life Points to randomly select 1 card in your opponent's hand and look at it.
et: Oma vastase Ootefaasil võid maksta 500 Elupunkti, et juhuslikult valida 1 kaardi oma vastase käest ja seda vaadata.

source: Prohibition
et: Keeld

source: When you activate this card, declare 1 card name. Cards with that name and their effects cannot be used. Cards on the field before this card was activated are not affected (including face-down cards).
et: Kui aktiveerid selle kaardi, nimeta 1 kaardi nimi. Selle nimega kaarte ja nende efekte ei saa kasutada. Enne selle kaardi aktiveerimist väljakul olevad kaardid ei ole mõjutatud (sealhulgas tagurpidi kaardid).

source: Morphing Jar #2
et: Muutuv Purk #2

source: FLIP: Return all Monster Cards on the field to their respective Decks and shuffle them. You and your opponent then pick up cards until you both have the same number of Monster Cards that were returned to each Deck. Special Summon the Level 4 or lower monsters to the field in face-down Defense Position. The rest of the cards picked up are discarded to the Graveyard.
et: FLIP: Tagasta kõik koletiskaardid väljakult nende vastavatesse pakkidesse ja sega need. Sina ja su vastane tõmbate kaarte, kuni teil mõlemal on sama arv koletiskaarte, mis tagastati igasse pakki. Kutsu spetsiaalselt välja 4. taseme või madalamad koletised väljakule näoga allapoole kaitsepositsioonis. Ülejäänud tõmmatud kaardid visatakse hauakambrisse.

source: Bubonic Vermin
et: Bubooniline kahjur

source: FLIP: You can Special Summon 1 "<M4970>Bubonic Vermin<M>" from your Deck in face-down Defense Position. Then shuffle your Deck.
et: FLIP: Sa võid eriliselt kutsuda 1 "<M4970>Bubonic Vermin<M>" oma pakist tagurpidi kaitsepositsioonis. Seejärel sega oma pakk.

source: Flame Champion
et: Leegitsev Meister

source: A warrior protected by a flaming shield that nullifies any attack.
et: Leegionär, keda kaitseb leegitsev kilp, mis neutraliseerib iga rünnaku.

source: Twin-Headed Fire Dragon
et: Kakspeaga Tuld Hingav Draakon

source: Two dragons fused as one from the effects of the Big Bang.
et: Kaks draakonit, kes on ühinenud üheks Suure Paugu mõjul.

source: Darkfire Soldier #1
et: Pimedatule Sõdur #1

source: An explosive expert from a special elite force.
et: Plahvatusohtude ekspert erilisest eliitüksusest.

source: Mr. Volcano
et: Härra Vulkaan

source: This seemingly mild-mannered creature has an extremely volatile temper.
et: See näiliselt leebe loomaga olend on äärmiselt plahvatusohtliku iseloomuga.

source: Darkfire Soldier #2
et: Pimedatule Sõdur #2

source: A warrior who gained immeasurable power from the heart of a volcano.
et: Sõdalane, kes sai mõõtmatu jõu vulkaani südamest.

source: When your opponent's monster attacks this card in face-down Defense Position, this card becomes an Equip Spell Card equipped to the attacking monster (No damage calculation is conducted). During each of your opponent's Standby Phases, increase your Life Points by half of the ATK of the monster equipped with this card.
et: Kui sinu vastase koletis ründab seda kaarti näoga allpool Kaitsepositsioonis, muutub see kaart Varustuse Loitsukaardiks, mis on varustatud ründava koletisega (kahju arvutamist ei toimu). Iga sinu vastase Ootefaaside ajal suurenda oma Elupunkte selle koletise rünnakujõu poole võrra, millele see kaart on varustatud.

source: Cyber Falcon
et: Küberpistrik

source: A jet-powered hawk that travels at the speed of sound.
et: Reaktiivmootoriga kull, mis liigub helikiirusel.

source: Dark Bat
et: Tume Nahkhiir

source: Bats from the netherworld that use their hyper senses to detect their enemies.
et: Allilmaailma nahkhiired, kes kasutavad oma hüpertundlikkust, et tuvastada oma vaenlasi.

source: Flying Kamakiri #2
et: Lendav Kamakiri #2

source: A flying mantis that feeds primarily on insects.
et: Lendav palvetaja, kes toitub peamiselt putukatest.

source: Harpie's Brother
et: Harpy vend

source: With eyes like a hawk and a flying speed exceeding Mach 5, this monster is a master of the sky.
et: Kullipilgu ja lennukiirusega, mis ületab Mach 5, on see koletis taeva meister.

source: An armored tank possessed by a fiend that will pursue enemies until they're crushed.
et: Soomuse valduses olev soomustatud tank, mis jälitab vaenlasi, kuni nad on purustatud.

source: Overdrive
et: Ülekiirus

source: An all-terrain armored vehicle armed with a heavy-duty machine gun.
et: Raske kuulipildujaga relvastatud maastikusoomuk.

source: This card gains 500 ATK for each Dragon-Type monster your opponent has on the field or in their Graveyard.
et: See kaart saab 500 ATK iga Draakoni-tüüpi koletise eest, mis on sinu vastasel väljakul või nende Hauas.

source: Time Seal
et: Aja Pitser

source: Skip the Draw Phase of your opponent's next turn.
et: Jäta oma vastase järgmise käigu tõmbamisfaas vahele.

source: Graverobber
et: Hauaröövel

source: Select 1 Spell Card from your opponent's Graveyard. You can use it as your hand until the end of the turn. If you use it, you take 2000 points of damage.
et: Vali oma vastase kalmistult 1 loitsukaart. Sa saad seda kasutada oma käena kuni käigu lõpuni. Kui sa seda kasutad, saad 2000 punkti kahju.
