Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: This card cannot be Special Summoned. This card cannot be Normal Summoned or Set except by Tributing 3 monsters. Your opponent cannot activate Spell or Trap Cards until the end of their 2nd turn after this card is Normal Summoned. The ATK and DEF of this card are each 100 points higher than the highest face-up monster's ATK on the field (except1 "<M7091>The Wicked Avatar<M>").
et: Seda kaarti ei saa eriliselt kutsuda. Seda kaarti ei saa normaalselt kutsuda ega asetada, välja arvatud 3 koletise ohverdamise teel. Sinu vastane ei saa aktiveerida Loitsu- ega Lõksukaarte kuni nende 2. käigu lõpuni pärast selle kaardi normaalselt kutsumist. Selle kaardi ATK ja DEF on igaüks 100 punkti kõrgemad kui kõrgeima avatud koletise ATK väljakul (välja arvatud "<M7091>The Wicked Avatar<M>").

source: The Wicked Eraser
et: <translatedÕel Eraser

source: This card cannot be Special Summoned. This card cannot be Normal Summoned or Set except by Tributing 3 monsters. The ATK and DEF of this card are each equal to the number of cards your opponent controls x 1000. When this card is destroyed and sent to the Graveyard, destroy all cards on the field. During your Main Phase, you can destroy this card.
et: Seda kaarti ei saa eriliselt kutsuda. Seda kaarti ei saa normaalselt kutsuda ega asetada, välja arvatud 3 koletise ohverdamise teel. Selle kaardi ATK ja DEF on võrdsed vastase kontrollitavate kaartide arvuga x 1000. Kui see kaart hävitatakse ja saadetakse hauakambrisse, hävita kõik kaardid väljakul. Oma peafaasis saad selle kaardi hävitada.

source: Spell Striker
et: Loitsulööja

source: You can remove from play 1 Spell Card from your Graveyard to Special Summon this card. This card can attack your opponent directly. You take no Battle Damage from battles involving this card.
et: Saad oma kalmistult mängust eemaldada 1 loitsukaardi, et eriliselt kutsuda see kaart. See kaart võib rünnata otse sinu vastast. Sa ei saa lahingukahju lahingutest, milles see kaart osaleb.

source: Exploder Dragon
et: Plahvatav Draakon

source: When this card is destroyed by battle and sent to the Graveyard, destroy the monster that destroyed it. While this card is attacking, any Battle Damage either player takes from a battle involving this card becomes 0.
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse, hävita koletis, mis selle hävitas. Kui see kaart ründab, muutub selle kaardiga seotud lahingus saadud lahingukahju mõlemale mängijale 0-ks.

source: Destiny HERO - Disk Commander
et: Saatus KANGELANE - Kettakäskija

source: When this card is Special Summoned from the Graveyard: Draw 2 cards.
et: Kui see kaart on eriliselt välja kutsutud hauakambrist: Tõmba 2 kaarti.

source: Destiny HERO - Plasma
et: Saatus KANGELANE - Plasma

source: Cannot be Normal Summoned or Set. Must be Special Summoned (from your hand) by Tributing 3 monsters you control, and cannot be Special Summoned by other ways. Negate the effects of all face-up monsters your opponent controls. Once per turn: You can target 1 monster your opponent controls; equip that target to this card, and this card gains ATK equal to half the ATK of that equipped monster (you can only equip 1 monster at a time to this card with this effect).
et: Ei saa olla normaalset kutsutud ega seatud. Peab olema eriliselt kutsutud (teie käest) ohverdades 3 koletist, mida te kontrollite, ja ei saa olla eriliselt kutsutud muul viisil. Tühista kõigi vastase kontrollitavate avatud koletiste efektid. Kord käigu jooksul: Saate sihtida 1 koletist, mida teie vastane kontrollib; varustage see sihtmärk sellele kaardile ja see kaart saab ATK-d, mis on võrdne poolega selle varustatud koletise ATK-st (saate selle efektiga korraga varustada sellele kaardile ainult 1 koletise).

source: Volcanic Blaster
et: Vulkaani Plahvataja

source: When this card is destroyed and sent to the Graveyard by battle, you can place 1 "Volcanic" monster in your Deck on top of your Deck.
et: Kui see kaart hävitatakse ja saadetakse lahingus Hauakambrisse, võid asetada 1 "Vulkaaniline" koletis oma pakist oma paki peale.

source: Volcanic Slicer
et: Vulkaani Viilutaja

source: Once per turn, you can inflict 500 damage to your opponent. If you activate this effect, this card cannot attack during this turn.
et: Korra ühe käigu jooksul saad oma vastasele tekitada 500 kahju. Kui aktiveerid selle efekti, ei saa see kaart sellel käigul rünnata.

source: Volcanic Hammerer
et: Vulkaanihaamr

source: Once per turn, you can inflict damage to your opponent equal to the number of "Volcanic" monsters in your Graveyard x 200. If you activate this effect, this card cannot attack during this turn.
et: Korra ühe korra käigu jooksul saad oma vastasele tekitada kahju, mis on võrdne sinu Hauakambris olevate "Volcanic" koletiste arvuga x 200. Kui aktiveerid selle efekti, ei saa see kaart sellel käigul rünnata.

source: Elemental HERO Captain Gold
et: Elementaalne KANGELANE Kapten Kuld

source: You can discard this card to the Graveyard; add 1 "<M6399>Skyscraper<M>" from your Deck to your hand. If "<M6399>Skyscraper<M>" is not face-up on the field, destroy this card.
et: Saad selle kaardi Hauakambrisse saata; lisa 1 "<M6399>Skyscraper<M>" oma pakist oma kätte. Kui "<M6399>Skyscraper<M>" ei ole väljal avatud, hävita see kaart.

source: Gravekeeper's Commandant
et: Hauakaevurite Komandant

source: You can discard this card to the Graveyard to add 1 "<M5533>Necrovalley<M>" from your Deck to your hand.
et: Saad selle kaardi Hauakambrisse, et lisada oma pakist 1 "<M5533>Necrovalley<M>" oma kätte.

source: Warrior of Atlantis
et: Atlantise sõdalane

source: You can discard this card to the Graveyard to add 1 "<M5387>A Legendary Ocean<M>" from your Deck to your hand.
et: Saad selle kaardi Hauakambrisse saata, et lisada oma pakist 1 "<M5387>Legendaarne Ookean<M>" oma kätte.

source: Destroyersaurus
et: Hävitajasaurus

source: You can discard this card to the Graveyard to add 1 "<M6823>Jurassic World<M>" from your Deck to your hand.
et: Saad selle kaardi Hauakambrisse, et lisada oma pakist 1 "<M6823>Jurassic World<M>" oma kätte.

source: Zeradia, Herald of Heaven
et: Zeradia, Taeva Kuulutaja

source: You can discard this card to the Graveyard to add 1 "<M5982>The Sanctuary in the Sky<M>" from your Deck to your hand. If "<M5982>The Sanctuary in the Sky<M>" is not face-up on the field, destroy this card.
et: Saad selle kaardi Hauakambrisse, et lisada oma pakist 1 "<M5982>The Sanctuary in the Sky<M>" oma kätte. Kui "<M5982>The Sanctuary in the Sky<M>" ei ole väljakul avatud, hävita see kaart.

source: Archfiend General
et: Kuradikindral

source: You can discard this card to the Graveyard to add 1 "<M5791>Pandemonium<M>" from your Deck to your hand. If this card is on the field but "<M5791>Pandemonium<M>" is not on the field, destroy this card.
et: Saad selle kaardi Hauakambrisse, et lisada oma pakist 1 "<M5791>Pandemonium<M>" oma kätte. Kui see kaart on väljal, kuid "<M5791>Pandemonium<M>" ei ole väljal, hävita see kaart.

source: Harpie Queen
et: Harpyia Kuninganna

source: You can discard this card to the Graveyard to add 1 "<M6207>Harpies' Hunting Ground<M>" from your Deck to your hand. This card's name is treated as "<M4068>Harpie Lady<M>" while it is on the field or in the Graveyard.
et: Saad selle kaardi Hauakambrisse, et lisada oma pakist 1 "<M6207>Harpyide Jahimaad<M>" oma kätte. Selle kaardi nimeks loetakse "<M4068>Harpyide Leedi<M>", kui see on väljakul või Hauakambris.

source: Sky Scourge Enrise
et: Taevane nuhtleja Enrise

source: This card cannot be Normal Summoned or Set. This card cannot be Special Summoned except by removing from play 3 LIGHT Fairy-Type monsters and 1 DARK Fiend-Type monster in your Graveyard. Once per turn, you can remove from play 1 face-up monster on the field. If you activate this effect, this card cannot attack during this turn.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti ei saa eriliselt kutsuda, välja arvatud juhul, kui eemaldate mängust 3 VALGUS haldjatüüpi koletist ja 1 PIMEDUS deemonitüüpi koletise oma hauakambrist. Kord käigu jooksul saate eemaldata mängust ühe avatud koletise väljakul. Kui aktiveerite selle efekti, ei saa see kaart sellel käigul rünnata.

source: Sky Scourge Norleras
et: Taevane nuhtleja Norleras

source: This card cannot be Normal Summoned or Set. This card cannot be Special Summoned except by removing from play 1 LIGHT Fairy-Type monster and 3 DARK Fiend-Type monsters in your Graveyard. You can pay 1000 Life Points to send all cards on the field and in both players' hands to the Graveyard, then you draw 1 card.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti ei saa eriliselt kutsuda, välja arvatud eemaldades mängust 1 VALGUS haldjatüüpi koletise ja 3 PIMEDUS deemonitüüpi koletist oma hauakambris. Sa võid maksta 1000 elupunkti, et saata kõik kaardid väljakul ja mõlema mängija käes hauakambrisse, seejärel tõmbad 1 kaardi.

source: Sky Scourge Invicil
et: Taevane nuhtleja Invicil

source: This card cannot be Special Summoned. If you Tribute Summon this card by Tributing 1 of the following monsters, this card gets the appropriate effect:<BR>● LIGHT Fairy-Type monster: Negate the effects of all Spell Cards.<BR>● DARK Fiend-Type monster: Negate the effects of all Trap Cards.
et: Seda kaarti ei saa eriliselt kutsuda. Kui sa ohverdad selle kaardi kutsumiseks ühe järgmistest koletistest, saab see kaart vastava efekti:<BR>● VALGUS Haldja-tüüpi koletis: Tühista kõigi Loitsukaartide efektid.<BR>● PIMEDUS Deemon-tüüpi koletis: Tühista kõigi Lõksukaartide efektid.

source: Goe Goe the Gallant Ninja
et: Vapper Ninja Goe Goe

source: When this card inflicts Battle Damage to your opponent while they have 5 or more cards in their hand, discard 2 random cards from their hand.
et: Kui see kaart tekitab lahingukahju sinu vastasele, kui tal on käes 5 või rohkem kaarti, viska tema käest juhuslikult ära 2 kaarti.

source: Mei-Kou, master of Barriers
et: Mei-Kou, Barjääride Meister

source: You can Tribute this card to destroy 1 face-up Continuous Spell or Continuous Trap Card on the field.
et: Saad selle kaardi ohverdada, et hävitada 1 avatud pidev Võlu- või Lõksukaart väljal.

source: Raiza the Storm Monarch
et: Tormimoonak Raiza

source: When this card is Tribute Summoned, return 1 card on the field to the top of its owner's Deck.
et: Kui see kaart on ohverdamisega välja kutsutud, tagasta 1 kaart väljakul selle omaniku paki peale.

source: Seismic Crasher
et: Seismiline Purustaja

source: Twice per turn, you can send 1 face-up Continuous Spell or Continuous Trap Card you control to the Graveyard to inflict 500 damage to your opponent.
et: Kaks korda käigu jooksul võid saata 1 avatud pideva loitsu või pideva lõksukaardi, mida sa kontrollid, hauakambrisse, et tekitada oma vastasele 500 kahju.

source: Dweller in the Depths
et: Sügavuste Elanik

source: This card gains 300 ATK for each face-up Continuous Spell Card you control.
et: See kaart saab 300 ATK iga avatud pideva loitsukaardi eest, mida sa kontrollid.

source: Magna-Slash Dragon
et: Magna-Slash Draakon

source: You can send 1 face-up Continuous Spell Card you control to the Graveyard to destroy 1 Spell or Trap Card your opponent controls.
et: Saad ühe oma kontrollitava avatud pideva võlukaardi kalmistule saata, et hävitada üks vastase kontrollitav võlu- või lõksukaart.

source: Gravi-Crush Dragon
et: Gravi-Purustaja Draakon

source: You can send 1 face-up Continuous Spell Card you control to the Graveyard to destroy 1 monster your opponent controls.
et: Saad ühe oma kontrollitava avatud pideva võlukaardi kalmistule, et hävitada üks vastase kontrollitav koletis.

source: Crystal Blessing
et: Kristalliõnnistus

source: Target up to 2 "Crystal Beast" monsters in your Graveyard; place those targets face-up in your Spell & Trap Card Zone as Continuous Spell Cards.
et: Vali kuni 2 "Crystal Beast" koletist oma Hauakambris; aseta need sihtmärgid oma Loitsu ja Lõksu Kaardi Tsooni ülespoole pidevate Loitsukaartidena.

source: Crystal Abundance
et: Kristalli Küllus

source: Send 4 "Crystal Beast" cards from your Spell & Trap Card Zone to the Graveyard; send all cards on the field to the Graveyard, then Special Summon as many "Crystal Beast" monsters as possible from your Graveyard, up to the number of cards your opponent controlled that were sent to the Graveyard by this card's effect.
et: Saada 4 "Kristallolendi" kaarti oma Võlu- ja Lõksukaartide alast Hauakambrisse; saada kõik kaardid väljakult Hauakambrisse, seejärel Kutsu Eriliselt välja nii palju "Kristallolendi" koletisi kui võimalik oma Hauakambrist, kuni nende kaartide arvuni, mida sinu vastane kontrollis ja mis saadeti selle kaardi efekti tõttu Hauakambrisse.

source: Crystal Promise
et: Kristalli Lubadus

source: Target 1 "Crystal Beast" card in your Spell & Trap Card Zone; Special Summon that target.
et: Sihtige 1 "Kristallolendi" kaart oma Loitsu & Lõksu Kaarditsoonis; Kutsu see sihtmärk eriliselt välja.

source: Lucky Iron Axe
et: Õnnelik Raudkirves

source: The equipped monster gains 500 ATK. When this face-up card on the field is destroyed by your opponent's card effect and sent to the Graveyard: Draw 1 card.
et: Varustatud koletis saab 500 ATK juurde. Kui see avatud kaart väljal hävitatakse sinu vastase kaardi efekti tõttu ja saadetakse Hauakambrisse: Tõmba 1 kaart.

source: Tornado
et: Tornaado

source: Activate only when there are 3 or more cards in your opponent's Spell & Trap Card Zone. Destroy 1 card in your opponent's Spell & Trap Card Zone.
et: Aktiveeri ainult siis, kui sinu vastase Loitsu- ja Lõksukaartide alas on 3 või rohkem kaarti. Hävita 1 kaart sinu vastase Loitsu- ja Lõksukaartide alas.

source: Field Barrier
et: Väljatõke

source: Field Spell Cards cannot be destroyed. Also, a new Field Spell Card cannot be activated. You can only control 1 face-up1 "<M7127>Field Barrier<M>".
et: Väljaloovustuskaarte ei saa hävitada. Samuti ei saa aktiveerida uut väljaloovustuskaarti. Sa saad kontrollida ainult 1 avatud "<M7127>Field Barrier<M>".

source: A Cell Breeding Device
et: Rakuaret kasvatamise seade

source: During each of your Standby Phases, put 1 A-Counter on 1 face-up monster your opponent controls.
et: Iga oma ootejärgu ajal pane 1 A-loendur ühele vastase avatud koletisele.

source: Otherworld - The "A" Zone
et: Teispoolsus - "A" tsoon

source: If your opponent's monster battles with an "Alien" monster you control, the opponent's monster loses 300 ATK and DEF during damage calculation only.
et: Kui sinu vastase koletis võitleb sinu kontrollitava "Tulnuka" koletisega, kaotab vastase koletis 300 ATK ja DEF ainult kahju arvutamise ajal.

source: Crystal Raigeki
et: Kristallraigeki

source: Send 1 "Crystal Beast" card from your Spell & Trap Card Zone to the Graveyard to target 1 card your opponent controls; destroy that target.
et: Saada 1 "Kristallolendi" kaart oma Võlu- ja Lõksukaartide alast Hauakambrisse, et sihtida 1 kaarti, mida sinu vastane kontrollib; hävita see sihtmärk.

source: Volcanic Recharge
et: Vulkaani Laadimine

source: Return up to 3 "Volcanic" Monster Cards from your Graveyard to your Deck.
et: Tagasta kuni 3 "Vulkaanilise" koletise kaarti oma kalmistult tagasi oma pakki.

source: Terrible Deal
et: Kohutav tehing

source: Activate only by paying 1000 Life Points when your opponent activates a Spell Card. Your opponent discards 1 random card.
et: Aktiveeri ainult 1000 Elupunkti maksmisega, kui sinu vastane aktiveerib Loitsukaardi. Sinu vastane viskab ära 1 juhusliku kaardi.

source: Breakthrough!
et: Läbimurre!

source: Select 1 "Six Samurai" monster you control. If the selected monster destroys an opponent's monster by battle, "<M6969>Great Shogun Shien<M>" and all "Six Samurai" monsters you control can attack your opponent directly during the Battle Phase of this turn.
et: Vali 1 "Six Samurai" koletis, mida sa kontrollid. Kui valitud koletis hävitab lahingus vastase koletise, saavad "<M6969>Great Shogun Shien<M>" ja kõik "Six Samurai" koletised, mida sa kontrollid, rünnata vastast otse selle käigu Lahingufaasis.

source: Backs to the Wall
et: Seljad vastu seina

source: Pay Life Points so that you only have 100 left. Special Summon as many "Six Samurai" monsters from your Graveyard as possible. You cannot Special Summon more than 1 monster with the same name, or a monster that has the same name as a monster you already control.
et: Makske Elupunkte, nii et sul jääb alles ainult 100. Kutsu välja nii palju "Kuue Samuraid" koletisi oma Hauakambrist kui võimalik. Sa ei saa eriliselt välja kutsuda rohkem kui 1 koletist sama nimega või koletist, millel on sama nimi kui koletisel, mida sa juba kontrollid.

source: Introduction to Gallantry
et: Sissejuhatus galantsusesse

source: Activate only when your opponent has 5 or more cards in their hand. Your opponent discards 1 random card.
et: Aktiveeri ainult siis, kui sinu vastasel on käes 5 või rohkem kaarti. Sinu vastane viskab juhuslikult ühe kaardi ära.

source: Secrets of the Gallant
et: Vapruste saladused

source: Select 1 Normal Monster you control. When the selected monster inflicts Battle Damage to your opponent this turn, your opponent discards 2 random cards.
et: Vali 1 Tavaline Koletis, mida sa kontrollid. Kui valitud koletis tekitab sellel käigul lahingukahju sinu vastasele, siis sinu vastane viskab juhuslikult 2 kaarti ära.

source: Radiant Mirror Force
et: Kiirgav Peegeljõud

source: Activate only when your opponent declares an attack while they control 3 or more Attack Position monsters. Destroy all Attack Position monsters your opponent controls.
et: Aktiveeri ainult siis, kui sinu vastane kuulutab välja rünnaku, kui tal on kontrolli all 3 või enam rünnakupositsioonis olevat koletist. Hävita kõik rünnakupositsioonis olevad koletised, mida sinu vastane kontrollib.

source: Hard-sellin' Goblin
et: Raske müügiga Goblin

source: Each time a monster you control inflicts Battle Damage to your opponent, return 1 card in your opponent's Spell & Trap Card Zone to its owner's hand.
et: Iga kord, kui sinu kontrolli all olev koletis tekitab vastasele lahingukahju, tagasta 1 kaart vastase Võlu- ja Lõksukaartide alalt selle omaniku kätte.

source: Hard-sellin' Zombie
et: Pealetükkiv Zombi

source: Each time a monster you control inflicts Battle Damage to your opponent, select 1 card from your opponent's Graveyard and return it to the bottom of their Deck.
et: Iga kord, kui sinu kontrollitav koletis tekitab vastasele lahingukahju, vali 1 kaart vastase hauakambrist ja tagasta see nende paki põhja.

source: Mass Hypnosis
et: Massihüpnoos

source: Activate only while you control an "Alien" monster. Select and take control of up to 3 of your opponent's monsters that each have an A-Counter(s) on them. This card is destroyed during the End Phase of the turn it is activated.
et: Aktiveeri ainult siis, kui sa kontrollid "Alien" koletist. Vali ja võta kontrolli alla kuni 3 vastase koletist, millel on A-loendur(id). See kaart hävitatakse käigu lõppfaasis, mil see aktiveeriti.

source: Gem Flash Energy
et: Gemmi Välgu Energia

source: During each of your Standby Phases, inflict damage to your opponent equal to the number of face-up Continuous Spell Card on the field x 300.
et: Iga oma ootejärgu ajal tee vastasele kahju, mis on võrdne väljaku peal olevate avatud Pidevate Loitsukaartide arvuga x 300.

source: When this card inflicts Battle Damage to your opponent, send 1 card from the top of your opponent's Deck to the Graveyard for each face-up LIGHT monster you control.
et: Kui see kaart tekitab lahingukahju sinu vastasele, saada 1 kaart oma vastase paki pealt hauakambrisse iga ülespoole suunatud VALGUSE koletise eest, mida sa kontrollid.

source: Botanical Lion
et: Botaaniline Lõvi

source: This card gains 300 ATK for each face-up Plant-Type monster you control. Control of this face-up card cannot switch.
et: See kaart saab 300 ATK iga avatud Taimetüüpi koletise eest, mida sa kontrollid. Selle avatud kaardi kontrolli ei saa vahetada.

source: Gravity Behemoth
et: Gravitatsiooni Behemot

source: If it is not the first turn of the Duel and there are no cards on the field, you can Normal Summon this card without Tributing. You can destroy all Field Spell Cards on the field. This card cannot attack the turn you activate this effect.
et: Kui see ei ole Duelli esimene käik ja väljakul ei ole kaarte, saad selle kaardi Normaal-Kutsuda ilma ohverdamiseta. Saad hävitada kõik Väljaloitsukaardid väljakul. See kaart ei saa rünnata käigul, mil aktiveerid selle efekti.

source: Grandmaster of the Six Samurai
et: Kuue Samuraide Suurmeister

source: You can only control 1 face-up1 "<M7145>Grandmaster of the Six Samurai<M>". While you control a face-up "Six Samurai" monster(s), you can Special Summon this card (from your hand). When this card is destroyed by your opponent's card effect: Target 1 "Six Samurai" monster in your Graveyard; add that target to your hand.
et: Saad kontrollida ainult ühte avatud "<M7145>Kuue Samuraide Suurmeister<M>". Kui sa kontrollid avatud "Kuue Samuraide" koletist(eid), saad selle kaardi (oma käest) eriliselt kutsuda. Kui see kaart hävitatakse sinu vastase kaardi efekti tõttu: Sihti 1 "Kuue Samuraide" koletis oma Hauas; lisa see sihtmärk oma kätte.

source: Diabolos, King of the Abyss
et: Diabolos, Kuristiku Kuningas

source: This card cannot be Special Summoned. If you Tribute Summon this card, the Tributes must be DARK. This card cannot be Tributed by a card's effect. During your opponent's Draw Phase, before their draw, look at the top card of their Deck, then put that card on the top or bottom of their Deck.
et: Seda kaarti ei saa eriliselt kutsuda. Kui sa kutsud selle kaardi ohverdades, peavad ohvrid olema PIMEDAD. Seda kaarti ei saa ohverdada kaardi efekti tõttu. Sinu vastase tõmbefaasis, enne nende tõmmet, vaata nende paki ülemist kaarti, seejärel pane see kaart nende paki ülemisele või alumisele osale.

source: Lich Lord, King of the Underworld
et: Allilord, Allilmaailma Kuningas

source: If you Tribute Summon this card, the Tribute must be DARK. If this card is Tributed by a card's effect and sent to the Graveyard, it returns to its owner's hand.
et: Kui sa ohverdad selle kaardi, peab ohver olema PIMEDUS. Kui see kaart ohverdatakse kaardi efekti tõttu ja saadetakse Hauakambrisse, naaseb see omaniku kätte.

source: Prometheus, King of the Shadows
et: Prometheus, Varjude Kuningas

source: When you Normal Summon this card, remove from play any number of DARK monsters from your Graveyard. This card gains 400 ATK for each removed card, until the End Phase of this turn.
et: Kui sa kutsud selle kaardi normaalselt välja, eemalda oma kalmistult mängust suvaline arv PIMEDAID koletisi. See kaart saab iga eemaldatud kaardi eest 400 ATK-d juurde kuni selle käigu lõppfaasini.

source: Mist Archfiend
et: Udu Kuradik

source: You can Normal Summon this card without Tributing. If you do, during the End Phase it is destroyed and you take 1000 damage.
et: Seda kaarti saab tavaliselt välja kutsuda ilma ohverdusteta. Kui teete seda, hävitatakse see lõppfaasis ja te saate 1000 kahju.

source: Plague Wolf
et: Katkukoer

source: Once per turn, you can change this card's ATK to twice its original ATK. If you do, destroy it during the End Phase.
et: Korra ühe käigu jooksul saad selle kaardi ATK muuta kahekordseks selle algsest ATK-st. Kui teed seda, hävita see End Phase'i ajal.

source: Recurring Nightmare
et: Korduv õudusunenägu

source: Select 2 DARK monsters with 0 DEF in your Graveyard and return them to your hand.
et: Vali oma kalmistult 2 PIMEDUST koletist, millel on 0 DEF, ja tagasta need oma kätte.

source: Sword of Dark Rites
et: Pimedate Riituste Mõõk
