Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: This card cannot be Special Summoned. This card returns to its owner's hand during the End Phase of the turn it is Normal Summoned or flipped face-up. When this card inflicts Battle Damage to your opponent, draw cards until you have 5 cards in your hand.
et: Seda kaarti ei saa eriliselt kutsuda. See kaart naaseb omaniku kätte selle käigu lõppfaasis, mil see on tavakutsutud või ümber pööratud. Kui see kaart tekitab lahingukahju sinu vastasele, tõmba kaarte, kuni sul on käes 5 kaarti.

source: Great Long Nose
et: Suur Pikk Nina

source: This card cannot be Special Summoned. This card returns to the owner's hand during the End Phase of the turn that this card is Normal Summoned or flipped face-up. If this card inflicts Battle Damage to your opponent's Life Points, your opponent skips their next Battle Phase.
et: Seda kaarti ei saa eriliselt kutsuda. See kaart naaseb omaniku kätte selle käigu lõppfaasis, mil see kaart on tavakutsutud või ümber pööratud. Kui see kaart tekitab lahingukahju sinu vastase elupunktidele, jätab sinu vastane oma järgmise lahingufaasi vahele.

source: This card cannot be Special Summoned. This card returns to the owner's hand during the End Phase of the turn that this card is Normal Summoned or flipped face-up. When this card is Normal Summoned or flipped face-up, you can change the Battle position of 1 face-up monster on your opponent's side of the field.
et: Seda kaarti ei saa eriliselt kutsuda. See kaart naaseb omaniku kätte selle käigu lõppfaasis, mil see kaart on tavakutsutud või ümber pööratud. Kui see kaart on tavakutsutud või ümber pööratud, saad muuta ühe vastase väljaku avatud koletise lahinguasendit.

source: This card cannot be Special Summoned. This card returns to its owner's hand during the End Phase of the turn it is Normal Summoned or flipped face-up. If this card inflicts Battle Damage to your opponent, they discard all cards in their hand during the next Draw Phase, before they draw.
et: Seda kaarti ei saa eriliselt kutsuda. See kaart naaseb omaniku kätte selle käigu lõppfaasis, mil see on normaalselt kutsutud või ümber pööratud. Kui see kaart tekitab lahingukahju sinu vastasele, siis nad viskavad kõik kaardid oma käest järgmise tõmbefaasi ajal ära, enne kui nad tõmbavad.

source: Asura Priest
et: Asura Preester

source: This card cannot be Special Summoned. This card returns to its owner's hand during the End Phase of the turn it is Normal Summoned or flipped face-up. This card can attack all monsters your opponent controls once each. This monster cannot attack directly if it has already attacked a monster.
et: Seda kaarti ei saa eriliselt kutsuda. See kaart naaseb omaniku kätte selle käigu lõppfaasis, mil see on tavakutsutud või ümber pööratud. See kaart võib rünnata kõiki vastase kontrollitavaid koletisi üks kord. See koletis ei saa rünnata otse, kui ta on juba rünnanud mõnda koletist.

source: This card cannot be Special Summoned. This card returns to the owner's hand during the End Phase of the turn that this card is Normal Summoned or flipped face-up. When this card inflicts Battle Damage to your opponent's Life Points, increase your Life Points by an amount equal to the Battle Damage.
et: Seda kaarti ei saa eriliselt kutsuda. See kaart naaseb omaniku kätte selle käigu lõppfaasis, mil see kaart on normaalselt kutsutud või ümber pööratud. Kui see kaart tekitab lahingukahju sinu vastase elupunktidele, suurenda oma elupunkte lahingukahjuga võrdse summa võrra.

source: Super Robolady
et: Super Robodaam

source: "<M5072>Robolady<M>" + "<M5073>Roboyarou<M>"<BR>You can Special Summon "<M5384>Super Roboyarou<M>" by returning this card from the field to the Extra Deck. You cannot use this effect during the same turn this card is Special Summoned. In addition, increase the ATK of this monster by 1000 points during the Damage Step when this monster inflicts Direct Damage to your opponent's Life Points.
et: "<M5072>Robolady<M>" + "<M5073>Roboyarou<M>"<BR>Saad kutsuda eriliselt välja "<M5384>Super Roboyarou<M>", tagastades selle kaardi väljakult Ekstra Teki. Sa ei saa seda efekti kasutada samal käigul, kui see kaart kutsuti eriliselt välja. Lisaks suurenda selle koletise ATK-d 1000 punkti võrra Kahjustuse Samme ajal, kui see koletis tekitab otsest kahju sinu vastase Elupunktidele.

source: "<M5073>Roboyarou<M>" + "<M5072>Robolady<M>"<BR>You can Special Summon "<M5383>Super Robolady<M>" by returning this card from the field to the Extra Deck. You cannot use this effect during the same turn this monster is Special Summoned. In addition, increase the ATK of this monster by 1000 points during the Damage Step when this monster inflicts Direct Damage to your opponent's Life Points.
et: "<M5073>Roboyarou<M>" + "<M5072>Robolady<M>"<BR>Saad eriliselt välja kutsuda "<M5383>Super Robolady<M>", tagastades selle kaardi väljakult Ekstra Teki. Sa ei saa seda efekti kasutada samal käigul, kui see koletis eriliselt välja kutsutakse. Lisaks suurenda selle koletise ATK-d 1000 punkti võrra Kahjustuse Samme ajal, kui see koletis tekitab otsest kahju sinu vastase Elupunktidele.

source: Fengsheng Mirror
et: Fengsheng Peegel

source: Look at your opponent's hand. Select and discard 1 Spirit monster to the Graveyard if Spirit monsters exist in his/her hand.
et: Vaata oma vastase kätt. Vali ja viska 1 Vaimu koletis Hauakambrisse, kui tema käes on Vaimu koletisi.

source: Heart of Clear Water
et: Selge vee süda

source: If the equipped monster's ATK is 1300 or higher, this card is destroyed. The monster equipped with this card is not destroyed as a result of battle or by the effect of a card that targets the monster. (Damage calculation is applied normally.)
et: Kui varustatud koletise ATK on 1300 või kõrgem, hävitatakse see kaart. Selle kaardiga varustatud koletist ei hävitata lahingu tulemusena ega kaardi efekti tõttu, mis sihib koletist. (Kahju arvutamine toimub tavapäraselt.)

source: A Legendary Ocean
et: Legendaarne Ookean

source: This card's name is treated as "<M4340>Umi<M>". Reduce the Level of all WATER monsters in both player's hands and on the field by 1. All WATER monsters gains 200 ATK and DEF.
et: Selle kaardi nimeks loetakse "<M4340>Umi<M>". Vähenda kõigi MERE koletiste taset mõlema mängija käes ja väljakul 1 võrra. Kõik MERE koletised saavad 200 ATK ja DEF juurde.

source: Fusion Sword Murasame Blade
et: Fusioni mõõk Murasame tera

source: This card can only be equipped to Warrior-Type monsters. A monster equipped with this card increases its ATK by 800 points. This card cannot be destroyed by effects that destroy Spell Cards.
et: Seda kaarti saab varustada ainult Sõdalase-tüüpi koletistele. Selle kaardiga varustatud koletise ATK suureneb 800 punkti võrra. Seda kaarti ei saa hävitada loitsukaartide hävitamise efektidega.

source: Smoke Grenade of the Thief
et: Varas suitsugranaat

source: When this Equip Spell Card is active and is destroyed by a card effect, look at your opponent's hand. Select 1 card from their hand and discard it to the Graveyard.
et: Kui see Varustuse Võlukaart on aktiivne ja hävitatakse kaardi efekti tõttu, vaata oma vastase kätt. Vali 1 kaart nende käest ja viska see Hauakambrisse.

source: Spiritual Energy Settle Machine
et: Vaimse Energia Settimise Masin

source: As long as this card remains face-up on the field, all Spirit monsters remain face-up on the field and do not return to their owners' hand during the End Phase even if they are Normal Summoned or flipped face-up. Discard 1 card from your hand to the Graveyard during each of your End Phases. If you do not, destroy this card. When this card is removed from the field, all face-up Spirit monsters return to the owners' hands.
et: Niikaua kui see kaart jääb väljale avatud olekus, jäävad kõik Vaimu koletised väljale avatud olekus ja ei naase oma omanike kätte lõppfaasis, isegi kui nad on normaalselt kutsutud või avatud. Iga oma lõppfaasi ajal viska 1 kaart oma käest hauakambrisse. Kui sa seda ei tee, hävita see kaart. Kui see kaart eemaldatakse väljalt, naasevad kõik avatud Vaimu koletised omanike kätte.

source: Second Coin Toss
et: Teine mündivise

source: As long as this card remains face-up on the field, you can negate the effects of a card requiring a coin toss once per turn and redo the coin toss.
et: Niikaua kui see kaart jääb väljale avatud olekusse, saad kord käigu jooksul tühistada mündiviske nõudva kaardi efekti ja teha mündiviske uuesti.

source: Convulsion of Nature
et: Looduse Kramp

source: As long as this card remains face-up on the field, both players must turn their respective Decks upside down and proceed with the current Duel.
et: Niikaua kui see kaart jääb väljale avatud olekus, peavad mõlemad mängijad oma vastavad pakid tagurpidi pöörama ja jätkama praegust duelli.

source: The Secret of the Bandit
et: Bandii saladus

source: This card can only be activated during Main Phase 1. Select 1 face-up monster on the field. Each time the selected monster inflicts Battle Damage to your opponent's Life Points this turn, your opponent discards 1 random card.
et: Seda kaarti saab aktiveerida ainult peafaas 1 ajal. Vali 1 avatud koletis väljal. Iga kord, kui valitud koletis tekitab sellel käigul lahingukahju sinu vastase elupunktidele, viskab sinu vastane juhuslikult ühe kaardi ära.

source: After the Struggle
et: Pärast Võitlust

source: This card can only be activated during Main Phase 1. All monsters on both sides of the field that have been involved in damage calculation are destroyed during the End Step of the turn.
et: Seda kaarti saab aktiveerida ainult peafaasi 1 ajal. Kõik mõlemal pool väljakut olevad koletised, mis on osalenud kahju arvutamises, hävitatakse käigu lõpuetapis.

source: Magic Reflector
et: Maagiline Reflektor

source: Select 1 Spell Card that remains face-up on your side of the field and put 1 counter on it. If the selected card would be destroyed, the counter is removed instead.
et: Vali 1 Püüniskaart, mis jääb sinu väljaku poolele avatud ja pane sellele 1 loendur. Kui valitud kaart hävitatakse, eemaldatakse selle asemel loendur.

source: Blast with Chain
et: Plahvatus ketiga

source: After activation, this card is treated as an Equip Card that increases the ATK of the equipped monster by 500 points. Equip a monster on your side of the field with this card. If this card is destroyed by the effect of another card while it is an Equip Card, select 1 card on the field and destroy it.
et: Pärast aktiveerimist käsitletakse seda kaarti kui Varustuskaarti, mis suurendab varustatud koletise ATK-d 500 punkti võrra. Varusta selle kaardiga oma väljaku koletis. Kui see kaart hävitatakse teise kaardi efekti tõttu, kui see on Varustuskaart, vali 1 kaart väljal ja hävita see.

source: Disappear
et: Kao

source: Remove from play 1 card from your opponent's Graveyard.
et: Eemalda mängust 1 kaart oma vastase Hauakambrist.

source: Bubble Crash
et: Mullimull

source: This card can only be activated when any player has 6 or more cards on the field and/or in their hand. The player(s) then select and send cards to their respective Graveyards until the amount remaining on the field and in their hand is 5.
et: Seda kaarti saab aktiveerida ainult siis, kui mõnel mängijal on väljakul ja/või käes 6 või rohkem kaarti. Seejärel valivad mängijad kaardid ja saadavad need oma vastavatesse Hauakambritesse, kuni väljakule ja kätte jääb 5 kaarti.

source: Royal Oppression
et: Kuninglik rõhumine

source: Either player can pay 800 Life Points to negate the Special Summon of a monster(s), and/or an effect that Special Summons a monster(s), and destroy those cards.
et: Kumbki mängija võib maksta 800 Elupunkti, et tühistada koletise(te) Erikutsumine ja/või efekti, mis Erikutsub koletise(te), ning hävitada need kaardid.

source: Bottomless Trap Hole
et: Põhjatu Lõksuauk

source: Activate only when your opponent Summons a monster(s) with 1500 or more ATK. Destroy and remove from play the monster(s).
et: Aktiveeri ainult siis, kui su vastane kutsub välja koletise(d), millel on 1500 või rohkem rünnakupunkti. Hävita ja eemalda mängust koletis(ed).

source: During your Standby Phase, select 1 random card from your opponent's hand. Call the type of card (Monster, Spell, or Trap). If you call it right, inflict 700 points of damage to your opponent's Life Points. You can use this effect once per turn.
et: Oma Standby Phase'i ajal vali 1 juhuslik kaart oma vastase käest. Nimeta kaardi tüüp (Koletis, Loits või Lõks). Kui arvad õigesti, põhjusta oma vastase Elupunktidele 700 punkti kahju. Seda efekti saab kasutada kord ühe käigu jooksul.

source: Spirit's Invitation
et: Vaimu Kutsung

source: Each time your Spirit Monster returns to your hand, select 1 monster on your opponent's side of the field and return it to its owner's hand. Pay 500 Life Points during each of your Standby Phases. If you do not, this card is destroyed.
et: Iga kord, kui sinu Vaimukoletis sinu kätte tagasi pöördub, vali 1 koletis oma vastase väljaku poolelt ja saada see tagasi selle omaniku kätte. Maksa iga oma Ootefaaside ajal 500 Elupunkti. Kui sa seda ei tee, hävitatakse see kaart.

source: Nutrient Z
et: Toitainete Z

source: This card can only be activated during your opponent's Damage Step. During this turn, if you take Battle Damage of 2000 points or more, increase your Life Points by 4000 points before the damage is subtracted from your Life Points.
et: Seda kaarti saab aktiveerida ainult vastase Kahjustuse Etapi ajal. Sellel käigul, kui sa saad 2000 või rohkem lahingukahju, suurenda oma Elupunkte 4000 punkti võrra enne, kui kahju lahutatakse sinu Elupunktidest.

source: Drop Off
et: Äraandmine

source: This card can only be activated during your opponent's Draw Phase. Your opponent immediately discards from their hand to the Graveyard the card they drew.
et: Seda kaarti saab aktiveerida ainult vastase tõmbefaasis. Sinu vastane viskab kohe oma käest hauakambrisse kaardi, mille ta tõmbas.

source: Fiend Comedian
et: Deemonikomöödik

source: Toss a coin and call it. If you call it right, all of your opponent's cards in the Graveyard are removed from play immediately. If you call it wrong, send a number of cards equal to the number of cards in your opponent's Graveyard from your Deck to your Graveyard.
et: Viska münt ja ütle, kummale poole see kukub. Kui arvad õigesti, eemaldatakse kõik sinu vastase kaardid Hauakambrist mängust koheselt. Kui arvad valesti, saada oma pakist Hauakambrisse sama palju kaarte, kui on sinu vastase Hauakambris.

source: Last Turn
et: Viimane Pööre

source: This card can only be activated during your opponent's turn when your Life Points are 1000 or less. Select 1 monster on your side of the field and send all other cards on the field and in their respective owner's hands to their respective Graveyards. After that, your opponent selects and Special Summons 1 monster from their Deck in face-up Attack Position and attacks your selected monster. (Any Battle Damage from this battle is treated as 0.) The player whose monster remains alone on the field at the End Phase of this turn wins the Duel. Any other case results in a DRAW.
et: Seda kaarti saab aktiveerida ainult vastase käigu ajal, kui sinu Elupunktid on 1000 või vähem. Vali 1 koletis oma väljaku poolelt ja saada kõik teised kaardid väljakult ja nende omanike kätest nende omanike Hauakambrisse. Pärast seda valib vastane ja Kutsuge Eriliselt 1 koletis oma pakist ülespööratud Rünnakupositsioonis ja ründab sinu valitud koletist. (Selle lahingu lahingukahju loetakse nulliks.) Mängija, kelle koletis jääb selle käigu lõppfaasis ainsana väljale, võidab Duelli. Kõik muud juhtumid lõppevad VIIGIGA.

source: When this card destroys an opponent's monster by battle and sends it to the Graveyard, inflict 500 damage to your opponent. This card gains 200 ATK each time a Normal or Quick-Play Spell Card is activated, until the end of the turn. (This effect is even applied during your opponent's turn.)
et: Kui see kaart hävitab lahingus vastase koletise ja saadab selle Hauakambrisse, tekitab see vastasele 500 kahju. See kaart saab 200 ATK juurde iga kord, kui aktiveeritakse Tavaline või Kiirmängu Loitsukaart, kuni käigu lõpuni. (See efekt rakendub ka vastase käigu ajal.)

source: Kaiser Sea Horse
et: Kaiseri Merihobu

source: This card can be treated as 2 Tributes for the Tribute Summon of a LIGHT monster.
et: Seda kaarti võib käsitleda kui 2 ohverdust LIGHT koletise ohverdussummoniks.

source: Vampire Lord
et: Vampiiriisand

source: Each time this card inflicts Battle Damage to your opponent, declare 1 card type (Monster, Spell, or Trap). Your opponent selects 1 card of that type from their Deck and sends it to the Graveyard. Also, if this card is destroyed and sent from your field to your Graveyard by your opponent's card effect, it is Special Summoned to your side of the field during your next Standby Phase.
et: Iga kord, kui see kaart tekitab lahingukahju sinu vastasele, kuuluta välja 1 kaarditüüp (Koletis, Loits või Lõks). Sinu vastane valib oma pakist 1 selle tüübi kaardi ja saadab selle Hauakambrisse. Samuti, kui see kaart hävitatakse ja saadetakse sinu väljakult sinu Hauakambrisse sinu vastase kaardi efekti tõttu, kutsutakse see eriliselt välja sinu väljaku poolele sinu järgmise Ootefaasia ajal.

source: Gora Turtle
et: Gora kilpkonn

source: As long as this card remains face-up on the field, monsters with an ATK equal to 1900 or more cannot declare an attack.
et: Niikaua kui see kaart jääb väljale avatud olekusse, ei saa koletised, kelle ATK on 1900 või rohkem, rünnakut kuulutada.

source: If this card attacks a face-down Defense Position monster, destroy the monster immediately with this card's effect without flipping it face-up or applying damage calculation.
et: Kui see kaart ründab tagurpidi Kaitseasendis olevat koletist, hävita koletis kohe selle kaardi efektiga ilma seda püstiasendisse pööramata või kahjustuse arvutust rakendamata.

source: Poison Mummy
et: Mürgimuumia

source: FLIP: Inflict 500 damage to your opponent.
et: FLIP: Põhjusta oma vastasele 500 kahju.

source: Dark Dust Spirit
et: Tume Tolmuhing

source: Cannot be Special Summoned. During the End Phase of the turn this card is Normal Summoned or flipped face-up: Return it to the hand. When this card is Normal Summoned or flipped face-up: Destroy all other face-up monsters on the field.
et: Ei saa erikutsuda. Selle kaardi normaalset kutsumist või ülespööramist järgiva käigu lõppfaasis: Tagasta see käsi. Kui see kaart on normaalselt kutsutud või üles pööratud: Hävita kõik teised ülespööratud koletised väljal.

source: Royal Keeper
et: Kuninglik Hoidja

source: Once per turn, you can flip this card into face-down Defense Position. When this card is flipped face-up, it gains 300 ATK and DEF until the end of the turn. (If attacked, this effect resolves after damage calculation.)
et: Korra ühe korra käigu jooksul saad selle kaardi pöörata näoga allapoole kaitsepositsiooni. Kui see kaart pööratakse näoga ülespoole, saab see 300 ATK ja DEF juurde kuni käigu lõpuni. (Kui sellele rünnatakse, rakendub see efekt pärast kahju arvutamist.)

source: Wandering Mummy
et: Rändav Muumia

source: You can flip this card into face-down Defense Position once per turn during your Main Phase. After you use this effect, rearrange the face-down Defense Position monsters on your side of the field, then return them in face-down Defense Position.
et: Saad selle kaardi kord ühe käigu jooksul oma peafaasil tagurpidi kaitseasendisse pöörata. Pärast selle efekti kasutamist korralda oma väljaku tagurpidi kaitseasendis olevad koletised ümber ja seejärel aseta need tagasi tagurpidi kaitseasendisse.

source: Great Dezard
et: Suur Dezard

source: When this monster destroys the following number of monsters as a result of battle, the following effects are activated in order:One: As long as this card remains face-up on the field, negate the activation and effects of all Spell and Trap Cards that target this card and destroy them.Two: You can Special Summon 1 "<M5428>Fushioh Richie<M>" from your hand or your Deck by Tributing this card during your Main Phase.
et: Kui see koletis hävitab lahingu tulemusena järgmise arvu koletisi, aktiveeritakse järgmised efektid järjekorras:Üks: Kuni see kaart jääb väljale avatud olekusse, tühista kõigi selle kaarti sihtivate Loitsu- ja Lõksukaartide aktiveerimine ja efektid ning hävita need.Kaks: Sa võid oma Põhifaasis ohverdades selle kaardi, Kutsuda Eriliselt välja 1 "<M5428>Fushioh Richie<M>" oma käest või pakist.

source: Swarm of Scarabs
et: Skarabeuse parv

source: Once per turn, you can flip this card into face-down Defense Position. When this card is Flip Summoned, destroy 1 monster your opponent controls.
et: Korra ühe käigu jooksul saad selle kaardi ümber pöörata näoga allapoole kaitsepositsiooni. Kui see kaart on ümberpööratud kutsumisega, hävita 1 koletis, mida sinu vastane kontrollib.

source: Swarm of Locusts
et: Rohutirtsude parv

source: Once per turn, you can flip this card into face-down Defense Position. When this card is Flip Summoned, destroy 1 Spell or Trap Card your opponent controls.
et: Korra ühe korra käigu jooksul saad selle kaardi pöörata näoga allapoole kaitseasendisse. Kui see kaart on ümber pööratud, hävita 1 loitsu- või lõksukaart, mida sinu vastane kontrollib.

source: Giant Axe Mummy
et: Hiiglaslik Kirvemuumia

source: You can flip this card into face-down Defense Position once per turn during your Main Phase. If the ATK of a monster on your opponent's side of the field that attacks this card in face-down Defense Position is lower than the DEF of this monster, the attacking monster is destroyed.
et: Sa saad selle kaardi kord oma peafaasil tagurpidi kaitseasendisse pöörata. Kui sinu vastase väljaku poolel oleva koletise, kes ründab seda kaarti tagurpidi kaitseasendis, rünnakupunktid (ATK) on madalamad kui selle koletise kaitsepunktid (DEF), hävitatakse ründav koletis.

source: 8-Claws Scorpion
et: 8-Küünise Skorpion

source: Once per turn, you can flip this card into face-down Defense Position. When this card attacks an opponent's face-down Defense Position monster, this card's ATK becomes 2400 during damage calculation only.
et: Korra ühe käigu jooksul saad selle kaardi pöörata näoga allapoole kaitseasendisse. Kui see kaart ründab vastase näoga allapoole kaitseasendis olevat koletist, muutub selle kaardi rünnakujõud (ATK) ainult kahju arvutamise ajal 2400-ks.

source: Guardian Sphinx
et: Valvur Sfinks

source: Once per turn, you can flip this card into face-down Defense Position. When this card is Flip Summoned, return all monsters your opponent controls to their owner's hand.
et: Korra ühe korra käigu jooksul saad selle kaardi pöörata näoga allapoole kaitsepositsiooni. Kui see kaart on ümber pööratud, tagasta kõik vastase kontrollitavad koletised nende omaniku kätte.

source: Pyramid Turtle
et: Püramiidkilpkonn

source: When this card is destroyed by battle and sent to the Graveyard, you can Special Summon 1 Zombie-Type monster with 2000 or less DEF from your Deck.
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse, saad Sa eriliselt kutsuda 1 Zombi-tüüpi koletise, mille DEF on 2000 või vähem, oma pakist.

source: Dice Jar
et: Täringupurk

source: FLIP: Both players roll a six-sided die once. The player with the lowest result takes damage equal to their opponent's result x 500 Life Points. However, if a winner's result is 6, the loser takes 6000 points of damage. If the results are the same, both players roll again.
et: FLIP: Mõlemad mängijad veeretavad kuuepoolset täringut üks kord. Mängija, kelle tulemus on madalaim, saab kahju, mis on võrdne vastase tulemusega x 500 Elupunkti. Kui aga võitja tulemus on 6, saab kaotaja 6000 punkti kahju. Kui tulemused on samad, veeretavad mõlemad mängijad uuesti.

source: Dark Scorpion Burglars
et: Pimedad Skorpionivargad
