Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: Disenchanter
et: Võlujõu hajutaja

source: Once per turn, you can remove 1 Spell Counter from anywhere on the field to return 1 face-up Spell Card to its owner's hand.
et: Korra ühe korra käigu jooksul saad eemaldada 1 Loitsuloenduri ükskõik kust väljal, et tagastada 1 avatud Loitsukaart selle omaniku kätte.

source: Defender, the Magical Knight
et: Kaitsja, Maagiline Rüütel

source: When this card is Normal Summoned, place 1 Spell Counter on it (max. 1). Once per turn, if a face-up Spellcaster-Type monster(s) on the field would be destroyed, you can remove 1 Spell Counter from a card you control for each of those monsters instead.
et: Kui see kaart Normaal-Kutsutakse, pane sellele 1 Loitsuloendur (max. 1). Kord kord käigu jooksul, kui näoga ülespoole olevad Loitsija-tüüpi koletised väljakul hävitatakse, võid iga nende koletise asemel eemaldada 1 Loitsuloenduri kaardilt, mida sa kontrollid.

source: Magical Citadel of Endymion
et: Endymioni Maagiline Tsitadell

source: Each time a Spell Card is activated, place 1 Spell Counter on this card. When a card with a Spell Counter(s) is destroyed, place its Spell Counters on this card. Once per turn, if you would activate a card's effect by removing a Spell Counter(s) from cards you control, you can remove Spell Counters from this card instead. If this card would be destroyed, you can remove 1 Spell Counter from this card instead.
et: Iga kord, kui aktiveeritakse Võlukaarte, pane sellele kaardile 1 Võluloendur. Kui kaart, millel on Võluloendur(id), hävitatakse, pane selle Võluloendurid sellele kaardile. Kord ühe käigu jooksul, kui sa aktiveeriksid kaardi efekti, eemaldades Võluloenduri(d) oma kontrollitavatelt kaartidelt, võid selle asemel eemaldada Võluloendurid sellelt kaardilt. Kui see kaart hävitatakse, võid selle asemel eemaldada 1 Võluloenduri sellelt kaardilt.

source: Spell Power Grasp
et: Loitsu Jõu Haaramine

source: Place 1 Spell Counter on a face-up card that you can place a Spell Counter on. Then you can add 1 "<M8136>Spell Power Grasp<M>" from your Deck to your hand. You can only activate 1 "<M8136>Spell Power Grasp<M>" per turn.
et: Aseta 1 Loitsuloendur ühele avatud kaardile, millele saad asetada Loitsuloenduri. Seejärel saad lisada 1 "<M8136>Loitsujõu Haaramine<M>" oma pakist oma kätte. Sa saad aktiveerida ainult 1 "<M8136>Loitsujõu Haaramine<M>" ühe käigu jooksul.

source: Power Tool Dragon
et: Võimuriist Draakon

source: 1 Tuner + 1 or more non-Tuner monsters<BR>Once per turn, during your Main Phase, you can select 3 Equip Spell Cards from your Deck, have your opponent pick one of them at random, and add it to your hand. Return the remaining cards to your Deck. If this card would be destroyed while equipped with an Equip Spell Card, you can send that card to the Graveyard instead.
et: 1 Tuner + 1 või rohkem mitte-Tuner koletist<BR>Kord kordus, oma peafaasi ajal, saad valida 3 varustuse loitsukaarti oma pakist, lasta oma vastasel valida neist üks juhuslikult ja lisada see oma kätte. Ülejäänud kaardid tagasta oma pakki. Kui see kaart hävitatakse, kui see on varustatud varustuse loitsukaardiga, saad selle kaardi saata kalmistule selle asemel.

source: Colossal Fighter/Assault Mode
et: Kolossaalne Võitleja/Rünnakurežiim

source: This card cannot be Normal Summoned or Set. This card cannot be Special Summoned except with "<M8058>Assault Mode Activate<M>". When this card is Special Summoned, you can send up to 2 Warrior-type monsters from your Deck to the Graveyard. All monsters your opponent controls lose 100 ATK for every Warrior-type monster in your Graveyard. When this card on the field is destroyed, you can Special Summon 1 "<M7698>Colossal Fighter<M>" from your Graveyard.
et: Seda kaarti ei saa tavaliselt kutsuda ega asetada. Seda kaarti ei saa eriliselt kutsuda, välja arvatud "<M8058>Rünnakurežiimi aktiveerimine<M>". Kui see kaart kutsutakse eriliselt välja, võid saata kuni 2 sõdalase tüüpi koletist oma pakist hauakambrisse. Kõik sinu vastase kontrollitavad koletised kaotavad 100 rünnakupunkti iga sinu hauakambris oleva sõdalase tüüpi koletise kohta. Kui see kaart väljal hävitatakse, võid eriliselt kutsuda 1 "<M7698>Kolossaalne Võitleja<M>" oma hauakambrist.

source: Dark Voltanis
et: Tume Voltanis

source: After 1 Counter Trap Card you control has been activated and has resolved, you can Tribute 1 DARK monster to Special Summon this card from your hand. If this card is Special Summoned in this way, destroy 1 card on the field.
et: Pärast seda, kui 1 sinu kontrolli all olev Vastulöögilõksukaart on aktiveeritud ja lahendatud, võid sa ohverdada 1 PIMEDA koletise, et Kutsuda see kaart oma käest Eriliselt välja. Kui see kaart on sel viisil Eriliselt välja kutsutud, hävita 1 kaart väljal.

source: Prime Material Falcon
et: Esmasmaterjalist Pistrik

source: When an Effect Monster's effect to destroy a Spell or Trap Card(s) on the field is activated, you can send 1 card from your hand to the Graveyard to negate its activation and destroy the card.
et: Kui aktiveeritakse Efektikoletise efekt, mis hävitab väljal oleva Võlu- või Lõksukaardi(d), võid saata 1 kaardi oma käest Hauakambrisse, et selle aktiveerimine tühistada ja kaart hävitada.

source: Bone Crusher
et: Luu Purustaja

source: When this card is Special Summoned from your Graveyard by the effect of a Zombie-Type monster, you can destroy 1 Spell or Trap Card your opponent controls. Destroy this card during the End Phase of the turn it was Special Summoned.
et: Kui see kaart kutsutakse sinu Hauakambrist eriliselt välja Zombi-tüüpi koletise efekti abil, saad hävitada 1 Loitsu- või Lõksukaardi, mida sinu vastane kontrollib. Hävita see kaart selle käigu lõppfaasis, mil see eriliselt välja kutsuti.

source: Alien Kid
et: Tulnukas Laps

source: Place 1 A-Counter on all monsters Special Summoned to your opponent's side of the field. (If a monster with an A-Counter battles an "Alien" monster, it loses 300 ATK and DEF for each A-Counter during damage calculation only.)
et: Aseta 1 A-loendur kõigile koletistele, kes on eriliselt kutsutud sinu vastase väljale. (Kui koletis, millel on A-loendur, võitleb "Tulnukas" koletisega, kaotab see iga A-loenduri kohta 300 ATK ja DEF ainult kahju arvutamise ajal.)

source: Totem Dragon
et: Totem Draakon

source: This card can be treated as 2 Tributes for the Tribute Summon of a Dragon-Type monster. If this card is in your Graveyard during your Standby Phase and you control no monsters, you can Special Summon this card in Attack Position. You cannot activate this effect if there are any monsters in your Graveyard that are not Dragon-Type. If this card is Special Summoned with this effect, remove it from play when it is removed from the field.
et: Seda kaarti saab käsitleda kui 2 ohverdust Draakoni-tüüpi koletise ohverdussummoniks. Kui see kaart on sinu hauas sinu ootejärgus ja sul pole ühtegi koletist, saad selle kaardi erilisummonida rünnakupositsioonis. Sa ei saa seda efekti aktiveerida, kui sinu hauas on mõni koletis, mis ei ole Draakoni-tüüpi. Kui see kaart on selle efektiga erilisummonitud, eemalda see mängust, kui see väljakult eemaldatakse.

source: Royal Swamp Eel
et: Kuninglik Soomusangerjas

source: If this card is used as a Synchro Material Monster, all the other Synchro Material Monsters must be Fish-Type.
et: Kui seda kaarti kasutatakse Sünkroonmaterjalina, peavad kõik teised Sünkroonmaterjalid olema Kalatüüpi.

source: Submarine Frog
et: Allveelaev-konn

source: Code A Ancient Ruins
et: Kood A Muistsed Varemed

source: Each time a face-up "Alien" monster(s) is destroyed, place 1 A-Counter on this card. Once per turn, you can remove 2 A-Counters from anywhere on the field to Special Summon 1 "Alien" monster from your Graveyard.
et: Iga kord, kui hävitatakse avatud "Alien" koletis(ed), aseta sellele kaardile 1 A-loendur. Kord ühe käigu jooksul saad eemaldada 2 A-loendurit ükskõik kust väljakult, et Kutsuda Eriliselt välja 1 "Alien" koletis oma Hauakambrist.

source: Synchro Change
et: Sünkro Muutus

source: Remove from play 1 face-up Synchro Monster you control. Special Summon 1 Synchro Monster from your Extra Deck whose Level is the same as the removed monster's. Its effect(s) is negated.
et: Eemalda mängust 1 ülespoole avatud Sünkro Monster, mida sa kontrollid. Kutsu eriliselt välja 1 Sünkro Monster oma Lisapakist, mille tase on sama, mis eemaldatud monsteril. Selle mõju(d) on tühistatud.

source: Rockstone Warrior
et: Kivisõdalane

source: You take no Battle Damage from battles involving this card. When this attacking card is destroyed by battle and sent to the Graveyard, Special Summon 2 "<M3955>Rockstone Token<M>" (Rock-Type/EARTH/Level 1/ATK 0/DEF 0). These Tokens cannot be Tributed for a Tribute Summon.
et: Sa ei saa lahingukahju lahingutest, milles see kaart osaleb. Kui see ründav kaart hävitatakse lahingus ja saadetakse Hauakambrisse, kutsu eriliselt välja 2 "<M3955>Rockstone Token<M>" (Kiviliik/MAA/Tase 1/ATK 0/DEF 0). Neid Token'eid ei saa kasutada ohverdusena Ohverdussummoniks.

source: Level Warrior
et: Taseme Sõdalane

source: If there are no monsters on the field, you can Normal Summon this card from your hand as a Level 2 monster. If your opponent controls a monster and you control no monsters, you can Special Summon this card from your hand as a Level 4 monster.
et: Kui väljakul pole koletisi, saad selle kaardi oma käest Normaal-Kutsuda 2. taseme koletisena. Kui sinu vastasel on koletis ja sul pole koletisi, saad selle kaardi oma käest Eriliselt Kutsuda 4. taseme koletisena.

source: Strong Wind Dragon
et: Tugev Tuule Draakon

source: This card cannot be destroyed in battle with a monster that has the same ATK. When this card is Tribute Summoned by Tributing a Dragon-Type monster, it gains ATK equal to half the ATK of the Tributed monster. During battle between this attacking card and a Defense Position monster whose DEF is lower than the ATK of this card, inflict the difference as Battle Damage to your opponent.
et: Seda kaarti ei saa hävitada lahingus koletisega, millel on sama ATK. Kui see kaart kutsutakse välja ohverdades Draakoni-tüüpi koletise, saab see ATK-d juurde võrdse poolega ohverdatud koletise ATK-st. Lahingu ajal selle ründava kaardi ja kaitsepositsioonis oleva koletise vahel, mille DEF on madalam kui selle kaardi ATK, tekitage vahe vastasele lahingukahjuna.

source: Dark Verger
et: Tume Võrse

source: When a Plant-Type Tuner monster is Normal Summoned to your side of the field, you can Special Summon this card from your Graveyard in Attack Position.
et: Kui Taimetüüpi Häälestuskoletis kutsutakse sinu väljale normaalkutsumise teel, saad selle kaardi oma hauakambrist rünnakupositsioonis erikutsuda.

source: Phoenixian Seed
et: Phoenixi seeme

source: You can send this face-up card to the Graveyard to Special Summon 1 "<M8159>Phoenixian Cluster Amaryllis<M>" from your hand.
et: Saad selle avatud kaardi Hauakambrisse, et Kutsuda Eriliselt 1 "<M8159>Phoenixian Cluster Amaryllis<M>" oma käest.

source: Phoenixian Cluster Amaryllis
et: Phoenixi Klastri Amarüllis

source: This card cannot be Special Summoned except with its own effect or with "<M8158>Phoenixian Seed<M>". If this card attacks, it is destroyed after damage calculation. If this card you control is destroyed and sent to the Graveyard, inflict 800 damage to your opponent. During your End Phase, you can remove from play 1 Plant-Type monster from your Graveyard to Special Summon this card from your Graveyard in Defense Position.
et: Seda kaarti ei saa eriliselt kutsuda, välja arvatud selle enda efekti või "<M8158>Phoenixian Seed<M>" abil. Kui see kaart ründab, hävitatakse see pärast kahju arvutamist. Kui see kaart, mida sa kontrollid, hävitatakse ja saadetakse Hauakambrisse, tekitab see vastasele 800 kahju. Oma lõppfaasis saad sa eemaldada mängust ühe Taimetüüpi koletise oma Hauakambrist, et eriliselt kutsuda see kaart oma Hauakambrist kaitsepositsioonis.

source: Hedge Guard
et: Hekipiiraja

source: During damage calculation, you can send this card from your hand to the Graveyard to prevent a monster you control from being destroyed by this battle, but that monster's ATK is halved until the End Phase.
et: Kahjukalkulatsiooni ajal võid saata selle kaardi oma käest Hauakambrisse, et takistada sinu kontrolli all oleva koletise hävitamist selles lahingus, kuid selle koletise ATK väheneb poole võrra kuni Lõppfaasini.

source: Evil Thorn
et: Kuriõis

source: You can Tribute this card to inflict 300 damage to your opponent and Special Summon up to 2 "<M8161>Evil Thorn<M>"(s) from your Deck in face-up Attack Position. Those monsters' effects cannot be activated.
et: Saad selle kaardi ohverdada, et teha vastasele 300 kahju ja Kutsuda Eri Kutsumisega kuni 2 "<M8161>Evil Thorn<M>" oma pakist lahingupositsioonis. Nende koletiste efekte ei saa aktiveerida.

source: Blackwing - Blizzard the Far North
et: Musta Tiib - Kaugpõhja Lumetorm

source: This card cannot be Special Summoned. When this card is Normal Summoned, you can Special Summon 1 Level 4 or lower "Blackwing" monster from your Graveyard in face-up Defense Position.
et: Seda kaarti ei saa eriliselt kutsuda. Kui see kaart on tavakutsutud, saad sa oma kalmistult eriliselt kutsuda 1 4. taseme või madalama "Blackwing" koletise näoga ülespoole kaitseasendis.

source: Blackwing - Shura the Blue Flame
et: Mustatiib - Shura Sinine Leek

source: When this card destroys an opponent's monster by battle and sends it to the Graveyard, you can Special Summon 1 "Blackwing" monster with 1500 or less ATK from your Deck. That monster's effect (s) is negated.
et: Kui see kaart hävitab lahingus vastase koletise ja saadab selle Hauakambrisse, saad Sa eriliselt kutsuda 1 "Blackwing" koletise, mille ATK on 1500 või vähem, oma pakist. Selle koletise efekt (id) on tühistatud.

source: Blackwing - Kalut the Moon Shadow
et: Mustatiib - Kalut, Kuuvari

source: When a "Blackwing" monster you control attacks or is attacked, you can send this card from your hand to the Graveyard during the Damage Step to have that monster gain 1400 ATK until the End Phase.
et: Kui sinu juhitav "Blackwing" koletis ründab või teda rünnatakse, võid Sa selle kaardi oma käest Hauakambrisse saata Kahjustuse etapi ajal, et see koletis saaks 1400 ATK kuni Lõppfaasini.

source: Blackwing - Elphin the Raven
et: Mustatiib - Ronk Elphin

source: If you control a face-up "Blackwing" monster, you can Normal Summon this card without Tributing. When this card is Normal Summoned, you can change the Battle Position of 1 monster your opponent controls.
et: Kui sa kontrollid avatud "Blackwing" koletist, saad selle kaardi Normaal-Kutsuda ilma ohverdamata. Kui see kaart on Normaal-Kutsutud, saad muuta ühe vastase kontrollitava koletise Lahinguasendit.

source: Morphtronic Remoten
et: Morftronik Remoten

source: ● While in Attack Position: Once per turn, you can remove from play 1 "Morphtronic" monster from your Graveyard and add 1 "Morphtronic" monster with the same Level from your Deck to your hand.<BR>● While in Defense Position: Once per turn, you can send 1 "Morphtronic" monster from your hand to the Graveyard and add 1 "Morphtronic" monster with the same Level from your Graveyard to your hand.
et: ● Rünnakupositsioonis olles: Kord ühe käigu jooksul saad eemaldada oma Hauakambrist mängust 1 "Morphtronic" koletise ja lisada oma pakist oma kätte 1 "Morphtronic" koletise sama tasemega.<BR>● Kaitsepositsioonis olles: Kord ühe käigu jooksul saad saata 1 "Morphtronic" koletise oma käest Hauakambrisse ja lisada oma Hauakambrist oma kätte 1 "Morphtronic" koletise sama tasemega.

source: Morphtronic Videon
et: Morftronik Videon

source: ● While in Attack Position: This card gains 800 ATK for each Equip Card equipped to it.<BR>● While in Defense Position: This card gains 800 DEF for each Equip Card equipped to it.
et: ● Rünnakupositsioonis olles: See kaart saab 800 ATK iga sellele varustatud Varustuskaardi eest.<BR>● Kaitsepositsioonis olles: See kaart saab 800 DEF iga sellele varustatud Varustuskaardi eest.

source: Morphtronic Scopen
et: Morfotroniline Skopen

source: ● While in Attack Position: Once per turn, you can Special Summon 1 Level 4 "Morphtronic" monster from your hand. Destroy it during the End Phase.<BR>● While in Defense Position: While this card is in face-up Defense Position, it is Level 4.
et: ● Ründeasendis olles: Kord ühe käigu jooksul saad eriliselt kutsuda 1. taseme 4 "Morphtronic" koletise oma käest. Hävita see lõppfaasis.<BR>● Kaitseasendis olles: Kui see kaart on avatud kaitseasendis, on see 4. taseme.

source: Gadget Arms
et: Vidina Käed

source: FLIP: Select 1 "Morphtronic" Spell or Trap Card in your Graveyard and add it to your hand.
et: FLIP: Vali 1 "Morphtronic" Võlu- või Lõksukaart oma Hauakambrist ja lisa see oma kätte.

source: This card cannot be used as a Synchro Material Monster, except for the Synchro Summon of a Warrior-Type Synchro Monster. If the Synchro Monster that used this card as a Synchro Material Monster attacks, your opponent cannot activate Trap Cards until the end of the Damage Step.
et: Seda kaarti ei saa kasutada Sünkromaterjalina, välja arvatud Sõdalase-tüüpi Sünkromonsteri Sünkrokutsumiseks. Kui Sünkromonster, mis kasutas seda kaarti Sünkromaterjalina, ründab, ei saa sinu vastane aktiveerida Lõksukaarte kuni Kahjustuse sammu lõpuni.

source: Earthbound Immortal Aslla piscu
et: Maa-alune Surematu Aslla piscu

source: There can only be 1 face-up "Earthbound Immortal" monster on the field. If there is no face-up Field Spell Card on the field, destroy this card. Your opponent cannot select this card as an attack target. This card can attack your opponent directly. When this card is removed from the field, except by its own effect, destroy all face-up monsters your opponent controls, and inflict 800 damage to your opponent for each monster destroyed.
et: Väljal võib olla ainult 1 avatud "Earthbound Immortal" koletis. Kui väljal ei ole avatud Väliloitsu Kaarti, hävita see kaart. Sinu vastane ei saa valida seda kaarti rünnaku sihtmärgiks. See kaart võib rünnata sinu vastast otse. Kui see kaart eemaldatakse väljast, välja arvatud oma efekti tõttu, hävita kõik sinu vastase kontrollitavad avatud koletised ja tekita sinu vastasele 800 kahju iga hävitatud koletise eest.

source: Earthbound Immortal Ccapac Apu
et: Maa-siduv Surematu Ccapac Apu

source: There can only be 1 face-up "Earthbound Immortal" monster on the field. If there is no face-up Field Spell Card on the Field, destroy this card. Your opponent cannot select this card as an attack target. This card can attack your opponent directly. If this card destroys an opponent's monster by battle, inflict damage to your opponent equal to the destroyed monster's ATK.
et: Väljal võib olla ainult 1 avatud "Earthbound Immortal" koletis. Kui väljal ei ole avatud väljaloitsu kaarti, hävita see kaart. Sinu vastane ei saa valida seda kaarti rünnaku sihtmärgiks. See kaart võib rünnata sinu vastast otse. Kui see kaart hävitab lahingus vastase koletise, põhjusta oma vastasele kahju, mis on võrdne hävitatud koletise rünnakuga (ATK).

source: During each of your End Phases, destroy this card unless you send 1 "<M8207>Iron Core of Koa'ki Meiru<M>" from your hand to the Graveyard. You can Tribute Summon this monster by Tributing 1 "Koa'ki Meiru" monster. This card cannot be destroyed by the effects of Trap Cards. During battle between this attacking card and a Defense Position monster whose DEF is lower than the ATK of this card, inflict the difference as Battle Damage to your opponent.
et: Iga lõpuetapi ajal hävita see kaart, kui sa ei saada 1 "<M8207>Koa'ki Meiru Raudtuum<M>" oma käest Hauakambrisse. Sa võid selle koletise ohverdus-summonida, ohverdades 1 "Koa'ki Meiru" koletise. Seda kaarti ei saa lõksukaartide efektide tõttu hävitada. Lahingu ajal selle ründava kaardi ja kaitsepositsioonis oleva koletise vahel, mille DEF on madalam kui selle kaardi ATK, põhjusta vahe vastasele lahingukahjuna.

source: Koa'ki Meiru Powerhand
et: Koa'ki Meiru Võimukäsi

source: During each of your End Phases, destroy this card unless you send 1 "<M8207>Iron Core of Koa'ki Meiru<M>" from your hand to the Graveyard or reveal 1 Normal Trap Card from your hand. If this card battles with a LIGHT or DARK monster, any of that monster's effects that activate or apply on the field are negated during the Battle Phase, while this card remains on the field.
et: Iga lõppfaasis hävita see kaart, kui sa ei saada 1 "<M8207>Koa'ki Meiru Raudtuum<M>" oma käest Hauakambrisse või ei näita 1 Tavalist Lõksukaarti oma käest. Kui see kaart võitleb VALGUSE või PIMEDUSE koletisega, siis kõik selle koletise efektid, mis aktiveeruvad või rakenduvad väljal, tühistatakse Lahingufaasi ajal, kuni see kaart jääb väljakule.

source: Koa'ki Meiru Guardian
et: Koa'ki Meiru Kaitsja

source: During each of your End Phases, destroy this card unless you send 1 "<M8207>Iron Core of Koa'ki Meiru<M>" from your hand to the Graveyard or reveal 1 Rock-Type monster in your hand. You can Tribute this card to negate the activation of an Effect Monster's effect and destroy that monster.
et: Iga lõpuetapi ajal hävita see kaart, kui sa ei saada 1 "<M8207>Koa'ki Meiru Raudtuum<M>" oma käest Hauakambrisse või ei näita oma käes olevat ühte Kiviliigi koletist. Sa võid ohverdada selle kaardi, et tühistada Efektikoletise efekti aktiveerimine ja hävitada see koletis.

source: During each of your End Phases, destroy this card unless you send 1 "<M8207>Iron Core of Koa'ki Meiru<M>" from your hand to the Graveyard or reveal 1 Dragon-Type monster in your hand. LIGHT and DARK monsters cannot be Special Summoned.
et: Iga oma lõppfaasi ajal hävita see kaart, kui sa ei saada ühte "<M8207>Koa'ki Meiru Raudtuum<M>" oma käest hauakambrisse või ei näita ühte Draakoni-tüüpi koletist oma käes. VALGUS ja PIMEDUS koletisi ei saa eriliselt kutsuda.

source: Koa'ki Meiru Ice
et: Koa'ki Meiru Jää

source: During each of your End Phases, destroy this card unless you send 1 "<M8207>Iron Core of Koa'ki Meiru<M>" from your hand to the Graveyard or reveal 1 Continuous Spell Card in your hand. You can send 1 card from your hand to the Graveyard to destroy 1 Special Summoned monster on the field.
et: Iga lõpuetapi ajal hävita see kaart, kui sa ei saada 1 "<M8207>Koa'ki Meiru Raudtuum<M>" oma käest Hauakambrisse või ei näita oma käes olevat Pidevat Loitsukaarti. Sa võid saata 1 kaardi oma käest Hauakambrisse, et hävitada 1 spetsiaalselt kutsutud koletis väljal.

source: Koa'ki Meiru Doom
et: Koa'ki Meiru Hukk

source: During each of your End Phases, destroy this card unless you send 1 "<M8207>Iron Core of Koa'ki Meiru<M>" from your hand to the Graveyard or reveal 1 Fiend-Type monster in your hand. Effects of LIGHT and DARK Effect Monsters that activate during the Main Phase are negated.
et: Iga lõpuetapi ajal hävita see kaart, kui sa ei saada 1 "<M8207>Koa'ki Meiru Raudtuum<M>" oma käest Hauakambrisse või ei näita 1 Deemon-tüüpi koletist oma käes. PÕHIFAASi ajal aktiveeruvate VALGUSE ja PIMEDUSE Efektikoletiste efektid on tühistatud.

source: Brain Golem
et: Ajugolem

source: Effects of face-up LIGHT monsters are negated. If this card destroys a LIGHT monster by battle, it can attack once again in a row.
et: Avatud näoga VALGUS koletiste efektid on tühistatud. Kui see kaart hävitab lahingus VALGUS koletise, võib see rünnata veel kord järjest.

source: Minoan Centaur
et: Minose tsentaur

source: This card cannot be Special Summoned. You can Tribute this card to Special Summon 2 Level 4 Beast-Warrior-Type Normal Monsters from your Deck.
et: Seda kaarti ei saa eriliselt kutsuda. Sa võid selle kaardi ohverdada, et kutsuda oma pakist eriliselt välja 2 4. taseme Tavalist Metssõdalase-tüüpi koletist.

source: Reinforced Human Psychic Borg
et: Tugevdatud Inimene Psüühiline Borg
