Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: When a "Resonator" monster(s) is sent to the Graveyard as a Synchro Material Monster, select 1 card your opponent controls and destroy it. Destroy this card during your 2nd End Phase after activation.
et: Kui "Resonaator" koletis(ed) saadetakse Hauakambrisse kui Sünkro Materjal Koletis, vali 1 kaart, mida sinu vastane kontrollib, ja hävita see. Hävita see kaart oma 2. lõppfaasis pärast aktiveerimist.

source: Fortissimo the Mobile Fortress
et: Fortissimo, liikuv kindlus

source: Once per turn, you can Special Summon 1 "Machine Imperial Soldier" monster from your hand.
et: Korra ühe korra käigu jooksul saad eriliselt kutsuda 1 "Masina Keiserliku Sõduri" koletise oma käest.

source: Gift of the Machine Emperor
et: Masinaimperaatori kingitus

source: Activate only if the only face-up monsters on the field are 2 "Machine Imperial" monsters. Draw 2 cards. You cannot conduct your Battle Phase the turn you activate this card.
et: Aktiveeri ainult siis, kui ainsad avatud koletised väljakul on 2 "Masinaimpeeriumi" koletist. Tõmba 2 kaarti. Sa ei saa sellel käigul, mil sa selle kaardi aktiveerid, läbi viia oma Lahingufaasi.

source: Iron Wall of the Machine Imperial Soldiers
et: Masina keisriväe raudne sein

source: Face-up Attack Position "Machine Imperial Soldier" monsters you control have their effects negated and cannot be destroyed by battle.
et: Avatud ründeasendis olevate "Machine Imperial Soldier" koletiste efektid, mida sa kontrollid, on tühistatud ja neid ei saa lahingus hävitada.

source: Reboot
et: Taaskäivitus

source: Shuffle 1 "Machine Imperial" monster from your hand into the Deck to select 1 "Machine Imperial" card in your Graveyard, and add it to your hand.
et: Sega 1 "Machine Imperial" koletis oma käest tagasi pakki, et valida 1 "Machine Imperial" kaart oma hauast ja lisada see oma kätte.

source: Select 1 face-up "T.G." monster you control. Halve its ATK and DEF, and destroy 1 Spell/Trap Card on the field.
et: Vali 1 avatud "T.G." koletis, mida sa kontrollid. Vähenda selle ATK ja DEF poole võrra ning hävita 1 Väljal olev Võlu-/Lõksukaart.

source: All face-up monsters you control gain 300 ATK for each face-up "T.G." monster you control.
et: Kõik avatud positsioonis olevad koletised, mida sa kontrollid, saavad 300 ATK iga avatud positsioonis oleva "T.G." koletise eest, mida sa kontrollid.

source: ESP Amplifier
et: ESP Võimendi

source: All face-up Psychic-Type monsters you control gain 300 ATK for each of your removed from play Psychic-Type monsters. During the End Phase, remove from play all monsters that were affected by this effect.
et: Kõik sinu kontrolli all olevad avatud Psüühika-tüüpi koletised saavad 300 ATK iga sinu mängust eemaldatud Psüühika-tüüpi koletise kohta. Lõppfaasi ajal eemalda mängust kõik koletised, mida see efekt mõjutas.

source: Psychic Feel Zone
et: Psüühiline Tunnetsoon

source: Select 2 of your removed from play monsters (1 Psychic-Type Tuner and 1 Psychic-Type non-Tuner), return them to the Graveyard, and Special Summon 1 Psychic-Type Synchro Monster from your Extra Deck in face-up Defense Position, whose Level equals the total Levels of the returned monsters.
et: Vali 2 oma mängust eemaldatud koletist (1 Psüühika-tüüpi Tuner ja 1 Psüühika-tüüpi mitte-Tuner), tagasta need Hauakambrisse ja Kutsu eriliselt välja 1 Psüühika-tüüpi Sünkro Koletis oma Lisapakist näoga ülespoole Kaitsepositsioonis, kelle Tase võrdub tagastatud koletiste kogutasemega.

source: Shien's Dojo
et: Shieni Dojo

source: Each time a "Six Samurai" monster is Normal or Special Summoned, place 1 Bushido Counter on this card. You can send this face-up card to the Graveyard to Special Summon 1 "Six Samurai" or "Shien" Effect Monster from your Deck whose Level is equal to or lower than the number of Bushido Counters on this card.
et: Iga kord, kui "Kuue Samuraid" koletis kutsutakse tavaliselt või eriliselt välja, pane sellele kaardile 1 Bushido loendur. Sa võid saata selle avatud kaardi Hauakambrisse, et kutsuda oma pakist eriliselt välja 1 "Kuue Samuraid" või "Shien" Efektikoletis, mille tase on võrdne või madalam sellel kaardil olevate Bushido loendurite arvuga.

source: Runaway Karakuri
et: Põgenev Karakuri

source: Select 1 face-up "Karakuri" monster on the field. Until the End Phase, it gains 1000 ATK, but its effect(s) is negated.
et: Vali 1 avatud "Karakuri" koletis väljal. Kuni lõppfaasini saab see 1000 ATK juurde, kuid selle efekt(id) on tühistatud.

source: Contact with the Aquamirror
et: Kontakt Akvapeegliga

source: If you control a face-up WATER monster, activate 1 of these effects. If you control a face-up WATER Ritual Monster, you can activate both of these effects:<BR>●Look at all Set cards in your opponent's Spell & Trap Card Zones.<BR>●Look at the 2 top cards of either player's Deck and return them to the top of the Deck in any order.
et: Kui sa kontrollid avatud VEE koletist, aktiveeri 1 neist efektidest. Kui sa kontrollid avatud VEE Rituaal Koletist, võid aktiveerida mõlemad efektid:<BR>●Vaata kõiki vastase Maagia & Lõksu Kaardi Tsoonides olevaid Set kaarte.<BR>●Vaata kas enda või vastase paki kahte ülemist kaarti ja aseta need tagasi paki tippu suvalises järjekorras.

source: Soundproofed
et: Helikindel

source: This card can only be activated at the start of Main Phase 1, and only if you control no face-up Synchro Monsters. Neither player can Special Summon a Synchro Monster until your opponent's next End Phase.
et: Seda kaarti saab aktiveerida ainult Main Phase 1 alguses ja ainult siis, kui sul pole ühtegi avatud Synchro Monsterit. Kumbki mängija ei saa Special Summon'ida Synchro Monsterit kuni sinu vastase järgmise End Phase'ini.

source: Out of the Blue
et: Ootamatult

source: Destroy this card if your opponent activates a card or effect that targets a card(s) in the Graveyard. When this card is destroyed by this effect and sent to the Graveyard, your opponent shuffles all cards in their Graveyard into the Deck
et: Hävita see kaart, kui sinu vastane aktiveerib kaardi või efekti, mis sihib kaarti või kaarte hauas. Kui see kaart hävitatakse selle efekti tõttu ja saadetakse hauda, segab sinu vastane kõik kaardid oma hauas tagasi pakki

source: Self-Mummification
et: Enesemummifikatsioon

source: Select 1 monster you control, and send it to the Graveyard.
et: Vali 1 koletis, mida sa kontrollid, ja saada see Hauakambrisse.

source: Red Carpet
et: Punane vaip

source: Activate only if a face-up Dragon-Type Synchro Monster is on the field. Select up to 2 "Resonator" monsters in your Graveyard. Special Summon those monsters.
et: Aktiveeri ainult siis, kui väljakul on avatud Näoga Draakoni-tüüpi Sünkro Koletis. Vali oma Hauakambris kuni 2 "Resonaator" koletist. Kutsu need koletised eriliselt välja.

source: Power-up Adapter
et: Võimenduse Adapter

source: Equip this card to a face-up "Morphtronic" monster you control. It cannot declare an attack. When this card is equipped to a monster, select 1 face-up monster on the field, except the equipped monster. That monster gains ATK equal to the ATK of the equipped monster. When the equipped monster or the selected monster is removed from the field, destroy this card.
et: Varusta see kaart enda kontrollitavale avatud "Morphtronic" koletisele. See ei saa rünnakut kuulutada. Kui see kaart on koletisele varustatud, vali 1 avatud koletis väljal, välja arvatud varustatud koletis. See koletis saab ATK-d, mis on võrdne varustatud koletise ATK-ga. Kui varustatud koletis või valitud koletis eemaldatakse väljast, hävita see kaart.

source: Chaos Infinity
et: Kaose lõpmatus

source: Change all Defense Position monsters on the field to face-up Attack Position. Then, Special Summon 1 "Machine Imperial" monster from your Deck or your Graveyard. Its effect is negated, and it is destroyed during this turn's End Phase.
et: Muuda kõik kaitseasendis olevad koletised väljal rünnakuasendisse. Seejärel kutsu eriliselt välja 1 "Masinaimpeeriumi" koletis oma pakist või hauast. Selle efekt on tühistatud ja see hävitatakse selle käigu lõppfaasis.

source: Machine-Timed Bomb
et: Masina-ajastatud pomm

source: Select 1 face-up "Machine Imperial" monster you control and 1 card your opponent controls. Destroy both cards.
et: Vali 1 avatud "Machine Imperial" koletis, mida sa kontrollid, ja 1 kaart, mida su vastane kontrollib. Hävita mõlemad kaardid.

source: Machine Emperor Factory
et: Masina Keisri Tehas

source: Activate only when a face-up "Machine Imperial" monster on the field is selected as an attack target. Select 1 "Machine Imperial Army" monster in your Graveyard, and add it to your hand. Then, destroy the attack target.
et: Aktiveeri ainult siis, kui näoga ülespoole olev "Masinaimpeeriumi" koletis väljakul valitakse rünnaku sihtmärgiks. Vali 1 "Masinaimpeeriumi armee" koletis oma Hauakambris ja lisa see oma kätte. Seejärel hävita rünnaku sihtmärk.

source: Select 3 "T.G." monsters in your Graveyard. Return them to your Deck, then draw 2 cards.
et: Vali oma kalmistult 3 "T.G." koletist. Tagasta need oma pakki, seejärel tõmba 2 kaarti.

source: Activate only when a "T.G." monster you control destroys an opponent's monster by battle and sends it to the Graveyard. Select 1 "T.G." Synchro Monster in your Graveyard and Special Summon it.
et: Aktiveeri ainult siis, kui sinu kontrollitav "T.G." koletis hävitab lahingus vastase koletise ja saadab selle Hauakambrisse. Vali 1 "T.G." Sünkro Koletis oma Hauakambris ja Kutsu see Eriliselt välja.

source: Select 1 monster your opponent controls and 1 face-up "T.G." monster you control. Switch control of the selected monsters.
et: Vali 1 koletis, mida sinu vastane kontrollib, ja 1 avatud "T.G." koletis, mida sina kontrollid. Vaheta valitud koletiste kontrolli.

source: Psychic Reactor
et: Psüühiline Reaktor

source: Activate only if you control a face-up Psychic-Type monster. During this turn, if a Psychic-Type monster you control battles an opponent's monster, remove from play both monsters.
et: Aktiveeri ainult siis, kui sa kontrollid avatud Psüühika-tüüpi koletist. Selle käigu ajal, kui sinu kontrolli all olev Psüühika-tüüpi koletis võitleb vastase koletisega, eemalda mängust mõlemad koletised.

source: Brain Hazard
et: Ajuhäire

source: Select 1 of your removed from play Psychic-Type monsters, and Special Summon it. When this card is removed from the field, destroy that monster. When that monster is destroyed, destroy this card.
et: Vali 1 oma mängust eemaldatud Psüühika-tüüpi koletis ja Kutsu see Eriliselt välja. Kui see kaart eemaldatakse väljakult, hävita see koletis. Kui see koletis hävitatakse, hävita see kaart.

source: Six Style - Dual Wield
et: Kuus Stiili - Kaksikhaare

source: Activate only if the only monster you control is 1 "Six Samurai" monster in face-up Attack Position. Select 2 cards your opponent controls and return them to the hand.
et: Aktiveeri ainult siis, kui ainus koletis, mida sa kontrollid, on 1 "Kuue Samuraid" koletis avatud rünnakupositsioonis. Vali 2 kaarti, mida su vastane kontrollib, ja tagasta need käele.

source: Karakuri Cash Shed
et: Karakuri Rahapesa

source: Activate only if you control a "Karakuri" monster in face-up Defense Position. Negate the activation of an opponent's Spell/Trap Card and destroy it.
et: Aktiveeri ainult siis, kui sul on "Karakuri" koletis avatud kaitsepositsioonis. Tühista vastase Loitsu/Lõksukaardi aktiveerimine ja hävita see.

source: Tyrant's Tantrum
et: Türanni raev

source: Tribute 2 monsters. Your opponent must send 1 Spell Card from their Deck to the Graveyard to activate a Spell Card.
et: Ohverda 2 koletist. Sinu vastane peab saatma 1 Loitsukaardi oma pakist Hauakambrisse, et aktiveerida Loitsukaardi.

source: Debunk
et: Paljastamine

source: Negate the activation of an Effect Monster's effect that activates in the hand or Graveyard, and remove it from play.
et: Tühista käes või Hauakambris aktiveeruva Efektikoletise efekti aktiveerimine ja eemalda see mängust.

source: Sealing Ceremony of Mokuton
et: Mokutoni pitseritseremoonia

source: Once per turn, you can Tribute 1 face-up EARTH monster to select up to 2 cards in your opponent's Graveyard, and remove them from play.
et: Korra ühe korra käigu jooksul saad sa ohverdada 1 avatud EARTH koletise, et valida kuni 2 kaarti oma vastase Hauakambris ja eemaldada need mängust.

source: Safe Zone
et: Turvatsoon

source: Activate only by selecting 1 face-up Attack Position monster. That monster cannot be targeted or destroyed by your opponent's card effects, or be destroyed by battle. It cannot attack your opponent directly. When this card is removed from the field, destroy that monster. When that monster is removed from the field, destroy this card.
et: Aktiveeri ainult valides 1 avatud Rünnakupositsioonis koletis. Seda koletist ei saa sihtida ega hävitada sinu vastase kaardi efektidega ega hävitada lahingus. See ei saa rünnata sinu vastast otse. Kui see kaart eemaldatakse väljakult, hävita see koletis. Kui see koletis eemaldatakse väljakult, hävita see kaart.

source: Localized Tornado
et: Lokaalne Tornado

source: Shuffle all cards from your hand and Graveyard into the Deck.
et: Sega kõik kaardid oma käest ja Hauakambrist tagasi Pakki.

source: W Nebula Meteorite
et: W Nebula Meteoriit

source: Change all face-down monsters on the field to face-up Defense Position. During the End Phase this turn, change all face-up LIGHT Reptile-Type monsters you control to face-down Defense Position, then draw 1 card for each. After that, you can Special Summon 1 Level 7 or higher LIGHT Reptile-Type monster from your Deck.
et: Muuda kõik näoga allapoole olevad koletised väljakul näoga ülespoole Kaitsepositsiooni. Selle käigu lõppfaasis muuda kõik näoga ülespoole olevad VALGUS Reptiil-Tüüpi koletised, mida sa kontrollid, näoga allapoole Kaitsepositsiooni, seejärel tõmba 1 kaart igaühe kohta. Pärast seda saad Sa eriliselt kutsuda 1 taseme 7 või kõrgema VALGUS Reptiil-Tüüpi koletise oma pakist.

source: Catapult Warrior
et: Katapuldisõdalane

source: 1 Tuner + 1 or more non-Tuner monsters<BR>Once per turn, you can Tribute 1 "Junk" monster to inflict damage to your opponent equal to that monster's original ATK.
et: 1 Tuner + 1 või rohkem mitte-Tuner koletist<BR>Kord kordamööda võid sa ohverdada 1 "Junk" koletise, et tekitada oma vastasele kahju, mis on võrdne selle koletise algse ATK-ga.

source: Machine Imperial God Machinicle ∞
et: Masinaimpeerium Jumal Machinicle ∞

source: This card cannot be Normal Summoned or Set. This card cannot be Special Summoned except by sending 3 other "Machine Imperial" monsters from your hand to the Graveyard. Once per turn, you can select 1 face-up Synchro Monster your opponent controls, and equip it to this card. This card gains ATK equal to those equipped monsters' combined ATK. Once per turn, during your Standby Phase, you can send 1 of those monsters to the Graveyard to inflict damage to your opponent equal to its ATK. You cannot conduct your Battle Phase the turn you activate this effect.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti ei saa eriliselt kutsuda, välja arvatud juhul, kui saadate 3 muud "Masinaimpeeriumi" koletist oma käest hauakambrisse. Kord ühe käigu jooksul saate valida ühe vastase kontrollitava avatud Sünkro Koletise ja kinnitada selle sellele kaardile. See kaart saab ATK-d, mis on võrdne nende kinnitatud koletiste kombineeritud ATK-ga. Kord ühe käigu jooksul, oma ooteetapi ajal, saate saata ühe neist koletistest hauakambrisse, et tekitada oma vastasele kahju, mis on võrdne selle ATK-ga. Te ei saa oma lahingufaasi läbi viia käigul, mil aktiveerite selle efekti.

source: T.G. Hyper Librarian
et: T.G. Hüperraamatukoguhoidja

source: 1 Tuner + 1 or more non-Tuner monsters<BR>While this card is face-up on the field, each time a Synchro Monster(s) is Synchro Summoned, draw 1 card for each.
et: 1 Tuner + 1 või rohkem mitte-Tuner koletist<BR>Kui see kaart on lahinguväljal avatud, tõmba iga kord, kui Sünkro Koletis(t) Sünkro Kutsutakse, 1 kaart igaühe eest.

source: The Supremacy Sun
et: Ülim Päike

source: Must be Special Summoned by its own effect and cannot be Special Summoned by other ways. If this face-up card on the field is destroyed and sent to the Graveyard, during the next Standby Phase: You can discard 1 card; Special Summon this card from the Graveyard.
et: Peab olema eriliselt kutsutud oma efekti abil ja ei saa olla eriliselt kutsutud muul viisil. Kui see avatud kaart väljakul hävitatakse ja saadetakse Hauakambrisse, siis järgmise Ootefaasiga: Sa võid ühe kaardi ära visata; Kutsu see kaart Hauakambrist eriliselt välja.

source: Zubaba Knight
et: Zubaba Rüütel

source: If this card attacks a face-up Defense Position monster: Destroy that monster at the start of the Damage Step (without damage calculation).
et: Kui see kaart ründab avatud kaitseasendis olevat koletist: Hävita see koletis Kahjustuse Arvutamise Etapi alguses (ilma kahjustuse arvutamiseta).

source: Ganbara Knight
et: Ganbara Rüütel

source: When this face-up Attack Position card is targeted for an attack: You can change it to Defense Position.
et: Kui see avatud Rünnakupositsioonis kaart on rünnaku sihtmärk: Sa võid selle muuta Kaitsepositsiooniks.

source: Feedback Warrior
et: Tagasiside Sõdalane

source: When this card is Normal or Special Summoned: You can target 1 face-up monster you control; it becomes Level 3.
et: Kui see kaart on Normaal- või Erikutsutud: Sa saad valida 1 avatud koletise, mida sa kontrollid; see muutub 3. tasemeks.

source: Speed Bird
et: Kiirlind

source: When this card is destroyed by battle and sent to the Graveyard: You can target 2 Level 2 monsters in your Graveyard; Special Summon them, but their effects are negated.
et: Kui see kaart hävitatakse lahingus ja saadetakse Hauakambrisse: Sa võid valida sihtmärgiks 2. taseme 2 koletist oma Hauakambris; Kutsu nad eriliselt välja, kuid nende efektid on tühistatud.

source: Key Man The Key Warrior
et: Võtme Mees Võtme Sõdalane

source: Once per turn, during your Main Phase: You can make this card Level 3 until the End Phase.
et: Korra ühe korra oma peafaasis: Sa võid muuta selle kaardi tasemeks 3 kuni lõppfaasini.

source: This card gains 400 ATK for each face-up Level 2 monster you control.
et: See kaart saab 400 ATK iga avatud 2. taseme koletise eest, mida sa kontrollid.

source: Shine Knight
et: Särav Rüütel

source: This card is Level 4 while in face-up Defense Position.
et: See kaart on 4. tasemel, kui see on avatud kaitsepositsioonis.

source: Blustering Winds
et: Puhanguline Tuul

source: Target 1 face-up monster you control; it gains 1000 ATK and DEF until your next Standby Phase.
et: Vali 1 avatud näoga koletis, mida sa kontrollid; see saab 1000 ATK ja DEF juurde kuni sinu järgmise Ootefaasini.

source: Harmonic Waves
et: Harmoonilised Lained

source: Target 1 face-up monster on the field; it becomes Level 4, until the End Phase.
et: Vali 1 avatud koletis väljal; see muutub 4. tasemeks kuni lõppfaasini.

source: Xyz Energy
et: Xyz Energia

source: Detach 1 Xyz Material you control to target 1 face-up monster your opponent controls; destroy that target.
et: Eemalda 1 Xyz Materjal, mida sa kontrollid, et sihtida 1 avatud koletis, mida sinu vastane kontrollib; hävita see sihtmärk.

source: Reinforced Space
et: Tugevdatud Ruum

source: Each face-up Xyz Monster you control gains 300 ATK for each Xyz Material attached to it, until the End Phase.
et: Iga avatud Xyz-koletis, mida sa kontrollid, saab 300 ATK iga Xyz Materjali kohta, mis sellele on kinnitatud, kuni lõppfaasini.

source: Xyz Effect
et: Xyz Efekt

source: When you Xyz Summon a monster: You can target 1 card on the field; destroy it.
et: Kui sa teed Xyz Kutsumise: Sa võid valida 1 kaardi väljal; hävita see.

source: Number 39: Utopia
et: Number 39: Utoopia

source: 2 Level 4 monsters<BR>When any player's monster declares an attack: You can detach 1 Xyz Material from this card; negate the attack. When this card is targeted for an attack, while it has no Xyz Materials: Destroy this card.
et: 2. taseme 4 koletist<BR>Kui ükskõik millise mängija koletis kuulutab välja rünnaku: Sa võid sellelt kaardilt eemaldada 1 Xyz Materjali; tühista rünnak. Kui see kaart on rünnaku sihtmärk ja sellel pole Xyz Materjale: Hävita see kaart.

source: 2 Level 2 monsters<BR>If this face-up card would be destroyed, you can detach 1 Xyz Material from this card instead. Face-up monsters you control gain 200 ATK and DEF for each Xyz Material attached to this card.
et: 2. taseme 2 koletist<BR>Kui see avatud kaart hävitatakse, võid selle asemel eemaldada 1 Xyz Materjali sellest kaardist. Avatud koletised, mida sa kontrollid, saavad 200 ATK ja DEF juurde iga Xyz Materjali eest, mis on sellele kaardile kinnitatud.

source: 2 Level 3 monsters<BR>When this card destroys an opponent's monster by battle and sends it to the Graveyard: You can detach 1 Xyz Material from this card; inflict 1000 damage to your opponent.
et: 2. taseme 3 koletist<BR>Kui see kaart hävitab lahingus vastase koletise ja saadab selle Hauakambrisse: Sa võid sellelt kaardilt eemaldada 1 Xyz Materjali; tekitada vastasele 1000 kahju.

source: During your Main Phase, you can remove from play this card from your Graveyard to select 1 face-up Level 4 or lower LIGHT Fairy-Type monster you control. That monster is treated as a Tuner monster while it is face-up on the field.
et: Oma peafaasia ajal saad sa eemaldada selle kaardi oma hauast, et valida 1 avatud 4. või madalama taseme VALGUS haldjatüüpi koletis, mida sa kontrollid. Seda koletist käsitletakse kui Häälestajat, kuni see on väljakul avatud.

source: Des Donut
et: Desi sõõrik

source: FLIP: Destroy all face-up monsters on the field with 0 original ATK/DEF.
et: FLIP: Hävita kõik lahinguväljal olevad avatud koletised, kellel on algne ATK/DEF 0.

source: Nimble Manta
et: Nobe Manta

source: When this card is sent from the field to the Graveyard by a card effect, you can Special Summon up to 2 "<M9580>Nimble Manta<M>" from your Deck.
et: Kui see kaart saadetakse väljastatud kaardi efekti tõttu mänguväljakult hauakambrisse, saad eriliselt kutsuda kuni 2 "<M9580>Nimble Manta<M>" oma pakist.

source: Rage of Deep Sea
et: Sügaviku Raev

source: This card gains 500 ATK and DEF for each Fish, Sea Serpent, Aqua-Type monster in your Graveyard.
et: See kaart saab 500 ATK ja DEF iga Kalade, Meremadude, Aqua-tüüpi koletise eest sinu Hauas.

source: Gem-Knight Obsidian
et: Gem-Knight Obsidiaan

source: If this card is sent from your hand to the Graveyard: Target 1 Level 4 or lower Normal Monster in your Graveyard; Special Summon it.
et: Kui see kaart saadetakse sinu käest Hauakambrisse: Sihti 1. taseme 4 või madalama tavaline koletis sinu Hauakambris; Kutsu see eriliselt välja.

source: Gem-Knight Iolite
et: Gem-Knight Ioliit

source: This card is treated as a Normal Monster while face-up on the field or in the Graveyard. While this card is face-up on the field, you can Normal Summon it to have it be treated as an Effect Monster with this effect:<BR>● Once per turn, you can remove from play 1 "Gem" monster from your Graveyard to add 1 "Gem-Knight" card from your Graveyard to your hand.
et: See kaart loetakse tavaliseks koletiseks, kui see on väljaku peal või hauas. Kui see kaart on väljaku peal, võid selle normaalselt kutsuda, et seda käsitletaks efektikoletisena järgmise efektiga:<BR>● Kord ühe käigu jooksul võid eemaldada oma hauast mängust ühe "Gem" koletise, et lisada oma hauast oma kätte üks "Gem-Knight" kaart.
