Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: Select 1 Monster Card each from you and your opponent's sides of the field and remove them from play. When this card is destroyed and sent to the Graveyard, return those monsters to the field in the same battle position as when they were removed from play.
et: Vali 1 koletisekaart nii enda kui ka vastase väljakult ja eemalda need mängust. Kui see kaart hävitatakse ja saadetakse hauakambrisse, tagasta need koletised väljakule samas lahingupositsioonis, milles nad mängust eemaldati.

source: Staunch Defender
et: Vankum Kaitsja

source: You can only activate this card when your opponent declares an attack. Select 1 face-up monster on your side of the field. During this turn, your opponent can only designate the selected monster as an attack target and your opponent must attack the selected monster with all face-up monsters.
et: Seda kaarti saad aktiveerida ainult siis, kui sinu vastane kuulutab välja rünnaku. Vali 1 avatud koletis oma väljaku poolel. Selle käigu ajal saab sinu vastane valida rünnaku sihtmärgiks ainult valitud koletise ja sinu vastane peab ründama valitud koletist kõigi avatud koletistega.

source: Special Summon 3 "<M3915>Ojama Token<M>"(s) (Beast-Type/LIGHT/Level 2/ATK 0/DEF 1000) in Defense Position on your opponent's side of the field. The tokens cannot be Tributed for a Tribute Summon. When an "<M3915>Ojama Token<M>" is destroyed, the controller of that token takes 300 points of damage.
et: Erikutsuge 3 "<M3915>Ojama Token<M>"(it) (Beast-Tüüp/VALGUS/Tase 2/ATK 0/DEF 1000) kaitsepositsioonis oma vastase väljale. Neid žetoone ei saa kasutada ohverdussummoniks. Kui "<M3915>Ojama Token<M>" hävitatakse, saab selle žetooni kontrollija 300 punkti kahju.

source: Arsenal Robber
et: Arsenali Röövel

source: Your opponent selects 1 Equip Spell Card from his/her Deck and sends it to the Graveyard.
et: Sinu vastane valib oma pakist 1 Varustuse Võlusõna Kaardi ja saadab selle Hauakambrisse.

source: Skill Drain
et: Oskuste Tühistamine

source: Pay 1000 Life Points. The effects of all face-up Effect Monsters on the field are negated.
et: Makske 1000 Elupunkti. Kõigi lahinguväljal olevate avatud Efektikoletiste efektid tühistatakse.

source: Really Eternal Rest
et: Tõeline Igavene Puhkus

source: Destroy all monsters equipped with Equip Cards
et: Hävita kõik varustuse kaartidega varustatud koletised

source: Soul Taker
et: Hinge Võtja

source: Destroy 1 face-up monster your opponent controls. Then, your opponent gains 1000 Life Points.
et: Hävita 1 avatud koletis, mida sinu vastane kontrollib. Seejärel saab sinu vastane 1000 Elupunkti.

source: Magical Dimension
et: Maagiline Dimensioon

source: If you control a face-up Spellcaster-Type monster: Target 1 monster you control; Tribute it, then Special Summon 1 Spellcaster-Type monster from your hand, then you can destroy 1 monster on the field.
et: Kui sa kontrollid avatud Nägija-tüüpi koletist: Sihtmärk 1 koletis, mida sa kontrollid; ohverda see, siis Kutsu Eriliselt 1 Nägija-tüüpi koletis oma käest, siis saad hävitada 1 koletis väljal.

source: Judgment of the Pharaoh
et: Vaarao otsus

source: Pay half your Life Points. Select and activate an appropriate effect which can be applied:<BR>● If "<M5754>Yu-Jo Friendship<M>" is in your Graveyard, until the end of this turn: your opponent cannot Normal Summon, Set, Flip Summon, or Special Summon a monster(s), or activate an Effect Monster's effect, and their monster's effects are negated.<BR>● If "<M5755>Unity<M>" is in your Graveyard, until the end of this turn: negate the effects of all Spell and Trap Cards on your opponent's side of the field, and your opponent cannot activate or Set Spell or Trap Cards
et: Maksa pool oma Elupunktidest. Vali ja aktiveeri sobiv efekt, mida saab rakendada:<BR>● Kui "<M5754>Yu-Jo Friendship<M>" on sinu Hauakambris, kuni selle käigu lõpuni: sinu vastane ei saa Normaalset Kutsuda, Paigutada, Pöörata ega Eriliselt Kutsuda koletist(e), ega aktiveerida Efektkoletise efekti, ja nende koletiste efektid on tühistatud.<BR>● Kui "<M5755>Unity<M>" on sinu Hauakambris, kuni selle käigu lõpuni: tühista kõikide sinu vastase välja peal olevate Loitsu- ja Lõksukaartide efektid, ja sinu vastane ei saa aktiveerida ega Paigutada Loitsu- või Lõksukaarte

source: Yu-Jo Friendship
et: Yu-Jo Sõprus

source: Offer your opponent a handshake. If they accept your handshake, each player's Life Points become half the combined Life Points of both players. If you have "<M5755>Unity<M>" in your hand and show it to your opponent, they must accept the handshake.
et: Paku oma vastasele kätt suruda. Kui nad nõustuvad käepigistusega, muutuvad mõlema mängija Elupunktid mõlema mängija Elupunktide summa pooleks. Kui sul on käes "<M5755>Unity<M>" ja sa näitad seda oma vastasele, peavad nad käepigistusega nõustuma.

source: Unity
et: Ühtsus

source: Select 1 monster on your side of the field. The DEF of the selected monster becomes equal to the combined original DEF of all face-up monsters on your side of the field, until the end of this turn.
et: Vali 1 koletis oma väljaku poolel. Valitud koletise DEF muutub võrdseks kõigi sinu väljaku poolel olevate avatud koletiste algse DEF-i summaga kuni selle käigu lõpuni.

source: Dark Magician Knight
et: Pimeduse Maag Rüütel

source: This card cannot be Normal Summoned or Set. This card cannot be Special Summoned except by the effect of "<M5757>Knight's Title<M>". If this card is Special Summoned successfully, select 1 card on the field and destroy it.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti ei saa eriliselt kutsuda, välja arvatud "<M5757>Rüütli tiitel<M>" efekti abil. Kui see kaart kutsutakse edukalt eriliselt välja, vali 1 kaart väljakul ja hävita see.

source: Knight's Title
et: Rüütli Tiitel

source: Activate this card by offering 1 face-up "<M4041>Dark Magician<M>" on your side of the field as a Tribute. Special Summon 1 "<M5756>Dark Magician Knight<M>" from your hand, Deck or Graveyard.
et: Aktiveeri see kaart, pakkudes oma väljaku poolel 1 avatud "<M4041>Tume Maag<M>" ohvriks. Kutsu eriliselt välja 1 "<M5756>Tume Maagikuningas<M>" oma käest, pakist või hauast.

source: Sage's Stone
et: Targa kivi

source: Activate only if you control a face-up "<M4766>Dark Magician Girl<M>". Special Summon 1 "<M4041>Dark Magician<M>" from your hand or Deck.
et: Aktiveeri ainult siis, kui sa kontrollid avatud "<M4766>Tume Maag Tüdruk<M>". Kutsu eriliselt välja 1 "<M4041>Tume Maag<M>" oma käest või pakist.

source: This young evildoer used to have an evil heart, but by meeting a special person, he discovered justice.
et: See noor kurjategija oli kunagi kurja südamega, kuid kohtudes erilise inimesega, avastas ta õigluse.

source: D.D. Trainer
et: D.D. Treener

source: A poor goblin that was sucked into a different dimension. However, he's doing his best with his new destiny.
et: Vaene goblin, kes imeti teise dimensiooni. Kuid ta teeb oma parima oma uue saatusega.

source: Ojama Green
et: Ojama Roheline

source: He's one of the Ojama Trio. It's said that he butts in by any means necessary. It's also said that when the three are together, something happens.
et: Ta on üks Ojama Trio liikmetest. Öeldakse, et ta sekkub igal võimalikul viisil. Samuti öeldakse, et kui kolm on koos, juhtub midagi.

source: Archfiend Soldier
et: Deemonisõdalane

source: An expert at battle who belongs to a crack diabolical unit. He's famous because he always gets the job done.
et: Lahinguekspert, kes kuulub kurikuulsasse kuradlikku üksusesse. Ta on kuulus, sest ta saab alati töö tehtud.

source: Pandemonium Watchbear
et: Pandemoniumi Valvurikaru

source: As long as this card remains face-up on your side of the field, "<M5791>Pandemonium<M>" on your side of the field is not destroyed by your opponent's card effects.
et: Niikaua kui see kaart jääb sinu väljale avatud olekusse, ei hävita sinu väljale asetatud "<M5791>Pandemonium<M>" sinu vastase kaardi efektid.

source: Once per turn, during your Main Phase, you can pay 800 Life Points. If you do this, until the End Phase, Spell and Trap Cards cannot be activated.
et: Korra ühe korra oma peafaasil võid maksta 800 elupunkti. Kui teed seda, ei saa kuni lõppfaasini aktiveerida loitsu- ja lõksukaarte.

source: Dark Scorpion - Gorg the Strong
et: Tume Skorpion - Gorg Tugev

source: When this card inflicts Battle Damage to your opponent's Life Points, you can select and activate 1 of the following effects:<BR>● Return 1 Monster Card on your opponent's side of the field to the top of its owner's Deck.<BR>● Send 1 card from the top of your opponent's Deck to the Graveyard.
et: Kui see kaart tekitab lahingukahju sinu vastase elupunktidele, saad valida ja aktiveerida ühe järgmistest efektidest:<BR>● Tagasta 1 koletisekaart sinu vastase väljaku poolelt selle omaniku paki tippu.<BR>● Saada 1 kaart sinu vastase paki tipust hauakambrisse.

source: Dark Scorpion - Meanae the Thorn
et: Tume Skorpion - Meanae Okas

source: When this card inflicts Battle Damage to your opponent's Life Points, you can select and activate 1 of the following effects:<BR>● Add 1 card that includes "Dark Scorpion" in its card name, or is named "<M5662>Dark Scorpion - Cliff the Trap Remover<M>", from your Deck to your hand.<BR>● Add 1 card that includes "Dark Scorpion" in its card name, or is named "<M5662>Dark Scorpion - Cliff the Trap Remover<M>", from your Graveyard to your hand.
et: Kui see kaart tekitab lahingukahju sinu vastase Elupunktidele, saad valida ja aktiveerida ühe järgmistest efektidest:<BR>● Lisa 1 kaart, mille nimes sisaldub "Dark Scorpion" või mille nimi on "<M5662>Dark Scorpion - Cliff the Trap Remover<M>", oma pakist oma kätte.<BR>● Lisa 1 kaart, mille nimes sisaldub "Dark Scorpion" või mille nimi on "<M5662>Dark Scorpion - Cliff the Trap Remover<M>", oma hauast oma kätte.

source: Outstanding Dog Marron
et: Silmapaistev Koer Marron

source: When this card is sent to your Graveyard, add it to your Deck and shuffle it.
et: Kui see kaart saadetakse sinu Hauakambrisse, lisa see oma Paki hulka ja sega see läbi.

source: Great Maju Garzett
et: Suur Maju Garzett

source: The ATK of this card becomes twice the original ATK of 1 monster that you Tributed for the Tribute Summon of this card.
et: Selle kaardi ATK muutub kahekordseks selle koletise algse ATK-ga, mille sa ohverdasid selle kaardi ohverdussummoniks.

source: Iron Blacksmith Kotetsu
et: Raudsepp Kotetsu

source: FLIP: Select 1 Equip Spell Card from your Deck and add it to your hand.
et: FLIP: Vali 1 Varustuse Võluskaart oma pakist ja lisa see oma kätte.

source: Goblin of Greed
et: Ahnitse Goblin

source: As long as this card remains face-up on your side of the field, neither player can activate an effect by discarding from his/her hand.
et: Niikaua kui see kaart jääb sinu väljale avatud olekusse, ei saa kumbki mängija aktiveerida efekti, visates kaarte oma käest ära.

source: Mefist the Infernal General
et: Põrgulik kindral Mefist

source: When this card attacks with an ATK that is higher than the DEF of your opponent's Defense Position monster, inflict the difference as Battle Damage to your opponent's Life Points. When this card inflicts Battle Damage to your opponent's Life Points, discard 1 card randomly from your opponent's hand.
et: Kui see kaart ründab ATK-ga, mis on kõrgem kui sinu vastase kaitsepositsioonis oleva koletise DEF, põhjusta vahe Battle Damage'ina oma vastase Life Points'idele. Kui see kaart põhjustab Battle Damage'i sinu vastase Life Points'idele, viska juhuslikult 1 kaart sinu vastase käest ära.

source: Vilepawn Archfiend
et: Kurjusekäpa Deemon

source: The controller of this card pays 500 Life Points during each of his/her Standby Phases (this is not optional). When this card is targeted by the effect of a card controlled by your opponent, when resolving the effect, roll a six-sided die. If the result is 3, negate the effect and destroy the opponent's card. As long as this card remains face-up on the field, your opponent cannot attack any Archfiend Monster Cards on your side of the field except "<M5772>Vilepawn Archfiend<M>".
et: Selle kaardi kontrollija maksab iga oma ooteetapi ajal 500 elupunkti (see ei ole valikuline). Kui selle kaardi sihtmärgiks on sinu vastase kontrollitava kaardi efekt, siis efekti lahendamisel veereta kuuepoolset täringut. Kui tulemus on 3, tühista efekt ja hävita vastase kaart. Kuni see kaart jääb väljale avatud olekusse, ei saa sinu vastane rünnata ühtegi Kuradikuningas koletise kaarti sinu väljaku poolel, välja arvatud "<M5772>Vilepawn Archfiend<M>".

source: Shadowknight Archfiend
et: Varjukuningas Kuradivürst

source: The controller of this card pays 900 Life Points during each of his/her Standby Phases (this is not optional). When this card is targeted by the effect of a card controlled by your opponent, when resolving the effect, roll a six-sided die. If the result is 3, negate the effect and destroy the opponent's card. The Battle Damage this card inflicts to your opponent is halved.
et: Selle kaardi kontrollija maksab iga oma ooteetapi ajal 900 elupunkti (see ei ole valikuline). Kui selle kaardi sihtmärgiks on sinu vastase kontrollitava kaardi efekt, siis efekti lahendamisel veereta kuuepoolset täringut. Kui tulemus on 3, tühista efekt ja hävita vastase kaart. Selle kaardi tekitatud lahingukahju sinu vastasele on poole väiksem.

source: Darkbishop Archfiend
et: Pimedusepiiskop Kuradikuningas

source: The controller of this card pays 500 Life Points during each of his/her Standby Phases (this is not optional). When an Archfiend Monster Card on your side of the field is targeted by the effect of a card controlled by your opponent, when resolving effect, roll a six-sided die. If the result is 1, 3, or 6, negate the effect and destroy the opponent's card.
et: Selle kaardi kontrollija maksab iga oma ooteetapi ajal 500 elupunkti (see ei ole valikuline). Kui sinu väljaku poolel olevat Archfiendi koletise kaarti sihitakse sinu vastase kontrollitava kaardi efektiga, siis efekti lahendamisel veereta kuuepoolset täringut. Kui tulemus on 1, 3 või 6, tühista efekt ja hävita vastase kaart.

source: Desrook Archfiend
et: Desrook'i Kuradivaim

source: This card's controller must pay 500 Life Points during each of his/her Standby Phases (this is not optional). When this card is targeted by the effect of a card controlled by your opponent, when resolving the effect, roll a six-sided die. If the result is 3, negate the effect and destroy the opponent's card. When a "<M5777>Terrorking Archfiend<M>" on your side of the field is destroyed and sent to the Graveyard, you can send this card from your hand to the Graveyard to Special Summon the "<M5777>Terrorking Archfiend<M>".
et: Selle kaardi kontrollija peab maksma 500 Elupunkti iga oma Ootefaaside ajal (see ei ole valikuline). Kui see kaart on sihitud sinu vastase kontrollitava kaardi efekti poolt, siis efekti lahendamisel veereta kuuepoolset täringut. Kui tulemus on 3, tühista efekt ja hävita vastase kaart. Kui sinu väljaku poolel olev "<M5777>Terrorking Archfiend<M>" hävitatakse ja saadetakse Hauakambrisse, võid saata selle kaardi oma käest Hauakambrisse, et Eriliselt Kutsuda "<M5777>Terrorking Archfiend<M>".

source: Infernalqueen Archfiend
et: Põrgukuninganna Kuradikuningas

source: The controller of this card pays 500 Life Points during each of his/her Standby Phases (this is not optional). When this card is targeted by the effect of a card controlled by your opponent, when resolving the effect, roll a six-sided die. If the result is 2 or 5, negate the effect and destroy the opponent's card. As long as this card remains on the field, during each Standby Phase increase the ATK of 1 Archfiend Monster Card by 1000 points until the End Phase.
et: Selle kaardi kontrollija maksab iga oma ooteetapi ajal 500 elupunkti (see ei ole valikuline). Kui see kaart on sihitud sinu vastase kontrollitava kaardi efekti poolt, siis efekti lahendamisel veereta kuuepoolset täringut. Kui tulemus on 2 või 5, tühista efekt ja hävita vastase kaart. Nii kaua kui see kaart jääb väljakule, suurenda iga ooteetapi ajal ühe Archfiend koletise kaardi rünnakupunkte 1000 võrra kuni lõppfaasini.

source: Terrorking Archfiend
et: Terrorikuningas Kuradivürst

source: This card cannot be Normal Summoned or Flip Summoned unless you have an Archfiend Monster Card on your side of the field. The controller of this card pays 800 Life Points during each of his/her Standby Phases (this is not optional). When this card is targeted by the effect of a card controlled by your opponent, when resolving the effect, roll a six-sided die. If the result is 2 or 5, negate the effect and destroy the opponent's card. The effects of an Effect Monster that this card destroyed as a result of battle are negated.
et: Seda kaarti ei saa tavaliselt kutsuda ega ümber pöörata, kui sul pole oma poolel väljal Archfiendi koletise kaarti. Selle kaardi kontrollija maksab iga oma ooteetapi ajal 800 elupunkti (see ei ole valikuline). Kui sinu vastase kontrollitava kaardi efekt sihib seda kaarti, siis efekti lahendamisel veereta kuuepoolset täringut. Kui tulemus on 2 või 5, tühista efekt ja hävita vastase kaart. Efektikoletise efektid, mille see kaart lahingu tulemusena hävitas, on tühistatud.

source: Skull Archfiend of Lightning
et: Välgu Kolju Kurivaim

source: The controller of this card pays 500 Life Points during each of his/her Standby Phases (this is not optional). When this card is targeted by the effect of a card controlled by your opponent, when resolving the effect, roll a six-sided die. If the result is 1, 3 or 6, negate the effect and destroy the opponent's card.
et: Selle kaardi kontrollija maksab iga oma ooteetapi ajal 500 elupunkti (see ei ole valikuline). Kui selle kaardi sihtmärgiks on sinu vastase kontrollitava kaardi efekt, siis efekti lahendamisel veereta kuuepoolset täringut. Kui tulemus on 1, 3 või 6, tühista efekt ja hävita vastase kaart.

source: Metallizing Parasite - Lunatite
et: Metalliseeruv Parasiit - Lunatiit

source: Once per turn, during your Main Phase, if you control this monster on the field, you can equip it to a face-up monster on your side of the field as an Equip Spell Card, OR unequip the Union equipment and Special Summon this card in face-up Attack Position. While equipped to a monster by this card's effect, that monster will be unaffected by the effects of Spell Cards controlled by your opponent. (1 monster can only be equipped with 11 Union Monster at a time. If the monster that this card is equipped to is destroyed as a result of battle, destroy this card instead.)
et: Kord päevas, oma peafaasi ajal, kui sa kontrollid seda koletist väljakul, saad selle varustada oma väljaku avatud koletisele kui Varustuse Loitsukaart, VÕI eemaldada Uniooni varustuse ja Kutsuda see kaart eriliselt avatud Rünnakupositsioonis. Kui see kaart on varustatud koletisele selle kaardi efekti abil, ei mõjuta seda koletist sinu vastase kontrollitavad Loitsukaartide efektid. (1 koletis saab korraga olla varustatud ainult 1 Uniooni Koletisega. Kui koletis, millele see kaart on varustatud, hävitatakse lahingu tulemusena, hävita selle asemel see kaart.)

source: This card cannot be Special Summoned. This card returns to the owner's hand during the End Phase of the turn it is Normal Summoned or flipped face-up. When this card is Normal Summoned or flipped face-up, flip 1 face-up monster on the field into face-down Defense Position.
et: Seda kaarti ei saa eriliselt kutsuda. See kaart naaseb omaniku kätte selle käigu lõppfaasis, mil see on normaalselt kutsutud või ümber pööratud. Kui see kaart on normaalselt kutsutud või ümber pööratud, pööra 1 avatud koletis väljakul tagurpidi kaitsepositsiooni.

source: Legendary Flame Lord
et: Legendaarne Leegilord

source: This card can only be Ritual Summoned with the Ritual Spell Card, "<M5783>Incandescent Ordeal<M>". You must also Tribute monsters whose total Levels equals 7 or more from the field or your hand. Each time you or your opponent activates 1 Spell Card, put 1 Spell Counter on this card. Remove 3 Spell Counters from this card to destroy all monsters on the field except this card.
et: Seda kaarti saab Rituaali Kutsuda ainult Rituaali Loitsukaardiga, "<M5783>Incandescent Ordeal<M>". Sa pead ka ohverdama koletisi, kelle kogutasemed on 7 või rohkem, kas väljakult või oma käest. Iga kord, kui sina või su vastane aktiveerib 1 Loitsukaardi, pane sellele kaardile 1 Loitsuloendur. Eemalda sellelt kaardilt 3 Loitsuloendurit, et hävitada kõik koletised väljakul, välja arvatud see kaart.

source: Dark Master - Zorc
et: Tume Meister - Zorc

source: This card can only be Ritual Summoned with the Ritual Spell Card "<M5785>Contract with the Dark Master<M>". During your Main Phase, you can roll 1 six-sided die. On a 1 or 2, destroy all monsters on your opponent's side of the field. On a 3, 4, or 5, destroy 1 monster on your opponent's side of the field. On a 6, destroy all monsters on your side of the field.
et: Seda kaarti saab Rituaali Kutsuda ainult Rituaalimaagia kaardiga "<M5785>Leping Pimeduse Meistriga<M>". Oma peafaasil võid veeretada 1 kuuepoolset täringut. Kui saad 1 või 2, hävita kõik koletised vastase väljaku poolel. Kui saad 3, 4 või 5, hävita 1 koletis vastase väljaku poolel. Kui saad 6, hävita kõik koletised oma väljaku poolel.

source: Incandescent Ordeal
et: Helevaline katsumus

source: This card is used to Ritual Summon "<M5781>Legendary Flame Lord<M>". You must also Tribute monsters whose total Levels equal 7 or more from the field or your hand.
et: Seda kaarti kasutatakse "<M5781>Legendary Flame Lord<M>" rituaalsummonimiseks. Sa pead ka ohverdama koletisi, kelle kogutasemed on 7 või rohkem, kas väljakult või oma käest.

source: Contract with the Abyss
et: Leping Kuristikuga

source: This card is used to Ritual Summon any DARK Ritual Monster. You must also Tribute monsters from the field or your hand whose total Levels equal the Level of the Ritual Monster you are Ritual Summoning.
et: Seda kaarti kasutatakse mis tahes PIMEDUSE Rituaalikoletise rituaalsummonimiseks. Sa pead ka ohverdama koletisi väljakult või oma käest, kelle kogutasemed on võrdsed rituaalikoletise tasemega, keda sa rituaalsummonid.

source: Contract with the Dark Master
et: Leping Pimeduse Meistriga

source: This card is used to Ritual Summon "<M5782>Dark Master - Zorc<M>". You must also Tribute monsters whose total Levels equal 8 or more from the field or your hand.
et: Seda kaarti kasutatakse Rituaalsummonimiseks "<M5782>Dark Master - Zorc<M>". Sa pead ka ohverdama koletisi, kelle kogutasemed on 8 või rohkem, kas väljakult või oma käest.

source: Falling Down
et: Kukkumine

source: Destroy this card if there is no "Archfiend" card on your side of the field. Take control of 1 of your opponent's monsters that is equipped with this card. You take 800 points of damage during each of your opponent's Standby Phases.
et: Hävita see kaart, kui sinu väljaku poolel ei ole ühtegi "Archfiend" kaarti. Võta kontroll 1 oma vastase koletise üle, mis on selle kaardiga varustatud. Sa saad 800 punkti kahju iga oma vastase Ootefaaside ajal.

source: Checkmate
et: Matt

source: Tribute 1 Archfiend monster on your side of the field. During this turn, 1 "<M5777>Terrorking Archfiend<M>" on your side of the field can attack your opponent's Life Points directly.
et: Ohverda 1 Archfiend koletis oma väljaku poolel. Selle käigu ajal võib 1 "<M5777>Terrorking Archfiend<M>" sinu väljaku poolel rünnata otse sinu vastase Elupunkte.

source: Final Countdown
et: Lõplik loendus

source: Pay 2000 Life Points. After 20 turns have passed (counting the turn you activate this card as the 1st turn), you win the Duel.
et: Maksa 2000 Elupunkti. Pärast 20 käigu möödumist (arvestades selle kaardi aktiveerimise käiku kui esimest käiku), võidad Duelli.

source: Archfiend's Oath
et: Kuradi Truudus
