Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: This card can only be Ritual Summoned with the Ritual Spell Card, "<M5176>Ritual of Lithmus<M>". This card is not destroyed as a result of battle and is unaffected by the effects of Trap Cards. As long as there is a face-up Trap Card on the field, the ATK and DEF of this card becomes 3000.
et: Seda kaarti saab Rituaali Kutsuda ainult Rituaali Loitsukaardiga, "<M5176>Litmuse Rituaal<M>". Seda kaarti ei hävitata lahingu tulemusena ja see ei ole mõjutatud Lõksukaartide efektidest. Nii kaua kui väljal on avatud Lõksukaart, muutuvad selle kaardi ATK ja DEF 3000-ks.

source: Ritual of Lithmus
et: Litmuse rituaal

source: This card is used to Ritual Summon "<M5175>Swordsman of Doom Lithmus<M>". You must also Tribute monsters whose total Levels equal 8 or more from the field or your hand.
et: Seda kaarti kasutatakse "<M5175>Swordsman of Doom Lithmus<M>" rituaalsummonimiseks. Sa pead ka ohverdama koletisi, kelle kogutasemed on 8 või rohkem, kas väljakult või oma käest.

source: Maiden in Love
et: Armunud Neiu

source: As long as this card remains face-up on the field in face-up Attack Position, it is not destroyed as a result of battle. Put a "Maiden Counter" on a monster that attacks this card.
et: Niikaua kui see kaart jääb väljale avatud Rünnakupositsioonis, ei hävitata seda lahingu tulemusena. Pane "Neiu Loendur" koletisele, kes ründab seda kaarti.

source: Cupid Kiss
et: Amori suudlus

source: If the equipped monster attacks a monster with a "Maiden Counter" on it and the controller of the equipped monster takes Battle Damage, take control of the monster that inflicts Battle Damage to a player's Life Points at the end of the Damage Step.
et: Kui varustatud koletis ründab koletist, millel on "Neiu Loendur", ja varustatud koletise juht saab lahingukahju, võta kontrolli alla koletis, mis tekitab lahingukahju mängija elupunktidele kahjuetapi lõpus.

source: Defense Maiden
et: Kaitse Neiu

source: You can only activate this card while there is a face-up "<M5177>Maiden in Love<M>" on your side of the field. When your opponent attacks one of your monsters, you can change the target of that attack to a face-up "<M5176>Ritual of Lithmus<M>" on your side of the field.
et: Seda kaarti saab aktiveerida ainult siis, kui sinu väljaku poolel on avatud "<M5177>Armastuse Neiu<M>". Kui sinu vastane ründab ühte sinu koletistest, saad selle rünnaku sihtmärgi muuta sinu väljaku poolel avatud "<M5176>Lithmuse Rituaal<M>" peale.

source: Happy Marriage
et: Õnnelik abielu

source: This card can only be activated while a face-up monster that is owned by your opponent is on your side of the field. Increase the ATK of the equipped monster by the ATK of that monster.
et: Seda kaarti saab aktiveerida ainult siis, kui sinu väljaku poolel on vastasele kuuluv avatud koletis. Suurenda varustatud koletise ATK-d selle koletise ATK võrra.

source: Illusion Gate
et: Illusioonivärav

source: Destroy all monsters on your opponent's side of the field. After that, select 1 monster in your opponent's Graveyard and Special Summon it to your side of the field, ignoring the Summoning conditions. At the End Phase of this turn, your Life Points are reduced by 90 percent.
et: Hävita kõik koletised oma vastase väljaku poolel. Pärast seda vali 1 koletis oma vastase Hauakambrist ja Kutsu see oma väljaku poolele, eirates Kutsumise tingimusi. Selle käigu Lõppfaasis vähenevad sinu Elupunktid 90 protsendi võrra.

source: Amazoness Arena
et: Amazoonlaste Areen

source: When this card is activated, increase the Life Points of both players by 600 points. Each time a player declares an attack with a monster, they can pay 100 Life Points to inflict 100 damage to the opponent's Life Points at the end of the Damage Step
et: Kui see kaart aktiveeritakse, suurendatakse mõlema mängija Elupunkte 600 punkti võrra. Iga kord, kui mängija kuulutab välja rünnaku koletisega, võib ta maksta 100 Elupunkti, et tekitada vastase Elupunktidele 100 kahju Kahjustuse Samme lõpus

source: Dark Scorpion Retreat
et: Pimedate Skorpionide Taandumine

source: You can only activate this card when you have either "<M5426>Don Zaloog<M>", "<M5662>Dark Scorpion - Cliff the Trap Remover<M>", "<M5718>Dark Scorpion - Chick the Yellow<M>", "<M5765>Dark Scorpion - Gorg the Strong<M>" and "<M5766>Dark Scorpion - Meanae the Thorn<M>" face-up on your side of the field. Return them all to their owner's hand.
et: Seda kaarti saad aktiveerida ainult siis, kui sul on kas "<M5426>Don Zaloog<M>", "<M5662>Tume Skorpion - Cliff, Lõksude Eemaldaja<M>", "<M5718>Tume Skorpion - Chick, Kollane<M>", "<M5765>Tume Skorpion - Gorg, Tugev<M>" ja "<M5766>Tume Skorpion - Meanae, Okas<M>" avatud sinu väljakupoolel. Tagasta need kõik nende omaniku kätte.

source: Dark Scorpion - Tragedy of Love
et: Tume Skorpion - Armastuse Tragöödia

source: You can only activate this card when there are "<M5426>Don Zaloog<M>" and "<M5766>Dark Scorpion - Meanae the Thorn<M>" face-up on your side of the field. Send 1 "<M5766>Dark Scorpion - Meanae the Thorn<M>" from your side of the field to the Graveyard to destroy all monsters your opponent controls.
et: Seda kaarti saab aktiveerida ainult siis, kui sinu väljaku poolel on "<M5426>Don Zaloog<M>" ja "<M5766>Dark Scorpion - Meanae the Thorn<M>" avatud. Saada 1 "<M5766>Dark Scorpion - Meanae the Thorn<M>" oma väljaku poolelt Hauakambrisse, et hävitada kõik vastase kontrollitavad koletised.

source: Archfiend Matador
et: Kuradikuningas Matador

source: This card can only be Ritual Summoned with the Ritual Spell Card, "<M5186>Ritual of the Matador<M>". This card cannot attack. This card cannot be destroyed by battle. You take no Battle Damage from battles involving this card. A monster that battles with this card is destroyed at the end of the Damage Step.
et: Seda kaarti saab Rituaali Kutsuda ainult Rituaali Loitsukaardiga, "<M5186>Matadori Rituaal<M>". See kaart ei saa rünnata. Seda kaarti ei saa lahingus hävitada. Sa ei saa lahingukahju lahingutest, mis hõlmavad seda kaarti. Koletis, mis võitleb selle kaardiga, hävitatakse Kahjustuse Etapi lõpus.

source: Ritual of the Matador
et: Matadori rituaal

source: This card is used to Ritual Summon "<M5185>Archfiend Matador<M>". You must also Tribute monsters whose total Levels equal 6 or more from the field or your hand.
et: Seda kaarti kasutatakse "<M5185>Archfiend Matador<M>" rituaalsummonimiseks. Sa pead ka ohverdama koletisi, kelle kogutasemed on 6 või rohkem, kas väljakult või oma käest.

source: Dark Arena
et: Tume Areen

source: Both players select attack targets for their opponent. All face-up monsters on the field must attack when possible.
et: Mõlemad mängijad valivad rünnaku sihtmärgid oma vastasele. Kõik avatud koletised väljakul peavad ründama, kui see on võimalik.

source: Alchemic Kettle - Chaos Distill
et: Alkeemiline Katel - Kaose Destillatsioon

source: Any card sent to your Graveyard is removed from play instead.
et: Mis tahes kaart, mis saadetakse sinu Hauakambrisse, eemaldatakse mängust selle asemel.

source: Philosopher's Stone - Sabatiel
et: Filosoofi kivi - Sabatiel

source: When a "<M6314>Winged Kuriboh<M>" is sent to the Graveyard, add this card from your Deck to your hand. When you activate this card, pay half your Life Points to add 1 Card from your Deck or Graveyard to your hand. After this card is activated, it is placed into the Deck. Then shuffle the Deck. After you use this effect 3 times, this card takes on the following effect. Select 1 face-up monster on your side of the field and multiply its ATK by the number of monsters on your opponent's side of the field until this turns End Phase.
et: Kui "<M6314>Tiivuline Kuriboh<M>" saadetakse Hauakambrisse, lisa see kaart oma pakist oma kätte. Kui aktiveerid selle kaardi, maksa pool oma Elupunktidest, et lisada 1 kaart oma pakist või Hauakambrist oma kätte. Pärast selle kaardi aktiveerimist asetatakse see pakki. Seejärel sega pakk. Pärast selle efekti kasutamist 3 korda, omandab see kaart järgmise efekti. Vali 1 avatud koletis oma väljaku poolel ja korruta selle ATK vastase väljaku koletiste arvuga kuni selle käigu lõppfaasini.

source: Ayers Rock Sunrise
et: Ayers Rocki päikesetõus

source: Discard all cards in your hand. Select one Beast-Type monster from your Graveyard and Special Summon it to your side of the field. Decrease the ATK of all face-up monsters on your opponent's side of the field by 200 points until the End Phase of this turn for every Beast, Plant and Winged Beast-Type monster in your Graveyard.
et: Viska kõik kaardid oma käest. Vali üks Beast-tüüpi koletis oma Hauakambrist ja Kutsu see eriliselt oma väljaku poolele. Vähenda kõigi vastase väljaku poolel olevate avatud koletiste ATK-d 200 punkti võrra kuni selle käigu lõppfaasini iga Beast, Plant ja Winged Beast-tüüpi koletise eest, mis on sinu Hauakambris.

source: Lady Panther
et: Panteridaam

source: Tribute this face-up card to return 1 of your monsters destroyed as a result of battle during this turn to the top of your Deck.
et: Ohverda see avatud kaart, et tagastada 1 sinu sellel käigul lahingu tulemusena hävitatud koletis oma paki tippu.

source: The Unfriendly Amazon
et: Ebasõbralik Amazon

source: Tribute 1 of your monsters on the field (excluding this monster) during each of your Standby Phases. If you do not, this card is destroyed.
et: Ohverda 1 oma koletistest väljal (välja arvatud see koletis) iga oma Ootefaaside ajal. Kui sa seda ei tee, hävitatakse see kaart.

source: Amazoness Archer
et: Amazoonlaste Vibukütt

source: You can Tribute 2 monsters to inflict 1200 damage to your opponent.
et: Saad ohverdada 2 koletist, et tekitada oma vastasele 1200 kahju.

source: Crimson Sentry
et: Veripunane Valvur

source: Tribute this face-up card to return 1 of your monsters destroyed as a result of battle during this turn to the bottom of your Deck.
et: Ohverda see avatud kaart, et tagastada 1 sinu sellel käigul lahingu tulemusena hävitatud koletis oma paki põhja.

source: Fire Princess
et: Tuleprintsess

source: Each time you gain Life Points, inflict 500 damage to your opponent.
et: Iga kord, kui sa saad Elupunkte, tekitab see vastasele 500 kahju.

source: Lady Assailant of Flames
et: Leekide ründaja

source: FLIP: Remove 3 cards from the top of your Deck from play to inflict 800 points of damage to your opponent's Life Points.
et: FLIP: Eemalda oma paki ülemised 3 kaarti mängust, et tekitada vastase Elupunktidele 800 punkti kahju.

source: Fire Sorcerer
et: Tule Nõid

source: FLIP: Randomly select 2 cards from your hand and remove them from play to inflict 800 points of damage to your opponent's Life Points.
et: FLIP: Vali juhuslikult 2 kaarti oma käest ja eemalda need mängust, et tekitada oma vastase Elupunktidele 800 punkti kahju.

source: Spirit of the Breeze
et: Briisi Vaim

source: As long as this card remains in face-up Attack Position on your side of the field, increase your Life Points by 1000 points during each of your Standby Phases.
et: Niikaua kui see kaart jääb sinu väljaku avatud ründeasendisse, suurenda oma Elupunkte iga oma Ootefaasiga 1000 punkti võrra.

source: Dancing Fairy
et: Tantsiv haldjas

source: As long as this card remains in face-up Defense Position on your side of the field, increase your Life Points by 1000 points during each of your Standby Phases.
et: Niikaua kui see kaart jääb sinu väljaku poolel avatud kaitseasendisse, suurenda oma Elupunkte iga oma Ootefaasiga 1000 punkti võrra.

source: Fairy Guardian
et: Haldjas Valvur

source: Tribute this face-up card to return 1 Spell Card sent to your Graveyard by your opponent's card effect during this turn to the bottom of your Deck.
et: Ohverda see avatud kaart, et tagastada 1 Loitsukaart, mille sinu vastase kaardi efekt selle käigu jooksul sinu Hauakambrisse saatis, oma Paki põhja.

source: Empress Mantis
et: Keisrinna Mantis

source: Queen of an army of giant mantises whose command moves legions.
et: Hiiglaslike mardikate armee kuninganna, kelle käsklused liigutavad leegione.

source: Cure Mermaid
et: Tervendav Merineitsi

source: As long as this card remains face-up on your side of the field, increase your Life Points by 800 points during each of your Standby Phases.
et: Niikaua kui see kaart jääb sinu väljaku poolel avatud olekusse, suurenda oma Elupunkte iga oma Ootefaasiga 800 punkti võrra.

source: Hysteric Fairy
et: Hüsteeriline Haldjas

source: Tribute 2 monsters on your side of the field to increase your Life Points by 1000 points.
et: Ohverda 2 koletist oma väljaku poolelt, et suurendada oma Elupunkte 1000 punkti võrra.

source: Bio-Mage
et: Bio-Maag

source: A mysterious priest created as a result of the lastest advances in biotechnology.
et: Salapärane preester, kes on loodud biotehnoloogia uusimate edusammude tulemusena.

source: The Forgiving Maiden
et: Andestav Neitsi

source: Tribute this face-up card to return to your hand 1 of your monsters destroyed as a result of battle during this turn.
et: Ohverda see avatud kaart, et tagastada oma kätte 1 oma sellel käigul lahingu tulemusena hävitatud koletis.

source: "<M5207>The Forgiving Maiden<M>" + "<M5209>Marie the Fallen One<M>"
et: "<M5207>Andestav Neitsi<M>" + "<M5209>Langenud Marie<M>"

source: Marie the Fallen One
et: Langenud Marie

source: As long as this card is in the Graveyard, increase your Life Points by 200 during each of your Standby Phases.
et: Niikaua kui see kaart on Hauakambris, suurenda oma Elupunkte 200 võrra iga oma Ootefaaside ajal.

source: Jar of Greed
et: Ahnuse Pott

source: Draw 1 card from your Deck.
et: Tõmba 1 kaart oma pakist.

source: Scroll of Bewitchment
et: Nõiduse Rull

source: Select 1 Attribute. Change the Attribute of the equipped monster to the one you select.
et: Vali 1 Atribuut. Muuda varustatud koletise atribuut valitud atribuudiks.

source: United We Stand
et: Ühtsus on jõud

source: The equipped monster gains 800 ATK and DEF for each face-up monster you control.
et: Varustatud koletis saab 800 ATK ja DEF iga sinu kontrollitava avatud koletise kohta.

source: Mage Power
et: Maagijõud

source: The equipped monster gains 500 ATK and DEF for each Spell and Trap Card you control.
et: Varustatud koletis saab 500 ATK ja DEF iga loitsu ja lõksukaardi eest, mida sa kontrollid.

source: Offerings to the Doomed
et: Ohverdused hukatule

source: Destroy 1 face-up monster. Skip your next Draw Phase.
et: Hävita 1 avatud koletis. Jäta vahele oma järgmine Tõmbamisfaas.

source: Meteor of Destruction
et: Hävituse meteoor

source: Inflict 1000 damage to your opponent. You cannot activate this card if your opponent's Life Points are 3000 or less.
et: Tekita oma vastasele 1000 kahju. Sa ei saa seda kaarti aktiveerida, kui su vastase Elupunktid on 3000 või vähem.

source: Lightning Vortex
et: Välguvortex

source: Discard 1 card. Destroy all face-up monsters your opponent controls.
et: Viska 1 kaart. Hävita kõik vastase avatud koletised.

source: Exchange
et: Vahetus

source: Each player looks at their opponent's hand, chooses 1 card in it and adds it to their own hand.
et: Iga mängija vaatab oma vastase kätt, valib sealt ühe kaardi ja lisab selle omaenda kätte.

source: The Portrait's Secret
et: Portree saladus

source: A portrait cursed by the artist, it is said to bring ill fortune to anyone who owns it.
et: Kunstniku poolt neetud portree, mis väidetavalt toob halba õnne kõigile, kes seda omavad.

source: The Gross Ghost of Fled Dreams
et: Põgenenud Unenägude Jube Kummitus

source: This monster feeds on the dreams of an unwary sleeper, dragging the victim into eternal slumber.
et: See koletis toitub ettevaatamatu magaja unistustest, tõmmates ohvri igavesse unne.

source: Headless Knight
et: Peata Rüütel

source: A haunted spirit of a falsely accused knight who wanders in search of truth and justice.
et: Valesti süüdistatud rüütli kummitav vaim, kes rändab tõe ja õigluse otsingul.

source: Dark Necrofear
et: Tume Necrofear

source: This card cannot be Normal Summoned or Set. This card can only be Special Summoned by removing from play 3 Fiend-Type monsters in your Graveyard. If this card is destroyed by battle, or by your opponent's card effect while it is a Monster Card, equip it to a monster your opponent controls during the End Phase of this turn. Take control of the equipped monster.
et: Seda kaarti ei saa normaalselt kutsuda ega asetada. Seda kaarti saab eriliselt kutsuda ainult eemaldades oma hauakambrist mängust 3 deemonitüüpi koletist. Kui see kaart hävitatakse lahingus või vastase kaardi efekti tõttu, kui see on koletiskaart, kinnita see selle käigu lõppfaasis vastase koletise külge. Võta kontroll kinnitatud koletise üle.

source: Magic Formula
et: Maagiline Valem

source: Equip only to "<M4041>Dark Magician<M>" or "<M4766>Dark Magician Girl<M>". The equipped monster gains 700 ATK. When this card is sent from the field to the Graveyard, gain 1000 Life Points.
et: Varusta ainult kaardile "<M4041>Tume Maag<M>" või "<M4766>Tume Maag Tüdruk<M>". Varustatud koletis saab 700 ATK juurde. Kui see kaart saadetakse väljakult Hauakambrisse, saad 1000 Elupunkti juurde.

source: Destiny Board
et: Saatuselaud

source: At the end of each of your opponent's turns, place 1 "Spirit Message" card from your hand or your Deck face-up on the field. If you control the "Spirit Message" cards "I", "N", "A", and "L" in the proper order, you win the Duel. If any "Spirit Message" cards or "<M5224>Destiny Board<M>" you control is removed from the field, all "Spirit Message" cards and "<M5224>Destiny Board<M>" you control are sent to the Graveyard.
et: Iga vastase käigu lõpus aseta 1 "Spirit Message" kaart oma käest või pakist avatud kujul väljakule. Kui sul on kontrolli all "Spirit Message" kaardid "I", "N", "A" ja "L" õiges järjekorras, võidad Duelli. Kui mõni "Spirit Message" kaart või "<M5224>Destiny Board<M>", mida sa kontrollid, eemaldatakse väljakult, saadetakse kõik "Spirit Message" kaardid ja "<M5224>Destiny Board<M>", mida sa kontrollid, Hauakambrisse.

source: The Dark Door
et: Pime uks

source: Both players can only attack with 1 monster during their respective Battle Phases.
et: Mõlemad mängijad saavad oma lahingufaaside ajal rünnata ainult ühe koletisega.

source: Earthbound Spirit
et: Maa-siduv Vaim

source: A vengeful creature formed by the spirits of fallen warriors, it drags any who dare approach it into the deepest bowels of the earth.
et: Kättemaksuhimuline olend, mis on moodustunud langenud sõdalaste vaimudest, veab igaühe, kes julgeb sellele läheneda, maa sügavaimatesse soppidesse.

source: Dark Spirit of the Silent
et: Vaikse Pimeduse Vaim

source: Activate only when an opponent's monster declares an attack. Negate that attack, and select another face-up monster your opponent controls. That monster attacks instead. (If it is in face-up Defense Position, change it to Attack Position.)
et: Aktiveeri ainult siis, kui vastase koletis kuulutab välja rünnaku. Tühista see rünnak ja vali teine vastase kontrollitav avatud koletis. See koletis ründab selle asemel. (Kui see on avatud kaitsepositsioonis, muuda see rünnakupositsiooniks.)

source: The Earl of Demise
et: Hävingu krahv

source: This gentlemanly creature is extremely wicked, feared by man and fiend alike.
et: See härrasmehelik olend on äärmiselt õel, keda kardavad nii inimesed kui ka deemonid.

source: Dark Sage
et: Tume Tark

source: This card Cannot be Normal Summoned or Set. Must first be Special Summoned (from your hand or Deck) by Tributing 1 "<M4041>Dark Magician<M>" immediately after applying the effect of "<M4022>Time Wizard<M>" in which you called the coin toss right. When Special Summoned this way: Add 1 Spell Card from your Deck to your hand.
et: Seda kaarti ei saa normaalset kutsuda ega asetada. Esmalt tuleb see eriliselt kutsuda (oma käest või pakist), ohverdades 1 "<M4041>Tume Maag<M>" kohe pärast "<M4022>Aja Võlur<M>" efekti rakendamist, milles sa ennustasid mündi viske õigesti. Kui see on eriliselt kutsutud sel viisil: Lisa 1 Loitsukaart oma pakist oma kätte.

source: Temple of the Kings
et: Kuningate Tempel

source: The controller of this card can activate Trap Cards the same turn they are Set. If you control "<M5242>Mystical Beast of Serket<M>" and this card, you can send both to the Graveyard to Special Summon 1 monster from your hand, Deck or Extra Deck.
et: Selle kaardi kontrollija saab aktiveerida Lõksukaardid samal käigul, kui need on seatud. Kui sa kontrollid "<M5242>Mystical Beast of Serket<M>" ja seda kaarti, saad saata mõlemad Hauakambrisse, et Kutsuda Eriliselt välja 1 koletis oma käest, Pakist või Lisapakist.

source: Judgment of Anubis
et: Anubise otsus

source: Discard 1 card from your hand. Negate the activation and the effect of a Spell Card controlled by your opponent that has the effect of destroying Spell and/or Trap Card(s) on the field and destroy it. After that, you can destroy 1 face-up monster on your opponent's side of the field and inflict damage to your opponent equal to the ATK of the destroyed monster.
et: Viska 1 kaart oma käest. Tühista oma vastase kontrollitava Võlukaardi aktiveerimine ja efekt, millel on väljal Võlu- ja/või Lõksukaardi hävitamise efekt, ning hävita see. Pärast seda saad hävitada 1 vastase poolel oleva avatud koletise ja tekitada oma vastasele kahju, mis on võrdne hävitatud koletise rünnakupunktidega (ATK).

source: Embodiment of Apophis
et: Apophise kehastus

source: Activate only during a Main Phase. After activation, Special Summon this card: it is treated as a Normal Monster Card (Reptile-Type/EARTH/Level 4/ATK 1600/DEF 1800). (This card is still treated as a Trap Card.)
et: Aktiveeri ainult peafaasi ajal. Pärast aktiveerimist kutsu see kaart eriliselt välja: seda käsitletakse kui tavalist koletiskaarti (Roomaja-tüüp/MAA/Tase 4/ATK 1600/DEF 1800). (Seda kaarti käsitletakse endiselt lõksukaardina.)

source: Foolish Burial
et: Lollakas Matmine

source: Send 1 Monster Card from your Deck to the Graveyard.
et: Saada 1 koletise kaart oma pakist hauakambrisse.

source: Makiu, the Magical Mist
et: Makiu, maagiline udu

source: Select 1 "<M4028>Summoned Skull<M>" or Thunder-Type monster you control. Destroy all monsters your opponent controls whose DEF is lower than the ATK of the selected monster. You cannot conduct your Battle Phase the turn you activate this card.
et: Vali 1 "<M4028>Summoned Skull<M>" või Äikese-tüüpi koletis, mida sa kontrollid. Hävita kõik koletised, mida su vastane kontrollib ja mille DEF on madalam kui valitud koletise ATK. Sa ei saa läbi viia oma Lahingufaasi sellel käigul, mil sa aktiveerid selle kaardi.

source: Ancient Lamp
et: Vana lamp

source: While this card is face-up on the field, during your Main Phase, you can Special Summon "<M4385>La Jinn the Mystical Genie of the Lamp<M>" from your hand. When this face-down Defense Position card is attacked, select 1 opponent's monster (except the attacking monster). The attacking monster attacks the selected monster instead.
et: Kui see kaart on lahinguväljal avatud, saad oma peafaasis erikutsuda "<M4385>La Jinn the Mystical Genie of the Lamp<M>" oma käest. Kui seda allapoole suunatud kaitsepositsioonis olevat kaarti rünnatakse, vali 1 vastase koletis (välja arvatud ründav koletis). Ründav koletis ründab valitud koletist.

source: Cyber Harpie Lady
et: Küberharpyia Daam

source: This card's name is treated as "<M4068>Harpie Lady<M>".
et: Selle kaardi nimeks loetakse "<M4068>Harpy Lady<M>".

source: Mystical Beast of Serket
et: Serketi Müstiline Metsaline

source: Destroy this card if you do not control "<M5231>Temple of the Kings<M>". Each time this card destroys a monster by battle, the destroyed monster is removed from play, and this card gains 500 ATK.
et: Hävita see kaart, kui sa ei kontrolli "<M5231>Kuningate Tempel<M>". Iga kord, kui see kaart hävitab lahingus koletise, eemaldatakse hävitatud koletis mängust ja see kaart saab 500 ATK juurde.
