Repository: exsilium/ogy
Catalog: l10n/*/tf6.po
Languages: et

source: When your opponent activates a card's effect that inflicts damage, you can discard this card to negate its activation and destroy it.
et: Kui sinu vastane aktiveerib kaardi efekti, mis tekitab kahju, saad selle kaardi ära visata, et selle aktiveerimine tühistada ja see hävitada.

source: Gladiator Beast Samnite
et: Gladiaalne Metsaline Samnite

source: If this card was Special Summoned by the effect of a "Gladiator Beast" monster, when this card destroys an opponent's monster by battle and sends it to the Graveyard, you can add 1 "Gladiator Beast" card from your Deck to your hand. At the end of the Battle Phase, if this card attacked or was attacked, you can return it to the Deck to Special Summon 1 "Gladiator Beast" monster from your Deck, except "<M8025>Gladiator Beast Samnite<M>".
et: Kui see kaart kutsuti eriliselt välja "Gladiator Beast" koletise efekti abil, siis kui see kaart hävitab lahingus vastase koletise ja saadab selle Hauakambrisse, võid lisada oma pakist 1 "Gladiator Beast" kaardi oma kätte. Lahingufaasi lõpus, kui see kaart ründas või seda rünnati, võid selle paki tagasi saata, et eriliselt välja kutsuda 1 "Gladiator Beast" koletis oma pakist, välja arvatud "<M8025>Gladiator Beast Samnite<M>".

source: When 1 other face-up Plant-Type monster is targeted by the effect of a Spell or Trap Card your opponent controls, you can Tribute this card to draw 2 cards.
et: Kui 1 teine avatud Taimetüüpi koletis on sihitud sinu vastase kontrollitava Loitsu või Lõksukaardi efekti poolt, võid sa ohverdada selle kaardi, et tõmmata 2 kaarti.

source: Scanner
et: Skanner

source: Once per turn, you can select 1 of your opponent's monsters that is removed from play. Until the End Phase, this card's name is treated as the selected monster's name, and this card has the same Attribute, Level, ATK, and DEF as the selected monster. If this card is removed from the field while this effect is applied, remove it from play.
et: Korra ühe korra käigu jooksul saad valida ühe oma vastase mängust eemaldatud koletise. Kuni lõppfaasini käsitletakse selle kaardi nime valitud koletise nimena ning sellel kaardil on sama Atribuut, Tase, RÜN ja KAIT kui valitud koletisel. Kui see kaart eemaldatakse väljakult, kui see efekt on rakendatud, eemalda see mängust.

source: Dimension Fortress Weapon
et: Dimensioonikindluse Relv

source: Cards cannot be sent from the Deck to the Graveyard.
et: Kaardid ei saa saata pakist hauakambrisse.

source: Desert Protector
et: Kõrbe Kaitsja

source: This card gains 300 DEF for each Spell and Trap Card on the field. If an Insect-Type monster you control would be destroyed, you can destroy this card instead.
et: See kaart saab 300 DEF iga väljal oleva Võlu- ja Lõksukaardi eest. Kui putukaliiki kuuluv koletis, mida sa kontrollid, hävitatakse, võid selle asemel hävitada selle kaardi.

source: Cross-Sword Beetle
et: Ristamõõga Mardikas

source: While you control another Insect-Type monster, during battle between an attacking Insect-Type monster you control and a Defense Position monster whose DEF is lower than the ATK of the Insect-Type monster, inflict the difference as Battle Damage to your opponent.
et: Kui sa kontrollid teist Putuk-Tüüpi koletist, siis lahingu ajal sinu kontrollitava ründava Putuk-Tüüpi koletise ja Kaitseasendis koletise vahel, mille DEF on madalam kui Putuk-Tüüpi koletise ATK, põhjusta vahe oma vastasele Lahingukahjuna.

source: Bee List Soldier
et: Mesilase Nimekirja Sõdur

source: You can Tribute this card and 1 face-up Insect-Type monster, except "<M8031>Bee List Soldier<M>", to draw 2 cards.
et: Saad selle kaardi ja 1 avatud putukaliigi koletise, välja arvatud "<M8031>Bee List Soldier<M>", ohverdada, et tõmmata 2 kaarti.

source: Hydra Viper
et: Hüdra Viper

source: Each time this card declares an attack, you must Tribute 1 Aqua-Type monster. This card can attack 3 times during each Battle Phase.
et: Iga kord, kui see kaart kuulutab rünnaku, pead ohverdama 1 Aqua-tüüpi koletise. See kaart võib rünnata 3 korda iga Lahingufaasi jooksul.

source: Alien Overlord
et: Tulnukate Ülem

source: You can remove 2 A-Counters from anywhere on the field to Special Summon this card from your hand. Once per turn, you can place 1 A-Counter on each face-up monster your opponent controls. (If a monster with an A-Counter battles an "Alien" monster, it loses 300 ATK and DEF for each A-Counter during damage calculation only.) You can only control 1 face-up "<M8033>Alien Overlord<M>".
et: Saad eemaldada 2 A-loendurit ükskõik kust väljakult, et Kutsuda see kaart oma käest Eriliselt välja. Kord ühe käigu jooksul saad asetada 1 A-loenduri igale vastase kontrollitavale avatud poolega koletisele. (Kui koletis, millel on A-loendur, võitleb "Tulnukas" koletisega, kaotab see 300 ATK ja DEF iga A-loenduri kohta ainult kahju arvutamise ajal.) Sa saad kontrollida ainult 1 avatud poolega "<M8033>Tulnukate Ülem<M>".

source: Alien Ammonite
et: Tulnukammooniit

source: When this card is Normal Summoned, you can Special Summon 1 Level 4 or lower "Alien" monster from your Graveyard. Destroy it during the End Phase.
et: Kui see kaart on Normaal-Kutsutud, saad Sa Eriliselt Kutsuda 1 Tase 4 või madalama "Tulnuka" koletise oma Hauakambrist. Hävita see Lõppfaasis.

source: Dark Strike Fighter
et: Pime Löögivõitleja

source: 1 Tuner + 1 or more non-Tuner monsters<BR>You can Tribute 1 monster to inflict damage to your opponent equal to its Level x 200.
et: 1 Tuner + 1 või rohkem mitte-Tuner koletist<BR>Sa võid ohverdada 1 koletise, et tekitada oma vastasele kahju, mis on võrdne selle tasemega x 200.

source: Blackwing Armor Master
et: Musta Tiiva Soomusmeister

source: 1 "Blackwing" Tuner + 1 or more non-Tuner monsters<BR>This card cannot be destroyed by battle, and you take no Battle Damage from battles involving this card. If this card attacks a monster, you can place 1 Wedge Counter on that monster at the end of the Damage Step (max. 1). You can remove all Wedge Counters from your opponent's monsters to reduce the ATK and DEF of each monster that had a Wedge Counter to 0, until the End Phase.
et: 1 "Blackwing" Tuner + 1 või rohkem mitte-Tuner koletist<BR>See kaart ei saa lahingus hävitatud ja sa ei saa lahingukahju lahingutest, milles see kaart osaleb. Kui see kaart ründab koletist, saad sa panna 1 Wedge Counteri sellele koletisele Damage Stepi lõpus (max. 1). Sa saad eemaldada kõik Wedge Counterid oma vastase koletistelt, et vähendada iga koletise, millel oli Wedge Counter, ATK ja DEF 0-ni kuni End Phase'ini.

source: Hyper Psychic Blaster
et: Hüper Psühhoblaster

source: 1 Tuner + 1 or more non-Tuner Psychic-Type Monsters<BR>During battle between this attacking card and a Defense Position monster whose DEF is lower than the ATK of this card, inflict the difference as Battle Damage to your opponent's Life Points. If this card attacks a Defense Position monster whose DEF is lower than the ATK of this card, gain Life Points equal to the difference at the end of the Damage Step.
et: 1 Tuner + 1 või rohkem mitte-Tuner Psüühika-Tüüpi Koletist<BR>Kui see ründav kaart võitleb Kaitseasendis koletisega, mille DEF on madalam kui selle kaardi ATK, tekitage vahe vastase Elupunktidele Lahingukahjuna. Kui see kaart ründab Kaitseasendis koletist, mille DEF on madalam kui selle kaardi ATK, saate Lahingusammu lõpus Elupunkte, mis on võrdsed vahega.

source: Arcanite Magician
et: Arkaanimaag

source: 1 Tuner + 1 or more non-Tuner Spellcaster-Type monsters<BR>When this card is Synchro Summoned, place 2 Spell Counters on it. This card gains 1000 ATK for each Spell Counter on it. You can remove 1 Spell Counter from a card you control to destroy 1 card your opponent controls.
et: 1 Tuner + 1 või rohkem mitte-Tuner Loitsija-tüüpi koletist<BR>Kui see kaart on Sünkro Kutsutud, aseta sellele 2 Loitsuloendurit. See kaart saab 1000 ATK iga Loitsuloenduri kohta, mis sellel on. Sa saad eemaldada 1 Loitsuloenduri kaardilt, mida sa kontrollid, et hävitada 1 kaart, mida sinu vastane kontrollib.

source: Cosmic Fortress Gol'gar
et: Kosmiline kindlus Gol'gar

source: "<M8034>Alien Ammonite<M>" + 1 or more non-Tuner "Alien" monsters<BR>Once per turn, you can select any number of face-up Spell or Trap Cards. Return those cards to their owners' hands, and distribute new A-Counters among monsters on the field equal to the number of cards returned. Once per turn, you can remove 2 A-Counters from anywhere on the field to destroy 1 card your opponent controls.
et: "<M8034>Alien Ammoniit<M>" + 1 või rohkem mittehäälestajat "Alien" koletist<BR>Korra käigu jooksul saad valida suvalise arvu avatud Võlu- või Lõksukaarte. Tagasta need kaardid nende omanike kätte ja jaota uued A-loendurid väljakul olevate koletiste vahel vastavalt tagastatud kaartide arvule. Korra käigu jooksul saad eemaldada 2 A-loendurit ükskõik kust väljakult, et hävitada 1 kaardi, mida sinu vastane kontrollib.

source: Prevention Star
et: Ennetustäht

source: Equip only to a monster you control, if it was changed from face-up Attack Position to face-up Defense Position this turn. Select 1 monster your opponent controls. That monster cannot attack or change its battle position. When the equipped monster is destroyed and this card is sent to the Graveyard, remove from play the selected monster.
et: Varusta ainult koletisele, mida sa kontrollid, kui see muudeti sellel käigul rünnakupositsioonilt kaitsepositsioonile. Vali 1 koletis, mida sinu vastane kontrollib. See koletis ei saa rünnata ega muuta oma lahingupositsiooni. Kui varustatud koletis hävitatakse ja see kaart saadetakse Hauakambrisse, eemalda mängust valitud koletis.

source: Vengeful Servant
et: Kättemaksuhimuline Teenija

source: When control of the equipped monster changes, inflict damage equal to its original ATK to its new controller.
et: Kui varustatud koletise kontroll muutub, põhjusta kahju, mis on võrdne selle algse rünnakuga, uuele kontrollijale.

source: Star Blast
et: Täheplahvatus

source: Pay any number of Life Points in multiples of 500. Reduce the Level of 1 monster you control or that is in your hand by 1 for each 500 Life Points you paid, until the End Phase.
et: Makske mis tahes arvu Elupunkte 500 kaupa. Vähenda 1 sinu kontrolli all oleva või sinu käes oleva koletise taset 1 võrra iga 500 Elupunkti eest, mida maksid, kuni Lõppfaasini.

source: Raptor Wing Strike
et: Raptori tiivalöök

source: Return 1 face-up "Blackwing" monster you control to the Deck. Add 1 "Blackwing" monster from your Deck to your hand.
et: Tagasta 1 avatud "Blackwing" koletis, mida sa kontrollid, tagasi pakki. Lisa 1 "Blackwing" koletis oma pakist oma kätte.

source: Morphtronic Rusty Engine
et: Morftroniline Roostes Mootor

source: Equip only to a "Morphtronic" monster. If the equipped monster is destroyed, inflict damage to each player equal to its original ATK.
et: Varusta ainult "Morphtronic" koletisele. Kui varustatud koletis hävitatakse, põhjusta igale mängijale kahju, mis on võrdne selle algse rünnakuga.

source: Morphtronic Map
et: Morftroniline Kaart

source: Each time a monster's battle position is changed, place 1 Morph Counter on this card. All "Morphtronic" monsters gain 300 ATK for each Morph Counter on this card. When this card is destroyed and sent from the field to the Graveyard, you can Special Summon 1 "Morphtronic" monster from your Graveyard.
et: Iga kord, kui koletise lahingupositsiooni muudetakse, pane sellele kaardile 1 Morf-loendur. Kõik "Morftronic" koletised saavad 300 ATK iga selle kaardi peal oleva Morf-loenduri kohta. Kui see kaart hävitatakse ja saadetakse väljakult Hauakambrisse, saad Sa eriliselt kutsuda 1 "Morftronic" koletise oma Hauakambrist.

source: Assault Overload
et: Rünnaku Ülekoormus

source: Tribute 1 "/Assault Mode" monster. Inflict damage to both players equal to its Level x 200.
et: Lohista 1 "/Assault Mode" koletis. Mõlemad mängijad saavad kahju, mis on võrdne selle tasemega x 200.

source: Assault Teleport
et: Rünnaku Teleport

source: Return 1 "/Assault Mode" monster from your hand to the Deck. Draw 2 cards.
et: Tagasta 1 "/Assault Mode" koletis oma käest pakki. Tõmba 2 kaarti.

source: Assault Revival
et: Rünnaku Taaselustamine

source: Remove from play 1 "<M8058>Assault Mode Activate<M>" from your Graveyard. Destroy all monsters you control and Special Summon 1 "/Assault Mode" monster from your Graveyard, ignoring its Summoning conditions. Its effect(s) is negated, and it cannot be Tributed. If it is removed from the field, remove it from play.
et: Eemalda oma kalmistult 1 "<M8058>Assault Mode Activate<M>". Hävita kõik koletised, mida sa kontrollid, ja Kutsu Eriliselt välja 1 "/Assault Mode" koletis oma kalmistult, ignoreerides selle Kutsumise tingimusi. Selle efekt(id) on tühistatud ja seda ei saa ohverdada. Kui see eemaldatakse väljakult, eemalda see mängust.

source: Psychic Sword
et: Psüühiline Mõõk

source: Equip only to a Psychic-Type monster. If your Life Points are lower than your opponent's, the equipped monster gains ATK equal to the difference (max. 2000).
et: Varusta ainult Psüühika-tüüpi koletisele. Kui sinu Elupunktid on madalamad kui sinu vastasel, saab varustatud koletis ATK-d, mis on võrdne erinevusega (maks. 2000).

source: Telekinetic Power Well
et: Telekineetiline Jõukaev

source: Special Summon any number of Level 2 or lower Psychic-Type monsters from your Graveyard. You take damage equal to the total Levels of those monsters x 300.
et: Erikutsuge oma Hauakambrist välja suvaline arv 2. taseme või madalama tasemega Psüühika-tüüpi koletisi. Sa saad kahju, mis on võrdne nende koletiste kogutasemega x 300.

source: Indomitable Gladiator Beast
et: Võitmatu Gladiaalne Metssiga

source: Target face-up "Gladiator Beast" monster you control gains 500 ATK until the End Phase. While this card is in your Graveyard, you can return 2 "Gladiator Beast" cards from your Graveyard to the Deck to return this card to your hand.
et: Valitud avatud "Gladiator Beast" koletis, mida sa kontrollid, saab 500 ATK kuni End Phase'ini. Kui see kaart on sinu Hauas, saad sa tagasi panna 2 "Gladiator Beast" kaarti oma Hauast Deck'i, et see kaart oma kätte tagasi saada.

source: Seed Cannon
et: Seemnekahur

source: Each time a Plant-Type monster(s) is Summoned, place 1 Plant Counter on this card (max. 5). You can send this card to the Graveyard to inflict 500 damage to your opponent for each Plant Counter on it.
et: Iga kord, kui Taimetüüpi koletis(ed) kutsutakse välja, aseta sellele kaardile 1 taimeloendur (maks. 5). Sa võid saata selle kaardi Hauakambrisse, et tekitada oma vastasele 500 kahju iga taimeloenduri eest, mis sellel on.

source: Super Solar Nutrient
et: Super Päikesetoit

source: Tribute 1 Level 2 or lower Plant-Type monster. Special Summon 1 Plant-Type monster whose Level is equal to or lower than the Tributed monster's Level +3 from your hand or Deck. When this card is removed from the field, destroy that monster. When that monster is removed from the field, destroy this card.
et: Lohista 1. taseme 2 või madalama tasemega Taim-tüüpi koletis. Kutsu eriliselt välja 1 Taim-tüüpi koletis, mille tase on võrdne või madalam loovutatud koletise tasemest +3 sinu käest või pakist. Kui see kaart eemaldatakse väljakult, hävita see koletis. Kui see koletis eemaldatakse väljakult, hävita see kaart.

source: Six Scrolls of the Samurai
et: Kuue samurai rullid

source: Tribute 2 face-up "Six Samurai" monsters. Special Summon 1 "<M6970>Shien's Footsoldier<M>" from your Deck.
et: Ohverda 2 avatud "Kuus Samuraid" koletist. Kutsu eriliselt välja 1 "<M6970>Shien'i Jalaväelane<M>" oma pakist.

source: Verdant Sanctuary
et: Lopsakas Pühamu

source: When a face-up Insect-Type monster is destroyed and sent to the Graveyard, its controller can add 1 Insect-Type monster with the same Level as the destroyed monster from their Deck to their hand.
et: Kui avatud positsioonis Putuk-tüüpi koletis hävitatakse ja saadetakse Hauakambrisse, võib selle juht lisada oma pakist ühe Putuk-tüüpi koletise, mille tase on sama kui hävitatud koletisel, oma kätte.

source: Arcane Barrier
et: Arkaanne Barjäär

source: Each time a Spellcaster-Type monster(s) on the field is destroyed, place 1 Spell Counter on this card (max. 4). You can send this card and 1 face-up Spellcaster-Type monster you control to the Graveyard to draw 1 card for each Spell Counter on this card.
et: Iga kord, kui väljal hävitatakse mõni Loitsija-tüüpi koletis(ed), aseta sellele kaardile 1 loitsuloendur (maks. 4). Sa võid saata selle kaardi ja ühe avatud Loitsija-tüüpi koletise, mida sa kontrollid, Hauakambrisse, et tõmmata 1 kaart iga selle kaardi peal oleva loitsuloenduri kohta.

source: Mysterious Triangle
et: Müsteeriumikolmnurk

source: Destroy 1 monster on the field with an A-Counter. Then, you can Special Summon 1 Level 4 "Alien" monster from your Deck. Destroy it during the End Phase.
et: Hävita 1 koletis väljal, millel on A-loendur. Seejärel saad eriliselt kutsuda 1. taseme 4 "Alien" koletise oma pakist. Hävita see lõppfaasis.

source: Assault Mode Activate
et: Rünnakurežiimi aktiveerimine

source: Tribute 1 Synchro Monster. Special Summon 1 "/Assault Mode" monster whose name includes the Tributed monster's name from your Deck in Attack Position.
et: Ohverda 1 Sünkro Koletis. Kutsu eriliselt välja 1 "/Rünnakurežiim" koletis, kelle nimi sisaldab ohverdatud koletise nime sinu pakist rünnakupositsioonis.

source: Spirit Force
et: Vaimujõud

source: Activate only during damage calculation during your opponent's turn. You take no Battle Damage from that battle. Then, you can add 1 Warrior-Type Tuner monster with 1500 or less DEF from your Graveyard to your hand.
et: Aktiveeri ainult oma vastase käigu ajal kahju arvutamise ajal. Sa ei saa sellest lahingust lahingukahju. Seejärel saad lisada oma kalmistult oma kätte ühe Sõdalase-tüüpi Häälestaja koletise, mille DEF on 1500 või vähem.

source: Descending Lost Star
et: Langev kadunud täht

source: Select 1 Synchro Monster in your Graveyard and Special Summon it in face-up Defense Position. Its effect is negated, its Level is reduced by 1 and its DEF becomes 0. Its battle position cannot be changed.
et: Vali oma kalmistult 1 Sünkrokoletis ja Kutsu see erilisesse kaitseasendisse. Selle efekt on tühistatud, selle tase väheneb 1 võrra ja selle DEF muutub 0-ks. Selle lahinguasendit ei saa muuta.

source: Shining Silver Force
et: Särav Hõbejõud

source: Activate only when your opponent activates a Trap Card that inflicts damage. Negate the activation of that card and destroy it and all face-up Spell and Trap Cards your opponent controls.
et: Aktiveeri ainult siis, kui su vastane aktiveerib lõksukaardi, mis tekitab kahju. Tühista selle kaardi aktiveerimine ja hävita see ning kõik vastase kontrolli all olevad avatud loitsu- ja lõksukaardid.

source: Half or Nothing
et: Pool või mitte midagi

source: Activate only during your opponent's Battle Phase. Your opponent selects 1 of the following effects:<BR>● Halve the ATK of all monsters they control until the end of the Battle Phase.<BR>● End the Battle Phase.
et: Aktiveeri ainult oma vastase Lahingufaasis. Sinu vastane valib ühe järgmistest efektidest:<BR>● Kõigi nende kontrollitavate koletiste ATK väheneb poole võrra kuni Lahingufaasi lõpuni.<BR>● Lõpeta Lahingufaas.

source: Nightmare Archfiends
et: Õudusunenäo Arhidemonid

source: Tribute 1 monster. Special Summon 3 "<M3953>Nightmare Archfiend Token<M>" (Fiend-Type/DARK/Level 6/ATK 2000/DEF 2000) to your opponent's side of the field in Attack Position. When a "<M3953>Nightmare Archfiend Token<M>" is destroyed, its controller takes 800 damage.
et: Lohista 1 koletis. Kutsu eriliselt välja 3 "<M3953>Nightmare Archfiend Token<M>" (Deemonitüüp/PIMEDUS/Tase 6/ATK 2000/DEF 2000) oma vastase väljaku poolele rünnakupositsioonis. Kui "<M3953>Nightmare Archfiend Token<M>" hävitatakse, saab selle kontrollija 800 kahju.

source: Ebon Arrow
et: Eebennoole

source: Select 1 face-up monster you control. Until the End Phase, it loses 500 ATK and during battle between that attacking monster and a Defense Position monster whose DEF is lower than the selected monster's ATK, inflict the difference as Battle Damage to your opponent. When the selected monster destroys a monster by battle and sends it to the Graveyard this turn, inflict damage to your opponent equal to the destroyed monster's original DEF.
et: Vali 1 avatud asendis olev koletis, mida sa kontrollid. Kuni lõppfaasini kaotab see 500 ATK ja kui see ründav koletis võitleb kaitseasendis oleva koletisega, mille DEF on madalam kui valitud koletise ATK, põhjusta vahe vastasele lahingukahjuna. Kui valitud koletis hävitab lahingus koletise ja saadab selle sel käigul hauakambrisse, põhjusta vastasele kahju, mis on võrdne hävitatud koletise algse DEF-iga.

source: Ivy Shackles
et: <translated Luuderihmad

source: While it is your turn, all face-up monsters your opponent controls become Plant-Type monsters. When this face-up card on the field is destroyed and sent to the Graveyard by an opponent's card effect, draw 1 card.
et: Kui on sinu käik, muutuvad kõik vastase kontrollitavad avatud koletised Taim-Tüüpi koletisteks. Kui see avatud kaart väljal hävitatakse ja saadetakse vastase kaardi efekti tõttu Hauakambrisse, tõmba 1 kaart.

source: Fake Explosion
et: Valeplahvatus

source: Activate only when an opponent's monster declares an attack. Monsters cannot be destroyed by this battle. After damage calculation, Special Summon 1 "<M7998>Summon Reactor・SK<M>" from your hand or Graveyard.
et: Aktiveeri ainult siis, kui vastase koletis kuulutab välja rünnaku. Selle lahingu käigus ei saa koletisi hävitada. Pärast kahju arvutamist, Kutsu Eriliselt 1 "<M7998>Summon Reactor・SK<M>" oma käest või Hauakambrist.

source: Morphtronic Forcefield
et: Morftroniline Jõuväli

source: Negate the activation of a Spell or Trap Card that would destroy a face-up "Morphtronic" monster you control and destroy it. Add 1 "Morphtronic" card from your Deck to your hand.
et: Negateeri maagia- või lõksukaardi aktiveerimine, mis hävitaks sinu kontrolli all oleva avatud "Morphtronic" koletise ja hävita see. Lisa 1 "Morphtronic" kaart oma pakist oma kätte.

source: Morphtronic Mix-up
et: Morftroniline Segadus

source: If you control 2 or more face-up "Morphtronic" monsters, select 2 cards your opponent controls. Destroy 1 card of your opponent's choice from those 2.
et: Kui sa kontrollid 2 või enamat avatud "Morphtronic" koletist, vali 2 kaarti, mida sinu vastane kontrollib. Hävita 1 kaart, mille sinu vastane neist kahest valib.

source: Assault Slash
et: Rünnakulõige

source: Activate only while you control an "/Assault Mode" monster. Destroy all face-up monsters on the field.
et: Aktiveeri ainult siis, kui sa kontrollid "/Assault Mode" koletist. Hävita kõik avatud koletised väljal.

source: Assault Counter
et: Rünnaku Vasturünnak

source: Activate only while you control an "/Assault Mode" monster. Negate the activation of a Spell Card, Trap Card, or Effect Monster's effect and destroy it.
et: Aktiveeri ainult siis, kui sa kontrollid "/Assault Mode" koletist. Tühista Võlukaardi, Lõksukaardi või Efektkoletise efekti aktiveerimine ja hävita see.

source: Psychic Tuning
et: Psüühiline Häälestamine

source: Select 1 Psychic-Type monster in your Graveyard and Special Summon it in Attack Position. It is treated as a Tuner monster. When this card is removed from the field, destroy that monster. When that monster is removed from the field, destroy this card. When this card is sent to the Graveyard, take damage equal to that monster's Level x 400.
et: Vali 1 Psüühika-tüüpi koletis oma Hauakambris ja Kutsu see Eriliselt välja Rünnakupositsioonis. Seda käsitletakse kui Häälestaja koletist. Kui see kaart eemaldatakse väljakult, hävita see koletis. Kui see koletis eemaldatakse väljakult, hävita see kaart. Kui see kaart saadetakse Hauakambrisse, võta kahju, mis on võrdne selle koletise tasemega x 400.
